{
    "plot": "At the age of 21, Tim Lake (Domhnall Gleeson) discovers he can travel in time... The night after another unsatisfactory New Year party, Tim's father (Bill Nighy) tells his son that the men in his family have always had the ability to travel through time. Tim can't change history, but he can change what happens and has happened in his own life-so he decides to make his world a better place...by getting a girlfriend. Sadly, that turns out not to be as easy as you might think. Moving from the Cornwall coast to London to train as a lawyer, Tim finally meets the beautiful but insecure Mary (Rachel McAdams). They fall in love, then an unfortunate time-travel incident means he's never met her at all. So they meet for the first time again-and again-but finally, after a lot of cunning time-traveling, he wins her heart. Tim then uses his power to create the perfect romantic proposal, to save his wedding from the worst best-man speeches, to save his best friend from professional disaster and to get his pregnant wife to the hospital in time for the birth of their daughter, despite a nasty traffic jam outside Abbey Road. But as his unusual life progresses, Tim finds out that his unique gift can't save him from the sorrows and ups and downs that affect all families, everywhere. There are great limits to what time travel can achieve, and it can be dangerous too.", 
    "genres": "Drama, Fantasy, Romance", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Tim's dad.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Tim's dad from About Time.", 
                "id": "CoolOldGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Lady in Red: Mary at her and Tim's wedding.", 
                "id": "LadyInRed"
            }
        ]
    }, 
    "imdbid": "tt2194499", 
    "poster_url": "AboutTime.jpg", 
    "similar": [
        {
            "shared": [
                "LadyInRed", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "LadyInRed", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "Bound", 
            "name": "Bound", 
            "poster_url": "Bound.jpg"
        }, 
        {
            "shared": [
                "LadyInRed"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy"
            ], 
            "shared_count": 1, 
            "id": "StarTrekNemesis", 
            "name": "Star Trek: Nemesis", 
            "poster_url": "StarTrekNemesis.jpg"
        }
    ], 
    "id": "AboutTime", 
    "name": "About Time"
}