{
    "plot": "At the age of 9, Abraham Lincoln witnesses his mother being killed by a vampire, Jack Barts. Some 10 years later, he unsuccessfully tries to eliminate Barts but in the process makes the acquaintance of Henry Sturgess who teaches him how to fight and what is required to kill a vampire. The quid pro quo is that Abe will kill only those vampires that Henry directs him to. Abe relocates to Springfield where he gets a job as a store clerk while he studies the law and kills vampires by night. He also meets and eventually marries the pretty Mary Todd. Many years later as President of the United States, he comes to realize that vampires are fighting with the Confederate forces. As a result he mounts his own campaign to defeat them.", 
    "genres": "Action, Fantasy, Horror", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bash Brothers: Abraham and his Black Best Friend Will Johnson.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "epic"
                ], 
                "role": "Papa Wolf: At the beginning of the film, Abe's dad gets an epic moment when he beats the crap out of a slave hunter who was whipping Will and Abe. Given the relationship between Lincoln and his father in Real Life, this could also count as a Historical Hero Upgrade.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "sadistic", 
                    "little"
                ], 
                "role": "Abraham Lincoln: Vampire Hunter had the vampire Big Bad's blonde sister Vadoma, a sadistic Baroness and Dark Action Girl who likes to kill little kids.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Blondes are Evil: Vadoma. Good Christ, Vadoma◊. Crosses into Evil Is Sexy, Dark Action Girl and Would Hurt a Child.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Bear: Mary Lincoln. Bet you regretting killing their son now, don't you Adam/Vadoma?", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Manic Pixie Dream Girl: Mary Todd.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [], 
                "role": "The Baroness: Vadoma, of the \"sexpot\" variety. (Watch her moan as she pins Abe down between her legs.) True to the trope, since she never falls for the hero, she dies.", 
                "id": "TheBaroness"
            }
        ]
    }, 
    "imdbid": "tt1611224", 
    "poster_url": "AbrahamLincolnVampireHunter.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "BlondesAreEvil", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "ClassOf1984", 
            "name": "Class Of", 
            "poster_url": "ClassOf1984.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "TheBaroness", 
                "BlondesAreEvil"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BlondesAreEvil", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "ItTakesTwo", 
            "name": "It Takes Two", 
            "poster_url": "ItTakesTwo.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BlondesAreEvil", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }
    ], 
    "id": "AbrahamLincolnVampireHunter", 
    "name": "Abraham Lincoln: Vampire Hunter"
}