{
    "plot": "Chris Parker agrees to babysit after her \"dread\" date stands her up. Expecting a dull evening, Chris settles down with three kids for a night of TV... and boredom. But when her frantic friend Brenda calls and pleads to be rescued from the bus station in downtown Chicago, the evening soon explodes into an endless whirl of hair-raising adventures! Babysitter and kids leave their safe suburban surroundings and head for the heart of the big city, never imagining how terrifyingly funny their expedition will become!", 
    "genres": "Action, Comedy, Crime", 
    "release_year": "1987", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "abusive", 
                    "cold", 
                    "unfaithful", 
                    "willing", 
                    "lip-sync", 
                    "entire", 
                    "anniversary"
                ], 
                "role": "Bastard Boyfriend: Mike. Not abusive, but cold and unfaithful toward a girl who was willing to dance and lip-sync her way through an entire doo-wop song at the prospect of their anniversary date (and who evidently resembled a Playboy centerfold).", 
                "id": "BastardBoyfriend"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "different", 
                    "new", 
                    "current"
                ], 
                "role": "Chris in Adventures in Babysitting is played from a slightly different angle. She finds out during a night of running from gangbangers and criminals that her boyfriend is cheating on her because she won't put out. She gets everybody safely home, parents none the wiser, and gets a nicer, new, upgraded boyfriend when all is said and done — all without changing her look. Then again, she doesn't really need to change her look — a running gag/subplot of the film is the Identical Stranger who is the current Playmate of the Month, for whom she is repeatedly mistaken.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "big"
                ], 
                "role": "Fangirl: Sara is a big...nay, HUGE fan of Thor.", 
                "id": "Fangirl"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Bear: Chris, especially on the train, dealing with the gang members.", 
                "id": "MamaBear"
            }
        ]
    }, 
    "imdbid": "tt0092513", 
    "poster_url": "AdventuresInBabysitting.jpg", 
    "similar": [
        {
            "shared": [
                "Fangirl", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "RiseOfTheGuardians", 
            "name": "Rise of the Guardians"
        }, 
        {
            "shared": [
                "AdrenalineMakeover", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "JennifersBody", 
            "name": "Jennifer's Body", 
            "poster_url": "JennifersBody.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "Fangirl"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "AdventuresInBabysitting", 
    "name": "Adventures in Babysitting"
}