{
    "plot": "In this dramatic courtroom thriller, LT Daniel Kaffee, a Navy lawyer who has never seen the inside of the courtroom, defends two stubborn Marines who have been accused of murdering a colleague. Kaffee is known as being lazy and had arranged for a plea bargain. Downey's Aunt Ginny appoints Cmdr. Galloway to represent him. Also on the legal staff is LTJG Sam Weinberg. The team rounds up many facts and Kaffee is discovering that he is really cut out for trial work. The defense is originally based upon the fact that PFC Santiago, the victim, was given a \"CODE RED\". Santiago was basically a screw-up. At Gitmo, screw-ups aren't tolerated. Especially by Col. Nathan Jessup. In Cuba, Jessup and two senior officers try to give all the help they can, but Kaffee knows something's fishy. In the conclusion of the film, the fireworks are set off by a confrontation between Jessup and Kaffee.", 
    "genres": "Drama, Thriller", 
    "release_year": "1992", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Few", 
                    "willing"
                ], 
                "role": "Colonel Jessup from A Few Good Men. For all his claims of toughness, he was willing to throw two marines under the bus to protect his sorry hide.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "willing"
                ], 
                "role": "Dirty Coward: Jessup, who despite his claims of toughness, was willing to throw two Marines under a bus to protect himself.", 
                "id": "DirtyCoward"
            }
        ]
    }, 
    "imdbid": "tt0104257", 
    "poster_url": "AFewGoodMen.jpg", 
    "similar": [
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "ISpitOnYourGrave", 
            "name": "I Spit on Your Grave", 
            "poster_url": "ISpitOnYourGrave.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "WomanInTheMoon", 
            "name": "Woman in the Moon", 
            "poster_url": "WomanInTheMoon.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "TheKillerShrews", 
            "name": "The Killer Shrews", 
            "poster_url": "TheKillerShrews.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "TheVikings", 
            "name": "The Vikings", 
            "poster_url": "TheVikings.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "EscapeFromLA", 
            "name": "Escape from L.A.", 
            "poster_url": "EscapeFromLA.jpg"
        }
    ], 
    "id": "AFewGoodMen", 
    "name": "A Few Good Men"
}