{
    "plot": "Two friends an actor and a chef discover a plot to fix a horse race and try to capitalize on it. But also have to deal with the two men who fixed it who are trying to silence them. And there's also the mob boss whom the two guys work for who planned the fixing thing whose wife is having an affair with the actor.", 
    "genres": "Action, Comedy, Crime", 
    "release_year": "1986", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "The Casanova: Spence, leading to the Running Gag below.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Meganekko: Ellen", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "first", 
                    "bubble", 
                    "visible", 
                    "top", 
                    "Sure", 
                    "coat", 
                    "top", 
                    "top", 
                    "burst", 
                    "exact"
                ], 
                "role": "Ms. Fanservice: Claudia Pazzo. The only times we see her properly dressed are her first appearance at the apartment when she offers to buy the piano, and at the end when she and Spence are filming a movie. Diamonds in the Buff: Claudia is seen wearing earrings while taking a bubble bath and talking with Spence on the phone, and arrives at Spence's apartment wearing earrings, a necklace and even rings on her fingers. The earrings and necklace are visible when she is on top of him in bed. Naked in Mink: Claudia arrives at Spence's apartment wearing a white fur coat. Spence asks, \"May I take your coat?\" and Claudia answers, \"Sure,\" shedding the coat and walking into Spence's bedroom wearing only panties. Nipple and Dimed/Sideboob: We see the top of Claudia's breasts and the side of her right breast on top of Spence but nothing more. Caught with Your Pants Down & Modesty Bedsheet: After Binky and Turnip have shown up at his apartment (since their car crashed into Spence's brother-in-law and his sister who were driving The Alleged Car above and he gave them Spence's address) and burst in on Claudia (wearing a towel on her way out of the bathroom, who then chased them screaming out the door), Spence wrapped the sheets around himself and tried to catch up with her, and called out her name, leading to an example of the Running Gag below.  Panty Shot. Along with the Naked in Mink scene above, when Spence and Dennis deliver the piano, Spence sneaks up to Claudia's bedroom to surprise her in bed, and holds up her panties, saying, \"In your rush, you forgot these.\" Closet Shuffle: Claudia tries to hide Spence under her bed and he and Dennis in the sauna Distracted by the Sexy: Tony, when Claudia takes off her nightgown in the sauna, where she is hiding Spence and Dennis, and walks out naked. However, Scenery Censor: The back wall of the sauna is the exact height needed to cover Claudia's butt when she drops her nightgown and even after she walks forward out of the sauna to distract Tony.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0091051", 
    "poster_url": "AFineMess.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "Meganekko", 
                "MsFanservice"
            ], 
            "shared_count": 3, 
            "id": "FantasticFour", 
            "name": "Fantastic Four", 
            "poster_url": "FantasticFour.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "WaynesWorld", 
            "name": "Wayne's World", 
            "poster_url": "WaynesWorld.jpg"
        }
    ], 
    "id": "AFineMess", 
    "name": "A Fine Mess"
}