{
    "plot": "A government agent trains a typical teenager Cody Banks who loves to skateboard, hates math, and feels like a complete idiot around girls, in the ways of covert operations that require younger participants. But Cody's got a secret--he's actually part of a secret teen CIA program. Cody's living every boy's dream life--he can drive like a stunt man, has an incredible arsenal of cool gadgets, and his agency mentor, Ronica Miles, is totally hot. But Cody's training is put to the test when he's sent to pose as a prep school student and befriend fellow teen Natalie Connors in order to gain access to her father--a scientist unknowingly developing a fleet of deadly pair of twisted villains called the nanobots for the evil organization ERIS, which can destroy any carbon or silicon-based substance-to destroy the world's defense systems so he can threaten anyone who opposes him. From runaway cars and high-speed snowboard chases to a spectacular final mountaintop showdown, Cody has to use everything he's learned to prove himself as an agent and stop ERIS from completing their mission before their mission fails.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Kid Anova: What the CIA thinks Cody is.", 
                "id": "KidAnova"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Natalie Connors from Agent Cody Banks fulfills this trope as if the writer had been reading this Wiki.", 
                "id": "MadScientistsBeautifulDaughter"
            }
        ]
    }, 
    "imdbid": "tt0313911", 
    "poster_url": "AgentCodyBanks.jpg", 
    "similar": [
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "TheMouseThatRoared", 
            "name": "The Mouse That Roared", 
            "poster_url": "TheMouseThatRoared.jpg"
        }, 
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "IslandOfLostSouls", 
            "name": "Island of Lost Souls", 
            "poster_url": "IslandOfLostSouls.jpg"
        }, 
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "TheKillerShrews", 
            "name": "The Killer Shrews", 
            "poster_url": "TheKillerShrews.jpg"
        }, 
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "TheMaskOfZorro", 
            "name": "The Mask of Zorro", 
            "poster_url": "TheMaskOfZorro.jpg"
        }, 
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "IronSky", 
            "name": "Iron Sky", 
            "poster_url": "IronSky.jpg"
        }
    ], 
    "id": "AgentCodyBanks", 
    "name": "Agent Cody Banks"
}