{
    "plot": "At a convent, fragile, unearthly Sister Agnes gives birth (she says it's a virgin birth), but the child dies. The police soon are involved because of the death of the baby. However, the main conflict is between Mother Superior Miriam Ruth, who wants Agnes left alone, and Dr. Martha Livingston, a psychiatrist determined to help Agnes gain a stronger grasp on reality and uncover any wrongdoers.", 
    "genres": "Drama, Mystery, Thriller", 
    "release_year": "1985", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "unclear", 
                    "sure"
                ], 
                "role": "The Ophelia: Agnes fits this trope extremely well. She is rather childlike and naïve. She also constantly speaks of random things that make sense only after being pieced together. It is unclear whether she was born mentally challenged; she says she was \"dropped on her head\" as a baby. Martha is never sure whether Agnes is really mentally challenged or it's a result of her mother's virtually imprisoning her.", 
                "id": "TheOphelia"
            }, 
            {
                "adjectives": [
                    "titular", 
                    "naïve", 
                    "unclear", 
                    "local", 
                    "sure"
                ], 
                "role": "The titular character of Agnes Of God fits this trope to a tee. Agnes is rather childlike and naïve, and she also constantly speaks of random things that make sense only after being pieced together. It is unclear whether she was born mentally challenged; she says she was \"dropped on her head\" as a baby. The local doctor, Martha, is never sure whether Agnes is really mentally challenged or it's a result of  her mother's virtually imprisoning her for years.", 
                "id": "TheOphelia"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in White: Agnes", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0088683", 
    "poster_url": "AgnesOfGod.jpg", 
    "similar": [
        {
            "shared": [
                "WomanInWhite", 
                "TheOphelia"
            ], 
            "shared_count": 2, 
            "id": "PicnicAtHangingRock", 
            "name": "Picnic at Hanging Rock", 
            "poster_url": "PicnicAtHangingRock.jpg"
        }, 
        {
            "shared": [
                "WomanInWhite", 
                "TheOphelia"
            ], 
            "shared_count": 2, 
            "id": "ADangerousMethod", 
            "name": "A Dangerous Method", 
            "poster_url": "ADangerousMethod.jpg"
        }, 
        {
            "shared": [
                "WomanInWhite", 
                "TheOphelia"
            ], 
            "shared_count": 2, 
            "id": "BlackSwan", 
            "name": "Black Swan", 
            "poster_url": "BlackSwan.jpg"
        }, 
        {
            "shared": [
                "WomanInWhite", 
                "TheOphelia"
            ], 
            "shared_count": 2, 
            "id": "TheRing", 
            "name": "The Ring", 
            "poster_url": "TheRing.jpg"
        }, 
        {
            "shared": [
                "WomanInWhite", 
                "TheOphelia"
            ], 
            "shared_count": 2, 
            "id": "BramStokersDracula", 
            "name": "Bram Stoker's Dracula"
        }
    ], 
    "id": "AgnesOfGod", 
    "name": "Agnes Of God"
}