{
    "plot": "This is the story of a mild-mannered man, named Tom Stall, who becomes a local hero through an act of violence, he lives a happy and quiet life with his lawyer wife and their two children in the small town of Millbrook, Indiana. But one night their idyllic existence is shattered when Tom foils a vicious attempted robbery in his diner. Sensing danger, he takes action and saves his customers and friends in the self-defense killings of two-sought-after criminals. Heralded as a hero, Tom's life is changed overnight, attracting a national media circus, which forces him into the spotlight. Uncomfortable with his newfound celebrity, Tom tries to return to the normalcy of his ordinary life only to be confronted by a mysterious and threatening man who arrives in town believing Tom is the man who wronged him in the past. As Tom and his family fight back against this case of mistaken identity and struggle to cope with their changed reality, they are forced to confront their relationships and the divisive issues which surface as a result.", 
    "genres": "Crime, Drama, Thriller", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Jerk Jock: The bully who torments Jack at school.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Tom Stahl's wife does a cheerleader routine before having sex with him in A History of Violence.", 
                "id": "CatholicSchoolGirlsRule"
            }
        ]
    }, 
    "imdbid": "tt0399146", 
    "poster_url": "AHistoryOfViolence.jpg", 
    "similar": [
        {
            "shared": [
                "CatholicSchoolGirlsRule", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "TheCraft", 
            "name": "The Craft", 
            "poster_url": "TheCraft.jpg"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "CatholicSchoolGirlsRule"
            ], 
            "shared_count": 1, 
            "id": "AssassinationOfAHighSchoolPresident", 
            "name": "Assassination Of A High School President", 
            "poster_url": "AssassinationOfAHighSchoolPresident.jpg"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "CatholicSchoolGirlsRule"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }
    ], 
    "id": "AHistoryOfViolence", 
    "name": "A History of Violence"
}