{
    "plot": "Still craving for the love of his life, Ted Striker follows Elaine onto the flight that she is working on as a member of the cabin crew. Elaine doesn't want to be with Ted anymore, but when the crew and passengers fall ill from food poisoning, all eyes are on Ted.", 
    "genres": "Comedy", 
    "release_year": "1980", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Camp Gay: Johnny is exaggeratedly camp in mannerisms and speech, Played for Laughs because nobody else seems to notice.", 
                "id": "CampGay"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "jive"
                ], 
                "role": "Cool Old Lady: The \"I speak jive\" lady.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Even the Girls Want Her: An old lady comments on Elaine to Ted.", 
                "id": "EvenTheGirlsWantHer"
            }, 
            {
                "adjectives": [
                    "lady", 
                    "white", 
                    "bouncy-bouncy", 
                    "panic", 
                    "second", 
                    "first"
                ], 
                "role": "Airplane!. The buxom Francesca \"Kitten\" Natividad pulls uncredited Gag Boobs duty as the jiggly lady in the white T-shirt. She has since said that she is not the topless woman who goes bouncy-bouncy in front of the camera when the passengers panic, so this second Fanservice Extra remains anonymous.\n As in the first movie, Francesca \"Kitten\" Natividad makes another blink-and-you'll-miss-it uncredited Gag Boobs appearance in The Sequel as the jiggling woman in the \"Moral Majority\" T-shirt.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "white", 
                    "later", 
                    "real"
                ], 
                "role": "Fanservice Extra: The buxom Francesca \"Kitten\" Natividad pulls uncredited duty here as the jiggling passenger in the white T-shirt (She later confirmed that she was not the naked woman who appears directly in front of the camera from out of nowhere for no real reason while the rest of the plane is panicking). She makes another blink-and-you'll-miss-it uncredited appearance as the jiggling woman in the \"Moral Majority\" T-shirt in Airplane II.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "Hysterical"
                ], 
                "role": "Hysterical Woman: Everyone lines up to slap some sense into her.", 
                "id": "HystericalWoman"
            }, 
            {
                "adjectives": [
                    "long", 
                    "hysterical", 
                    "lethal", 
                    "same", 
                    "fresh"
                ], 
                "role": "This trope is hilariously spoofed in Airplane!, with a long line of passengers lining up to slap the hysterical woman, with increasingly lethal weapons.\n The gag is recycled in Airplane II: The Sequel when the same woman testifies on Ted Stryker's behalf in a Kangaroo Court — the memory of her hysterics sends her into a fresh episode of hysterics, which prompts the members of the court to line up to beat it out of her.", 
                "id": "HystericalWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Sexy Stewardess: Elaine and Randy.", 
                "id": "SexyStewardess"
            }
        ]
    }, 
    "imdbid": "tt0080339", 
    "poster_url": "Airplane.jpg", 
    "similar": [
        {
            "shared": [
                "HystericalWoman", 
                "CampGay"
            ], 
            "shared_count": 2, 
            "id": "BrideOfFrankenstein", 
            "name": "Bride of Frankenstein"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "HystericalWoman"
            ], 
            "shared_count": 2, 
            "id": "PulpFiction", 
            "name": "Pulp Fiction", 
            "poster_url": "PulpFiction.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "CoolOldLady"
            ], 
            "shared_count": 2, 
            "id": "LiarLiar", 
            "name": "Liar Liar", 
            "poster_url": "LiarLiar.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "CoolOldLady"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "SexyStewardess"
            ], 
            "shared_count": 2, 
            "id": "TheFifthElement", 
            "name": "The Fifth Element", 
            "poster_url": "TheFifthElement.jpg"
        }
    ], 
    "id": "Airplane", 
    "name": "Airplane!"
}