{
    "plot": "Years have passed since Ted Striker heroically saved many lives by avoiding a plane crash. Working as a test pilot for a new Lunar Shuttle, he gets innocently sent into a mental ward after a crash of the badly constructed, computer-navigated spaceship. When he hears that the exactly same type of shuttle is scheduled for a moon flight soon, he breaks out to hinder the launch. Aboard, Ted finds his ex-ex Elaine Dickinson working as stewardess again and her fiancé Simon, a member of the committee that wants the Mayflower I to be launched. In flight, the ship's computer ROK 9000 takes control, killing the crew. Ted and Elaine manage to switch it off, and now it is up to Ted again to save the passengers' lives - if there only wouldn't be these flashbacks to the war and these people who know Ted and have no faith in his abilities at all.", 
    "genres": "Comedy", 
    "release_year": "1982", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "wrong", 
                    "defective", 
                    "later"
                ], 
                "role": "Airplane II: The Sequel: Simon, Elaine's fiancee. He lied and said that Stryker was wrong about the Mayflower shuttle being defective, and later abandons the shuttle rather than help save its passengers from the disaster.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "suicidal"
                ], 
                "role": "Airplane II: The Sequel makes fun of this by having impotence as the Berserk Button of suicidal passenger Joe Saluchi.", 
                "id": "TheLoinsSleepTonight"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "same", 
                    "fresh"
                ], 
                "role": "The gag is recycled in Airplane II: The Sequel when the same woman testifies on Ted Stryker's behalf in a Kangaroo Court — the memory of her hysterics sends her into a fresh episode of hysterics, which prompts the members of the court to line up to beat it out of her.", 
                "id": "HystericalWoman"
            }
        ]
    }, 
    "imdbid": "tt0083530", 
    "poster_url": "AirplaneIITheSequel.jpg", 
    "similar": [
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "ISpitOnYourGrave", 
            "name": "I Spit on Your Grave", 
            "poster_url": "ISpitOnYourGrave.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "WomanInTheMoon", 
            "name": "Woman in the Moon", 
            "poster_url": "WomanInTheMoon.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "TheKillerShrews", 
            "name": "The Killer Shrews", 
            "poster_url": "TheKillerShrews.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "TheVikings", 
            "name": "The Vikings", 
            "poster_url": "TheVikings.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "EscapeFromLA", 
            "name": "Escape from L.A.", 
            "poster_url": "EscapeFromLA.jpg"
        }
    ], 
    "id": "AirplaneIITheSequel", 
    "name": "Airplane II: The Sequel"
}