{
    "plot": "Eleven year-old Akeelah Anderson's life is not easy: her father is dead, her mom ignores her, her brother runs with the local gangbangers. She's smart, but her environment threatens to strangle her aspirations. Responding to a threat by her school's principal, Akeelah participates in a spelling bee to avoid detention for her many absences. Much to her surprise and embarrassment, she wins. Her principal asks her to seek coaching from an English professor named Dr. Larabee for the more prestigious regional bee. As the possibility of making it all the way to the Scripps National Spelling Bee looms, Akeelah could provide her community with someone to rally around and be proud of -- but only if she can overcome her insecurities and her distracting home life. She also must get past Dr. Larabee's demons, and a field of more experienced and privileged fellow spellers.", 
    "genres": "Drama", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Disappeared Dad: Akeelah has one.", 
                "id": "DisappearedDad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "male", 
                    "Japanese", 
                    "main"
                ], 
                "role": "Akeelah and the Bee has a male Japanese version in the form of the main rival's father.  Luckily, all was resolved by both of them winning the contest.", 
                "id": "EducationMama"
            }, 
            {
                "adjectives": [
                    "frivolous"
                ], 
                "role": "Education Mama: Subverted with Akeelah's mother, to the point that she thinks the spelling bee is completely frivolous in regards to her daughter going to school, not realizing that studying and bees go hand in hand. Dylan's father fits this, though, and it's hinted he's trying to get his son to win in an attempt to live through him, as \"he's never won anything in his life.\"", 
                "id": "EducationMama"
            }
        ]
    }, 
    "imdbid": "tt0437800", 
    "poster_url": "AkeelahAndTheBee.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "TheFog", 
            "name": "The Fog", 
            "poster_url": "TheFog.jpg"
        }
    ], 
    "id": "AkeelahAndTheBee", 
    "name": "Akeelah and the Bee"
}