{
    "plot": "Young Calvin Fuller is pulled into King Arthur's court by Merlin. His mission: to save Camelot. To do this he must overcome the villain known as Lord Belascoe, train to become a knight, and rescue the Princess Katherine whom he has fallen in love with him. Ultimately, He must help Arthur regain his confidence before he can go home.", 
    "genres": "Adventure, Comedy, Family", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Grandpa: Arthur", 
                "id": "BadassGrandpa"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "ridiculous"
                ], 
                "role": "Badass Princess:  Princess Sarah. Princess Katy starts out this way before suffering one of the most ridiculous cases of Chickification you'll ever see anywhere.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Chickification: See Faux Action Girl below.", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [], 
                "role": "A Kid in King Arthur's Court took out Guinevere and gave the widowed King Arthur two daughters, Princess Katey and Princess Sarah.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "ridiculous", 
                    "able", 
                    "broad", 
                    "old", 
                    "young", 
                    "fast", 
                    "able", 
                    "same", 
                    "entire", 
                    "tomboyish", 
                    "tough", 
                    "along"
                ], 
                "role": "Faux Action Girl: The film provides us with a very ridiculous example of this trope with Princess Katy. In the training sequence she is shown to be an excellent swordswoman, archer and horse rider, thus she should be \"of course, able to take care of herself\". Except, then she gets kidnapped by some mooks, in broad daylight and needs to be rescued by Calvin and King Arthur. A fight begins. Now on the good guys' side we have Arthur (a very old man), Calvin (a nerd who fails at baseball and has only trained in swordplay for a couple of days) and Katy (who is young, fast and has trained in swordplay all her life). Arthur and Calvin fight and kill the mooks while Katy, who really should be \"...able to take care of herself,\" gets kidnapped again. The same film also subverts the trope, however, with Katy's older sister Princess Sarah. The viewer spends the entire movie believing that tomboyish Katy is the tough one of the pair, only to find out that Sarah is the secret identity of the Black Knight, who has been fighting the enemy all along.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [
                    "only", 
                    "responsible"
                ], 
                "role": "The Lady's Favour: Not quite played straight. Sarah and Calvin are initially the only ones who know that Katy has been kidnapped. Sarah urges him to go to Arthur and tell him what's happened and who is responsible, as she feels Arthur is Katy's only hope. She gives Calvin her handkerchief to give to her father, so that he will know Calvin was sent by her and is telling the truth.", 
                "id": "TheLadysFavour"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: The two princesses.", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt0113538", 
    "poster_url": "AKidInKingArthursCourt.jpg", 
    "similar": [
        {
            "shared": [
                "Chickification", 
                "TomBoyAndGirlyGirl", 
                "BadassGrandpa", 
                "FauxActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 5, 
            "id": "ptitlenaucd30o", 
            "name": "A Kid in King Arthur's Court", 
            "poster_url": "ptitlenaucd30o.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "FauxActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "Chickification", 
                "BadassPrincess"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "Chickification", 
                "BadassPrincess"
            ], 
            "shared_count": 3, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "TomBoyAndGirlyGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 3, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }
    ], 
    "id": "AKidInKingArthursCourt", 
    "name": "A Kid in King Arthur's Court"
}