{
    "plot": "Aladdin is a street-urchin who lives in a large and busy town long ago with his faithful monkey friend Abu. When Princess Jasmine gets tired of being forced to remain in the palace that overlooks the city, she sneaks out to the marketplace, where she accidentally meets Aladdin. Under the orders of the evil Jafar (the sultan's advisor), Aladdin is thrown in jail and becomes caught up in Jafar's plot to rule the land with the aid of a mysterious lamp. Legend has it that only a person who is a \"diamond in the rough\" can retrieve the lamp from the Cave of Wonders. Aladdin might fit that description, but that's not enough to marry the princess, who must (by law) marry a prince.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "1992", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "evil", 
                    "male"
                ], 
                "role": "Beard of Evil: Not everyone with a beard is evil (in fact, every male citizen of Agrabah we see, besides Aladdin and little boys, has a beard) but Jafar's beard is definitely a Beard Of Evil. It's so...twisted.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Jafar in Aladdin deserves a mention. Not-evil men like the sultan and captain of the guard also have beards in the movie, but Jafar's is not only a goatee, but twisted.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "second", 
                    "unlike", 
                    "many", 
                    "courageous", 
                    "second"
                ], 
                "role": "Iago of Disney's Aladdin. For much of the second movie Aladdin: The Return of Jafar onward, he spent a lot of time looking out for himself almost exclusively although unlike many of the examples here, he can be courageous and selfless. Two examples come up in the second film.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [], 
                "role": "Jafar in Aladdin comes across as this when he wants Genie to make Jasmine fall in love with him, and when he thinks that's happened, he calls her \"pussycat\". Um, gross.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [
                    "hot", 
                    "young"
                ], 
                "role": "Mr. Fanservice: Aladdin. His animation design was based on Tom Cruise (at the point where Tom Cruise was the hot young thing of the moment) for this very reason. He was originally designed much younger and based on Michael J. Fox, but that design didn't go down as well.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "arrival", 
                    "likable"
                ], 
                "role": "Prince Achmed in Disney's Aladdin. Every late arrival suitor during the TV series was this trope, save for Prince Uncouthma, who ended up being likable.", 
                "id": "PrinceCharmless"
            }, 
            {
                "adjectives": [
                    "straight"
                ], 
                "role": "Never quite played straight in Disney's Aladdin. The chorus girls start out mockingly describing Aladdin's charm as a street urchin, and mostly seem to praise him as Prince Ali because of Genie's magic. Their counterpoint adoration of him during the \"Prince Ali\" song is awesome, regardless.", 
                "id": "SexyManInstantHarem"
            }, 
            {
                "adjectives": [
                    "interesting", 
                    "nice", 
                    "insignificant"
                ], 
                "role": "The Sultan in Aladdin is an interesting example; he was always nice, but in the movie was insignificant because he had been controlled by an Evil Vizier so long. Then in the series, he develops into The Good King.\n He expresses, at one point, genuine surprise that there are impoverished people living in his kingdom - though his inflection indicates a compassionate concern for them.", 
                "id": "TheGoodKing"
            }, 
            {
                "adjectives": [], 
                "role": "Jafar disguises himself as one of these in Aladdin, in a Monte Cristo reference.", 
                "id": "TheOldConvict"
            }, 
            {
                "adjectives": [], 
                "role": "The Old Convict: Jafar disguises himself as one of these in a Monte Cristo reference.", 
                "id": "TheOldConvict"
            }, 
            {
                "adjectives": [
                    "shirtless"
                ], 
                "role": "Apparently, Aladdin couldn't afford buttons for his vest. Or a shirt. Or nipples. The Genie also is completely shirtless.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Disney's Aladdin had Badass Princess Jasmine. She and Aladdin save each other's skins more than once throughout the course of the movie, making them a Battle Couple.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "single", 
                    "famous", 
                    "little"
                ], 
                "role": "Princess Jasmine in Aladdin is possibly the single most famous bedlah-wearer, in the harem pants and the little off-the-shoulder belly top.\n Also, the 3 Balcony Harem Girls.", 
                "id": "BedlahBabe"
            }, 
            {
                "adjectives": [], 
                "role": "Genie conjures some up in Aladdin. Disturbingly, some of them are camels.", 
                "id": "BellyDancer"
            }, 
            {
                "adjectives": [
                    "sweet", 
                    "excitable", 
                    "strong", 
                    "slavery", 
                    "emotional-psychological", 
                    "sarcastic", 
                    "Social"
                ], 
                "role": "The Aladdin fanfic Antiphony portrays recurring villain Mozenrath as one, in a Rare Male Example; he used to be a sweet, excitable child who just wanted to help people and had a strong devotion to his god. Fast-forward fourteen years of what was essentially slavery and emotional-psychological torture, and he's become a sarcastic Social Darwinist who scorns any form of faith and seeks power for himself.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Disney's Aladdin had Badass Princess Jasmine. She and Aladdin save each other's skins more than once throughout the course of the movie, making them a Battle Couple.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Princess Jasmine — Aladdin (1992)", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Graceful Ladies Like Purple: Jasmine wears a purple dress when she intends to announce her engagement.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [
                    "few", 
                    "crucial"
                ], 
                "role": "Aladdin: Jasmine had her moment, keeping Jafar distracted long enough for Al to get the lamp back. Backfired, since Al was (rightly) too squicked out upon seeing her kiss Jafar to keep moving toward the lamp, losing a few crucial seconds.", 
                "id": "HeroicSeductress"
            }, 
            {
                "adjectives": [
                    "original", 
                    "early", 
                    "third", 
                    "great"
                ], 
                "role": "Aladdin: Aladdin's mother, who appears in the original story, was going to be in the movie as well, but was dropped early on. In the third movie he mentions that his mother died when he was a kid. The Sultan's wife is mentioned as being deceased. In one of the direct-to-TV princess movies, it is shown that the Sultan spends a great deal of time with his wife's stallion, Sahara, indicating that she died quite recently.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "meant"
                ], 
                "role": "Missing Mom: Jasmine. Aladdin as well, which is one of the similarities between them. Originally Aladdin was meant to have a mother and some brothers, but this was changed.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "sexual"
                ], 
                "role": "Ms. Fanservice: Jasmine. Arguably the most sexual of all the Disney Princesses, and consistently the highest billed in their Princess Collection range.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Jasmine from Aladdin.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "As told in the page quote, Jasmine in Aladdin, even more so in the stage adaptation.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "Rebellious"
                ], 
                "role": "Rebellious Princess: Jasmine.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "Rebellious", 
                    "poor", 
                    "shown", 
                    "effective"
                ], 
                "role": "Princess Jasmine in Aladdin is a Rebellious Princess, but she has elements of this as well, like giving an apple to a poor kid. Unfortunately she doesn't realize she needs money in the marketplace, and that if you don't have any the merchants will assume you're stealing. In the series, she's shown having slightly more effective methods of helping the people of Agrabah.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [], 
                "role": "Likewise concerning the Sultan.", 
                "id": "TheUglyGuysHotDaughter"
            }
        ]
    }, 
    "imdbid": "tt0103639", 
    "poster_url": "Aladdin.jpg", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "DamselOutOfDistress", 
                "PrinceCharmless", 
                "TheUglyGuysHotDaughter", 
                "SexyManInstantHarem", 
                "EverythingsBetterWithPrincesses", 
                "DirtyCoward", 
                "BadassDamsel", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 10, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "PluckyGirl", 
                "RebelliousPrincess", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "TheGoodKing", 
                "MrFanservice", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "TheUglyGuysHotDaughter", 
                "DirtyOldMan", 
                "SpoiledSweet", 
                "EverythingsBetterWithPrincesses", 
                "DirtyCoward", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "DamselOutOfDistress", 
                "MsFanservice", 
                "RebelliousPrincess", 
                "SpoiledSweet", 
                "BeardOfEvil", 
                "DirtyCoward", 
                "BadassDamsel", 
                "MrFanservice"
            ], 
            "shared_count": 8, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "DamselOutOfDistress", 
                "PrinceCharmless", 
                "PluckyGirl", 
                "RebelliousPrincess", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "BrokenBird"
            ], 
            "shared_count": 7, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }
    ], 
    "id": "Aladdin", 
    "name": "Aladdin"
}