{
    "plot": "During World War II when all the men are fighting the war, most of the jobs that were left vacant because of their absence were filled in by women. The owners of the baseball teams, not wanting baseball to be dormant indefinitely, decide to form teams with women. So scouts are sent all over the country to find women players. One of the scouts, passes through Oregon and finds a woman named Dottie Hinson, who is incredible. He approaches her and asks her to try out but she's not interested. However, her sister, Kit who wants to get out of Oregon, offers to go. But he agrees only if she can get her sister to go. When they try out, they're chosen and are on the same team. Jimmy Dugan, a former player, who's now a drunk, is the team manager. But he doesn't feel as if it's a real job so he drinks and is not exactly doing his job. So Dottie steps up. After a few months when it appears the girls are not garnering any attention, the league is facing closure till Dottie does something that grabs attention. And it isn't long Dottie is the star of the team and Kit feels like she's living in her shadow.", 
    "genres": "Comedy, Drama, Sport", 
    "release_year": "1992", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "The two strongest players in A League of Their Own are played by Rosie O'Donnell and Megan Cavanagh.", 
                "id": "StoutStrength"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "former", 
                    "good", 
                    "person—fiercely", 
                    "loyal", 
                    "great", 
                    "other"
                ], 
                "role": "Hooker with a Heart of Gold: Mae. Not a prostitute, but a former taxi dancer (which was close enough back in those days) and implied to be promiscuous. Other than that, she's clearly a good person—fiercely loyal to and protective of her best friend Doris, teaches Shirley to read, helps Marla and Kit pretty themselves up, consoles Dottie after the World Series loss, is a great ball player, and for all her flirting and sleeping around, is never once seen to be pursuing any of the other girls' men.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "Many", 
                    "Kit"
                ], 
                "role": "Passionate Sports Girl: Many of the girls, but especially Kit.", 
                "id": "PassionateSportsGirl"
            }, 
            {
                "adjectives": [
                    "many"
                ], 
                "role": "Statuesque Stunner: Dottie is easily the tallest of the Peaches, and as many of the characters will attest, one of the prettiest", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [], 
                "role": "Team Mom: Dottie.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Kit and Dottie, and Doris and Mae.", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt0104694", 
    "poster_url": "ALeagueOfTheirOwn.jpg", 
    "similar": [
        {
            "shared": [
                "TeamMom", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 2, 
            "id": "NowAndThen", 
            "name": "Now And Then", 
            "poster_url": "NowAndThen.jpg"
        }, 
        {
            "shared": [
                "StatuesqueStunner", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 2, 
            "id": "TheSisterhoodOfTheTravelingPants", 
            "name": "The Sisterhood of the Traveling Pants", 
            "poster_url": "TheSisterhoodOfTheTravelingPants.jpg"
        }, 
        {
            "shared": [
                "StoutStrength", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 2, 
            "id": "TheIncredibles", 
            "name": "The Incredibles"
        }, 
        {
            "shared": [
                "StoutStrength", 
                "StatuesqueStunner"
            ], 
            "shared_count": 2, 
            "id": "StreetFighter", 
            "name": "Street Fighter", 
            "poster_url": "StreetFighter.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "WereTheMillers", 
            "name": "We're the Millers", 
            "poster_url": "WereTheMillers.jpg"
        }
    ], 
    "id": "ALeagueOfTheirOwn", 
    "name": "A League of Their Own"
}