{
    "plot": "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to consider whether to go through with the marriage and falls down a hole in the garden after spotting an unusual rabbit. Arriving in a strange and surreal place called \"Underland,\" she finds herself in a world that resembles the nightmares she had as a child, filled with talking animals, villainous queens and knights, and frumious bandersnatches. Alice realizes that she is there for a reason--to conquer the horrific Jabberwocky and restore the rightful queen to her throne.", 
    "genres": "Adventure, Family, Fantasy", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "final", 
                    "other", 
                    "occasional", 
                    "would-be", 
                    "final", 
                    "other"
                ], 
                "role": "Man in a Kilt: The Hatter wears one for the final battle. No explanation is offered, other than the Hatter's occasional Scottish-ness. Actually, there may be some sort of explanation: Near the beginning of the movie, when Alice dances with her would-be fiance she tells him that she had a vision of women wearing pants and men wearing dresses (or something to that effect). Since she is effectively wearing pants in the final battle, the Hatter wearing a kilt might sort of fulfill the other part of her vision.", 
                "id": "ManInAKilt"
            }, 
            {
                "adjectives": [
                    "final"
                ], 
                "role": "The Hatter in Tim Burton's Alice in Wonderland wears a kilt for the final battle.", 
                "id": "ManInAKilt"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "final"
                ], 
                "role": "Action Girl: Alice becomes this in the final battle. As well as the Dormouse of all people.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "clear", 
                    "supplemental", 
                    "entire", 
                    "main", 
                    "other", 
                    "common", 
                    "Victorian"
                ], 
                "role": "Broken Bird: The Hatter. As it gets explained to Alice via flashback (and is made more explicitly clear in supplemental material), his entire family was killed the day the Jabberwock assaulted Witzend and the White Queen lost her crown. The Hatter himself only survived the invasion because he rushed to get the White Queen to safety; he returned to the scene afterward and found everything burning and everyone dead. This is one of the two main reasons for his madness, the other being mercury poisoning (a common malady for Victorian milliners).", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Big Sis: Alice's; her name is Margaret.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [], 
                "role": "Daddy's Girl: Alice.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better With Queens", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "huge", 
                    "hard", 
                    "later", 
                    "quick", 
                    "actual", 
                    "19th-century"
                ], 
                "role": "Each of the Red Queen's courtiers had a comically huge body part, and if one were to look hard enough, there are glimpses of one with Gag Boobs. When it is later revealed that the body parts are all fake, there's a very quick background shot of one of the courtiers tearing the fake breasts away from the woman's chest, though no actual naughty bits are shown. So Alice is a 19th-century Brit who is gonna engage in trade with China. Riiiight.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "classic", 
                    "huge"
                ], 
                "role": "Another classic example is The Queen of Hearts of Alice in Wonderland. She has a huge temper and has anyone who upsets her executed.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [], 
                "role": "God Save Us from the Queen!: The Queen of Hearts.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "Played"
                ], 
                "role": "God Save Us from the Queen!: Played straight with the Red Queen, averted with the White.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [], 
                "role": "Granola Girl: Played for Laughs with The White Queen.", 
                "id": "GranolaGirl"
            }, 
            {
                "adjectives": [], 
                "role": "The White Queen from Tim Burton's Alice in Wonderland. Her sister the Red Queen laments that she can make anything fall in love with her... even the furniture.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [], 
                "role": "Lady of War: The Dormouse.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "fantasy"
                ], 
                "role": "Maiden Aunt: Alice's, played by Frances De La Tour. Apparently thinks she's Wallis Simpson. (\"I'm waiting for my fiance. He's a prince, but alas, he cannot marry me unless he renounces his throne.\") When Alice returns, she tells her aunt she has to let go of her fantasy.", 
                "id": "MaidenAunt"
            }, 
            {
                "adjectives": [
                    "single"
                ], 
                "role": "Tim Burton's Alice in Wonderland had Aunt Imogen. She wasn't so much \"single\" as \"engaged to a prince who doesn't exist\".", 
                "id": "MaidenAunt"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Alice.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "In the 2010 Alice in Wonderland, Alice Kingsley doesn't have an identity until she claims herself to be her father's daughter. She then goes on to run her father's company according to his vision instead of accepting a wedding proposal, so while it looks like sister's doin' it for herself, there's still a man to thank for her position.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "Self-Made", 
                    "little", 
                    "'suitable"
                ], 
                "role": "Never a Self-Made Woman: Despite Alice's father having very little screen time, once Alice understands who she is she labels herself as her father's daughter, then proceeds to continue his work. However, she chooses to go into a business and leave home to establish trade routes, rather than get married to a 'suitable' member of the aristocracy. She's doing what the eldest son of a family would be expected to do, rather than a daughter.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "melodramatic", 
                    "own", 
                    "punk-rock", 
                    "critic"
                ], 
                "role": "Perky Goth: The White Queen - Anne Hathaway is clearly having a ball floating around like a melodramatic crazy girl. Hathaway's own description of her character is \"a punk-rock vegan pacifist.\" One movie critic summed her up as \"Morticia Addams's hippie cousin.\"", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [], 
                "role": "Alice from Alice in Wonderland.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "9-foot", 
                    "tall"
                ], 
                "role": "Alice in Wonderland: Alice is this to the Knave of Hearts when she's 9-foot tall.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "9-foot-tall"
                ], 
                "role": "Statuesque Stunner: 9-foot-tall Alice. Well, to the Knave of Hearts, anyway.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "High"
                ], 
                "role": "The High Queen: The White Queen is an exaggerated version.", 
                "id": "TheHighQueen"
            }, 
            {
                "adjectives": [
                    "opposite"
                ], 
                "role": "The White Queen from Tim Burton's Alice in Wonderland. Her sister (who is the opposite) laments that she can make anything fall in love with her - even the furniture.", 
                "id": "TheHighQueen"
            }, 
            {
                "adjectives": [
                    "first", 
                    "second"
                ], 
                "role": "The Woman Wearing the Queenly Mask: The White Queen spends most of her time looking elegant and floating around waving her arms in the air, but during her first appearance, she asks her courtiers to excuse her for a moment, and the second they leave, she drops her arms, picks up her skirts and runs to greet Bayard in a gush of emotion. She's making use of Obfuscating Weirdness.", 
                "id": "TheWomanWearingTheQueenlyMask"
            }, 
            {
                "adjectives": [
                    "pacifistic"
                ], 
                "role": "Woman in White: The White Queen in all her pacifistic glory.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt1142966", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "EverythingsBetterWithPrincesses", 
                "WomanInWhite", 
                "GodSaveUsFromTheQueen", 
                "LadyOfWar", 
                "TheHighQueen", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "EverythingsBetterWithPrincesses", 
                "GodSaveUsFromTheQueen", 
                "CoolBigSis", 
                "TheWomanWearingTheQueenlyMask", 
                "PluckyGirl", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "EverythingsBetterWithPrincesses", 
                "WomanInWhite", 
                "TheWomanWearingTheQueenlyMask", 
                "GodSaveUsFromTheQueen", 
                "LadyOfWar", 
                "TheHighQueen"
            ], 
            "shared_count": 7, 
            "id": "Elizabeth", 
            "name": "Elizabeth", 
            "poster_url": "Elizabeth.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "EverythingsBetterWithPrincesses", 
                "GagBoobs", 
                "ManInAKilt", 
                "PluckyGirl", 
                "TheHighQueen"
            ], 
            "shared_count": 6, 
            "id": "Brave", 
            "name": "Brave", 
            "poster_url": "Brave.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "GagBoobs", 
                "WomanInWhite", 
                "StatuesqueStunner", 
                "PerkyGoth", 
                "PluckyGirl"
            ], 
            "shared_count": 6, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }
    ], 
    "id": "AliceInWonderland", 
    "name": "Alice in Wonderland"
}