{
    "plot": "A commercial crew aboard the deep space towing vessel, Nostromo is on its way home when they pick an SOS warning from a distant planet. What they don't know is that the SOS warning is not like any other ordinary warning call. Picking up the signal, the crew realize that they are not alone on the spaceship when a alien stowaway is on the cargo ship.", 
    "genres": "Horror, Sci-Fi", 
    "release_year": "1979", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Alien: Parker, the Chief Engineer, and Brett, the Engineering Technician", 
                "id": "GreaseMonkey"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "neutral", 
                    "last", 
                    "whole", 
                    "common", 
                    "subsequent", 
                    "other", 
                    "second", 
                    "fourth", 
                    "Bishop-like"
                ], 
                "role": "Alien does this. And it should be noted that every role in the film was written as gender neutral (which is probably why everyone just used their last names for the whole film), so it could have easily been a Final Guy instead.\n It's a common misconception that all of the subsequent Alien movies followed suit; in reality, there were other survivors in the second and fourth movies, and Ripley actually dies in the third.\n Prometheus: Shaw, sort of: David also survives of a fashion, although in a state of Bishop-like discombobulation thanks to an Engineer.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "Final", 
                    "strict"
                ], 
                "role": "Final Girl: Ripley is the lone survivor of the film, though she was not the strict star of the film.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "Hysterical", 
                    "terrified", 
                    "emotional"
                ], 
                "role": "Hysterical Woman: Lambert (Veronica Cartwright). She's by far the most terrified and emotional member of the crew, and completely freezes up when the Alien confronts her.", 
                "id": "HystericalWoman"
            }, 
            {
                "adjectives": [
                    "terrified", 
                    "emotional"
                ], 
                "role": "Lambert (Veronica Cartwright) in Alien. She's by far the most terrified and emotional member of the crew, and completely freezes up when the Alien confronts her.", 
                "id": "HystericalWoman"
            }, 
            {
                "adjectives": [
                    "organic", 
                    "vulva-shaped", 
                    "great"
                ], 
                "role": "Maternal symbolism: the AI of the spaceship in Alien is called \"Mother.\" The organic alien ship is entered through vulva-shaped doors. The showdown between Ripley and the alien queen has a great deal of Mama Bear implications on both sides. Many critics have compared the alien queen with Grendel's mother.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "final"
                ], 
                "role": "Alien:\n Lambert, most notably in her final scene when she's paralysed with fear as the alien advances on her.\n Ripley screams in the end of the movie, before blowing the alien out the airlock.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [
                    "traditional", 
                    "final"
                ], 
                "role": "Screaming Woman: Ripley screams when she discovers the xenomorph approaching her as she's preparing to hit the airlock near the end. Lambert is the traditional version, most notably in her final scene when she's paralysed with fear as the alien advances on her.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Lambert", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0078748", 
    "poster_url": "Alien.jpg", 
    "similar": [
        {
            "shared": [
                "HystericalWoman", 
                "ScreamingWoman", 
                "FinalGirl"
            ], 
            "shared_count": 3, 
            "id": "StageFrightAquarius", 
            "name": "StageFright -Aquarius-"
        }, 
        {
            "shared": [
                "TheChick", 
                "ScreamingWoman", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "JurassicParkIII", 
            "name": "Jurassic Park III", 
            "poster_url": "JurassicParkIII.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "SweetHome", 
            "name": "Sweet Home"
        }, 
        {
            "shared": [
                "ScreamingWoman", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "They", 
            "name": "They", 
            "poster_url": "They.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "Hausu", 
            "name": "Hausu"
        }
    ], 
    "id": "Alien", 
    "name": "Alien"
}