{
    "plot": "Fifty seven years after Ellen Ripley survived her disastrous ordeal, her escape vessel is recovered after drifting across the galaxy as she slept in cryogenic stasis. Back on earth, nobody believed her story about the \"Aliens\" on the planet LV-426. After the \"Company\" orders the colony on LV-426 to investigate, however, all communication with the colony is lost. The Company enlists Ripley to aid a team of tough, rugged space marines on a rescue mission to the now partially terraformed planet to find out if there are aliens or survivors. As the mission unfolds, Ripley will be forced to come to grips with her worst nightmare, but even as she does, she finds that the worst is yet to come.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "1986", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bash Brother & Sister - Drake and Vasquez, the two M56 Smart Gun users.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "past", 
                    "such", 
                    "own", 
                    "single", 
                    "original", 
                    "parasite-based", 
                    "bad"
                ], 
                "role": "Aliens: Carter Burke. His meddling directly causes the deaths of everyone in the colony. When called on this he tries to bribe Ripley, then attempts to get Ripley and Newt infected so he can sneak them past quarantine. And to top it off, in order to sell a convincing story to the authorities he was going to kill the rest of the team in their sleep on the way home. Slime ball doesn't even begin to describe him. In fact, being such a Dirty Coward is what leads to his death. When the Aliens attack, he tries to escape on his own, shutting a security door behind him as he does, which seemingly prevents Ripley and the Marines from getting out as well. He then runs straight into a single Alien, which kills him. Which is a kindness compared to the original script, where he ended up another victim of the Alien's parasite-based birthing process until Ripley gives him a grenade for a Mercy Kill (a fate which made it into the novelization). Burke was so bad that when Paul Reiser, the actor portraying him, took his parents to the film's premiere, his mother NODDED IN APPROVAL when her son's character died.", 
                "id": "DirtyCoward"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "particular", 
                    "rough-and-tumble", 
                    "other"
                ], 
                "role": "Action Girl: Ellen Ripley graduates to one. Although not possessing any particular combat skills, she has the guts and determination to survive. Vasquez, one of the Marines who nearly makes it to the end. Also known for being more rough-and-tumble than the other Marines.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "enormous", 
                    "old", 
                    "same", 
                    "last"
                ], 
                "role": "Action Mom: Ripley essentially adopts Newt, and goes to enormous lengths to protect her. This is set up earlier in a deleted scene (included in the novelisation and the Special Edition) which reveals that her daughter had died of cancer in her old age while Ripley was lost in hypersleep, and Newt is the same age that her daughter was the last time she saw her.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "maternal", 
                    "old", 
                    "cryogenic", 
                    "significant"
                ], 
                "role": "Ellen Ripley. In Aliens, her relationship with Newt is completely maternal, even though they're not biologically mother and daughter. Much ass-kicking is induced by that relationship. \"GET AWAY FROM HER, YOU BITCH!\", indeed. The directors cut of the film also reveals that she had a daughter back on Earth before leaving on the trip that sets off the series. Said daughter grew old and died while Ripley was lost in cryogenic sleep for 57 years, making her connection with Newt all the more significant.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "obvious", 
                    "first"
                ], 
                "role": "Broken Bird: Ripley at the beginning of the movie. Newt is in obvious shellshock as well, at first.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "last", 
                    "half-hour"
                ], 
                "role": "Mama Bear: The last half-hour deals with Ripley defending Newt from the xenomorphs and the Alien Queen defending her eggs from Ripley.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "real"
                ], 
                "role": "Newt in Aliens. Excusable though as she is just a little girl facing very real monsters. It also saves her life when she's coccooned awaiting the facehugger. Ripley has found her Tracking Device lying on the floor and breaks down in tears, thinking she's dead. Suddenly she hears Newt scream and thus knows exactly which direction to go.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [
                    "excusable", 
                    "real"
                ], 
                "role": "Screaming Woman: Ripley screams as she falls into the gravity well with the Queen, and just before the Queen loses its hold on her during the airlock sequence. And Newt — excusable though as she is just a little girl facing very real monsters. It also saves her life when she's cocooned awaiting the facehugger. Ripley has found her Tracking Device lying on the floor and breaks down in tears, thinking she's dead. Suddenly Ripley hears Newt scream and thus knows exactly which direction to go.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [
                    "Private"
                ], 
                "role": "Private Vasquez from Aliens is played by a 5'3 actress and wields a 40-pound machine gun. \"Let's rock!!\"", 
                "id": "SmallGirlBigGun"
            }, 
            {
                "adjectives": [
                    "tough"
                ], 
                "role": "Aliens Vasquez is a tough and masculine marine. Her character introduction is one of the guys asking if she's ever been mistaken for a man. She icily replies \"No, have you?\"", 
                "id": "TheLadette"
            }, 
            {
                "adjectives": [
                    "gender-flipped", 
                    "equal", 
                    "sardonic", 
                    "bashful"
                ], 
                "role": "Aliens: another gender-flipped example when Hicks gives Ripley a communicator. After both exchange looks equal parts sardonic and bashful, he quickly quips \"It doesn't mean we're engaged,\" and she puts it on herself.", 
                "id": "TheLadysFavour"
            }, 
            {
                "adjectives": [], 
                "role": "Aliens. Vasquez. Also Dietrich and Ferro.", 
                "id": "TheSquadette"
            }
        ]
    }, 
    "imdbid": "tt0090605", 
    "poster_url": "AlienS.jpg", 
    "similar": [
        {
            "shared": [
                "DirtyCoward", 
                "BashBrothers", 
                "TheLadysFavour", 
                "ActionMom", 
                "TheSquadette"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "ActionGirl", 
                "MamaBear", 
                "TheSquadette"
            ], 
            "shared_count": 4, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "TheSquadette", 
                "BashBrothers", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "EdgeOfTomorrow", 
            "name": "Edge of Tomorrow", 
            "poster_url": "EdgeOfTomorrow.jpg"
        }, 
        {
            "shared": [
                "TheLadette", 
                "DirtyCoward", 
                "ActionGirl", 
                "TheSquadette"
            ], 
            "shared_count": 4, 
            "id": "StreetsOfFire", 
            "name": "Streets of Fire", 
            "poster_url": "StreetsOfFire.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward", 
                "SmallGirlBigGun", 
                "ActionGirl", 
                "BashBrothers"
            ], 
            "shared_count": 4, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }
    ], 
    "id": "AlienS", 
    "name": "Aliens"
}