{
    "plot": "When her father enlists to fight for the British in WWI, young Sara Crewe goes to New York to attend the same boarding school her late mother attended. She soon clashes with the severe headmistress, Miss Minchin, who attempts to stifle Sara's creativity and sense of self-worth. Sara's belief that \"every girl's a princess\" is tested to the limit, however, when word comes that her father was killed in action and his estate has been seized by the British government.", 
    "genres": "Drama, Family, Fantasy", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "main", 
                    "absent"
                ], 
                "role": "Frances Hodgson Burnett seemed to love this trope as this happens to pretty much all of her main characters. Sara Crewe at least used to have a loving father, but both of Mary's parents are emotionally and largely physically absent even before they die. And then we have Little Lord Fauntleroy Cedric, whose loving father died when he was a toddler, and the plot is kickstarted when he and his mom go to England to meet his grandfather...", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Mr Carrisford in A Little Princess watches over Sara without her realizing that it was the man next door to the school who was secretly delivering presents and gifts up to her room to keep her spirits up.", 
                "id": "MysteriousProtector"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Alpha Bitch: Lavinia.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "close", 
                    "young"
                ], 
                "role": "Daddy's Girl: Sara and her father were very close, and her mother died when she was quite young.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Sara Crewe from A Little Princess.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "close", 
                    "Little", 
                    "modern", 
                    "few"
                ], 
                "role": "Daddy's Girl: Sara and her father were very close, and her mother died when she was quite young. His calling her \"Little Missus\" also, to the modern reader, carries a few... implications.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "various", 
                    "Spoiled", 
                    "grand", 
                    "big"
                ], 
                "role": "A Little Princess. To clarify, Sara Crewe considers herself to be a princess and looks to various royal women in history as role models. Though her attitude isn't because of her money (she's actually Spoiled Sweet), she considers herself to be a princess because she acts grand and dignified, and would never do something vulgar. In one film adaptation, she makes a big speech about how all girls are princesses.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "small", 
                    "hangers-on"
                ], 
                "role": "Girl Posse: Lavinia's small band of hangers-on.", 
                "id": "GirlPosse"
            }, 
            {
                "adjectives": [
                    "musical", 
                    "only", 
                    "likeable"
                ], 
                "role": "The evil matriarch of the girls' boarding school in A Little Princess is shown playing a harp at moments when she's not actively working to make Sarah's life miserable. Her musical ability is arguably the only likeable trait the character has.", 
                "id": "HarpOfFemininity"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Lonely Doll Girl: Sarah's doll Emily was bought by her father so she'd feel less lonely when he returned to India. She becomes one of Sara's few companions when Sara loses her fortune.", 
                "id": "LonelyDollGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Ojou: Sara before her father dies. Look at the title.", 
                "id": "Ojou"
            }, 
            {
                "adjectives": [
                    "hard"
                ], 
                "role": "Sara Crewe in A Little Princess, before she falls on hard times.", 
                "id": "Ojou"
            }, 
            {
                "adjectives": [], 
                "role": "Sarah Crewe from A Little Princess.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "historical"
                ], 
                "role": "Princess Classic: Or almost. In fact, Sara looks up to historical queens and princesses (notably Marie Antoinette in one instance) as role models, which helps her control her temper on occasions.", 
                "id": "PrincessClassic"
            }, 
            {
                "adjectives": [
                    "close", 
                    "actual", 
                    "sweetness", 
                    "uncomfortable", 
                    "competent", 
                    "tough"
                ], 
                "role": "Sara Crewe in the movie versions of A Little Princess is about as close as this trope gets without any actual royalty. But in the book she isn't sweetness and light. Part of why she is disliked is because of her ability to make adults uncomfortable by standing up for herself. Unfortunately, the Shirley Temple version completely destroys what made the character great, while adding in an inability to face reality. Whereas in the book she is remarkably competent and tough for her age. The 90s version seems to fix that though.", 
                "id": "PrincessClassic"
            }, 
            {
                "adjectives": [
                    "such", 
                    "last"
                ], 
                "role": "In at least one film version of A Little Princess, Sara Crewe lives such a charmed life that she not only fancies herself a princess but says that all girls are princesses. She's nearly a teenager but it fits since it takes place in the Victorian period which is when the phase came from so it is probably expected to last longer. It's worth noting that Sara's idea of being a princess does not mean it entitles you to be a spoiled brat.", 
                "id": "PrincessPhase"
            }, 
            {
                "adjectives": [
                    "recent", 
                    "little", 
                    "literary", 
                    "real", 
                    "such", 
                    "favorite"
                ], 
                "role": "Princess Phase: The most recent film version of Sara not only fancies herself a princess but says that all girls are princesses. She's nearly a teenager but it fits since it is in the Victorian period and probably aimed at little girls. It's worth noting her idea of being a princess does not mean it entitles you to be a spoiled brat. By contrast, the literary Sara did not fancy herself a real princess; however, others described her as such, and she used the ideal of a princess as a model and guide for living — and during the worst of her ordeal, coping with — her life. However, one of her favorite \"supposings\" was that she was \"...a Princess, and a Fairy one, and because (she was) a Fairy, nothing can hurt (her) or make (her) uncomfortable.”", 
                "id": "PrincessPhase"
            }, 
            {
                "adjectives": [], 
                "role": "Lavinia from A Little Princess.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "Rich", 
                    "social", 
                    "unmerciful"
                ], 
                "role": "Rich Bitch: Lavinia Herbert, who was the richest girl in school before Sara turned up, and sees the younger girl as a threat to her social standing. She's unmerciful in her ridicule when Sara loses her fortune.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "actual"
                ], 
                "role": "In A Little Princess, Sara Crewe takes this role to pay her headmistress. Before that, she befriends Becky, the actual scullery maid at the school.", 
                "id": "SculleryMaid"
            }, 
            {
                "adjectives": [
                    "first", 
                    "strong"
                ], 
                "role": "Sara from A Little Princess. She is a bit clueless about people below her station at first, but she soon develops a very strong sense of compassion even before things all go to hell in a handbasket for her.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "sweet"
                ], 
                "role": "Spoiled Sweet: Sara has clearly been ridiculously spoiled but is still as sweet as Shirley Temple always was.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "first", 
                    "awful", 
                    "fortunate"
                ], 
                "role": "Spoiled Sweet: Sara's a bit naive about the state of the world at first, but even before things get horribly awful she realizes that there are people less fortunate than she is and doesn't act like a Rich Bitch.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0113670", 
    "poster_url": "ALittlePrincess.jpg", 
    "similar": [
        {
            "shared": [
                "SpoiledSweet", 
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses", 
                "PluckyGirl", 
                "DaddysGirl"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses", 
                "PluckyGirl", 
                "DaddysGirl"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "EverythingsBetterWithPrincesses", 
                "PluckyGirl", 
                "AlphaBitch"
            ], 
            "shared_count": 4, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic"
            ], 
            "shared_count": 4, 
            "id": "Cinderella", 
            "name": "Cinderella", 
            "poster_url": "Cinderella.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses", 
                "PluckyGirl", 
                "DaddysGirl"
            ], 
            "shared_count": 4, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }
    ], 
    "id": "ALittlePrincess", 
    "name": "A Little Princess"
}