{
    "plot": "The orphan Mandy Lane is a beautiful, virgin and pure teenager raised by her aunt, desired by her schoolmates and a close friend of the outcast Emmet. After the death of their high school mate in a pool party, Mandy befriends Chloe, Marlin, Red, Bird and Jake. Red invites the group for a weekend party in the isolated ranch of his family, with all the boys disputing who would succeed in having sex with Mandy Lane. They meet the henchman Garth that takes care of the ranch and he asks the group to go easy on the drugs and booze. In the middle of the night, a stranger wearing a hood attacks Marlin in the barn; when Jake seeks her out, he faces the killer, beginning a night of bloodshed and terror.", 
    "genres": "Horror", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Big Man on Campus: Red.", 
                "id": "BigManOnCampus"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: Dylan.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Alpha Bitch: Chloe.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "Final", 
                    "double"
                ], 
                "role": "Final Girl: Mandy. Pure and innocent. Subverted when it's revealed that she was in on the murders, and double subverted when she turns against the killer, allowing her to be the Final Girl after all.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "first", 
                    "whole", 
                    "last"
                ], 
                "role": "Subverted to hell and back in All the Boys Love Mandy Lane. The innocent and pure Mandy appears to be this at first, but then comes The Reveal that, the whole time, she was working with the killer, with whom she had entered a Suicide Pact. It's then given a Double Subversion when Mandy backs out of the pact at the last minute, allowing her to be the Final Girl after all.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Mandy, of course. Chloe as well.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "virginal", 
                    "late-teen", 
                    "high", 
                    "evil", 
                    "manipulative", 
                    "female"
                ], 
                "role": "All the Boys Love Mandy Lane, Mandy Lane seems like an innocent, virginal, late-teen girl who all the teenage boys are obsessed over at high school.  Turns out she's an evil, manipulative, female who uses her charms to make a multiple murder and suicide pact with her nerdy male best friend, which she then breaks by killing him too. And she gets away maintaining her innocent persona.", 
                "id": "TheFakeCutie"
            }
        ]
    }, 
    "imdbid": "tt0490076", 
    "poster_url": "AllTheBoysLoveMandyLane.jpg", 
    "similar": [
        {
            "shared": [
                "JerkJock", 
                "AlphaBitch", 
                "FinalGirl"
            ], 
            "shared_count": 3, 
            "id": "Shrooms", 
            "name": "Shrooms", 
            "poster_url": "Shrooms.jpg"
        }, 
        {
            "shared": [
                "BigManOnCampus", 
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "TheBreakfastClub", 
            "name": "The Breakfast Club", 
            "poster_url": "TheBreakfastClub.jpg"
        }, 
        {
            "shared": [
                "BigManOnCampus", 
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "BigManOnCampus", 
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "ShesAllThat", 
            "name": "She's All That", 
            "poster_url": "ShesAllThat.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "AlphaBitch", 
                "FinalGirl"
            ], 
            "shared_count": 3, 
            "id": "Carrie", 
            "name": "Carrie", 
            "poster_url": "Carrie.jpg"
        }
    ], 
    "id": "AllTheBoysLoveMandyLane", 
    "name": "All the Boys Love Mandy Lane"
}