{
    "plot": "Edward Carnby, detective of the paranormal, unexplained and supernatural, investigates a mystery (the recent death of a friend) with clues leading to \"Shadow Island\" that brings him face to face with bizarre horrors that prove both psychologically disturbing and lethal, as he discovers that evil demons worshiped by an ancient culture called the Abskani are planning on coming back to life in the 21st century to once again take over the world... and only he and a young genius anthropologist with an incredible memory (and his ex-girlfriend), Aline Cedrac, stand in their way, at a gateway to hell. Standing in Carnby's way, however, is the impact that a brief encounter with an evil spirit called the Queen had upon his mind, as he slowly finds himself overpowered by the forces of darkness as they eat away at his very sanity...", 
    "genres": "Action, Horror", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "joint"
                ], 
                "role": "In his joint review of Alone in the Dark (2005) with Spoony and The Nostalgia Critic, when raving at the absurdity of the love interest visiting the protagonist of the film just to sleep with him, and start doing so without asking or even talking, he then admits that he wishes some women would do that.", 
                "id": "ChivalrousPervert"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Hot", 
                    "American", 
                    "commentary", 
                    "critic"
                ], 
                "role": "Hot Scientist: Aline Cedrac, played by, oddly enough, Tara Reid (better known for her roles in American Pie and The Big Lebowski). Boll actually says in the commentary that the glasses and her hair in a bun make her look really intelligent. One critic remarked that this would be \"like casting Dame Judi Dench as a crack whore\".", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [], 
                "role": "Alone in the Dark (2005): Tara Reid's character.", 
                "id": "Meganekko"
            }
        ]
    }, 
    "imdbid": "tt0369226", 
    "poster_url": "AloneInTheDark2005.jpg", 
    "similar": [
        {
            "shared": [
                "HotScientist", 
                "ChivalrousPervert"
            ], 
            "shared_count": 2, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "ChivalrousPervert"
            ], 
            "shared_count": 2, 
            "id": "Ghostbusters", 
            "name": "Ghostbusters", 
            "poster_url": "Ghostbusters.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "ChivalrousPervert"
            ], 
            "shared_count": 2, 
            "id": "ItsAWonderfulLife", 
            "name": "It's a Wonderful Life", 
            "poster_url": "ItsAWonderfulLife.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "DevilFish", 
            "name": "Devil Fish"
        }, 
        {
            "shared": [
                "Meganekko", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "Moonraker", 
            "name": "Moonraker", 
            "poster_url": "Moonraker.jpg"
        }
    ], 
    "id": "AloneInTheDark2005", 
    "name": "Alone in the Dark "
}