{
    "plot": "In Jasper National Park, the wolves, Kate and Humphrey, have known each other since puppyhood, but they are on the oppose ends of the Western Pack's social structure with Kate as the energetic Alpha daughter of the pack leader and Humphrey being the good humoured Omega. That social structure forces Kate to accept an arranged marriage with Garth of the Eastern Pack to unite the packs for peace, regardless of Humphrey's hopeless attraction for her. Before that union can occur, Kate and Humphrey are captured by the park's rangers and sent to an Idaho park as part of a wolf repopulation project. Mindful of her duties, Kate is determined to return to Jasper and Humphrey offers to help with the assistance of two odd geese. However, as this disparate pair struggle through the dangers to get home, a growing mutual appreciation of their talents and then a deeper love threatens to disastrously complicate everything if they make it back.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Bishōnen"
                ], 
                "role": "Bishōnen: Garth. Yes, Garth.", 
                "id": "Bishonen"
            }, 
            {
                "adjectives": [], 
                "role": "Shakey from Alpha and Omega, a runty Omega wolf who wears flowers around his neck and cries at weddings. He loves hanging out with a couple of wolven Granola Girls.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [], 
                "role": "Casanova Wannabe: Salty with his best (and only) pickup line being \"hey\".", 
                "id": "CasanovaWannabe"
            }, 
            {
                "adjectives": [], 
                "role": "Salty from Alpha and Omega is basically a wolf version of this trope.", 
                "id": "CasanovaWannabe"
            }, 
            {
                "adjectives": [
                    "quick", 
                    "old"
                ], 
                "role": "Henpecked Husband: Humphrey becomes one of these to a degree, as Kate is quick to criticize and order him around (although Kate is noticeably trying to handle a lot of stress). Humphrey lampshades this by questioning if he's become the family pet when she orders him to dig up old bones for the family dinner.", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [], 
                "role": "Garth from Alpha and Omega is the wolf version of this, especially to another wolf named Humphrey.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "such"
                ], 
                "role": "Jerk Jock: Garth initially comes off as such towards Humphrey, but gradually shows he's more than that.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "Overprotective", 
                    "forbidden", 
                    "poor"
                ], 
                "role": "Overprotective Dad: Humphrey gets into this role to a degree when he catches onto the growing attraction between Claudette and Fleet. He immediately yells at Claudette that she's forbidden to date until she's \"[her] grandma's age\", embarrassing the poor girl (and Kate, who watches on). That Humphrey is also coaching her and Fleet is also on the rival team do not help matters.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [], 
                "role": "Surfer Dude: Salty is basically a wolf version of this.", 
                "id": "SurferDude"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "other", 
                    "female", 
                    "such", 
                    "second"
                ], 
                "role": "Action Girl: Kate, although some other female characters have received moments (such as Lilly and Princess in the second film)", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "beautiful"
                ], 
                "role": "Beautiful All Along: After failing miserably to hit the intended target during a hunting exercise, Lilly tries to hide away from Garth in shame. Garth, figuring her Peek-a-Bangs are the reason she missed, brushes her hair out of her face and is wowed by how beautiful her eyes are. Following this, Lilly becomes far more confident.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Big Sis: Kate to Lilly.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "loyal", 
                    "collective", 
                    "good"
                ], 
                "role": "Daddy's Little Villain: Subverted with Princess. While she is loyal to her father and serves as The Dragon, Princess does not share the Rogues' collective Social Darwinist views and has a good side that Runt helps bring out.", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [
                    "Howl-iday", 
                    "loyal", 
                    "clear", 
                    "Anti-Villain", 
                    "Card-Carrying", 
                    "good", 
                    "final"
                ], 
                "role": "Princess of Alpha and Omega 2: A Howl-iday Adventure is a subversion. While Princess is loyal to her father King and serves as his Dragon, it becomes clear that she's an Anti-Villain to his Card-Carrying Villain. Even moreso in the climax when, thanks to Runt bringing out more of her good side, Princess defies King's final attack order and retreats.", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Dark Action Girl: Princess", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "vegetarian"
                ], 
                "role": "Granola Girl: Reba and Janice, the vegetarian she-wolves", 
                "id": "GranolaGirl"
            }, 
            {
                "adjectives": [
                    "maternal", 
                    "bear", 
                    "other"
                ], 
                "role": "Mama Bear: Princess' maternal instincts start showing when she cares for Runt during his time as the Rogues' hostage. The mother of the bear cub shows up towards the climax and leads other bears to fight off the Rogues.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Missing Mom: Garth doesn't have a mom. This could say a lot about his father, considering his nature.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "hair-flipping"
                ], 
                "role": "Ms. Fanservice: Kate, especially during the \"hair-flipping\" scene.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "The Cutie: Lilly. Also, Shakey counts as a male version.", 
                "id": "TheCutie"
            }
        ]
    }, 
    "imdbid": "tt1213012", 
    "poster_url": "AlphaAndOmega.jpg", 
    "similar": [
        {
            "shared": [
                "OverprotectiveDad", 
                "MsFanservice", 
                "ActionGirl", 
                "MamaBear", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "OverprotectiveDad", 
                "MsFanservice", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "ActionGirl", 
                "MamaBear", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "GranolaGirl", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }, 
        {
            "shared": [
                "Bishonen", 
                "MsFanservice", 
                "ActionGirl", 
                "DarkActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Lucifer", 
            "name": "Lucifer"
        }
    ], 
    "id": "AlphaAndOmega", 
    "name": "Alpha and Omega"
}