{
    "plot": "It's the late 1960's. Just for a lark, graduate student Eddie Jessup, known for being unconventional, brilliant and slightly mad, conducts experiments with an isolation chamber, using himself as the subject. His experiences in the chamber cause him to hallucinate, much of the imagery being religious-based despite he not being a religious man. Seven years later, he is a respected full professor in the Harvard Medical School. Believing he has lost his edge and has fallen into an unwanted state of respectability, Eddie decides to resume his work with sensory deprivation, this time using hallucinogens, specifically untested ones used in mystical Mexican rituals, to enhance the experience of being in the isolation tank. After initial tests, he claims he entered an alternate physical and mental state. Although unbelieving of Eddie's claims, his colleagues Arthur Rosenberg and Mason Parrish, as well as Eddie's wife, Emily, who is in her own right a respected academic, are concerned for Eddie's well being. However, if Eddie's claims are indeed true, he could do irreparable harm to himself and others around him, especially if his altered states are uncontrollable.", 
    "genres": "Drama, Fantasy, Horror", 
    "release_year": "1980", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "prime"
                ], 
                "role": "Mr. Fanservice: William Hurt in his prime.", 
                "id": "MrFanservice"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Hot", 
                    "later"
                ], 
                "role": "Hot Scientist: Eddie's girlfriend and later, wife, Emily (played by Blair Brown)", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "delicious"
                ], 
                "role": "Ms. Fanservice: Blair Brown as Emily. Her nude scenes are quite delicious and the film even ends with her naked in a hallway held by an equally undressed William Hurt.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "physical", 
                    "small", 
                    "much", 
                    "intellectual", 
                    "good", 
                    "glorious"
                ], 
                "role": "The Cutie: Subverted by Blair Brown as Emily, who as a PhD in physical anthropology (she seems to be largely a primatologist or a behaviorist) and mother of two small daughters still dresses like a teenager in The Sixties. Hoewever, she's a genius, and her relationship with Eddie Jessup is as much intellectual as it is sexual. She also spends a good deal of time in Africa... studying baboons, which is not the most glorious fieldwork.", 
                "id": "TheCutie"
            }
        ]
    }, 
    "imdbid": "tt0080360", 
    "poster_url": "AlteredStates.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "MrFanservice", 
                "HotScientist"
            ], 
            "shared_count": 3, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MrFanservice", 
                "HotScientist"
            ], 
            "shared_count": 3, 
            "id": "JohnCarter", 
            "name": "John Carter", 
            "poster_url": "JohnCarter.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "AlteredStates", 
    "name": "Altered States"
}