{
    "plot": "In a tree farm, three musically inclined chipmunks, Alvin, Simon and Theodore, find their tree cut down and sent to Los Angeles. Once there, they meet the frustrated songwriter David Seville, and despite a poor house wrecking first impression, they impress him with their singing talent. Seeing the opportunity for success, both human and chipmunks make a pact for them to sing his songs. While that ambition proves a frustrating struggle with the difficult trio, the dream does come true after all. However, that success presents its own trials as their unscrupulous record executive, Ian Hawke, plans to break up this family to exploit the boys. Can Dave and the Chipmunks discover what they really value amid the superficial glamor around them?", 
    "genres": "Animation, Comedy, Family", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Basement-Dweller"
                ], 
                "role": "Basement-Dweller: Toby", 
                "id": "BasementDweller"
            }, 
            {
                "adjectives": [], 
                "role": "Dave's cousin Toby from Alvin and the Chipmunks: The Squeakel who lives in his grandmother's basement and plays video games all day.", 
                "id": "BasementDweller"
            }, 
            {
                "adjectives": [
                    "girth", 
                    "side-kick"
                ], 
                "role": "Ryan in Alvin and the Chipmunks: The Squeakquel verbally threatens Alvin, gives Simon a swirly and subsequently drops him into the toilet, and pokes fun at Theodore's girth (which is naturally a Berserk Button for Alvin and Simon). His sidekick would too, if he weren't . . . well, the side-kick.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "second", 
                    "straight-up"
                ], 
                "role": "In the second cartoon series, but not in the three live-action movies, Alvin and the Chipmunks are either Borderline Petting Zoo People or straight-up Petting Zoo People, but the Chipettes are Borderline Little Bit Beastly.", 
                "id": "HumanoidFemaleAnimal"
            }, 
            {
                "adjectives": [], 
                "role": "Alvin and the Chipmunks: Jeanette of the Chipettes. A Funny Animal example.", 
                "id": "Meganekko"
            }
        ]
    }, 
    "imdbid": "tt0952640", 
    "poster_url": "AlvinAndTheChipmunks.jpg", 
    "similar": [
        {
            "shared": [
                "Meganekko", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "TheRageCarrie2", 
            "name": "The Rage: Carrie 2"
        }, 
        {
            "shared": [
                "Meganekko", 
                "BasementDweller"
            ], 
            "shared_count": 2, 
            "id": "WaynesWorld", 
            "name": "Wayne's World", 
            "poster_url": "WaynesWorld.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "TheAmazingSpider-Man", 
            "name": "The Amazing Spider-Man", 
            "poster_url": "TheAmazingSpider-Man.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "HumanoidFemaleAnimal", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "OpenSeason", 
            "name": "Open Season", 
            "poster_url": "OpenSeason.jpg"
        }
    ], 
    "id": "AlvinAndTheChipmunks", 
    "name": "Alvin and the Chipmunks"
}