{
    "plot": "Amélie is a story about a girl named Amélie whose childhood was suppressed by her Father's mistaken concerns of a heart defect. With these concerns Amélie gets hardly any real life contact with other people. This leads Amélie to resort to her own fantastical world and dreams of love and beauty. She later on becomes a young woman and moves to the central part of Paris as a waitress. After finding a lost treasure belonging to the former occupant of her apartment, she decides to return it to him. After seeing his reaction and his new found perspective - she decides to devote her life to the people around her. Such as, her father who is obsessed with his garden-gnome, a failed writer, a hypochondriac, a man who stalks his ex girlfriends, the \"ghost\", a suppressed young soul, the love of her life and a man whose bones are as brittle as glass. But after consuming herself with these escapades - she finds out that she is disregarding her own life and damaging her quest for love. Amélie then discovers she must become more aggressive and take a hold of her life and capture the beauty of love she has always dreamed of.", 
    "genres": "Comedy, Romance", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "awesome", 
                    "able", 
                    "spot-on", 
                    "Amélie", 
                    "uncomfortable"
                ], 
                "role": "Cool Old Guy: Raymond Dufayel, the shut-in in Amélie's building. One of the most awesome things ever about Mr. Dufayel is that he's able to be completely spot-on about everything that's going on in Amélie's head and even mentions uncomfortable truths about her and her life. Throughout the movie, he almost becomes a guru of sorts for her.", 
                "id": "CoolOldGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "eponymous", 
                    "Amélie", 
                    "naive", 
                    "borderline-autistic", 
                    "later"
                ], 
                "role": "The eponymous main character of Amélie with har naive and borderline-autistic view of the world. She doesn't really have any goals beside helping others and later get her man.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "Amélie", 
                    "eponymous"
                ], 
                "role": "Amélie also features an eponymous heroine who is motherless. Her death is explained at the beginning of the movie.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0211915", 
    "similar": [
        {
            "shared": [
                "CoolOldGuy", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "TheSwanPrincess", 
            "name": "The Swan Princess", 
            "poster_url": "TheSwanPrincess.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "JoeVersusTheVolcano", 
            "name": "Joe Versus The Volcano", 
            "poster_url": "JoeVersusTheVolcano.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }
    ], 
    "id": "Amelie", 
    "name": "Amélie"
}