{
    "plot": "In 1963 Sydney Newman, progressive head of BBC TV's drama department, wants to fill a Saturday tea-time slot with a show with youth appeal and hits on the idea of an august figure, like a doctor, leading a group of companions on time travel adventures. He engages inexperienced young producer Verity Lambert to expand the idea. Fighting sexist and racial bigotry Verity and young Indian director Waris Hussein persuade crusty character actor William Hartnell to play the doctor figure and, despite technical hiccups and competition with coverage of the Kennedy assassination, the first episode of 'Doctor Who' is born. As the show becomes a success Hartnell displays an obsession with his character but, after three years, ill health catches up with him and he starts to forget lines. Newman tells him that Doctor Who will 'regenerate' and he will be replaced by younger actor Patrick Troughton. Though attached to the part and reluctant to give it up Hartnell wishes every success to Troughton, the first of several actors to play a part which will endure for fifty years.", 
    "genres": "Biography, Drama, History", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Straight Gay: Waris Hussein, appropriately for the time period.", 
                "id": "StraightGay"
            }
        ]
    }, 
    "imdbid": "tt2663812", 
    "similar": [
        {
            "shared": [
                "StraightGay"
            ], 
            "shared_count": 1, 
            "id": "TheLionInWinter", 
            "name": "The Lion in Winter", 
            "poster_url": "TheLionInWinter.jpg"
        }, 
        {
            "shared": [
                "StraightGay"
            ], 
            "shared_count": 1, 
            "id": "ValentinesDay", 
            "name": "Valentine's Day", 
            "poster_url": "ValentinesDay.jpg"
        }, 
        {
            "shared": [
                "StraightGay"
            ], 
            "shared_count": 1, 
            "id": "TheBirdcage", 
            "name": "The Birdcage", 
            "poster_url": "TheBirdcage.jpg"
        }, 
        {
            "shared": [
                "StraightGay"
            ], 
            "shared_count": 1, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "StraightGay"
            ], 
            "shared_count": 1, 
            "id": "Maurice", 
            "name": "Maurice", 
            "poster_url": "Maurice.jpg"
        }
    ], 
    "id": "AnAdventureInSpaceAndTime", 
    "name": "An Adventure in Space and Time"
}