{
    "plot": "Fievel is a young Russian mouse separated from his parents on the way to America, a land they think is without cats. When he arrives alone in the New World, he keeps up hope, searching for his family, making new friends, and running and dodging the cats he thought he'd be rid off.", 
    "genres": "Animation, Comedy, Drama", 
    "release_year": "1986", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "American", 
                    "complete", 
                    "villainous"
                ], 
                "role": "Fievel daydreams about being a Young Gun at the beginning of An American Tail: Fievel Goes West, complete with his hero Wylie Burp telling him to get out while he still can, and Fievel blatantly disobeying him and shooting out a gang of villainous cats.", 
                "id": "YoungGun"
            }, 
            {
                "adjectives": [
                    "complete", 
                    "villainous"
                ], 
                "role": "Young Gun: Fievel daydreams about being a Young Gun at the beginning of Fievel Goes West, complete with his hero Wylie Burp telling him to 'get out while he still can', and Fievel blatantly disobeying him and shooting out a gang of villainous cats.", 
                "id": "YoungGun"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Gag Boobs: Cat R. Waul's owner smothers him with hers. Also a Marshmallow Hell. PUSSY PUSSY!", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "American", 
                    "human", 
                    "huge", 
                    "human", 
                    "good", 
                    "first", 
                    "first"
                ], 
                "role": "In An American Tail: Fievel Goes West, there is a human woman with huge knockers who is infatuated with Cat R. Waul, whom he meets when Fievel stabs him with a fork and sends him shooting up into the human overworld, and whose unwilling pet he becomes when the good guys send him packing on a train at film's end. In her first scene, she even snuggles him up into her cleavage!\n The implication of her two appearances is that she was already his owner in the first place.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scoop: Nellie Brie in The Mystery of the Night Monster.", 
                "id": "HotScoop"
            }, 
            {
                "adjectives": [
                    "first", 
                    "flesh-colored", 
                    "human-looking", 
                    "much"
                ], 
                "role": "Humanoid Female Animal: Bridget is the best example in the first movie (even having flesh-colored, very human-looking hands), the sequels do it more though. Female characters tend to have much smaller hands and feet in the series.", 
                "id": "HumanoidFemaleAnimal"
            }, 
            {
                "adjectives": [
                    "female", 
                    "American", 
                    "human-like", 
                    "male", 
                    "first", 
                    "flesh-colored", 
                    "human", 
                    "other", 
                    "male", 
                    "female"
                ], 
                "role": "The female mice in An American Tail look a little more human-like than the male mice, more so in the sequels.\n In the first film, Bridget has Caucasian flesh-colored hands which look much more human than those of any of the other mice, male or female.", 
                "id": "HumanoidFemaleAnimal"
            }, 
            {
                "adjectives": [
                    "other", 
                    "past"
                ], 
                "role": "In Fievel Goes West, there is a talking cat woman whose name is actually Miss Kitty. She is the head matron amongst the other \"singers\" in the saloon, and left her troubled past behind her in New York to go off to the west.", 
                "id": "MissKitty"
            }, 
            {
                "adjectives": [
                    "same", 
                    "future"
                ], 
                "role": "Miss Kitty: She even has the same name. Kitty leaves New York for an exciting future in the west, and ends up being one of the head matrons to what is essentially a brothel.", 
                "id": "MissKitty"
            }, 
            {
                "adjectives": [
                    "American"
                ], 
                "role": "Miss Kitty from An American Tail: Fievel Goes West is this by profession, but is never actually shown singing. She makes Tanya her protege and Tanya is shown singing at a cat bar.", 
                "id": "TheChanteuse"
            }, 
            {
                "adjectives": [
                    "American"
                ], 
                "role": "In the direct-to-video sequel An American Tail: The Treasure of Manhattan Island, the daughter the Chief of an underground tribe of Native American mice named Cholena comes with Fievel and his friends to the surface to see if Europeans have become more tolerant. Sadly, they have not.", 
                "id": "TheChiefsDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "The Chief's Daughter: Cholena in The Treasure of Manhattan Island.", 
                "id": "TheChiefsDaughter"
            }, 
            {
                "adjectives": [
                    "American", 
                    "first", 
                    "possible"
                ], 
                "role": "Tanya Mousekewitz from An American Tail, particularly in the first sequel where she's older and more developed, bares little resemblance to her father. It's possible she took after her mother, if she was quite a looker once.", 
                "id": "TheUglyGuysHotDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "The Ugly Guy's Hot Daughter: Cholena, who is absolutely dwarfed by her father and looks nothing like him.", 
                "id": "TheUglyGuysHotDaughter"
            }
        ]
    }, 
    "imdbid": "tt0090633", 
    "poster_url": "AnAmericanTail.jpg", 
    "similar": [
        {
            "shared": [
                "TheChanteuse", 
                "GagBoobs", 
                "HumanoidFemaleAnimal"
            ], 
            "shared_count": 3, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }, 
        {
            "shared": [
                "MissKitty", 
                "YoungGun"
            ], 
            "shared_count": 2, 
            "id": "Silverado", 
            "name": "Silverado", 
            "poster_url": "Silverado.jpg"
        }, 
        {
            "shared": [
                "TheChanteuse", 
                "TheUglyGuysHotDaughter"
            ], 
            "shared_count": 2, 
            "id": "BatmanMysteryOfTheBatwoman", 
            "name": "Batman: Mystery of the Batwoman", 
            "poster_url": "BatmanMysteryOfTheBatwoman.jpg"
        }, 
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "HotScoop"
            ], 
            "shared_count": 2, 
            "id": "HarryPotterAndTheGobletOfFire", 
            "name": "Harry Potter and the Goblet of Fire", 
            "poster_url": "HarryPotterAndTheGobletOfFire.jpg"
        }, 
        {
            "shared": [
                "GagBoobs", 
                "HumanoidFemaleAnimal"
            ], 
            "shared_count": 2, 
            "id": "Rango", 
            "name": "Rango", 
            "poster_url": "Rango.jpg"
        }
    ], 
    "id": "AnAmericanTail", 
    "name": "An American Tail"
}