{
    "plot": "Having left San Diego for New York City, Ron Burgundy is living the high life with his wife Veronica Corningstone and son Walter Burgundy. However, when the boss decides to promote Veronica to full time lead anchor and fire Ron, everything changes. Now heading back to San Diego, Ron is washed up and working part time at Sea World. His shot at redemption though comes in the form of a man named Freddie Schapp, who's an executive producer at the Global News Network, the world's first 24 hour round the clock news channel. He hires Ron, who proceeds to reunite the news team of Champ, Brick, and Brian, and head back to New York City. While there Ron and his news team are given the graveyard shift and a challenge. Ron comes up with a radical new idea to transform the news and that puts him at the top of the game once again. But how long will Ron's newfound fame last? And will Brick finally find true love?", 
    "genres": "Comedy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "In the sequel, when he meets up with Ron again, he constantly keeps on hugging him, to the point Ron gets a little weirded out.", 
                "id": "ArmouredClosetGay"
            }, 
            {
                "adjectives": [], 
                "role": "Bumbling Dad: Ron assumes this role for his son.", 
                "id": "BumblingDad"
            }
        ]
    }, 
    "imdbid": "tt1229340", 
    "poster_url": "Anchorman2TheLegendContinues.jpg", 
    "similar": [
        {
            "shared": [
                "BumblingDad", 
                "ArmouredClosetGay"
            ], 
            "shared_count": 2, 
            "id": "AmericanBeauty", 
            "name": "American Beauty", 
            "poster_url": "AmericanBeauty.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "FourLions", 
            "name": "Four Lions", 
            "poster_url": "FourLions.jpg"
        }, 
        {
            "shared": [
                "BumblingDad"
            ], 
            "shared_count": 1, 
            "id": "Epic", 
            "name": "Epic"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "ThePunisher", 
            "name": "The Punisher", 
            "poster_url": "ThePunisher.jpg"
        }
    ], 
    "id": "Anchorman2TheLegendContinues", 
    "name": "Anchorman 2: The Legend Continues"
}