{
    "plot": "The youth's voice of today. Hear their message, understand their motives, and see their movement.", 
    "genres": "Documentary, Short, Drama", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "first", 
                    "own"
                ], 
                "role": "Averted in the first poster for A New Hope. All the elements are there, except the princess is standing on her own, looking away from the hero and holding a gun.", 
                "id": "LegCling"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "bad"
                ], 
                "role": "Princess Leia in A New Hope. Luke and Han come to rescue her, the rescue doesn't quite work out, so she blasts a hole in the wall, proclaiming \"Somebody has to save our skins!\" Not to mention, she did what she could to keep the secret of the rebel hideout and had lots of guts when facing Darth Vader. Too bad Alderaan still got blown up despite her efforts.\n And in Return of the Jedi, Jabba the Hutt takes Leia as a slave. Goodbye, Jabba.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "male", 
                    "first", 
                    "understandable", 
                    "sympathetic", 
                    "sulky", 
                    "brattish"
                ], 
                "role": "Luke Skywalker in Star Wars comes off as a male version at first, although it's pretty understandable (his foster aunt and uncle forbidding him to pursue his dream of attending the Imperial Academy and becoming a pilot like his father). He does whine and moan quite a bit throughout A New Hope and The Empire Strikes Back, although by Return of the Jedi this behavior has completely disappeared. And through it all, he looks pretty sympathetic compared to Jerk with a Heart of Gold Han Solo.\n And Luke, even at his most sulky and brattish, has nothing on his father at that age...", 
                "id": "BrattyTeenageDaughter"
            }, 
            {
                "adjectives": [
                    "good", 
                    "moon-sized", 
                    "obvious", 
                    "so-called"
                ], 
                "role": "Damsel in Distress / Damsel out of Distress: Princess Leia is captured in the opening scene and remains a prisoner for a good deal of the movie. Then the trope is inverted (one could almost say deconstructed for the genre George Lucas was drawing from). True, Leia doesn't try to escape herself, but that's because she's outnumbered and then imprisoned in a moon-sized battlestation. But when an opportunity does arise, she seizes it with both hands and takes charge of matters once it's obvious her so-called rescuers don't have a clue what they're doing.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "first", 
                    "in-between", 
                    "much"
                ], 
                "role": "Princess Leia in A New Hope. Luke and Han come to rescue her but the rescue doesn't quite work out, so she blasts a hole in the wall, proclaiming \"Somebody has to save our skins!\"\n  Leia's first appearance may result in her being captured to eventually be rescued, but in-between giving the Death Star plans to some droids, she's a much better shot than the stormtroopers who died trying to capture her.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Everything's Better with Princesses: Princess Leia! She even blasts a few stormtroopers, thus making her an Action Girl.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "first", 
                    "simple", 
                    "elegant", 
                    "white"
                ], 
                "role": "Her daughter Leia continues the tradition by spending the entire first movie in a simple but elegant white dress. Even when she was shooting stormtroopers and leading a prison escape.", 
                "id": "KickingAssInAllHerFinery"
            }, 
            {
                "adjectives": [
                    "first", 
                    "own"
                ], 
                "role": "Averted in the first poster for A New Hope. All the elements are there, except the princess is standing on her own, looking away from the hero and holding a gun.", 
                "id": "LegCling"
            }, 
            {
                "adjectives": [
                    "adoptive", 
                    "tangential"
                ], 
                "role": "Similarly averted in A New Hope where Princess Leia is a Senator and member of the rebellion with no man by her side. Her (adoptive) father was a Senator before her and is the chief executive on their homeworld, but it's implied that any influence he had on her getting her position was tangential at best.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in White: Princess Leia.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt2177912", 
    "similar": [
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "DamselOutOfDistress", 
                "KickingAssInAllHerFinery", 
                "BadassDamsel"
            ], 
            "shared_count": 4, 
            "id": "Spaceballs", 
            "name": "Spaceballs", 
            "poster_url": "Spaceballs.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "DamselOutOfDistress", 
                "KickingAssInAllHerFinery", 
                "DamselInDistress"
            ], 
            "shared_count": 4, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "NeverASelfMadeWoman", 
                "LegCling"
            ], 
            "shared_count": 4, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "DamselInDistress"
            ], 
            "shared_count": 3, 
            "id": "RaidersOfTheLostArk", 
            "name": "Raiders of the Lost Ark", 
            "poster_url": "RaidersOfTheLostArk.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "NeverASelfMadeWoman", 
                "KickingAssInAllHerFinery"
            ], 
            "shared_count": 3, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }
    ], 
    "id": "ANewHope", 
    "name": "A New Hope"
}