{
    "plot": "Angus is a large, pathetic 14 year old whose thoughts are most often filled with the image of one Melissa Lefevre. Angus is shy and thinks that he has no chance of ever 'getting' her. Being especially uncool, he is incredibly surprised (along with the rest of the school) that he is chosen to dance with her at the Winter Ball. The only one not surprised is the cool-kid who set him up to fail, but Angus' best friend is going to help him win the heart of Melissa by developing a new look for him.", 
    "genres": "Comedy, Drama", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "brief", 
                    "original", 
                    "present", 
                    "due", 
                    "potential", 
                    "plot-relevant", 
                    "re-shot"
                ], 
                "role": "Angus: There's a brief reference to the title character's parents being divorced, his father is never seen, and he lives with his mother and grandfather; the latter sort of being his father figure. In the original script, his father was still present in his life, and was gay - due to the potential controversy, he was written out of the movie altogether, the divorce reference was added, and plot-relevant scenes that were supposed to have Angus and his father in them were re-shot with his grandfather there instead.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "original", 
                    "alive", 
                    "likely", 
                    "marry", 
                    "butch"
                ], 
                "role": "Disappeared Dad: Angus's father had a heart attack while Angus' mom was in labor. This was changed from the original short story where Angus' parents were alive, but both were gay. The change was most likely done to avoid the Fridge Logic of why two people of Incompatible Orientation would both marry and produce a kid together, although his mom still has a rather butch streak in the movie (she's a truck driver with the CB handle \"Bruiser\"). Word Of God states that this was done so that the fact of his parents' homosexuality could not be construed as a principal reason Angus is tormented by his peers. (A line still exists in the film where Meg refers to the magnet school Angus is applying for as \"somewhere he can go where he won't have to account for who his parents are\".)", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: Rick Sanford, all the way.", 
                "id": "JerkJock"
            }
        ]
    }, 
    "imdbid": "tt0112368", 
    "poster_url": "Angus.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "WereTheWorldMine", 
            "name": "Were the World Mine", 
            "poster_url": "WereTheWorldMine.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "TheKarateKid", 
            "name": "The Karate Kid", 
            "poster_url": "TheKarateKid.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "SurfsUp", 
            "name": "Surf's Up", 
            "poster_url": "SurfsUp.jpg"
        }
    ], 
    "id": "Angus", 
    "name": "Angus"
}