{
    "plot": "A successful attempt at an even-handed portrayal of the White Star Line's (later part of Cunard) luxury liner R.M.S. Titanic's sinking from the standpoint of 2nd Officer Charles Herbert Lightoller, himself the most senior of the ill-fated ship's Deck Officers to survive the disaster. (Lightoller later went on to distinguish himself as a line British Naval Officer during the First World War and served as a Senior Naval Staff Officer (convoys) during WWII. Between wars he owned and operated a successful family business producing pleasure craft.) His own survival of the sinking, along with several others, is shown atop one of the liner's two \"collapsible\" lifeboats which was capsized in floating off the liner as it sank. The picture depicts then known facts (c1958) as reported after the sinking; such as the woeful lack of adequate lifeboats, the ship's band playing true to the very end, White Star's co-owner Bruce Ismay's somewhat less than chivalrous departure from the sinking vessel -and- the Titanic's designer (Andrews, on-board) revelation that due to the severity of below-the-water-line damage and that the vaunted watertight compartments were not designed to nor sealed up to the weather deck, would only delay the inevitable as sea water spilled over the top of one to the next from the bows to the stern. It also addresses the mysterious ship seen from the Titanic's bridge stopped some 12-19 miles off and depicts it as being the S.S. Californian, whom - if that steamship had responded, the loss of life could have been far, far less. The Californian is seen stopped due to the ice warnings, the same alerts whose import were undervalued by the Titanic's Captain Smith. She herself had shut-down wireless operations, nominally at 11:00pm as her sole operator retired for the evening, this before the iceberg was struck and the 1st distress calls were made by Titanic. It also addresses somewhat the coal fire in one of Titanic's bunkers - apparently not uncommon back in those days, before her departure into the Atlantic and potential for damage to steel plates below the water line. (This picture predates the calling-into-question of the quality of rivets (metalurgy) which has since come to the fore.) The film also shows the class distinction and its impact as to whom - of the \"women and children first,\" got a seat in a boat; the fact that the first/earliest lifeboats launched were not at full capacity; and that the boats launched from the port and starboard side held to different criteria as to loading. The latter allows the viewer an inference as to the importance for crew and passenger alike as to lifeboat drills which were then (1912) neither required nor ever held aboard Titanic. One of several movies on the subject, it stands well the test-of-time for its \"just the facts\" approach in the telling and avoidance of conjecture or added melodrama.", 
    "genres": "Action, Drama, History", 
    "release_year": "1958", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "lifeboat", 
                    "first", 
                    "few", 
                    "justified", 
                    "contemporary", 
                    "hard", 
                    "last", 
                    "debatable", 
                    "no-one", 
                    "no-one", 
                    "boat", 
                    "half-full", 
                    "many", 
                    "actual"
                ], 
                "role": "Dirty Coward: J. Bruce Ismay is depicted in this fashion when he scurries into a lifeboat at first opportunity. It's one of the movie's few Critical Research Failures (albeit one justified by the time), since contemporary reports indicate that Ismay, far from being a coward, strenuously worked hard to get people into the boats, helped launch them and only took a seat in one of the last boats to leave the ship having made sure that there were no women and children nearby. Massively debatable as he is often shown in the film helping, or at least trying to help, with the launch of the boats and getting the survivors into them. He only gets into the boats when there is no-one left to go on the side he was on, with First Officer Murdoch on the Starboard side, where he actually asks \"Is there no-one else?\" regarding a boat that was only leaving half-full (of which there were many on the actual sinking).", 
                "id": "DirtyCoward"
            }
        ]
    }, 
    "imdbid": "tt0051994", 
    "poster_url": "ANightToRemember.jpg", 
    "similar": [
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "ISpitOnYourGrave", 
            "name": "I Spit on Your Grave", 
            "poster_url": "ISpitOnYourGrave.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "WomanInTheMoon", 
            "name": "Woman in the Moon", 
            "poster_url": "WomanInTheMoon.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "TheKillerShrews", 
            "name": "The Killer Shrews", 
            "poster_url": "TheKillerShrews.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "TheVikings", 
            "name": "The Vikings", 
            "poster_url": "TheVikings.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "EscapeFromLA", 
            "name": "Escape from L.A.", 
            "poster_url": "EscapeFromLA.jpg"
        }
    ], 
    "id": "ANightToRemember", 
    "name": "A Night to Remember"
}