{
    "plot": "Despite being no saint herself, Julia Cody has shielded her seventeen year old son, Joshua \"J\" Cody, from her Melbourne-based criminal relatives who they have not seen in years. After Julia dies in front of J's eyes from a self-inflicted heroin overdose, J, who is slightly detached from life, feels he has no choice but to contact his maternal grandmother, Janine \"Smurf\" Cody, the family matriarch, for a place to live. Smurf rules the family with a borderline incestuous love over her three sons, the quietly menacing Andrew \"Pope\" Cody, the hyperactive Craig Cody, and the barely of age Darren Cody. Pope and his best friend, Barry \"Baz\" Brown, are armed robbers, with Darren their up and coming apprentice, while Craig is a mid level drug dealer. Melbourne's Armed Robbery Squad is after specifically Pope, who is hiding out. But when the standoff between the Codys and the Armed Robbery Squad is brought up a notch, an all out war ensues, with some casualties and J caught in the middle. The only grounding in J's life is his girlfriend, Nicky Henry. With those casualties comes an investigation by Homicide Detective Senior Sergeant Nathan Leckie, who knows the Codys are involved in some of those deaths. As Leckie tries to get J on his side, J has to figure out how best to get himself out from the middle, where he trusts neither side. J also wants to figure out how to exact what he considers justice in an all around bad situation.", 
    "genres": "Crime, Drama, Thriller", 
    "release_year": "2010", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Evil Matriarch: Janine.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "Australian"
                ], 
                "role": "Janine in the Australian family crime drama Animal Kingdom.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Bear: Janine is a terrifying example.", 
                "id": "MamaBear"
            }
        ]
    }, 
    "imdbid": "tt1313092", 
    "poster_url": "AnimalKingdom.jpg", 
    "similar": [
        {
            "shared": [
                "EvilMatriarch", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "SouthParkBiggerLongerAndUncut", 
            "name": "South Park: Bigger, Longer & Uncut", 
            "poster_url": "SouthParkBiggerLongerAndUncut.jpg"
        }, 
        {
            "shared": [
                "EvilMatriarch", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "EvilMatriarch", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "EvilMatriarch", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Sybil", 
            "name": "Sybil", 
            "poster_url": "Sybil.jpg"
        }, 
        {
            "shared": [
                "EvilMatriarch", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "TheBaby", 
            "name": "The Baby"
        }
    ], 
    "id": "AnimalKingdom", 
    "name": "Animal Kingdom"
}