{
    "plot": "Alvy Singer, a forty year old twice divorced, neurotic, intellectual Jewish New York stand-up comic, reflects on the demise of his latest relationship, to Annie Hall, an insecure, flighty, Midwestern WASP aspiring nightclub singer. Unlike his previous relationships, Alvy believed he may have worked out all the issues in his life through fifteen years of therapy to make this relationship with Annie last, among those issues being not wanting to date any woman that would want to date him, and thus subconsciously pushing those women away. Alvy not only reviews the many ups and many downs of their relationship, but also reviews the many facets of his makeup that led to him starting to date Annie. Those facets include growing up next to Coney Island in Brooklyn, being attracted to the opposite sex for as long as he can remember, and enduring years of Jewish guilt with his constantly arguing parents.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1977", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Manic Pixie Dream Girl: Annie. Played straight, then deconstructed.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "white-bread", 
                    "other"
                ], 
                "role": "Annie Hall: The contrast between Annie's white-bread Midwestern WASP family and (Allen's character) Alvy's Brooklyn Jewish family is frequently Played for Laughs. One of the working titles was even Me and My Goy. Some other films by Woody Allen also qualify. His two longest relationships have been with Mia Farrow and Soon-yi Previn who are both non-Jews.", 
                "id": "ShiksaGoddess"
            }
        ]
    }, 
    "imdbid": "tt0075686", 
    "poster_url": "AnnieHall.jpg", 
    "similar": [
        {
            "shared": [
                "ManicPixieDreamGirl", 
                "ShiksaGoddess"
            ], 
            "shared_count": 2, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Lo", 
            "name": "Lo"
        }
    ], 
    "id": "AnnieHall", 
    "name": "Annie Hall"
}