{
    "plot": "In the depths of the 1930's, Annie is a fiery young orphan girl who must live in a miserable orphanage run by the tyrannical Miss Hannigan. Her seemingly hopeless situation changes dramatically when she is selected to spend a short time at the residence of the wealthy munitions industrialist, Oliver Warbucks. Quickly, she charms the hearts of the household staff and even the seemingly cold-hearted Warbucks cannot help but learn to love this wonderful girl. He decides to help Annie find her long lost parents by offering a reward if they would come to him and prove their identity. However, Miss Hannigan, her evil brother, Rooster, and a female accomplice, plan to impersonate those people to get the reward for themselves which put Annie in great danger.", 
    "genres": "Comedy, Drama, Family", 
    "release_year": "1982", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "managed", 
                    "steal"
                ], 
                "role": "In the 1982 film adaptation of Annie, Annie is clearly more than a Heartwarming Orphan. She's managed to stomp her evil caretaker's foot and make it hurt, outrun police officers, stuff boys into trashcans, break her adopted father's leg (by accident while showing him what she's learned earlier) and trick her kidnappers into pulling over, then steal their cheque, climb over a fence and rip it up in front of them.", 
                "id": "LittleMissBadass"
            }
        ]
    }, 
    "imdbid": "tt0083564", 
    "poster_url": "Annie1982.jpg", 
    "similar": [
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "PokemonMewtwoReturns", 
            "name": "Pokémon: Mewtwo Returns"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "Oculus", 
            "name": "Oculus", 
            "poster_url": "Oculus.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "LittleSweetheart", 
            "name": "Little Sweetheart", 
            "poster_url": "LittleSweetheart.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "Super", 
            "name": "Super", 
            "poster_url": "Super.jpg"
        }
    ], 
    "id": "Annie1982", 
    "name": "Annie"
}