{
    "plot": "It is just another day at the National Aeronautics and Space Administration (NASA), a few astronauts were repairing a satellite until, out of nowhere, a series of asteroids came crashing into the shuttle, destroying it. These asteroids also decimated New York soon thereafter. Then, NASA discovered that there is an asteroid roughly the size of Texas heading towards the Earth, and when it does hit the Earth, the planet itself and all of its inhabitants will be obliterated, worse, the asteroid will hit the Earth in 18 days. Unfortunately, NASA's plans to destroy the asteroid are irrelevant. That is when the U.S. military decides to use a nuclear warhead to blow the asteroid to pieces. Then, scientists decide to blow the asteroid with the warhead inside the asteroid itself. The only man to do it, is an oil driller named Harry Stamper and his group of misfit drillers and geologists. As he and his drill team prepare for space excavation, the asteroid is still heading towards the Earth. When the crew are launched into outer space, they are determined to destroy this asteroid.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "paternal"
                ], 
                "role": "Disappeared Dad: Chick's gambling problem resulted in his wife taking him to court and removing his paternal rights, so he wasn't willingly disappeared. Technically, Harry Stamper himself.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Bruce Willis and his shotgun in Armageddon.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "ballistic", 
                    "asteroid", 
                    "happy", 
                    "emotional", 
                    "protective", 
                    "nice"
                ], 
                "role": "Papa Wolf: Harry, of course. He goes ballistic when he thinks his daughter needs to be protected, and you do not want to be the one in his path. Leads to a Crowning Moment of Funny when he chases AJ around the oil rig after finding out that he and Grace are together. Harry's Papa Wolf qualities ultimately lead him to  sacrifice himself and go down destroying the asteroid in order to allow AJ to live and marry Grace so that she can be happy, leading to the most emotional scenes of the movie. Harry's crew members point out that they all had a hand in raising Grace, so they all feel protective of her. Doubles as a nice Crowning Moment of Heartwarming.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "surprising", 
                    "huge"
                ], 
                "role": "Scary Black Man: Michael Clarke Duncan's \"Bear\" is a surprising subversion. He's rather a softy, despite looking huge and menacing.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "adult-onset", 
                    "earth", 
                    "giant"
                ], 
                "role": "Armageddon begins with a Missing Mom as Harry Tasker raises his daughter Grace with a bunch of oil rig roughnecks, but  it turns to an adult-onset Parental Abandonment as Harry dies saving the earth from a giant meteor the size of Texas. We find out from Grace that mom left.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "small"
                ], 
                "role": "Missing Mom: Grace was raised by roughnecks because her mother walked out on Harry when Grace was very small, and Harry wouldn't leave the rig.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0120591", 
    "poster_url": "Armageddon.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad", 
                "OverprotectiveDad", 
                "ScaryBlackMan", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "ToKillAMockingbird", 
            "name": "To Kill a Mockingbird", 
            "poster_url": "ToKillAMockingbird.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "OverprotectiveDad", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "OverprotectiveDad", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "Taken", 
            "name": "Taken", 
            "poster_url": "Taken.jpg"
        }
    ], 
    "id": "Armageddon", 
    "name": "Armageddon"
}