{
    "plot": "High School. Four of the most important years of your life. But it isn't always dances and keg parties and sucking face in your parents' mini-van. Sometimes it's ugly and hard and complicated. As complicated as a conspiracy to overthrow the president. There's something rotten at St. Donovan's High and sophomore newspaper reporter Bobby Funke is on it like pink rubber bands on your little sister's braces. When senior hottie Francesca Facchini solicits Funke's help tracking down a set of stolen SATs, Funke uncovers a story dirtier than the lunch lady's mustache. After he fingers the school president (figuratively) for the crime, Funke becomes one of the most popular kids at St. Donovan's High. No longer known simply as the freshman who was once tied to a giant snowman penis, Funke wins the respect of everyone from the Desert-Storm-hero-turned-educator Principal Kirkpatrick to the kid that farts on him in Spanish class. When Francesca takes Funke to homecoming, even the in-school suspension delinquents turn nice and offer guidance on how to keep his boner in check during slow dances. But high school's not always what it seems. As Funke's popularity grows so do his suspicions. Did the president really steal the SATs? Or is Funke just a pawn in a conspiracy as complicated as adolescence itself? Determined to find the truth, Funke digs deeper and unearths the sordid underbelly of St. Donovan's. Student council members, college bookies, public school brats, everyone seems to play a part. Armed only with a learner's permit and the spirit of Woodward and Bernstein, Funke must crack the case before it cracks him.", 
    "genres": "Comedy, Crime, Mystery", 
    "release_year": "2008", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Catholic School Girls Rule: Surprisingly, aside from a few Male Gaze moments, underplayed", 
                "id": "CatholicSchoolGirlsRule"
            }, 
            {
                "adjectives": [], 
                "role": "Femme Fatale: Francesca.  She was a part of the plot to frame Paul", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [], 
                "role": "Hello, Nurse!: The school employs one", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [], 
                "role": "Spicy Latina: Clara", 
                "id": "SpicyLatina"
            }
        ]
    }, 
    "imdbid": "tt1018818", 
    "poster_url": "AssassinationOfAHighSchoolPresident.jpg", 
    "similar": [
        {
            "shared": [
                "HelloNurse", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }, 
        {
            "shared": [
                "HelloNurse", 
                "SpicyLatina"
            ], 
            "shared_count": 2, 
            "id": "FoolsRushIn", 
            "name": "Fools Rush In", 
            "poster_url": "FoolsRushIn.jpg"
        }, 
        {
            "shared": [
                "HelloNurse", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "SilentMovie", 
            "name": "Silent Movie", 
            "poster_url": "SilentMovie.jpg"
        }, 
        {
            "shared": [
                "HelloNurse", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "Clue", 
            "name": "Clue", 
            "poster_url": "Clue.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale", 
                "SpicyLatina"
            ], 
            "shared_count": 2, 
            "id": "ResidentEvil", 
            "name": "Resident Evil", 
            "poster_url": "ResidentEvil.jpg"
        }
    ], 
    "id": "AssassinationOfAHighSchoolPresident", 
    "name": "Assassination Of A High School President"
}