{
    "plot": "In Canton, Mississippi, 10-year-old Tonya Hailey is viciously brutalized by two white racist rednecks -- James Louis \"Pete\" Willard and Billy Ray Cobb. Almost immediately after Tonya is found and rushed to a hospital, Pete and Billy Ray are found at a roadside bar, where they had been bragging about what they did to Tonya. Tonya's understandably distraught and enraged father, Carl Lee Hailey, remembers a case from a year ago, when four white men raped an African-American girl in a nearby town, and got acquitted. Carl is determined to not let that happen in this case. While deputy Dwayne Powell Looney is escorting Pete and Billy Ray up a flight of stairs to a court room, Carl emerges from the building's basement with an assault rifle, and he kills Pete and Billy Ray for what they did to Tonya. Carl is later arrested at his house by African-American sheriff Ozzie Walls, and Carl is scheduled to be placed on trial. Despite the efforts of the NAACP and local African-American leaders to persuade Carl to choose some of their high-powered attorneys, Carl wants to be represented by his friend Jake Tyler Brigance, who has a wife named Carla and a daughter named Hannah. Presiding over the trial is white judge Omar Noose, and the prosecution attorney is Rufus Buckley, who would like nothing more than to win the case and swim in the publicity that a win would generate, because Rufus realizes that a murder conviction could help him gain higher office. Helping Jake on the case are his former law professor Lucien Wilbanks, fellow attorney Harry Rex Vonner, and law student Ellen Roark. Ellen has had experience with death penalty cases, and that's exactly what Rufus may be seeking. To start things off, Noose denies bail and denies Jake's petition for a change of venue. Carl has also been fired from his job. Billy Ray Cobb's brother Freddie Lee Cobb wants revenge on Carl, so Freddy gets the help of the Mississippi branch of the KKK, led by Mississippi grand dragon Stump Sisson. Carl's wife Gwen tells Carl that a doctor has said that because of Pete and Billy Ray, Tonya's reproductive organs are damaged enough to where she won't be able to have kids when she grows up. That night, a KKK member is found trying to plant a bomb under Jake's porch. Jake's secretary Ethel Twitty and her husband Bud are also attacked by the KKK. Still, Jake, Harry, Lucien, and Ellen continue to help Carl. On the day the trial begins, there is a riot outside the court building between the KKK and the area's African-American residents, and Stump Sisson is killed by a molotov cocktail that was dropped from a roof by one of Carl's sons, who was not seen dropping it. Freddy and the KKK start burning crosses throughout Canton, and one of the crosses burns Jake's house down while Jake and his family are not home. As a result, the National Guard is called to Canton to keep the peace during the trial. But Freddy is not about to let that stop him. While Freddy continues his efforts to get revenge on Carl for Billy Ray's death, Carl's attorneys put everything they've got into Carl's defense.", 
    "genres": "Crime, Drama, Thriller", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Angry Black Man: Carl Lee Hailey, in the courthouse, with an assault rifle.", 
                "id": "AngryBlackMan"
            }, 
            {
                "adjectives": [
                    "same"
                ], 
                "role": "Papa Wolf: Carl Lee Hailey, obviously. The deputy played by Chris Cooper also counts, as he says he would have done the same thing.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Black Man: Played by Samuel L. Jackson even.", 
                "id": "ScaryBlackMan"
            }
        ]
    }, 
    "imdbid": "tt0117913", 
    "poster_url": "ATimeToKill.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "ComingToAmerica", 
            "name": "Coming to America", 
            "poster_url": "ComingToAmerica.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "Taken", 
            "name": "Taken", 
            "poster_url": "Taken.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "Hook", 
            "name": "Hook", 
            "poster_url": "Hook.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "KickAss", 
            "name": "Kick-Ass", 
            "poster_url": "KickAss.jpg"
        }
    ], 
    "id": "ATimeToKill", 
    "name": "A Time to Kill"
}