{
    "plot": "Several strange occurrences are taking place all over the world including the disappearance of two engineers. Also, former admiral Kosumi is nearly kidnapped along with his secretary, and goddaughter, Makoto Jinguji. The kidnap attempt is thwarted by photographer Susumu Hatanaka and his assistant Yoshito Nishibe. It is later revealed the Mu Empire, which disappeared 12,000 years earlier, are responsible for all the occurrences and are planning to invade the surface world to reclaim their supposed colonies. Also, the Muans manage to steal the I-403 submarine from embittered Captain Jinguji, Makoto's father, and in the process steal the plans for and even greater sub, Atragon (aka Gotengo). As the attacks by the Muans increase the world anxiously asks Jinguji for his help, even his daughter Makoto makes an impassioned plea for him to join the fight against Mu. Unfortunately, Jinguji is still bitter about the defeat of Japan in World War II and won't help. However, the fight becomes personal when Makoto and Susumu, with whom she has fallen in love, are captured by the Muans. Soon Jinguji unleashes his ultimate weapon against the Muans and their giant snakelike guardian Manda.", 
    "genres": "Adventure, Sci-Fi", 
    "release_year": "1963", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "long"
                ], 
                "role": "Papa Wolf: It took Captain Jinuji a long ass time to see he should use the Atragon to save his daughter. And he does.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Yamato Nadeshiko: The Empress of Mu.", 
                "id": "YamatoNadeshiko"
            }
        ]
    }, 
    "imdbid": "tt0057215", 
    "poster_url": "Atragon.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "YamatoNadeshiko"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "GodzillaVsDestoroyah", 
            "name": "Godzilla vs. Destoroyah"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "Atragon", 
    "name": "Atragon"
}