{
    "plot": "In Tokyo, Shigeharu Aoyama is a widower that grieves the loss of his wife and raises his son Shigehiko Aoyama alone. Seven years later, the teenage Shigehiko asks why his middle-aged father does not remarry and Shigeharu meets his friend Yasuhisa Yoshikawa, who is a film producer, and tells his intention. However, Shigeharu has difficulties to approach to available women to date and Yasuhisa decide to organize a sham audition for casting the lead actress for the fake movie. They receive several portfolios of candidates and Shigeharu becomes obsessed by the gorgeous Asami Yamazaki. Despite the advice of the experienced Yasuhisa, Shigeharu calls Asami to date and he falls for her. But who is the mysterious Asami?", 
    "genres": "Drama, Horror, Thriller", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Dirty Old Man: Asami's stepfather, who sexually abused her when she was a child.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Dude: Aoyama in the finale.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "last"
                ], 
                "role": "The last twenty minutes of Audition.", 
                "id": "DistressedDude"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Clingy Jealous Girl: \"Tell me you'll love only me...\"", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [
                    "gentle", 
                    "soft-spoken", 
                    "last", 
                    "hardened", 
                    "previous"
                ], 
                "role": "Fans of Takashi Miike's work may remember a little film named Audition. Asami Yamazaki is gentle and soft-spoken - but what she does with razor wire and acupuncture needles in the last twenty minutes will make even the most hardened horror fan cringe. The appearance of a previous boyfriend in a dream sequence shortly before gives some idea of what she will do to prevent her lovers from leaving her.", 
                "id": "GirlWithPsychoWeapon"
            }, 
            {
                "adjectives": [
                    "delicate", 
                    "beautiful"
                ], 
                "role": "Girl with Psycho Weapon:  The fact that the needles and piano wire are so delicate and she's so beautiful makes it infinitely worse.", 
                "id": "GirlWithPsychoWeapon"
            }, 
            {
                "adjectives": [
                    "unspecified"
                ], 
                "role": "Missing Mom: Shigehiko's mother dies of an unspecified illness at the start of the film.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Asami in Audition seems like the girl of your dreams. However, when she asks you to love only her, she means it.", 
                "id": "UncannyValleyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Uncanny Valley Girl: Asami.", 
                "id": "UncannyValleyGirl"
            }, 
            {
                "adjectives": [
                    "white", 
                    "black", 
                    "other", 
                    "white"
                ], 
                "role": "Asami Yamazaki in Audition is shown dressed in white throughout the film, although during the torture scene, she is wearing a black leather apron and gloves, but other than that she is still dressed in white.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in White", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "Used", 
                    "female", 
                    "perky"
                ], 
                "role": "Used to eerie effect in Audition, wherein the female lead makes Glenn Close's Fatal Attraction look as perky and innocent as Elle Woods. \"Say you'll love only me,\" indeed.", 
                "id": "WomanScorned"
            }, 
            {
                "adjectives": [
                    "pre-emptive", 
                    "previous"
                ], 
                "role": "Woman Scorned: The pre-emptive type. But also done after the fact with her previous boyfriend.", 
                "id": "WomanScorned"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "Japanese", 
                    "due", 
                    "horrific", 
                    "other"
                ], 
                "role": "Audition. Asami Yamazaki appears to be the sort of beautiful, demure woman that every Japanese man would love to have for a wife. However due to horrific abuse (among other things) her core of steel is made of razor wire and needles, and she's a psycho.", 
                "id": "YamatoNadeshiko"
            }, 
            {
                "adjectives": [
                    "first", 
                    "soft-spoken", 
                    "mental", 
                    "dependent", 
                    "debatable", 
                    "delusion-based", 
                    "interested"
                ], 
                "role": "Yamato Nadeshiko: Deconstructed. At first, Aoyama is drawn to Asami because of her soft-spoken nature as well as her subtle, hidden strength. However, it is revealed that she was severely abused as a child and as a result has hidden mental problems, meaning that she is actually one of two things: Yandere: She wanted him to love only her and snapped out when she discovered this wasn't the case. Kind of makes Alex Forrest look like Rainbow Brite. Case in point:  the guy in the bag, who she mutilated in order to make him totally dependent on her. Cute and Psycho: It's debatable how motivated by love she was, in that she didn't sound that convinced of the delusion-based excuses she shuffled through. She may have been less interested in him romantically than in using him as a punching bag.", 
                "id": "YamatoNadeshiko"
            }
        ]
    }, 
    "imdbid": "tt0235198", 
    "poster_url": "Audition.jpg", 
    "similar": [
        {
            "shared": [
                "DistressedDude", 
                "WomanInWhite", 
                "DirtyOldMan", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "DistressedDude", 
                "WomanInWhite", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "DistressedDude", 
                "DirtyOldMan", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "WomanInWhite", 
                "DirtyOldMan", 
                "GirlWithPsychoWeapon"
            ], 
            "shared_count": 3, 
            "id": "Red", 
            "name": "Red", 
            "poster_url": "Red.jpg"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "DirtyOldMan", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "LesMiserables", 
            "name": "Les Misérables"
        }
    ], 
    "id": "Audition", 
    "name": "Audition"
}