{
    "plot": "Austin Powers is a 60's spy who is cryonically frozen and released in the 1990's. The world is a very different place for Powers. Unfortunately for Austin, everyone is no longer sex-mad. Although he may be in a different decade, his mission is still the same. He has teamed up with Vanessa Kensington to stop the evil Dr. Evil, who was also frozen in the past. Dr. Evil stole a nuclear weapon and is demanding a payment of (when he realises its the 90's) 100 billion dollars. Can Austin Powers stop this madman? or will he caught up with Evil's henchman, with names like Alotta Fagina and Random Task? Only time will tell!", 
    "genres": "Comedy, Crime, Sci-Fi", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "hat"
                ], 
                "role": "Random Task in Austin Powers: International Man of Mystery, a parody of Oddjob, who throws his shoe instead of a hat.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [], 
                "role": "Carpet of Virility: Austin's ridiculously hairy chest, which women improbably seem to love.", 
                "id": "CarpetOfVirility"
            }, 
            {
                "adjectives": [
                    "implied", 
                    "sexual", 
                    "courteous", 
                    "drunk"
                ], 
                "role": "Austin Powers, despite some implied deviant sexual behavior, is still for the most part courteous toward the ladies he's trying to woo (at one point, a very drunk woman suggests that they have sex, but he turns her down because it \"wouldn't be right\" to take advantage of her intoxicated state). Considering who he's a parody of, this is to be expected.\n When Vanessa is talking to her mother, who used to be Austin's partner in the 60s, Vanessa asks if she has ever slept with Austin. Her mother replies that he never tried to get her into bed out of respect for Vanessa's father.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "Chivalrous", 
                    "noted", 
                    "much"
                ], 
                "role": "Chivalrous Pervert: As noted above in Above the Influence, for as much of a womanizer he is, Austin won't take advantage of a drunk woman.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "Mini-Me", 
                    "Mini-Me", 
                    "audible", 
                    "second", 
                    "Overly-Long"
                ], 
                "role": "Gag Penis: Aside from everything Nigel says about Mini-Me's endowments, there's the fact that when Mini-Me lowers his pants, there is an audible thump. Goldmember has a gold...er, member. The phallic-looking rocket in the second movie, inspiring an Overly-Long Gag of bystanders reacting to it.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [
                    "Mini-Me"
                ], 
                "role": "Mini-Me of Austin Powers fame has one of these. \"If you ever get tired, you can use it as a kickstand!\", \"You're a frickin' tripod!\"", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [
                    "Mini-Me", 
                    "severe", 
                    "biological"
                ], 
                "role": "Overlord Jr.: Scott Evil and Mini-Me, with a severe case of sibli- er, uncle/neph-... biological son/midget clone rivalry.", 
                "id": "OverlordJr"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Papa Wolf: Let's just say that Dr. Evil did not react well at all to a Klansman calling Scott Evil a freak on Jerry Springer. Nigel Powers is also this when he stops Austin from shooting his other son, Dr. Evil.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "less-then-normal", 
                    "due", 
                    "Swedish-made", 
                    "deleted", 
                    "second", 
                    "accurate", 
                    "normal"
                ], 
                "role": "Teeny Weenie: Austin is implied to have a less-then-normal sized member, due to his ownership of a \"Swedish-made Penis Enlarger Pump\" (A deleted scene from the second film even had him claiming to Felicity that his frozen self was not an \"accurate representation\" of his normal size).", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [
                    "Swedish-made"
                ], 
                "role": "The Swedish-made Penis Enlarger is a running gag in Austin Powers.", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [], 
                "role": "The Casanova: Austin, and in a twist, Doctor Evil after drinking Austin's mojo. All for comedy. Nigel Powers.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Austin Powers: \"Fembots, attack!\"", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [], 
                "role": "Girl of the Week: Every trope that applies to a Bond Girl applies to Austin's women.", 
                "id": "GirlOfTheWeek"
            }, 
            {
                "adjectives": [], 
                "role": "Austin Powers: The Spy Who Shagged Me. CIA agent Felicity Shagwell seduces the villain Fat Bastard in order to implant a Tracking Device in his buttocks.", 
                "id": "HeroicSeductress"
            }, 
            {
                "adjectives": [
                    "High", 
                    "second", 
                    "suggestive", 
                    "attractive", 
                    "love"
                ], 
                "role": "High Heel-Face Turn: The second film's sexy evil foreigner with a highly suggestive name, Ivana Humpalot, was sent to kill Austin Powers but instead finds him so attractive that she ends up confessing to her agenda and just asks him to make love to her. Apparently she was so attracted to him that she made no move to kill him even after he lost his mojo in the middle of sex.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "hard"
                ], 
                "role": "Mama Bear: Don't try to harm Scott in front of Frau, both Mini Me and Doctor Evil found that out the hard way.  Later it turns out she really is Scott's mom.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "first", 
                    "straight", 
                    "real", 
                    "temporary"
                ], 
                "role": "Ms. Fanservice: Alotta Fagina from the first movie is a pretty straight example. Her only real role (besides acting as a plot device to  drive a temporary wedge between Austin and Vanessa) was to look hot. Vanessa (especially her nude scene at the end), Felicity and Foxxy. And let's not forget Mimi Rogers in a catsuit.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Sassy Black Woman: Foxxy Cleopatra.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [], 
                "role": "The Baroness: The Rosa Klebb type is spoofed with Frau Farbissina.", 
                "id": "TheBaroness"
            }
        ]
    }, 
    "imdbid": "tt0118655", 
    "poster_url": "AustinPowers.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "TheBaroness", 
                "MsFanservice", 
                "ChivalrousPervert"
            ], 
            "shared_count": 4, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "PapaWolf", 
                "SassyBlackWoman", 
                "ChivalrousPervert"
            ], 
            "shared_count": 4, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "PapaWolf", 
                "MsFanservice", 
                "TheCasanova"
            ], 
            "shared_count": 4, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "GirlOfTheWeek", 
                "GagPenis", 
                "ChivalrousPervert"
            ], 
            "shared_count": 4, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "OverlordJr", 
                "MsFanservice", 
                "MamaBear"
            ], 
            "shared_count": 4, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }
    ], 
    "id": "AustinPowers", 
    "name": "Austin Powers"
}