{
    "plot": "When his brother is killed in a robbery, paraplegic Marine Jake Sully decides to take his place in a mission on the distant world of Pandora. There he learns of greedy corporate figurehead Parker Selfridge's intentions of driving off the native humanoid \"Na'vi\" in order to mine for the precious material scattered throughout their rich woodland. In exchange for the spinal surgery that will fix his legs, Jake gathers intel for the cooperating military unit spearheaded by gung-ho Colonel Quaritch, while simultaneously attempting to infiltrate the Na'vi people with the use of an \"avatar\" identity. While Jake begins to bond with the native tribe and quickly falls in love with the beautiful alien Neytiri, the restless Colonel moves forward with his ruthless extermination tactics, forcing the soldier to take a stand - and fight back in an epic battle for the fate of Pandora.", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "enormous", 
                    "black"
                ], 
                "role": "Also parodied in Virtual In-Stanity, where CIA employees have access to a control machine \"like the one in Avatar\". Dick uses it to control an enormous, veiny, black body-builder yet, when going to by condoms, he instead compares the XS and XXXS sizes, before going with the latter and asking an employee \"if they shrink in the dryer.\"", 
                "id": "GagPenis"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "American", 
                    "interested"
                ], 
                "role": "Subverted in the Avatar parody episode of American Dad!, where Phyllis, a girl interested in Steve, lets down her hair and takes off her glasses to reveal... an unkempt afro and beady eyes. Double Subversion in that he still finds her attractive. Possibly moreso.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "fair", 
                    "considerable"
                ], 
                "role": "Neytiri from Avatar. Did she really need to be The Chief's Daughter? (To be fair, her place as the successor to the tribe's shaman gave her statement that there had been a sign from Eywa considerable weight, but still.)", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "male", 
                    "main"
                ], 
                "role": "Avatar has the Na'vi, male and female. Appropriately, the main character falls in love with and has sex with one of them.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "Green-Skinned"
                ], 
                "role": "Green-Skinned Space Babe. Available in Blue! (Neytiri flavored.)", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "only", 
                    "other", 
                    "main"
                ], 
                "role": "Trudy Chacon in Avatar is the only one of the soldiers who does a Heel-Face Turn: the other characters who turn are either scientists or Jake Sully who (very literally) Go Native, but Trudy is simply one grunt amongst hundreds. While she does spend more time with the main cast getting Aesops and stuff, it certainly comes off as this.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "benign", 
                    "tough"
                ], 
                "role": "Dr. Grace Augustine from Avatar is a more benign version (being a scientist in a group of soldiers and corp executives) of this but you gotta admit that she's as tough as they come.", 
                "id": "IronLady"
            }, 
            {
                "adjectives": [], 
                "role": "Nubile Savage: Neytiri all the way.", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [
                    "white", 
                    "off-white", 
                    "dirty", 
                    "famous", 
                    "female"
                ], 
                "role": "The Na'vi from Avatar. Their teeth are either white or slightly off-white, no one but Jake ever seems to get dirty, and their hair is pretty much perfect all the time. The Na'vi females do not always cover their National Geographic breasts. Count Neytiri, Princess of the Omaticaya Tribe, is the most famous among the female Na'vi.", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [
                    "main", 
                    "tribal", 
                    "spiritual", 
                    "outright"
                ], 
                "role": "In James Cameron's Avatar, the main character first meets Neytiri, the daughter of both the tribal and spiritual leaders of the Na'vi. The trope is even named outright.", 
                "id": "Ptitletkzqws2q"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Avatar: Technically any female Na'vi; Dr. Grace (Sigourney Weaver) towers over most of her coworkers.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "main", 
                    "tribal", 
                    "spiritual", 
                    "outright"
                ], 
                "role": "In James Cameron's Avatar, the main character first meets Neytiri, the daughter of both the tribal and spiritual leaders of the Na'vi. The trope is even named outright.", 
                "id": "TheChiefsDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Neytiri actually becomes a queen at the end of Avatar.", 
                "id": "TheHighQueen"
            }, 
            {
                "adjectives": [], 
                "role": "Avatar. Trudy Chacon (Michelle Rodriguez), part of the largely sausage party SecFor.", 
                "id": "TheSquadette"
            }
        ]
    }, 
    "imdbid": "tt0499549", 
    "poster_url": "Avatar.jpg", 
    "similar": [
        {
            "shared": [
                "NubileSavage", 
                "EverythingsBetterWithPrincesses", 
                "TheChiefsDaughter", 
                "TheHighQueen"
            ], 
            "shared_count": 4, 
            "id": "Pocahontas", 
            "name": "Pocahontas", 
            "poster_url": "Pocahontas.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "EverythingsBetterWithPrincesses", 
                "StatuesqueStunner", 
                "TheSquadette"
            ], 
            "shared_count": 4, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "StatuesqueStunner", 
                "TheHighQueen"
            ], 
            "shared_count": 3, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }, 
        {
            "shared": [
                "IronLady", 
                "EverythingsBetterWithPrincesses", 
                "TheSquadette"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "NubileSavage", 
                "StatuesqueStunner", 
                "GreenSkinnedSpaceBabe"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "Avatar", 
    "name": "Avatar"
}