{
    "plot": "Burt Farlander and Verona De Tessant are a couple steeped in eccentricity and irregularity but are very much in love. So when they find out that Verona is pregnant they seem to be taking it in their stride. Verona is enjoying pregnancy, Burt is already practicing skill that he believes a good father should have, and they living in the same state as Burt's parents, Jerry and Gloria, so that their prospective daughter can have grandparents. However, things are shaken up when Burt and Verona go to dinner at Jerry and Gloria's house, as Burt's parents reveal a surprising piece of news. They have decided to move to Antwerp in Belguim a month before the baby is due, scuppering Burt and Verona's plans of having their children's grandparents around. Because Verona lost her parents when she was relatively young, she finds this news very hard to take, but the resilient couple quickly find a way to turn it in to a positive. It becomes obvious that this is what the pair needed, as they decide to embark on a search for the right place for them to raise their daughter. They go to every place they can think of, meeting family and friends along the way, with laughter and sadness, this is a road trip the couple will never forget.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bumbling Dad: An expecting version.", 
                "id": "BumblingDad"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Verona has Burt promise that he'll fight for his daughter's fights.", 
                "id": "PapaWolf"
            }
        ]
    }, 
    "imdbid": "tt1176740", 
    "poster_url": "AwayWeGo.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "BumblingDad"
            ], 
            "shared_count": 2, 
            "id": "MrMom", 
            "name": "Mr. Mom", 
            "poster_url": "MrMom.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BumblingDad"
            ], 
            "shared_count": 2, 
            "id": "UncleBuck", 
            "name": "Uncle Buck", 
            "poster_url": "UncleBuck.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BumblingDad"
            ], 
            "shared_count": 2, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BumblingDad"
            ], 
            "shared_count": 2, 
            "id": "LadyAndTheTramp", 
            "name": "Lady and the Tramp", 
            "poster_url": "LadyAndTheTramp.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BumblingDad"
            ], 
            "shared_count": 2, 
            "id": "HoneyIShrunkTheKids", 
            "name": "Honey, I Shrunk the Kids", 
            "poster_url": "HoneyIShrunkTheKids.jpg"
        }
    ], 
    "id": "AwayWeGo", 
    "name": "Away We Go"
}