{
    "plot": "Willie T. Stokes is a convicted con man who's led a miserable life. He drinks heavily and constantly embarrasses himself publicly. He only works once a year dressed as Santa. But then come Christmas Eve, he and his pint-sized helper dwarf Marcus stage elaborate robberies and take their department stores for everything they got. This year, they hit a mall in suburban Phoenix, Arizona. This time around, Willie gets distracted by having sex with large women, a bartender who is attracted to Santas, and a kid who's convinced he's the real deal. However, this time around Marcus must once again put up with Willie's heavy drinking and a series of incidents that constantly shoot themselves in the foot. Not to mention a nosy department store security guard who's onto them and wants his cut of the loot. Will Willie and Marcus make it to next Christmas? Or will this be the year the dynamic duo finally face justice?", 
    "genres": "Comedy", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "No-Holds-Barred"
                ], 
                "role": "Papa Wolf: Willie evolves into somewhat of one, to the point where he gives the bullies who harass The Kid a No-Holds-Barred Beatdown.", 
                "id": "PapaWolf"
            }
        ]
    }, 
    "imdbid": "tt0307987", 
    "poster_url": "BadSanta.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "GodzillaVsDestoroyah", 
            "name": "Godzilla vs. Destoroyah"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "BadSanta", 
    "name": "Bad Santa"
}