{
    "plot": "Soon-Young (Kim Sae-Ron) is a young girl who is the head of her family. She lives with her mentally handicapped father (Jo Yong-Suk), unscrupulous uncle (Lee Chun-Hee) and younger sister Soon-Ja (Kim Ah-Ron) who is always ill. Younger sister Soon-Ja plays with her Barbie doll everyday and dreams of one day living in the United States. Meanwhile, Mang-Taek comes into contact with an American man interested in adopting a healthy Korean girl. Mang-Taek arranges a deal for the American man to adopt Soon-Young. When her younger sister Soon-Ja hears of the adoption, she becomes jealous and asks to take the place of her older sister. When the American man and his young daughter arrive to take Soon-Young, the uncle, Soong-Young and Soon-Ja must decide who is to go. The American father has an ulterior motive for the adoption.", 
    "genres": "Drama", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "hilarious", 
                    "Jewish", 
                    "other"
                ], 
                "role": "Klaus Barbie, a Gestapo agent stationed in France became known as \"The Butcher of Lyon\" for the tortures he carried out. Since the advent of the girls doll line in 1959 his surname has became retroactively hilarious however, which was spoofed by Rat Race when a Jewish family mistakes a \"Barbie Museum\" run by Neo-Nazis for the other thing.", 
                "id": "TheButcher"
            }, 
            {
                "adjectives": [], 
                "role": "The Dandy: Ken in Toy Story 3.", 
                "id": "TheDandy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: In Barbie and the Three Musketeers, and Toy Story 3.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Barbie plays a princess in some of her movies. Plus some of the dolls are named as though she is a princess, like the \"Winter Princess\" line.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "peasant", 
                    "music"
                ], 
                "role": "Everything's Better with Princesses: A lot of her dolls and films. In Barbie & The Diamond Castle, she's a peasant but still becomes princess of music at the end, just because.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "purple"
                ], 
                "role": "Graceful Ladies Like Purple: Plenty of her outfits are purple.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [
                    "Several", 
                    "several"
                ], 
                "role": "Several outfits Barbie has worn have been purple, as well as several characters in the Direct-to-Video movies.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [], 
                "role": "Most of the princesses in the Barbie films are this trope.\n Ro of Barbie as the Island Princess\n Anneliese of Barbie in the Princess and the Pauper\n Most of the princesses in Barbie In The Twelve Dancing Princesses.", 
                "id": "PrincessClassic"
            }, 
            {
                "adjectives": [
                    "top"
                ], 
                "role": "Sweater Girl: A number of her outfits over the years. The early 80s set \"Fashion Jeans\" included a pink, fuzzy sweater, even though a doll with that name could have included any kind of top.", 
                "id": "SweaterGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Barbie", 
                "id": "TheFashionista"
            }, 
            {
                "adjectives": [
                    "obvious"
                ], 
                "role": "The Fashionista: Barbie herself and Nikki are the most obvious examples.", 
                "id": "TheFashionista"
            }, 
            {
                "adjectives": [], 
                "role": "Laverna in the Barbie Fairytopia movies.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Barbie, for a few years, had a line of premium holiday dolls called the \"Winter Princess◊\" line.", 
                "id": "WinterRoyalLady"
            }, 
            {
                "adjectives": [], 
                "role": "Winter Royal Lady: Her line of \"Winter Princess◊\" dolls, among others.", 
                "id": "WinterRoyalLady"
            }
        ]
    }, 
    "imdbid": "tt2074334", 
    "similar": [
        {
            "shared": [
                "VainSorceress", 
                "GracefulLadiesLikePurple", 
                "TheFashionista", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "ActionGirl", 
                "PrincessClassic", 
                "EverythingsBetterWithPrincesses", 
                "GracefulLadiesLikePurple"
            ], 
            "shared_count": 5, 
            "id": "Tangled", 
            "name": "Tangled", 
            "poster_url": "Tangled.png"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "WinterRoyalLady", 
                "ActionGirl", 
                "GracefulLadiesLikePurple"
            ], 
            "shared_count": 4, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "PrincessClassic", 
                "EverythingsBetterWithPrincesses", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Fantaghiro", 
            "name": "Fantaghiro"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "ActionGirl", 
                "GracefulLadiesLikePurple"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "Barbie", 
    "name": "Barbie"
}