{
    "plot": "Henry Chinaski never cared for the American dream, the thought of needing to become 'something' and fit into the system disgusts him. He believes that life is free and yours to live like you see fit, and if that in some cases involves copious amounts of whiskey then so be it. Henry spends his days drinking and listening to the radio, and he spends his nights drinking and fighting against Eddy who he thinks personifies shallowness and shameless self promoting. Sometimes in the middle of this he finds the time to jot down a few lines of poetry or a short story. After fighting Eddy and winning for a change Henry is thrown out of his regular bar where Eddy is a bartender. This leads him to seek another watering hole where he happens to find Wanda who is a barfly, in her own words \"if another man came along with a fifth of whiskey, I'd go with him\". Henry is not fazed by this thou and moves in with her. Of course Wanda immediately goes off and sleeps with Eddy, but after some clothes throwing and two visits from the paramedics Henry and Wanda manage to patch up their relationship. Then Henry gets a visit from a literary agent who has decided to publish one of his stories that he sent in because he \"liked the name of the mag\". He follows the agent home to her place in order to receive his payment and with the help of a little whiskey sleeps with her. When he leaves to go back to the bar and back to Wanda the agent is heartbroken, she sees something special in Henry and has fallen in love with him. She follows him to his usual bar and gets into a cat fight with Wanda that Wanda wins. In celebration of new found love, happiness and money Henry buys a round for everyone at the bar and toasts them \"to my friends!\"", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1987", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Hard-Drinking"
                ], 
                "role": "Hard-Drinking Party Girl: Every hooker in the bar.", 
                "id": "HardDrinkingPartyGirl"
            }, 
            {
                "adjectives": [
                    "close", 
                    "first"
                ], 
                "role": "Lady Drunk: most notably, Lily - but Wanda seems to be very close to it at the time of her first meeting with Henry.", 
                "id": "LadyDrunk"
            }, 
            {
                "adjectives": [], 
                "role": "Streetwalker: Henry has a conversation with one of them.", 
                "id": "Streetwalker"
            }
        ]
    }, 
    "imdbid": "tt0092618", 
    "poster_url": "Barfly.jpg", 
    "similar": [
        {
            "shared": [
                "LadyDrunk", 
                "Streetwalker"
            ], 
            "shared_count": 2, 
            "id": "CriminallyInsane", 
            "name": "Criminally Insane", 
            "poster_url": "CriminallyInsane.jpg"
        }, 
        {
            "shared": [
                "HardDrinkingPartyGirl", 
                "LadyDrunk"
            ], 
            "shared_count": 2, 
            "id": "BlackChristmas1974", 
            "name": "Black Christmas ", 
            "poster_url": "BlackChristmas1974.jpg"
        }, 
        {
            "shared": [
                "LadyDrunk"
            ], 
            "shared_count": 1, 
            "id": "AuntieMame", 
            "name": "Auntie Mame", 
            "poster_url": "AuntieMame.jpg"
        }, 
        {
            "shared": [
                "LadyDrunk"
            ], 
            "shared_count": 1, 
            "id": "WhosAfraidOfVirginiaWoolf", 
            "name": "Who's Afraid of Virginia Woolf?", 
            "poster_url": "WhosAfraidOfVirginiaWoolf.jpg"
        }, 
        {
            "shared": [
                "HardDrinkingPartyGirl"
            ], 
            "shared_count": 1, 
            "id": "RaidersOfTheLostArk", 
            "name": "Raiders of the Lost Ark", 
            "poster_url": "RaidersOfTheLostArk.jpg"
        }
    ], 
    "id": "Barfly", 
    "name": "Barfly"
}