{
    "plot": "A former rock star, Johnny Boz, is brutally killed during sex, and the case is assigned to detective Nick Curran of the SFPD. During the investigation, Nick meets Catherine Tramell, a crime novelist who was Boz's girlfriend when he died. Catherine proves to be a very clever and manipulative woman, and though Nick is more or less convinced that she murdered Boz, he is unable to find any evidence. Later, when Nilsen, Nick's rival in the police, is killed, Nick suspects of Catherine's involvement in it. He then starts to play a dangerous lust-filled mind game with Catherine to nail her, but as their relationship progresses, the body count rises and contradicting evidences force Nick to start questioning his own suspicions about Catherine's guilt.", 
    "genres": "Drama, Mystery, Thriller", 
    "release_year": "1992", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "dead", 
                    "own", 
                    "responsible"
                ], 
                "role": "Black Widow: Catherine. Every one of her love interests ends up dead, whether by her own hand or through her manipulation of the situation.  Beth too, if she's responsible for her husband's murder", 
                "id": "BlackWidow"
            }, 
            {
                "adjectives": [
                    "Basic", 
                    "evil", 
                    "iconic", 
                    "evil", 
                    "own"
                ], 
                "role": "Basic Instinct has two evil blondes, Catherine and Roxy. Catherine is one of the most iconic blondes in cinema, and proves to be much more evil than Roxy, manipulating her for her own purposes.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "sinister", 
                    "hedonistic", 
                    "own", 
                    "murderous", 
                    "murky", 
                    "days—whether", 
                    "own", 
                    "unclear"
                ], 
                "role": "Blondes are Evil: Catherine is one of the most sinister blondes in all cinema, a hedonistic sociopath who manipulates everyone around her for her own amusement and gratification, while her girlfriend Roxy is easily driven to murderous fits of jealousy.  and when Beth's murky past is discovered, it's revealed she wore her hair blonde back in those days—whether of her own volition or to imitate Catherine is unclear", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "true", 
                    "other", 
                    "other", 
                    "stalked"
                ], 
                "role": "Clingy Jealous Girl: Roxy in regards to Catherine, threatening to kill Nick if he doesn't leave Catherine alone,  then attempting to do so Depending on whose version of events is true,  either Catherine or Beth was this to the other, with each woman claiming that the other stalked her after their one night stand. Then there's the murder of Beth's husband and the latest series of killings, which could have been engineered by either woman either as revenge for ending their relationship, or in the hopes of resuming it", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [
                    "iconic", 
                    "modern", 
                    "entire", 
                    "update", 
                    "emotional"
                ], 
                "role": "Catherine Tramell in Basic Instinct is one of the most iconic examples in modern filmmaking. No surprise, seeing as how the entire film is a 90's update on the Film Noir genre. She seduces both men and women to attain her goals, tempts Nick with her emotional vulnerability after Roxy's death, and committed all the murders.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "iconic", 
                    "modern", 
                    "entire", 
                    "update", 
                    "emotional"
                ], 
                "role": "Femme Fatale: Catherine is one of the most iconic examples in modern filmmaking. No surprise, seeing as how the entire film is a 90's update on the Film Noir genre. She seduces both men and women to attain her goals, tempts Nick with her emotional vulnerability after Roxy's death, and probably committed all the murders.. Beth and Roxy may also qualify depending on how you interpret the film and the characters.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [], 
                "role": "Psycho Lesbian: Roxy.", 
                "id": "PsychoLesbian"
            }, 
            {
                "adjectives": [
                    "much", 
                    "open"
                ], 
                "role": "The Vamp: While much of Catherine's character is open to interpretation, there's no denying how easily she manipulates everyone around her (especially by seducing them) to get what she wants.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0103772", 
    "poster_url": "BasicInstinct.jpg", 
    "similar": [
        {
            "shared": [
                "TheVamp", 
                "BlondesAreEvil", 
                "FemmeFatale", 
                "BlackWidow"
            ], 
            "shared_count": 4, 
            "id": "DoubleIndemnity", 
            "name": "Double Indemnity", 
            "poster_url": "DoubleIndemnity.jpg"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "BlondesAreEvil", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "TheVamp", 
                "FemmeFatale", 
                "BlackWidow"
            ], 
            "shared_count": 3, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "BlondesAreEvil", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "CoolWorld", 
            "name": "Cool World", 
            "poster_url": "CoolWorld.jpg"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "PsychoLesbian", 
                "BlondesAreEvil"
            ], 
            "shared_count": 3, 
            "id": "LegendOfTheSeeker", 
            "name": "Legend of the Seeker"
        }
    ], 
    "id": "BasicInstinct", 
    "name": "Basic Instinct"
}