{
    "plot": "Gotham City: dark, dangerous, 'protected' only by a mostly corrupt police department. Despite the best efforts of D.A. Harvey Dent and police commissioner Jim Gordon, the city becomes increasingly unsafe...until a Dark Knight arises. We all know criminals are a superstitious, cowardly lot...so his disguise must be able to strike terror into their hearts. He becomes a bat. Enter Vicky Vale, a prize-winning photo journalist who wants to uncover the secret of the mysterious \"bat-man\". And enter Jack Napier, one-time enforcer for Boss Grissom, horribly disfigured after a firefight in a chemical factory...who, devoid of the last vestiges of sanity, seizes control of Gotham's underworld as the psychotic, unpredictable Clown Prince of Crime...the Joker. Gotham's only hope, it seems, lies in this dark, brooding vigilante. And just how does billionaire playboy Bruce Wayne fit into all of this?", 
    "genres": "Action, Adventure", 
    "release_year": "1989", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Crusading Widower: Mr. Freeze.", 
                "id": "CrusadingWidower"
            }, 
            {
                "adjectives": [], 
                "role": "Dumb Muscle: Bane.", 
                "id": "DumbMuscle"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "pivotal", 
                    "double"
                ], 
                "role": "Batman & Robin had Julie Madison (Elle MacPherson). And that just proves how pivotal she is to the plot.\n Although, both Vicki and Catwoman are given an explanation as to where they went. Bruce told Selina that Vicki couldn't handle his double life, and as far as Batman knows Catwoman is dead.\n A earlier draft of the script for Batman and Robin had  Poison Ivy killing Julie Madison", 
                "id": "GirlOfTheWeek"
            }, 
            {
                "adjectives": [
                    "other", 
                    "main", 
                    "minor", 
                    "many", 
                    "comic", 
                    "far", 
                    "minor", 
                    "steady"
                ], 
                "role": "Girl of the Picture: Unlike the other three films, in which Bruce's Girl of the Movie was a main character for that film, Julie Madison is a minor character who exists entirely to create minor tension as Bruce deals with Poison Ivy's pheromones infecting him outside of battle. Bruce's extreme reluctance to marry her led to many jokes by comic fans that she was a beard. Her Aborted Arc leads to her being a far more minor character than someone being Bruce Wayne's steady love interest would seem to entail.", 
                "id": "GirlOfTheWeek"
            }, 
            {
                "adjectives": [
                    "romantic"
                ], 
                "role": "Lady Macbeth: Poison Ivy to Freeze, without the romantic undertones.", 
                "id": "LadyMacBeth"
            }, 
            {
                "adjectives": [], 
                "role": "Batman & Robin: Uma Thurman as Pamela Isely before becoming Poison Ivy.\n Batman Returns: Michelle Pfeifer as Selena Kyle before becoming Catwoman.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "good", 
                    "such"
                ], 
                "role": "A lot of females in superhero movies fit this trope. A good example is Alicia Silverstone's Batgirl in Batman & Robin acted as if she had something to prove to Robin and her character was seen doing such things as participating in a motorcycle race.", 
                "id": "OneOfTheBoys"
            }, 
            {
                "adjectives": [], 
                "role": "The Vamp: Poison Ivy. Yes, making her a camp vamp.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0096895", 
    "poster_url": "BatmanAndRobin.jpg", 
    "similar": [
        {
            "shared": [
                "TheVamp", 
                "Meganekko"
            ], 
            "shared_count": 2, 
            "id": "WaynesWorld", 
            "name": "Wayne's World", 
            "poster_url": "WaynesWorld.jpg"
        }, 
        {
            "shared": [
                "CrusadingWidower", 
                "Meganekko"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "Meganekko", 
                "DumbMuscle"
            ], 
            "shared_count": 2, 
            "id": "TheFaculty", 
            "name": "The Faculty", 
            "poster_url": "TheFaculty.jpg"
        }, 
        {
            "shared": [
                "LadyMacBeth", 
                "TheVamp"
            ], 
            "shared_count": 2, 
            "id": "DoubleIndemnity", 
            "name": "Double Indemnity", 
            "poster_url": "DoubleIndemnity.jpg"
        }, 
        {
            "shared": [
                "CrusadingWidower", 
                "GirlOfTheWeek"
            ], 
            "shared_count": 2, 
            "id": "OnHerMajestysSecretService", 
            "name": "On Her Majesty's Secret Service", 
            "poster_url": "OnHerMajestysSecretService.jpg"
        }
    ], 
    "id": "BatmanAndRobin", 
    "name": "Batman & Robin"
}