{
    "plot": "Gotham City: dark, dangerous, 'protected' only by a mostly corrupt police department. Despite the best efforts of D.A. Harvey Dent and police commissioner Jim Gordon, the city becomes increasingly unsafe...until a Dark Knight arises. We all know criminals are a superstitious, cowardly lot...so his disguise must be able to strike terror into their hearts. He becomes a bat. Enter Vicky Vale, a prize-winning photo journalist who wants to uncover the secret of the mysterious \"bat-man\". And enter Jack Napier, one-time enforcer for Boss Grissom, horribly disfigured after a firefight in a chemical factory...who, devoid of the last vestiges of sanity, seizes control of Gotham's underworld as the psychotic, unpredictable Clown Prince of Crime...the Joker. Gotham's only hope, it seems, lies in this dark, brooding vigilante. And just how does billionaire playboy Bruce Wayne fit into all of this?", 
    "genres": "Action, Adventure", 
    "release_year": "1989", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Mustache: One of Joker's mobsters sports one.", 
                "id": "BadAssMustache"
            }, 
            {
                "adjectives": [], 
                "role": "Badass Grandpa: Commissioner Gordon, although in subsequent films he suffers Badass Decay.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "only"
                ], 
                "role": "Played straight in the '89 film. Joker employs one of these guys. He's the only henchman to give Batman trouble.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "last", 
                    "first", 
                    "fair"
                ], 
                "role": "Scary Black Man: The last of the goons Batman has to fight before getting to Joker himself. He actually manages to beat the living piss out of Bats at first, although to be fair our hero had already been seriously injured.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Vicki Vale.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "pivotal", 
                    "double"
                ], 
                "role": "The 90s Batman films. Batman had Vicki Vale (Kim Basinger), Batman Returns had Catwoman (Michelle Pfeiffer) and Batman Forever had Chase Meridian (Nicole Kidman).\n Batman & Robin had Julie Madison (Elle MacPherson). And that just proves how pivotal she is to the plot.\n Although, both Vicki and Catwoman are given an explanation as to where they went. Bruce told Selina that Vicki couldn't handle his double life, and as far as Batman knows Catwoman is dead.\n A earlier draft of the script for Batman and Robin had  Poison Ivy killing Julie Madison", 
                "id": "GirlOfTheWeek"
            }, 
            {
                "adjectives": [
                    "main", 
                    "interest.The"
                ], 
                "role": "Photo journalist Vicky Vale in the 1989 Batman movie is the main female lead and love interest.The villain, The Joker, becomes obsessed with her.", 
                "id": "HotScoop"
            }, 
            {
                "adjectives": [
                    "other", 
                    "useless"
                ], 
                "role": "Neutral Female: Played with Vicki Vale. She does manage to save Batman from getting unmasked in the alley, and successfully distracts Joker while Batman is sneaking up on him. In all other cases, though, she's as useless as a snorkel in the Sahara.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [
                    "second", 
                    "identical"
                ], 
                "role": "In Batman Forever, Bruce Wayne asks Sugar (one of Two-Face's babes) how to turn Edward Nygma's machine off. He takes the glowing green battery from her and goes in, and then Sugar produces a second, identical battery from down her cleavage and switches it on again.\n In Batman, Vicky Vale attempts to conceal the film containing a picture of Batman unmasked in roughly that neighborhood, if her dismayed grab at her left breast  in one scene is any indication.", 
                "id": "Ptitleba4e2b2g"
            }, 
            {
                "adjectives": [
                    "absurd", 
                    "other", 
                    "capable", 
                    "first", 
                    "scaredy-cat"
                ], 
                "role": "Vicki Vale in the 1989 Batman movie, who would scream at everything — when the clowns shooting at the City Hall, when the Joker nearly sprays her with acid, when Bruce Wayne gets shot by the Joker, when her friend Knox jumped to the windshield of her car and when the Joker pulled the trigger on his fake gun (which is even more absurd in context, since the Joker was pretending to shoot himself). In the City Hall scene, Vicki wasn't screaming; she was shouting \"Bruce!\" at Bruce Wayne because he wasn't paying attention and nearly wandered into the clowns' line of fire. In other words, she was trying to save him, which is not something you'd expect a Screaming Woman to do. Vicki is actually pretty capable for the first half of the movie, and doesn't turn into the scaredy-cat character we all remember until the museum scene.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [
                    "white", 
                    "white", 
                    "climactic", 
                    "cathedral", 
                    "religious", 
                    "human"
                ], 
                "role": "Woman in White: Vicki wears a white dress, jacket and shoes at the climax of the 1989 film. By the end of the scene, she's lost the jacket and the shoes, and the dress is noticeably dirtied. Coincidence? The white dress also makes sense if you interpret the climactic cathedral scene from a religious perspective. In the dress, Vicki looks a lot like a bride - an association that is only strengthened when the Joker tells her, \"I've got to get you to the church on time.\" Some sects of Christianity refer to the human race as the \"Bride of Christ.\" Could Vicki Vale represent all of us, and are Batman and the Joker fighting for her soul? Almost certainly, if you take into account the excellent Prince song, \"Dance With the Devil\", that was (unfortunately) cut from one of the movie's two soundtracks (\"Dance with the Devil in the pale moonlight... He wants your soul and he wants it tonight\").", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0096895", 
    "poster_url": "Batman.jpg", 
    "similar": [
        {
            "shared": [
                "NeutralFemale", 
                "DamselInDistress", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 3, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "DamselInDistress", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "Taken", 
            "name": "Taken", 
            "poster_url": "Taken.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "BadAssMustache", 
                "DamselInDistress"
            ], 
            "shared_count": 3, 
            "id": "Bunraku", 
            "name": "Bunraku", 
            "poster_url": "Bunraku.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "BadassGrandpa", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "DiaryOfTheDead", 
            "name": "Diary of the Dead", 
            "poster_url": "DiaryOfTheDead.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "DamselInDistress", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "TheRock", 
            "name": "The Rock", 
            "poster_url": "TheRock.jpg"
        }
    ], 
    "id": "Batman", 
    "name": "Batman"
}