{
    "plot": "The Dark Knight of Gotham City confronts a dastardly duo: Two-Face and the Riddler. Formerly District Attorney Harvey Dent, Two-Face incorrectly believes Batman caused the courtroom accident which left him disfigured on one side; he has unleashed a reign of terror on the good people of Gotham. Edward Nygma, computer-genius and former employee of millionaire Bruce Wayne, is out to get the philanthropist; as The Riddler he perfects a device for draining information from all the brains in Gotham, including Bruce Wayne's knowledge of his other identity. Batman/Wayne is/are the love focus of Dr. Chase Meridan. Former circus acrobat Dick Grayson, his family killed by Two-Face, becomes Wayne's ward and Batman's new partner Robin the Boy Wonder.", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "healthy", 
                    "'normal", 
                    "acid-scarred"
                ], 
                "role": "Elsewhere in the Batman franchise, Two-Face in Batman Forever has Sugar and Spice - Sugar for his healthy, 'normal' side, Spice for his twisted, acid-scarred side.", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [], 
                "role": "Instant Soprano: Batman rescues Robin from barely even touching the spikes at the bottom of the Riddler's hideout, and he squeaks out a \"thanks\" to Batman, which makes you wonder how Robin would have been impaled.", 
                "id": "InstantSoprano"
            }, 
            {
                "adjectives": [], 
                "role": "Man in White: The Riddler starts channeling Ziggy Stardust in the finale.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [], 
                "role": "Sissy Villain: The friggin' Riddler. (He's even wearing rouge.)", 
                "id": "SissyVillain"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "female", 
                    "previous", 
                    "straight-up", 
                    "psychotic", 
                    "weak", 
                    "pitiable", 
                    "clear", 
                    "sarcastic", 
                    "new", 
                    "later"
                ], 
                "role": "Batman Forever gave audiences Dr. Chase Meridian (Nicole Kidman), who could be seen as an Author's Saving Throw for the female leads in the two previous Batman films: a straight-up Distressed Damsel (Vicki Vale) and an Action Girl who was nonetheless psychotic, emotionally weak, and pitiable (Selina Kyle/Catwoman). This becomes clear when Bruce Wayne pays her a visit and becomes concerned when he hears feminine gasps and grunts coming from her office. Thinking she's being attacked and finding the door locked, he kicks it in - only to find that Dr. Meridian was just practicing her boxing skills with a punching bag. (To compound Bruce's embarrassment, Chase then makes a sarcastic comment about how he'll now have to buy her a new door.) Later on, when she and Bruce are being attacked by Two-Face's gang, Chase punches out one of the Mooks when he tries to grab her - although she is then taken hostage mere moments later.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "rich"
                ], 
                "role": "In Batman Forever, Edward Nygma subconsciously idolizes Bruce Wayne, so when he pretends to be a rich industrialist, he copies everything Bruce does, including having a (fake) mole.", 
                "id": "BeautyMark"
            }, 
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Chase Meridian.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "female", 
                    "previous", 
                    "straight-up", 
                    "psychotic", 
                    "weak", 
                    "pitiable", 
                    "clear", 
                    "sarcastic", 
                    "new", 
                    "later"
                ], 
                "role": "Batman Forever gave audiences Dr. Chase Meridian (Nicole Kidman), who could be seen as an Author's Saving Throw for the female leads in the two previous Batman films: a straight-up Damsel in Distress (Vicki Vale) and an Action Girl who was nonetheless psychotic, emotionally weak, and pitiable (Selina Kyle/Catwoman). This becomes clear when Bruce Wayne pays her a visit and becomes concerned when he hears feminine gasps and grunts coming from her office. Thinking she's being attacked and finding the door locked, he kicks it in - only to find that Dr. Meridian was just practicing her boxing skills with a punching bag. (To compound Bruce's embarrassment, Chase then makes a sarcastic comment about how he'll now have to buy her a new door.) Later on, when she and Bruce are being attacked by Two-Face's gang, Chase punches out one of the Mooks when he tries to grab her - although she is taken hostage moments later.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Dominatrix: Chase suggests dressing and acting like Catwoman would entice the Bat.", 
                "id": "Dominatrix"
            }, 
            {
                "adjectives": [
                    "stereotypical", 
                    "seductive", 
                    "evil", 
                    "ambiguous", 
                    "later"
                ], 
                "role": "Femme Fatale: Invoked by Nicole Kidman playing Dr. Chase Meridian as a stereotypical 40's film noir heroine, with a raspy voice and seductive mannerisms. Subverted because she is not evil or even morally ambiguous; she is just fascinated by people with Split Personality. Sugar briefly acts as one to the Brucester himself: making eyes with him at the gala... and later convincing him to try out a Nygmatech trade show booth.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "only"
                ], 
                "role": "Girl of the Film: Dr. Chase Meridian (the only Girl of the Week that wasn't lifted from the comics).", 
                "id": "GirlOfTheWeek"
            }, 
            {
                "adjectives": [
                    "Hot", 
                    "unapologetic", 
                    "comic", 
                    "sexy"
                ], 
                "role": "Hot Scientist: Dr. Meridian is an unapologetic comic stereotype. Though WB fought against casting Kidman in the movie, on the grounds that she isn't sexy enough.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "Two-Face", 
                    "bad"
                ], 
                "role": "Batman Forever has Two-Face's molls, Sugar (played by Drew Barrymore) and Spice (played by Debi Mazar). Subverted in that both of them are \"bad\", and \"Sugar\" is probably worse because she gives The Riddler the cube with the information about Bruce Wayne's Secret Identity.", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "jealous"
                ], 
                "role": "Ms. Fanservice: Nicole Kidman in her hottie prime naked under a silk bedsheet, and using the Batsignal to strip in front of Batman and try to seduce him. Drew Barrymore as Sugar and Debi Mazar as Spice, or as the script originally referred to them, Leather and Lace. Of all of Barrymore's screentime, she has exactly one scene that is not spent in lingerie, and except for a sheer coat, Mazar spends the entire movie in a dominatrix getup that would make Dr. Frank N. Furter jealous.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0112462", 
    "poster_url": "BatmanForever.jpg", 
    "similar": [
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "GirlOfTheWeek", 
                "ManInWhite", 
                "DamselInDistress"
            ], 
            "shared_count": 5, 
            "id": "RaidersOfTheLostArk", 
            "name": "Raiders of the Lost Ark", 
            "poster_url": "RaidersOfTheLostArk.jpg"
        }, 
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "MsFanservice", 
                "HotScientist", 
                "FemmeFatale"
            ], 
            "shared_count": 5, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "BeautyMark", 
                "LightFeminineAndDarkFeminine", 
                "SissyVillain", 
                "ManInWhite", 
                "ALadyOnEachArm"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "MsFanservice", 
                "DamselInDistress"
            ], 
            "shared_count": 4, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "LightFeminineAndDarkFeminine", 
                "DamselInDistress", 
                "DamselOutOfDistress", 
                "ManInWhite"
            ], 
            "shared_count": 4, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }
    ], 
    "id": "BatmanForever", 
    "name": "Batman Forever"
}