{
    "plot": "Heiress Lisa Carson, girlfriend to Bruce Wayne, is kidnapped by the Riddler. A call on the bat-phone summons Batman and Robin to police headquarters. A flick of the switch hidden in a bust of Shakespeare, the wall opens up and it's, \"To the bat-poles\". \"Atomic batteries to power, turbines to speed\", the bat-mobile roars out of the bat-cave and the familiar animated titles roll. It's all here in this parody of the 60's TV series, Alfred, Commissioner Gordon, and Chief O'Hara along with a trio of arch-villains, Joker, Catwoman, and the Riddler. There's even the obligatory celebrity poking his head out a window as the Dynamic Duo scale the side of a building. But this is a porn parody, so there's also lots of hostage-on-villain, villain-on-crimefighter, and crimefighter-on-crimefighter sex. Cringe as Lisa \"negotiates\" with her captor for better accommodations . Marvel as the Caped Crusader does the Bat-tusi at a discotheque before succumbing to a scopolamine mickey in his fresh-squeezed grapefruit juice, placing him at the mercy of the Riddler's moll, Molly. Their passions aroused after spying on the Joker with his two molls, watch as Robin shows Batgirl why he's called Boy Wonder. Will Robin and Batgirl manage to rescue Batman and his alter-ego's girlfriend or will they, too, fall into the clutches of this triumvirate of evil? Will the Joker, the Riddler, and Catwoman be able to suppress their separate agendas and together finally dispatch the Dark Knight? Well it wouldn't be a faithful parody without a cliffhanger ending.", 
    "genres": "Adult, Comedy", 
    "release_year": "2010", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Lisa.", 
                "id": "DamselInDistress"
            }
        ]
    }, 
    "imdbid": "tt1653823", 
    "similar": [
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "HouseOfFlyingDaggers", 
            "name": "House of Flying Daggers", 
            "poster_url": "HouseOfFlyingDaggers.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "TurtlesForever", 
            "name": "Turtles Forever", 
            "poster_url": "TurtlesForever.png"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }
    ], 
    "id": "BatmanXXX", 
    "name": "Batman XXX"
}