{
    "plot": "This series features the adventures of the Dark Knight of Gotham City as he battles the evil that inhabits the city with occasional help of Robin and Batgirl in stories that are faithful to the comics in spirit and tone.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "1992–1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "administrative", 
                    "first"
                ], 
                "role": "Batman: The Animated Series\n Alfred Pennyworth, of course, steps up as the situation arises.\n Maven, the administrative assistant of Selina Kyle/Catwoman.\n Baby Dahl also had a Battle Butler/Nanny in her first appearance.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "former", 
                    "British", 
                    "few", 
                    "fanatical", 
                    "regular"
                ], 
                "role": "Battle Butler: Alfred is a former British secret agent and gets a few opportunities to utilize those skills in Batman's service, while Harley Quinn shows her fanatical devotion to the Joker on a regular basis.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "one-time"
                ], 
                "role": "In an episode of Batman: The Animated Series, one-time villain Calendar Girl had Mooks dressed like this.", 
                "id": "ChippendalesDancers"
            }, 
            {
                "adjectives": [
                    "brief", 
                    "batshit-insane", 
                    "interested", 
                    "later"
                ], 
                "role": "In Batman: The Animated Series, The Joker gets into a brief argument with the Creeper over ownership of Harley Quinn. Subverted in that it's more about \"There Can Only Be One batshit-insane creep in Gotham City\", rather than who is Harley's man.\n Also, Harley only loves the Joker, who's not interested as usual. And it was not until later that the Creeper becomes smitten with her.", 
                "id": "CockFight"
            }, 
            {
                "adjectives": [
                    "extended", 
                    "Beware", 
                    "real"
                ], 
                "role": "Cool Old Guy: Alfred and Commissioner Gordon, naturally. An elderly Jonah Hex, who appears in an extended flashback in the episode, \"Showdown\", and Simon Trent in \"Beware the Grey Ghost\", who in turn is voiced by real life Cool Old Guy Adam West.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "gluttonous", 
                    "dangerous"
                ], 
                "role": "One episode of Batman: The Animated Series pitted Bruce Wayne against a gluttonous sadist, who kidnapped the homeless and forced them to work in a dangerous mine.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [], 
                "role": "Crusading Widower: Mr. Freeze.", 
                "id": "CrusadingWidower"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Freeze in Batman: The Animated Series , though his wife did not actually die.", 
                "id": "CrusadingWidower"
            }, 
            {
                "adjectives": [
                    "ex-con", 
                    "invisible", 
                    "ex-wife"
                ], 
                "role": "There's an episode of Batman: The Animated Series wherein the ex-con father of a little girl can turn invisible with some Applied Phlebotinum, which makes him literally a Disappeared Dad. Not only that, but his ex-wife tells him:", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Jervis Tetch (aka the Mad Hatter) from Batman: The Animated Series starts out as this. Things go quickly downhill when he learns that his love interest, Alice, is engaged and only sees Jarvis as a friend.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "homeless", 
                    "complete", 
                    "fried"
                ], 
                "role": "In the Batman: The Animated Series episode \"The Forgotten\", homeless people are being kidnapped and forced to work in a mine run by one of these types, pictured above complete with a piece of fried chicken and a fan. (All he lacked was a Southern accent.)", 
                "id": "FatSweatySouthernerInAWhiteSuit"
            }, 
            {
                "adjectives": [
                    "careful"
                ], 
                "role": "Batman: The Animated Series: At the time, a Groin Attack could be included in the show with careful positioning. To indicate to the viewer that it actually had happened, note the Joker's noticeably higher voice after.", 
                "id": "InstantSoprano"
            }, 
            {
                "adjectives": [
                    "sympathetic"
                ], 
                "role": "Simon Trent, the typecast actor who played the Gray Ghost, years after the show was cancelled, in Batman: The Animated Series. It's a more sympathetic portrayal than most, however, and he eventually does get out of his slump.", 
                "id": "JadedWashout"
            }, 
            {
                "adjectives": [], 
                "role": "Batman: The Animated Series shows this even applies to supervillains - after the Joker kicks Harley out in \"Harley and Ivy\", he forgets to feed the hyenas (\"They snapped at me!\") and can't find his socks. Or trousers, apparently.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice: Nightwing is, shall we say, quite a handsome fellow.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "far"
                ], 
                "role": "Papa Wolf: Batman's one principle is to never take a life, but if you dare to enslave innocent children to steal for you like The Sewer King did, you better damn well pray that he does hold onto it. \"Over the Edge\" shows just how far Jim Gordon will go for his daughter.  Or rather, what she fears he will do.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "al-Ghul"
                ], 
                "role": "Batman: The Animated Series\n \"Bane\": Robin is kidnapped by Bane and his accomplice. He is stripped of his shirt and dangled by chains over a tank in which they intend to drown him. Justified in that Bane uses the uniform shirt to show Batman that he'd kidnapped Robin.\n \"The Demon's Quest Part II\": Batman is stripped of his shirt by Ra's al-Ghul's henchmen and put in chains in the dungeons after his capture attempting to sneak into the Lazarus Pit compound.", 
                "id": "ShirtlessCaptives"
            }, 
            {
                "adjectives": [
                    "gratuitous"
                ], 
                "role": "Shirtless Scene: Both Batman and Robin get in on this, and in The New Batman Aventures season Nightwing has a completely gratuitous one.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Catwoman appears frequently, sometimes assisting Batman, sometimes working against him. Barbara Gordon initially appears only as Commissioner Gordon's daughter, but over the series she transforms into Batgirl and becomes an official member of the Bat-family. From time to time, Harley Quinn as well.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "Mean", 
                    "various", 
                    "beautiful", 
                    "beautiful", 
                    "hideous"
                ], 
                "role": "The New Batman Adventures episode \"Mean Seasons\" plays it straight as a twist. A villain going by the name \"Calendar Girl\" kidnaps various fashion and cosmetics bigwigs in order to exact her revenge from them. The villain wears a metal mask that conceals her face completely and constantly fumes about how the industry has ruined her, especially her beautiful face. In the end of the episode,  it is revealed that she is flawlessly beautiful, but is so distraught by her perceived flaws that she believes herself to be immeasurably hideous.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "comic", 
                    "real", 
                    "odd", 
                    "animal-tested", 
                    "Half-Human", 
                    "identical", 
                    "then-blonde"
                ], 
                "role": "Batman: The Animated Series had three: Catwoman, who mentioned at one point in a comic that she dyed her hair, Harley Quinn, who also denied being a real blonde, and Mary Louise \"Baby Doll\" Dahl.\n There's odd inconsistency with Catwoman — her hair colour changed between seasons, and this was explained with her stopping dyeing her hair with animal-tested products, but back in the episode Tyger, Tyger, she was transformed into a Half-Human Hybrid, yet had fur the identical shade to her then-blonde hair.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "short", 
                    "leg-baring", 
                    "flesh-colored", 
                    "gender-flipped"
                ], 
                "role": "Batman: The Animated Series examples:\n Mr. Freeze of all people employed a goon squad of women wearing impossibly short leg-baring parka-type outfits. One would hope they're actually wearing warm and comfy flesh-colored tights.\n The Penguin had henchwomen Jay, Lark and Raven.\n Calendar Girl had the gender-flipped version; bodyguards who looked like Chippendales Dancers.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [
                    "real"
                ], 
                "role": "Classy Catburglar: Who else but the real deal?", 
                "id": "ClassyCatBurglar"
            }, 
            {
                "adjectives": [
                    "jealous", 
                    "homicidal"
                ], 
                "role": "Clingy Jealous Girl: Baby Doll, for Killer Croc. Harley eventually becomes jealous of all the attention that Batman gets from the Joker, and this grows into homicidal tendencies.", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [
                    "prominent", 
                    "many", 
                    "girlfriend/henchman", 
                    "abusive"
                ], 
                "role": "Although prominent in many Batman comics today, it was in Batman: The Animated Series that Harley Quinn was introduced as Joker's girlfriend/henchman in an abusive relationship.", 
                "id": "DarkMistress"
            }, 
            {
                "adjectives": [], 
                "role": "This is also how she captures Batman in Batman: The Animated Series episode Mad Love.", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [], 
                "role": "The Batman: The Animated Series episode \"Critters\" had Batman fighting against Farmer Brown and his daughter Emmylou Brown, and thanks to some \"Beef Steroids,\" she doesn't go down easily.", 
                "id": "FarmersDaughter"
            }, 
            {
                "adjectives": [
                    "only", 
                    "physical", 
                    "five-year-old"
                ], 
                "role": "Femme Fatale: The only female villain that does not fall into this in some way is Baby Doll, on account of her bearing the physical form of a five-year-old.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "Girlish", 
                    "villainous"
                ], 
                "role": "Girlish Pigtails: A villainous example in Harley Quinn.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [
                    "first", 
                    "warrant", 
                    "hat"
                ], 
                "role": "Harley Quinn from Batman: The Animated Series didn't have pigtails at first, but her partly childlike behavior seemed to warrant them (and they fit with the hat). She also didn't have them when she was a psychiatrist. Like pretty much everything else about her, this was ported to the comics.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [], 
                "role": "In Batman: The Animated Series, when Commissioner Gordon picked up his daughter Barbara from the airport, he brought Barbara's teddy bear \"Woobie\" with him. When Bruce Wayne happened to run into the Commissioner and saw him holding the bear, Gordon sheepishly \"explained\" that Woobie knew the way better than he did.", 
                "id": "GirlsLoveStuffedAnimals"
            }, 
            {
                "adjectives": [
                    "monstrous", 
                    "beautiful", 
                    "due"
                ], 
                "role": "Farmer Brown from the Batman: The Animated Series episode \"Critters\" can count as a Mad Scientist, seeing as he was using microbiology to create monstrous farm animals. And he did indeed have a beautiful daughter named Emmylou. She was also his enforcer, and was much stronger than her almost petite frame would appear, being more than a match for Batgirl. (She claimed it was due to beef steroids, clearly another of her dad's experiments.)", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [
                    "short"
                ], 
                "role": "Mad Scientist's Beautiful Daughter: Farmer Brown's daughter. Added bonus that she wears short shorts.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Batman: The Animated Series: Harleen Quinzel before becoming Harley Quinn, in another example of the glasses signifying a personality (or in this case, sanity) change.\n Janet Van Dorn, Gotham City's District Attorney.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "interesting", 
                    "neutral", 
                    "fiancée", 
                    "neutral", 
                    "straight", 
                    "whole", 
                    "different", 
                    "first", 
                    "ineffectual", 
                    "own", 
                    "much", 
                    "low", 
                    "lethal", 
                    "strong", 
                    "hilarious", 
                    "Batman/Superman", 
                    "instant", 
                    "infamous", 
                    "on-again-off-again"
                ], 
                "role": "An interesting subversion happens in the Batman: The Animated Series episode \"Two Face Part Two\": An employee of the mob boss Thorne was a neutral female up until she tries to hit Two Face over the head with a container, when she is tackled by Two Face's fiancée (another previously neutral female, and a Face, believe it or not). Making it also a straight example of a whole different trope, Designated Girl Fight.\n Played with in the first part, where Thorne's moll sits out a fight between Harvey Dent (Pre-Two-Face) and Batman vs. Thorne's men, not because she was scared or ineffectual, she was just enjoying the show, describing it as \"Wild!\", disturbingly excitedly.\n Joker and Harley both avert and play this one straight. Often Joker will tell Harley to sit out and let him handle \"Batsy\" on his own, in which case she will merrily cheer him on, as if she was watching a TV show. Other times she will help in the fight, often bringing out bigger and badder weapons than the Joker himself (although Joker tends to stay more of the threat since he's a better fighter than she is).\n In the comics, however, Harley is a much better and stronger fighter than Joker (after getting low level superstrength and agility from one of Poison Ivy's chemicals), although Joker usually carries more lethal weaponry. Regardless, he most often uses her as his strong arm while he stays behind, not bothering to fight unless he is facing Batman himself.\n A hilarious inversion comes in the Batman/Superman crossover World's Finest, where Harley and Mercy, Luthor's assistant, take an instant dislike to one another, and have an all out brawl in the background while Joker and Lex talk business.\n Played straight for Talia Al Ghul, daughter of the infamous Ra's Al Ghul and on-again-off-again Love Interest for Batman. Whenever her daddy and her beau fight, she refuses to take a side. The best she'll do is prevent Batman from actually capturing and imprisoning Ra's after winning said fight.\n Probably justified, as they are her father and the man she professes to love, which would make choosing a side somewhat awkward.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [
                    "important", 
                    "later", 
                    "window-dressing", 
                    "real"
                ], 
                "role": "Barbara Gordon in Batman: The Animated Series starts out as mainly important because she is Commissioner Gordon's daughter (and later Dick's love interest). The trope is inverted, however, in Batman Beyond, where Sam Young's role as district attorney is mostly just window-dressing for his real role as Barbara Gordon's husband.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Perky Female Minion: Harley Quinn.", 
                "id": "PerkyFemaleMinion"
            }, 
            {
                "adjectives": [], 
                "role": "Blink and you might miss it, but in the Batman episode \"Pretty Poison\", Poison Ivy retrieves her poison lipstick from her cleavage.", 
                "id": "Ptitleba4e2b2g"
            }, 
            {
                "adjectives": [], 
                "role": "\"Girl's Night Out, \" the aptly named episode of The New Batman Adventures where Batgirl and Supergirl team up to take on Livewire, Harley Quinn and Poison Ivy.", 
                "id": "Ptitlex8dzph7q"
            }, 
            {
                "adjectives": [], 
                "role": "Robot Girl: Randa Duane, H.A.R.D.A.C.'s dragon.", 
                "id": "RobotGirl"
            }, 
            {
                "adjectives": [
                    "Many", 
                    "only"
                ], 
                "role": "Socialite: Many, either dating Bruce or in the background at upper class events and parties. Veronica Vreeland is the only named example (well, that isn't part of the Rogues Gallery).", 
                "id": "Socialite"
            }, 
            {
                "adjectives": [], 
                "role": "Red Claw on Batman: The Animated Series.", 
                "id": "TheBaroness"
            }, 
            {
                "adjectives": [
                    "later", 
                    "old", 
                    "precious", 
                    "real"
                ], 
                "role": "Mary \"Baby Doll\" Dahl of Batman: The Animated Series was a child actor with a growth deficiency which prevented her from physically aging, and similarly prevented her career from advancing as well. Years later, she snapped and started kidnapping old cast members, but kept doing so in character as \"Daddy's widdle precious\". It's only at the end of the episode, when she stumbles in front of a funhouse mirror that seems to show the adult form she could never have, that she breaks character and reveals what she's really like, in a speech that's a real Tear Jerker.", 
                "id": "TheFakeCutie"
            }, 
            {
                "adjectives": [
                    "long-separated", 
                    "former", 
                    "full-body", 
                    "become", 
                    "beautiful", 
                    "former", 
                    "stark"
                ], 
                "role": "Batman: The Animated Series:\n Recurring villain Mary \"Baby\" Dahl, a White Dwarf Starlet, with emphasis on \"Dwarf\", who abducted her long-separated sitcom co-stars.\n An episode of \"The New Batman Adventures\" has a former model intent on killing the people who had led to her downfall, wearing full-body covering and a featureless mask to hide what she's become since her fame ran out. The Reveal shows that she looks to be in her 30s and is still beautiful, but she \"can only see the flaws\". Wanna know the kicker, though? Her voice actress was former model Sela Ward, which sort of makes the episode Truth in Television, although Ward obviously didn't go stark raving nuts in Real Life.", 
                "id": "WhiteDwarfStarlet"
            }, 
            {
                "adjectives": [
                    "White-Dwarf"
                ], 
                "role": "White-Dwarf Starlet: Mary \"Baby\" Dahl. In more ways than one.", 
                "id": "WhiteDwarfStarlet"
            }, 
            {
                "adjectives": [
                    "working", 
                    "own"
                ], 
                "role": "Batgirl in Batman: The Animated Series. Batman having a secret relationship with her, and not telling Dick who she really was, ultimately causes Dick to quit working with him out of anger and start fighting crime on his own.", 
                "id": "YokoOhNo"
            }
        ]
    }, 
    "imdbid": "tt0103359", 
    "similar": [
        {
            "shared": [
                "DoggedNiceGuy", 
                "ShirtlessScene", 
                "ClingyJealousGirl", 
                "YokoOhNo", 
                "BlondesAreEvil", 
                "NeverASelfMadeWoman", 
                "NeutralFemale", 
                "CockFight"
            ], 
            "shared_count": 8, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "MenCantKeepHouse", 
                "FemmeFatale", 
                "ShirtlessScene", 
                "NeverASelfMadeWoman", 
                "NeutralFemale", 
                "ActionGirl", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 7, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "FemmeFatale", 
                "TheBaroness", 
                "PerkyFemaleMinion", 
                "DecoyDamsel", 
                "BodyguardBabes", 
                "MrFanservice"
            ], 
            "shared_count": 7, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MadScientistsBeautifulDaughter", 
                "TheBaroness", 
                "CoolOldGuy", 
                "NeverASelfMadeWoman", 
                "Meganekko", 
                "BodyguardBabes"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "FatSweatySouthernerInAWhiteSuit", 
                "WhiteDwarfStarlet", 
                "MenCantKeepHouse", 
                "FarmersDaughter", 
                "NeverASelfMadeWoman", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 7, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "BatmanTheAnimatedSeries", 
    "name": "Batman: The Animated Series"
}