{
    "plot": "When his parents were killed, millionaire playboy Bruce Wayne relocates to Asia when he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as 'Batman'. But it doesn't stay quiet for long.", 
    "genres": "Action, Adventure", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "same", 
                    "touch"
                ], 
                "role": "Bruce Wayne does this in Batman Begins, then does the same thing with three women in The Dark Knight. However, he only does it because Alfred told him to behave like a Rich Idiot with No Day Job, so that people don't start thinking about his activities and jump to conclusions. Alfred actually had to explain what he means, as Bruce has been out of touch for a while.", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [], 
                "role": "Alfred knocks down one of the intruders from behind in the burning mansion in Batman Begins.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [], 
                "role": "Battle Butler: Alfred takes out a League of Shadows assassin with a golf club in order to rescue Bruce from the burning Wayne Manor.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "al"
                ], 
                "role": "Beard of Evil: Ra's al Ghul sports the Fu Manchu of villainy, as does Ducard.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "al", 
                    "first", 
                    "first", 
                    "comic"
                ], 
                "role": "In Batman Begins, Ra's al Ghul's and Henri Ducard's fu manchus are our first clue that the League of Shadows is evil. (Well, the first clue for those who hadn't read the comic books.) Bruce Wayne also sports a rather scraggly beard at the beginning of the film, but it's gone by the time he disavows killing and severs ties with the League.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Millionaire Playboy: Invoked; it goes hand in hand with Rich Idiot with No Day Job.", 
                "id": "MillionairePlayboy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Batman Begins: Male example; Cillian Murphy as Johnathan Crane/Scarecrow.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "appear"
                ], 
                "role": "In Batman Begins, while both Bruce's parents die, he spends the rest of the movie obsessed only with whether or not his father would be proud of him. Mother is not mentioned after her death, and while she does appear on film, she's not cast as a speaking part.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0372784", 
    "poster_url": "BatmanBegins.jpg", 
    "similar": [
        {
            "shared": [
                "MissingMom", 
                "Meganekko", 
                "ALadyOnEachArm"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "BattleButler", 
                "BeardOfEvil", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "JusticeLeagueCrisisOnTwoEarths", 
            "name": "Crisis on Two Earths", 
            "poster_url": "JusticeLeagueCrisisOnTwoEarths.jpg"
        }, 
        {
            "shared": [
                "MissingMom", 
                "Meganekko", 
                "ALadyOnEachArm"
            ], 
            "shared_count": 3, 
            "id": "CloudyWithAChanceOfMeatballs", 
            "name": "Cloudy with a Chance of Meatballs", 
            "poster_url": "CloudyWithAChanceOfMeatballs.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "Meganekko"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }
    ], 
    "id": "BatmanBegins", 
    "name": "Batman Begins"
}