{
    "plot": "Having defeated the Joker, Batman now faces the Penguin - a warped and deformed individual who is intent on being accepted into Gotham society. Crooked businessman Max Schreck is coerced into helping him become Mayor of Gotham and they both attempt to expose Batman in a different light. Earlier however, Selina Kyle, Max's secretary, is thrown from the top of a building and is transformed into Catwoman - a mysterious figure who has the same personality disorder as Batman. Batman must attempt to clear his name, all the time deciding just what must be done with the Catwoman.", 
    "genres": "Action", 
    "release_year": "1992", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "portrayal", 
                    "voluptuous", 
                    "posterior", 
                    "excessive", 
                    "spiked"
                ], 
                "role": "Danny DeVito's portrayal of the Penguin in Batman Returns takes this Up to Eleven. He fondles a girl's breasts as he's pinning a button to her coat, rudely stares at a voluptuous woman's posterior for an excessive amount of time, sniffs Catwoman's spiked heel, and agrees to run for mayor only after learning that being mayor in Gotham City entitles one to \"unlimited poontang.\"", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: Chip Shreck, at least in the shooting script. In the film itself, he's more a case of Daddy's Little Villain.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "tough", 
                    "dignified", 
                    "such"
                ], 
                "role": "Miles Gloriosus: For all his tough talk, Max Shreck isn't above running away and hiding in an alley when the Penguin's gang crashes the downtown Christmas celebration. What makes his cowardice even worse is that he leaves his son standing there on the stage with multiple guns and bladed weapons pointing at his throat. Sure, it's what everyone else is trying to do, and it's what his son wants anyway... but one would have expected more dignified behavior from such an eminent public official.", 
                "id": "MilesGloriosus"
            }, 
            {
                "adjectives": [
                    "ballistic", 
                    "neurological", 
                    "great", 
                    "useless", 
                    "cold"
                ], 
                "role": "Papa Wolf: The Penguin goes ballistic after Batman has Alfred jam the frequency over which he is sending neurological commands to his pet penguins, which evidently causes them great pain. (\"MY BABIIIIES!\") Subverted in that he proves to be almost useless in combat. Also, Max Shreck. He's a ruthless, cold blooded thug of a business man, but still loves his son. When Selina finds out the truth about his \"power plant,\" he tries to kill her, because he views it as his legacy to leave to Chip.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed", 
                    "fur-lined", 
                    "black-and-white", 
                    "close", 
                    "waistcoat", 
                    "bad"
                ], 
                "role": "Sharp-Dressed Man: Nobody outdresses Max Shreck, whose natty striped suit, fur-lined coat, black-and-white spats, and Ominous Opera Cape you will not soon forget - though the Penguin comes close when he's running for mayor in his striped pants, waistcoat, frock coat and top hat. Bruce Wayne himself doesn't look bad either when he attends his meeting with Shreck. (\"Nice suit,\" says Selina.)", 
                "id": "SharpDressedMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "old", 
                    "finished"
                ], 
                "role": "Alpha Bitch: The depiction of the Ice Princess, at least in the shooting script. One scene that was filmed but ultimately cut showed her tearing through Gotham Plaza amidst all the gang violence and shoving an old woman to the ground so that she'd get trampled instead! But these character traits are softened in the finished film, so the Princess just comes off as Spoiled Sweet.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "near-death"
                ], 
                "role": "Beautiful All Along: Dowdy secretary Selina Kyle goes through a near-death experience, trashes her apartment, and stitches together a vinyl suit to become the evil and sexy Catwoman..", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "Visible", 
                    "own", 
                    "dowdy", 
                    "able"
                ], 
                "role": "Visible in Batman Returns. Who knew that getting thrown off a building, trashing her own house, and tearing up her clothes to make a catsuit would change dowdy secretary Selina Kyle so much? The book of the movie explains it's her self-confidence that makes her able to wear clothes that really suit her.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Dark Action Girl: Catwoman.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Selina Kyle (Catwoman) in Batman Returns.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "faithful", 
                    "actual"
                ], 
                "role": "Faux Action Girl: The Poodle Lady (a grown woman in an \"innocent\" pink shawl and skirt) stares Batman down coldly during a street fight, but in the end lets her faithful dog engage in the actual combat.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Girl of the Film: Selina Kyle.", 
                "id": "GirlOfTheWeek"
            }, 
            {
                "adjectives": [
                    "childish", 
                    "similar"
                ], 
                "role": "When Selina Kyle snaps and becomes Catwoman, one of the things she does is putting her collection of childish plush toys down her garbage disposal.\n A similar scene occurred in Black Swan.", 
                "id": "GirlsLoveStuffedAnimals"
            }, 
            {
                "adjectives": [
                    "criminal", 
                    "regular"
                ], 
                "role": "Batman Returns: Selina Kyle is usually portrayed as a criminal who grew up on the streets. Here she has a regular job and a home but hates her life and eventually snaps.\n Being pushed out of a window by your boss also helps.", 
                "id": "GoodGirlGoneBad"
            }, 
            {
                "adjectives": [], 
                "role": "Batman Returns: Michelle Pfeifer as Selena Kyle before becoming Catwoman.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Office Girl: Selina, before her transformation.", 
                "id": "PluckyOfficeGirl"
            }, 
            {
                "adjectives": [
                    "meant", 
                    "sympathetic"
                ], 
                "role": "Spoiled Sweet: The Ice Princess in the film as it exists - she was originally meant to be less sympathetic (see Alpha Bitch above).", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [], 
                "role": "The Ice Princess from Batman Returns.", 
                "id": "WinterRoyalLady"
            }, 
            {
                "adjectives": [], 
                "role": "Winter Royal Lady: The Ice Princess", 
                "id": "WinterRoyalLady"
            }, 
            {
                "adjectives": [
                    "iconic", 
                    "dangerous"
                ], 
                "role": "Woman in Black: Burton's Catwoman is iconic of the trope, being enticing but also clearly dangerous.", 
                "id": "WomanInBlack"
            }
        ]
    }, 
    "imdbid": "tt0103776", 
    "poster_url": "BatmanReturns.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "SpoiledSweet", 
                "Meganekko", 
                "BeautifulAllAlong", 
                "AlphaBitch"
            ], 
            "shared_count": 5, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "WomanInBlack", 
                "Meganekko", 
                "DirtyOldMan", 
                "DarkActionGirl"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BeautifulAllAlong", 
                "Meganekko", 
                "GirlsLoveStuffedAnimals"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "SharpDressedMan", 
                "JerkJock", 
                "WomanInBlack"
            ], 
            "shared_count": 4, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "DirtyOldMan", 
                "AlphaBitch", 
                "GirlsLoveStuffedAnimals"
            ], 
            "shared_count": 4, 
            "id": "BlackSwan", 
            "name": "Black Swan", 
            "poster_url": "BlackSwan.jpg"
        }
    ], 
    "id": "BatmanReturns", 
    "name": "Batman Returns"
}