{
    "plot": "Batman, the costumed crime-fighter who prowls the night skies in Gotham City, soon finds there's another vigilante in town knocking off prominent mob figures. Despite the scythe-like blade for a hand, a mechanical voice and the cloud of smoke that follows the figure wherever it goes, the police and outraged officials mistake the homicidal crusader for Batman himself and demand that the city's longtime hero be brought to justice. Meanwhile, Andrea Beaumont returns to town. She is the lost love of Bruce Wayne, the billionaire playboy who is Batman's alter ego, and was an integral part of Wayne's decision ten years earlier to don the cape and cowl. Now, she is back in his life and is no less a disruption than the return of his old archenemy, The Joker, who has a stake in seeing the annihilation of this new vigilante, whoever it proves to be.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "modern"
                ], 
                "role": "Lady Killer In Love: Inverted with Bruce. He was genuinely in love with Andrea before he became the womanizer he is in the modern parts of the movie. Then he and Andrea briefly get back together again...", 
                "id": "LadyKillerInLove"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Asian"
                ], 
                "role": "Asian Airhead: One of the girls vying for Bruce's attention at the party at the beginning of the movie.", 
                "id": "AsianAirhead"
            }, 
            {
                "adjectives": [
                    "aware", 
                    "female", 
                    "final"
                ], 
                "role": "Andrea Beaumont from Batman: Mask of the Phantasm combines this trope with being a Femme Fatale Broken Bird.\n Averted in most of the movie, considering that nobody is even aware the Phantasm is female until the final act.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Femme Fatale / Dark Action Girl:  Andrea, upon being revealed to be The Phantasm.", 
                "id": "FemmeFatale"
            }
        ]
    }, 
    "imdbid": "tt0106364", 
    "poster_url": "BatmanMaskOfThePhantasm.jpg", 
    "similar": [
        {
            "shared": [
                "DarkActionGirl", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "LadyKillerInLove", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "LoveInTheAfternoon", 
            "name": "Love in the Afternoon", 
            "poster_url": "LoveInTheAfternoon.jpg"
        }, 
        {
            "shared": [
                "DarkActionGirl", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "DarkActionGirl", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "FasterPussycatKillKill", 
            "name": "Faster Pussycat Kill Kill"
        }, 
        {
            "shared": [
                "DarkActionGirl", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "Lucifer", 
            "name": "Lucifer"
        }
    ], 
    "id": "BatmanMaskOfThePhantasm", 
    "name": "Batman: Mask of the Phantasm"
}