{
    "plot": "Teenager Ethan Wate is obsessed with his urge to finish high school and go on to college in order to leave behind the small town of Gatlin, South Carolina behind, until a mysterious girl begins to inhabit his dreams. When he meets Lena Duchannes, a newcomer who has just enrolled in his school, Ethan knows she is the girl in his dreams. Lena is rejected by the rest of her classmates for being the granddaughter of Macon Ravenwood, whom the town's superstitious residents consider to be a devil-worshiper. But Ethan gives her a ride anyway and they fall in love. Lena reveals to her new boyfriend that she is a witch, and that on her sixteenth birthday she will be claimed by either the forces of light or of darkness. She will remain in the light, but only if she does not remain in love with Ethan. To make matters worse, her evil mother, Sarafine, is casting spells to push Lena to the dark side. Ethan joins her in a search to find a magic spell to save their doomed love. Will the lovers succeed?", 
    "genres": "Drama, Fantasy, Romance", 
    "release_year": "2013", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Alpha Bitch: Savannah Snow, with Emily and Eden as her Girl Posse.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "apparent"
                ], 
                "role": "Evil Matriarch: Sarafine is Lena's mother. Also, the apparent matriarch of the family, Genevieve. Though becoming evil was a spell backfire.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "apparent"
                ], 
                "role": "The Caster Chronicles: Sarafine is Lena's mother.\n Also, the apparent matriarch of the family, Genevieve. Though becoming evil was a spell backfire.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "High"
                ], 
                "role": "High Heel-Face Turn: Ridley.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Witch: The impression most Dark Casters give.", 
                "id": "HotWitch"
            }
        ]
    }, 
    "imdbid": "tt1559547", 
    "poster_url": "BeautifulCreatures.jpg", 
    "similar": [
        {
            "shared": [
                "EvilMatriarch", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "EvilMatriarch", 
                "HotWitch"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "EvilMatriarch", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "TheBaby", 
            "name": "The Baby"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "AnimalHouse", 
            "name": "Animal House", 
            "poster_url": "AnimalHouse.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "HotWitch"
            ], 
            "shared_count": 2, 
            "id": "DeathBecomesHer", 
            "name": "Death Becomes Her"
        }
    ], 
    "id": "BeautifulCreatures", 
    "name": "Beautiful Creatures"
}