{
    "plot": "Belle is a girl who is dissatisfied with life in a small provincial French town, constantly trying to fend off the misplaced \"affections\" of conceited Gaston. The Beast is a prince who was placed under a spell because he could not love. A wrong turn taken by Maurice, Belle's father, causes the two to meet.", 
    "genres": "Animation, Family, Fantasy", 
    "release_year": "1991", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "A Lady on Each Arm: Lumiere mentions this in the Cut Song \"Human Again.\" The two mademoiselles are Mrs. Potts and Babette.", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [
                    "special", 
                    "good"
                ], 
                "role": "Beauty and the Beast : the special edition has the Re Cut song \"Human Again\" in which Lumiere sings that when the spell is broken: \"I'll be cooking again / be good looking again / With a mademoiselle on each arm.\"", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [
                    "temporary"
                ], 
                "role": "Beauty and the Beast has Belle's father Maurice. He invents strange contraptions, gets lost in the woods on his way to a fair, ignores his horse Philippe's instincts to turn back, and ultimately ends up as the Beast's temporary prisoner.\n Speaking of Disney movies, let's not forget Professor Porter, Jane's father in Tarzan, who certainly also falls into this trope.", 
                "id": "AbsentMindedProfessor"
            }, 
            {
                "adjectives": [
                    "Baritone/Guttural", 
                    "odd", 
                    "real", 
                    "various", 
                    "making-of", 
                    "special", 
                    "natural"
                ], 
                "role": "Badass Baritone/Guttural Growler: The Beast again — the thing is pretty odd if we consider that Robby Benson's real voice is more like a tenor (the production crew mixed Benson's lines with the growls of various wild animals). This is mentioned by Benson himself in a making-of special; his natural speaking voice is closer to the Beast's baritone, but directors have constantly asked him to pitch it higher because they think a Tenor Boy would make a better Love Interest. It's actually kind of a shock when he speaks candidly.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [
                    "solid", 
                    "much", 
                    "arrogant"
                ], 
                "role": "The indisputably badass Beast from Beauty and the Beast is a solid baritone role, as is the equally badass (though much more arrogant about it) villain Gaston.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [], 
                "role": "Beast Man: The prince was cursed into this.", 
                "id": "BeastMan"
            }, 
            {
                "adjectives": [], 
                "role": "Carpet of Virility: Gaston.", 
                "id": "CarpetOfVirility"
            }, 
            {
                "adjectives": [
                    "full-on", 
                    "murderous"
                ], 
                "role": "Gaston of Disney's Beauty and the Beast. His Villainous Breakdown begins when he realizes Belle is in love with the Beast, sending him downward into full-on murderous Yandere mode.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Dirty Coward: Gaston resorts to dirty fighting in his battle against the Beast, mocking Beast while he was too depressed to defend himself, then pleading for his life when he finds himself at Beast's mercy. Beast finally lets him go... only for Gaston to stab him In the Back.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [], 
                "role": "In Beauty and the Beast, Chip has a loving mother in Mrs. Potts. But Mr. Potts is never mentioned.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "villainous"
                ], 
                "role": "Beauty and the Beast:\n Gaston is a rare villainous example and goes straight into Testosterone Poisoning territory.\n The Beast in his human form, Prince Adam.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "eligible", 
                    "true", 
                    "blue-eyed", 
                    "stud"
                ], 
                "role": "Hunk: Gaston is the most eligible bachelor in the village for this reason. The bimbettes say he's 'dreamy'. The Beast's true form is a blonde haired, blue-eyed, stud.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "non-school"
                ], 
                "role": "Gaston from Disney's Beauty and the Beast is a non-school example of this.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "kind", 
                    "rude", 
                    "worthy"
                ], 
                "role": "Similarly, Beauty and the Beast shows that France in the 1800s is not kind to a girl like Belle, as everyone considers her crazy for liking to read and back Gaston in his behavior towards her, even though he does things that are rude at best and worthy of a restraining order at most drastic. The only people who consider Belle's opinions or desires are her father, the castle servants, and the Beast.", 
                "id": "NoWomansLand"
            }, 
            {
                "adjectives": [
                    "song", 
                    "lucky", 
                    "egotistical", 
                    "later", 
                    "full-on"
                ], 
                "role": "Gaston from Disney's Beauty and the Beast.\n In the stage version, he even has a song called \"Me\", extolling his greatness and how lucky she is to be the object of his affections. (This is in addition to \"Gaston\" from the film, where the rest of the town extols his virtues, although his plans to marry Belle only come up in the reprise.)\n And as egotistical as he is at the start of it, he gets worse later on in the movie when he goes into full-on Yandere mode threatening to throw her father into the asylum if Belle won't marry him and trying to kill the Beast who he feels is an obstacle to what he sees as his. Asshole indeed.", 
                "id": "PrinceCharmingWannabe"
            }, 
            {
                "adjectives": [
                    "heroic"
                ], 
                "role": "Prince Charming Wannabe: Gaston, towards Belle; he thinks he's a dashing and heroic suitor that will sweep her off her feet. She is less than impressed.", 
                "id": "PrinceCharmingWannabe"
            }, 
            {
                "adjectives": [], 
                "role": "Prince Charming Wannabe: Avenant.", 
                "id": "PrinceCharmingWannabe"
            }, 
            {
                "adjectives": [
                    "actual", 
                    "self-absorbed", 
                    "big"
                ], 
                "role": "Beast from Beauty and the Beast started out this way, largely why the enchantress cursed him.\n Gaston also qualifies as this, despite not being an actual prince (more like an Alpha Male). He's self-absorbed as well as a big Jerkass to everyone in town, including Belle, who he is trying to get to marry him.", 
                "id": "PrinceCharmless"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Prince Charmless: Beast was this before the curse and before Belle came into his life. It's the reason he was cursed in the first place.", 
                "id": "PrinceCharmless"
            }, 
            {
                "adjectives": [
                    "identical"
                ], 
                "role": "Gaston in Disney's Beauty and the Beast. His fangirls appear to be identical triplets.", 
                "id": "SexyManInstantHarem"
            }, 
            {
                "adjectives": [
                    "read—soon"
                ], 
                "role": "Straw Misogynist: It's not right for a woman to read—soon she starts getting ideas... and thinking.", 
                "id": "StrawMisogynist"
            }, 
            {
                "adjectives": [
                    "Gaston/No", 
                    "quick"
                ], 
                "role": "Beauty and the Beast: \"No one's slick as Gaston/No one's quick as Gaston...\"", 
                "id": "TheFightingNarcissist"
            }, 
            {
                "adjectives": [
                    "effeminate"
                ], 
                "role": "The Fighting Narcissist: Gaston is an unusually manly example. He has an rather effeminate pose when he sings about his skills in decorating. Said decorations are all animals he's hunted and killed.", 
                "id": "TheFightingNarcissist"
            }, 
            {
                "adjectives": [], 
                "role": "Walking Shirtless Scene: The Beast spends half the time of the movie wearing only pants and a purple cape.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "willing"
                ], 
                "role": "Belle pulls this trope off again in Kingdom Hearts II when Xaldin kidnaps her and the rose, and forces Beast to choose.  She elbows Xaldin in the gut and grabs the rose before running back.\n Kairi as well, as she sees herself in danger often, but is perfectly willing to fight it with or without a weapon.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "good", 
                    "same"
                ], 
                "role": "Beautiful All Along: The prince transforms back into his handsome human guise. Although when he changed back, it wasn't good enough for Belle, and she had to look into his eyes to see that he was the same person she fell in love with.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Belle in Beauty and the Beast adores her crackpot father Maurice, and vice versa.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Belle pulls this trope off again when Xaldin kidnaps her and the rose, and forces Beast to choose.  She elbows Xaldin in the gut and grabs the rose before running back.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Belle — Beauty and the Beast (1991)", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "feather"
                ], 
                "role": "The maid from Beauty and the Beast, who was transformed into a feather duster. Even moreso in the stage show, where her role is greatly expanded. She was named Babette in the stage adaptation, and named Fifi in the midquel Belle's Magical World.", 
                "id": "FrenchMaid"
            }, 
            {
                "adjectives": [
                    "full", 
                    "maternal"
                ], 
                "role": "Kindly Housekeeper: Mrs. Potts is one of the castle's maids and full of maternal love for everyone. She's the one who roused the kitchen when Belle came down for a snack.", 
                "id": "KindlyHousekeeper"
            }, 
            {
                "adjectives": [], 
                "role": "Mrs. Potts in Beauty and the Beast.", 
                "id": "KindlyHousekeeper"
            }, 
            {
                "adjectives": [
                    "well-endowed"
                ], 
                "role": "In Beauty and the Beast, one of the three the Bimbettes wore a red revealing dress and was pretty well-endowed in her cleavage area.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [
                    "'mad", 
                    "good", 
                    "loyal"
                ], 
                "role": "Beauty and the Beast utilizes this with Belle and her father, with alterations in the form of the 'mad scientist' being a good person (more of a Bungling Inventor, really) and the fact that plot starts because the mad scientist's daughter is loyal to him.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [
                    "musical", 
                    "dead"
                ], 
                "role": "Beauty and the Beast: There is no mention of what happened to Maurice's wife. Not so in the stage musical, which reveals her to be dead and still honoured in the family.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Belle from Beauty and the Beast.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: Belle repeatedly refuses to submit to the Beast and only treats him better when he starts reforming.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "Proper", 
                    "odd", 
                    "well-mannered", 
                    "sophisticated", 
                    "high"
                ], 
                "role": "Proper Lady: For all the village thinking she is odd, Belle is well-mannered, sophisticated and has high morals.", 
                "id": "ProperLady"
            }, 
            {
                "adjectives": [
                    "middle-class", 
                    "feminist", 
                    "gorgeous"
                ], 
                "role": "Belle of Beauty and the Beast is a middle-class example: intelligent, witty, spirited in a subtly feminist way—but still feminine, refined, and gorgeous in a ballgown. Note she was, according to the film's screenwriter, based on Jo March from Little Women.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [
                    "literary", 
                    "middle-class"
                ], 
                "role": "Spirited Young Lady: Belle, with her literary tastes and intelligence, is a middle-class version.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [
                    "tall"
                ], 
                "role": "One wonders how Maurice ended up with tall, slender Belle for a daughter.", 
                "id": "TheUglyGuysHotDaughter"
            }
        ]
    }, 
    "imdbid": "tt0101414", 
    "poster_url": "BeautyAndTheBeast.jpg", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "BeastMan", 
                "CrazyJealousGuy", 
                "MadScientistsBeautifulDaughter", 
                "ALadyOnEachArm", 
                "DaddysGirl", 
                "TheUglyGuysHotDaughter", 
                "DisappearedDad", 
                "TheFightingNarcissist", 
                "EverythingsBetterWithPrincesses", 
                "ProperLady", 
                "DirtyCoward", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 14, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "DamselOutOfDistress", 
                "PrinceCharmless", 
                "TheUglyGuysHotDaughter", 
                "SexyManInstantHarem", 
                "EverythingsBetterWithPrincesses", 
                "DirtyCoward", 
                "BadassDamsel", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 10, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "NoWomansLand", 
                "PrinceCharmless", 
                "DaddysGirl", 
                "EverythingsBetterWithPrincesses", 
                "StrawMisogynist", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "BeastMan", 
                "PrinceCharmless", 
                "EverythingsBetterWithPrincesses", 
                "DamselOutOfDistress", 
                "BadassDamsel", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "Spaceballs", 
            "name": "Spaceballs", 
            "poster_url": "Spaceballs.jpg"
        }, 
        {
            "shared": [
                "DamselOutOfDistress", 
                "PrinceCharmless", 
                "SpiritedYoungLady", 
                "EverythingsBetterWithPrincesses", 
                "Hunk", 
                "PluckyGirl"
            ], 
            "shared_count": 6, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }
    ], 
    "id": "BeautyAndTheBeast", 
    "name": "Beauty and the Beast"
}