{
    "plot": "In 1974, Marty Bronson builds the Sunny Vista Motel in Los Angeles, California, with the intention of raising his son Skeeter and his daughter Wendy in the place where he works. However he is not a good businessman and the hotel goes bankrupt. Marty is forced to sell his motel to Barry Nottingham that promises to hire Skeeter in a general manager position when he grown up. Years later, Barry builds a new hotel; forgets his promise to Marty; and Skeeter Bronson is only the handyman of his hotel. The general manager is the arrogant Kendall, who is engaged with the shallow Barry's daughter Violet Nottingham. When the Webster Elementary School where Wendy is the principal will be closed to be demolished, she needs to travel to Arizona for a job interview. Wendy asks her friend Jill, who is teacher in the same school, to watch her son Patrick and her daughter Bobbi during the day and Skeeter to watch them during the night. Skeeter meets the estranged kids with his best friend Mickey and makes up bedtime stories to help them to sleep but the kids add details to the stories, changing their endings. Soon Skeeter realizes that the plot of the stories are coming true and affecting his life. Meanwhile Barry Nottingham decides to give a change to Skeeter to dispute the manager position in his new hotel with Kendall like in one of his stories. But Skeeter has told to his nephew and his niece that stories do not have happy endings.", 
    "genres": "Comedy, Family, Fantasy", 
    "release_year": "2008", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Spoiled Sweet: Violet Nottingham.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0960731", 
    "poster_url": "BedtimeStories.jpg", 
    "similar": [
        {
            "shared": [
                "SpoiledSweet"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet"
            ], 
            "shared_count": 1, 
            "id": "MaidInManhattan", 
            "name": "Maid In Manhattan", 
            "poster_url": "MaidInManhattan.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet"
            ], 
            "shared_count": 1, 
            "id": "ComingToAmerica", 
            "name": "Coming to America", 
            "poster_url": "ComingToAmerica.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet"
            ], 
            "shared_count": 1, 
            "id": "Lincoln", 
            "name": "Lincoln", 
            "poster_url": "Lincoln.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet"
            ], 
            "shared_count": 1, 
            "id": "Stardust", 
            "name": "Stardust", 
            "poster_url": "Stardust.jpg"
        }
    ], 
    "id": "BedtimeStories", 
    "name": "Bedtime Stories"
}