{
    "plot": "Ella Peterson is a Brooklyn telephone answering service operator who tries to improve the lives of her clients by passing along bits of information she hears from other clients. She falls in love with one of her clients, the playwright Jeffrey Moss, and is determined to meet him. The trouble is, on the phone to him, she always pretends to be an old woman whom he calls \"Mom.\"", 
    "genres": "Comedy, Musical, Romance", 
    "release_year": "1960", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "washed-up"
                ], 
                "role": "In Bells Are Ringing, Ella Peterson steps into and improves the lives of three clients of the telephone answering service she works for. She helps a dentist realize his ambitions to become a songwriter, makes a washed-up Brando wannabe actor stop mumbling, buy a suit and get a part, and a struggling playwright overcome his Writer's Block and, incidentally, fall in love with her.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "washed-up", 
                    "shy", 
                    "normal", 
                    "behind", 
                    "quirky", 
                    "perspective", 
                    "well-rounded", 
                    "interesting", 
                    "standard"
                ], 
                "role": "Manic Pixie Dream Girl: Ella Peterson steps into and improves the lives of three clients of the telephone answering service she works for. She helps a dentist realize his ambitions to become a songwriter, makes a washed-up Brando wannabe actor stop mumbling, buy a suit and get a part, and a struggling playwright overcome his Writer's Block and, incidentally, fall in love with her. However, Ella is too shy and withdrawn to help all these people openly, so she has to use fake names and act very differently around them. She's smitten with Jeffrey Moss (Plaza 0-4433), but even though she's worried about his prospects as a writer, she can't talk to him like a normal person and instead tries to help him out from behind the scenes. Even once they start dating, she continues to use a fake name. Ella may be quirky and flit in and out of men's lives, charming them and solving their problems, but because the play is told from her perspective, she comes off as more well-rounded and interesting than your standard MPDG. It is, in the end, her story, not anyone else's.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt0053645", 
    "poster_url": "BellsAreRinging.jpg", 
    "similar": [
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Lo", 
            "name": "Lo"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "LAStory", 
            "name": "LA Story"
        }
    ], 
    "id": "BellsAreRinging", 
    "name": "Bells Are Ringing"
}