{
    "plot": "The story of Ben Tennyson, a typical kid who becomes very atypical after he discovers the Omnitrix, a mysterious alien device with the power to transform the wearer into ten different alien species.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "2005–2008", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Grandpa: Max Tennyson.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "'em", 
                    "old", 
                    "full", 
                    "original", 
                    "accidental", 
                    "human", 
                    "many"
                ], 
                "role": "Ben 10:\n Max Tennyson. Bonus points in that at least two of 'em (Xylene and Verdona, the latter of whom is Ben and Gwen's grandmother) were extraterrestrials. Even better, he's still got it even as an old man. And it's implied that that's not even the full story!\n Ben himself wasn't one in the original series, but the sequels, especially Ultimate Alien and Omniverse, allow him to get some as well. He has attracted the attention of Julie Yamamoto (until they decide to move down to \"just friends\" in Omniverse), Eunice, Elena Validus, Jennifer Nocturne ([[spoiler:though for publicity), Ester, Princess Attea, and even ended up accidental fiancé to a Tetramand princess. It seems he has more luck attracting aliens than he does human girls, like his grampa (Rook even asks how many girls Ben has in his life during \"Rules of Engagement\", to which Ben replies he has no clue).\n Ben is stunned to find out that Rook was one of these on his home world.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "former", 
                    "old", 
                    "old", 
                    "loveable", 
                    "same", 
                    "awesome"
                ], 
                "role": "Grandpa Max from Ben 10, especially after he's revealed to be a former Man in Black who remembers quite a bit from his old job and still has access to his old gear. Generally of the \"dated but loveable personality\" type, but swings into \"no nonsense\" when the situation calls for it... In a nutshell, he's a textbook case.\n He's the same guy who bosses Snake around, making him even more awesome.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "'Omniverse"
                ], 
                "role": "Ben 10 con-artists Argit and Simian, although Simian can and will fight if backed into a corner.\n Ben calls Malware out on being this in 'Omniverse' when Malware sends a gasoline tanker at a busload of innocent children just to escape Ben.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Grandpa Max towards Ben and Gwen. Ben himself in the future, where his son Kenny is concerned.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "very", 
                    "first", 
                    "typical", 
                    "Chthulu-inspired"
                ], 
                "role": "The way Vilgax of Ben 10 is designed makes his tentacles look somewhat like a beard. However, you'll only notice this in the very first episode, because for most of the series he wears a breathing mask, making him look like a typical Chthulu-inspired character.", 
                "id": "WeirdBeard"
            }, 
            {
                "adjectives": [
                    "dubious", 
                    "second", 
                    "much", 
                    "complete", 
                    "several", 
                    "white", 
                    "opposite"
                ], 
                "role": "It's probably a matter of opinion, but Ben 10's Albedo isn't particularly bishonen, though he is morally dubious enough to build a second Omnitrix against his master's wishes and beat up hordes of Forever Knights looking for Ben, complain directly to a cook how much he loathes the Earth food he finds himself compelled to eat, make a laughably dumb attempt to convince Gwen that he is Ben (complete with several instances of \"I, Ben Tennyson...\"), and try to take Ben's Omnitrix by force. Then again, he doesn't get the white hair until the end of the episode (probably just to look like Ben's opposite), which may indicate an intended reappearance.", 
                "id": "WhiteHairedPrettyBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Gwen, sometimes. More so in the future.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "A waitress who helps the gang out in the Ben 10 episode \"Ben 4 Good Buddy\".", 
                "id": "ApronMatron"
            }, 
            {
                "adjectives": [
                    "Hot-Blooded", 
                    "Ax-Crazy"
                ], 
                "role": "Biker Babe: Rojo, who's also a Hot-Blooded (bordering on Ax-Crazy) Badass Biker.", 
                "id": "BikerBabe"
            }, 
            {
                "adjectives": [
                    "original"
                ], 
                "role": "The villainess Rojo in the original Ben 10 series.", 
                "id": "BikerBabe"
            }, 
            {
                "adjectives": [], 
                "role": "Black Magician Girl: Charmcaster.", 
                "id": "BlackMagicianGirl"
            }, 
            {
                "adjectives": [
                    "forceful", 
                    "evil", 
                    "loved", 
                    "hard", 
                    "sorry"
                ], 
                "role": "Charmcaster from Ben 10. She's got the brash, forceful personality down; but unlike most examples listed, she's a villain.\n As of the Ultimate Alien, that status gets somewhat blurred. (Basically, we find out that Even Evil Has Loved Ones... about ten minutes before we find out that evil with loved ones is still evil. It's still hard to not feel sorry for her.)", 
                "id": "BlackMagicianGirl"
            }, 
            {
                "adjectives": [
                    "non-humanoid", 
                    "true", 
                    "human", 
                    "attractive", 
                    "purple-skinned", 
                    "true"
                ], 
                "role": "Cute Monster Girl: In \"My Big Fat Alien Wedding\" the majority of the shapeshifting aliens are very ugly non-humanoid sludge monsters in their true form. The non-evil one (who's marrying a human) oddly looks like a fairly attractive purple-skinned woman in her true form. Despite being the daughter of the episode's villains.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Charmcaster has this sort of relationship with her uncle Hex in Ben 10.", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Daddy's Little Villain: Charmcaster to Hex (though it's more of a case of Uncle's Little Villain).", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Dark Action Girl: Rojo", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "third", 
                    "Ultimate", 
                    "whole", 
                    "evil", 
                    "enough", 
                    "free", 
                    "tyrannical", 
                    "killed", 
                    "typical", 
                    "later", 
                    "insistent"
                ], 
                "role": "Charmcaster from Ben 10, the antithesis to Magical Girl Gwen. In the third series, Ben 10: Ultimate Alien, it turns out that  her whole motive for being evil is to gain enough power to free her home dimension from a tyrannical being that killed her parents and left her lonely and bitter. She ends up developing a typical Magical Girl-Dark Magical Girl bond with Gwen as well, and even when she relapses later, Gwen is still insistent on helping her toward goodness.", 
                "id": "DarkMagicalGirl"
            }, 
            {
                "adjectives": [
                    "normal", 
                    "evil", 
                    "abusive", 
                    "evil", 
                    "sexy"
                ], 
                "role": "Dark Magical Girl: Played with in regards to Charmcaster. She does sincerely have the background of a normal DMG (raised and trained by an evil, abusive guardian,) but she actually chooses to be evil rather than join her Magical Girl counterpart. Since, you know, Evil Is Cool (not to mention sexy.)", 
                "id": "DarkMagicalGirl"
            }, 
            {
                "adjectives": [
                    "fair", 
                    "male", 
                    "popular", 
                    "similar"
                ], 
                "role": "Ben 10 and its sequel are both aimed at preteen boys, but the shows have garnered a fair amount of teenage-and-up female fans. Some of them enjoy the show as an entity, but others just watch it for one of the male characters (or for the Shipping…). Kevin is the most popular (particularly when he grows up), but some girls prefer Grandpa Max. This seems to be a recurring theme for Man of Action, with similar fanbase for Generator Rex and one already developing for Ultimate Spider-Man.", 
                "id": "EstrogenBrigade"
            }, 
            {
                "adjectives": [
                    "purple-skinned", 
                    "later", 
                    "literal", 
                    "Green-Skinned", 
                    "alien", 
                    "human", 
                    "actual", 
                    "green", 
                    "skinned"
                ], 
                "role": "Grandpa Max of Ben 10 married and had a family with a purple-skinned Energy Being (who hides it well), and later dated a literal Green-Skinned Space Babe.\n Ben himself seems to have more luck with alien girls than human ones, and like his Grandpa he has caught the eye of an actual green skinned alien, a princess at that.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "Green-Skinned", 
                    "Non-Mammal", 
                    "young", 
                    "own"
                ], 
                "role": "Green-Skinned Space Babe: Xylene. With Non-Mammal Mammaries, even after she states that her race does not take care of their young at all (\"On my planet, once you hatch, you're on your own.\")", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [], 
                "role": "Ben 10 Ben's cousin Gwen (and to a lesser extent, her Evil Counterpart Charmcaster). Not so much in Ben 10: Alien Force, where they have both grown up considerably.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Gwen from Ben 10", 
                "id": "MagicalGirl"
            }, 
            {
                "adjectives": [
                    "Magical"
                ], 
                "role": "Magical Girl: Gwen.", 
                "id": "MagicalGirl"
            }, 
            {
                "adjectives": [
                    "original", 
                    "full", 
                    "other"
                ], 
                "role": "Ben 10: In both the original and Alien Force shows, Ben's mother generally does not appear. In Race Against Time, the Live Action Movie, she actually appears full body. We see her hands washing dishes in Ben 10: Alien Force, but other than that, she's mostly absent.\n We see more than her hands. We see the rest of her when she and her husband found out about Ben going alien.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Charmcaster from Ben 10 is a silver haired sorceress.", 
                "id": "WhiteHairedPrettyGirl"
            }, 
            {
                "adjectives": [
                    "villainous"
                ], 
                "role": "Wrench Wench: Road Crew member Turbine is a villainous version.", 
                "id": "WrenchWench"
            }
        ]
    }, 
    "imdbid": "tt0760437", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa", 
                "DarkMagicalGirl", 
                "WhiteHairedPrettyGirl", 
                "BikerBabe", 
                "MagicalGirl", 
                "WrenchWench", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "ApronMatron", 
                "CoolOldGuy", 
                "DarkActionGirl", 
                "DirtyCoward", 
                "LittleMissBadass", 
                "WrenchWench", 
                "MissingMom"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "DarkActionGirl", 
                "EstrogenBrigade", 
                "WeirdBeard", 
                "DirtyCoward", 
                "CuteMonsterGirl"
            ], 
            "shared_count": 6, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "CoolOldGuy", 
                "PapaWolf", 
                "EstrogenBrigade", 
                "GreenSkinnedSpaceBabe", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "CuteMonsterGirl", 
                "ChickMagnet", 
                "GreenSkinnedSpaceBabe", 
                "WeirdBeard", 
                "DirtyCoward"
            ], 
            "shared_count": 5, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "Ben10", 
    "name": "Ben 10"
}