{
    "plot": "The duke of York, nicknamed Bertie, was born as royal 'spare heir', younger brother to the prince of Wales, and thus expected to spend a relatively private life with his Scottish wife Elisabeth Bowes-Lyon and their daughters, in the shadow of their reigning father, George V, and next that of his elder brother who succeeded to the British throne as Edward VIII. However Edward decides to put his love for a divorced American, Wallis Simpson, above dynastic duty, and ends up abdicating the throne, which now falls to Bertie, who reigns as George VI. Now he expects to be, as constitutional monarch, little more then a figure head, but again faith has more in store for him: Nazi Germany proves such a formidable war challenger to the British Empire that the nearly desperate nation looks to its royal couple as comforting symbol of the unbroken spirit, a part they play with great success, while hosting chased monarchs and governments from continental Europe. After victory, life returns to normal, but pulmonary disease soon ends George's, leaving the throne to his still young firstborn, queen Elisabeth II.", 
    "genres": "Drama", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "The Wise Prince: George VI", 
                "id": "TheWisePrince"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "But Lizzy jr. and her sister look gorgeous. Because Everything's Better with Princesses.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Lady of War: Invoked. Elizabeth is shown doing a Take That against Britain's enemies by having four targets painted with a Dartboard of Hate (two with swastikas, two with a cartoon Hitler), for her to take pistol practice on them.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Bear: Subverted. Elizabeth decides without batting an eyelash that her children have to stay during the Blitz. But then her job was to be Britain's Mama Bear.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "The Masterpiece Theater production Bertie and Elizabeth is a romance about a marriage between a Wise Prince (George VI) and The Woman Wearing A Queenly Mask (the Queen Mum) sharing The Chains of Commanding during World War II.", 
                "id": "TheWomanWearingTheQueenlyMask"
            }, 
            {
                "adjectives": [], 
                "role": "The Woman Wearing The Queenly Mask: Elizabeth", 
                "id": "TheWomanWearingTheQueenlyMask"
            }
        ]
    }, 
    "imdbid": "tt0310733", 
    "similar": [
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "LadyOfWar", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "TheWomanWearingTheQueenlyMask", 
                "EverythingsBetterWithPrincesses", 
                "LadyOfWar"
            ], 
            "shared_count": 3, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }, 
        {
            "shared": [
                "TheWomanWearingTheQueenlyMask", 
                "EverythingsBetterWithPrincesses", 
                "LadyOfWar"
            ], 
            "shared_count": 3, 
            "id": "Elizabeth", 
            "name": "Elizabeth", 
            "poster_url": "Elizabeth.jpg"
        }, 
        {
            "shared": [
                "TheWomanWearingTheQueenlyMask", 
                "LadyOfWar", 
                "TheWisePrince"
            ], 
            "shared_count": 3, 
            "id": "PrincessMononoke", 
            "name": "Princess Mononoke", 
            "poster_url": "PrincessMononoke.jpg"
        }, 
        {
            "shared": [
                "TheWomanWearingTheQueenlyMask", 
                "EverythingsBetterWithPrincesses"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }
    ], 
    "id": "BertieAndElizabeth", 
    "name": "Bertie and Elizabeth"
}