{
    "plot": "Detroit cop Axel Foley is delighted when he receives a surprise visit from his best friend Mikey Tandino, who lives in California. Not long after Mikey arrives in Detroit, Mikey is killed, right in front of Axel, by a man named Zack. Axel follows Zack to Beverly Hills, California, where Beverly Hills police department Lieutenant Andrew Bogomil assigns Detective Billy Rosewood and Rosewood's partner, Sergeant John Taggart, to keep an eye on Axel. Axel visits his friend Jenny Summers, who works in an art gallery. With Jenny's help, Axel discovers that Zack works for Jenny's boss, Victor Maitland, the man who owns the art gallery. Maitland is a drug kingpin who is using the gallery as a front, and Maitland had Zack kill Mikey after Maitland accused Mikey of stealing some of Maitland's bonds. With the help of Jenny, Billy, and Taggart, Axel does what he can to make sure Maitland and Zack won't kill any more people.", 
    "genres": "Action, Comedy, Crime", 
    "release_year": "1984", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Karla Fry from Beverly Hills Cop II (mentioned in the quote above), portrayed by Brigitte Nielsen, a Statuesque Stunner herself.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "tall"
                ], 
                "role": "Statuesque Stunner: Karla Fry, portrayed by Brigitte Nielsen. This is called out by all the protagonists, and her presence at one of the robberies is a plot point, as everyone remembers the \"tall blonde\".", 
                "id": "StatuesqueStunner"
            }
        ]
    }, 
    "imdbid": "tt0086960", 
    "poster_url": "BeverlyHillsCop.jpg", 
    "similar": [
        {
            "shared": [
                "StatuesqueStunner"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "StatuesqueStunner"
            ], 
            "shared_count": 1, 
            "id": "ALeagueOfTheirOwn", 
            "name": "A League of Their Own", 
            "poster_url": "ALeagueOfTheirOwn.jpg"
        }, 
        {
            "shared": [
                "StatuesqueStunner"
            ], 
            "shared_count": 1, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }, 
        {
            "shared": [
                "StatuesqueStunner"
            ], 
            "shared_count": 1, 
            "id": "SupermanBatmanApocalypse", 
            "name": "Superman/Batman: Apocalypse", 
            "poster_url": "SupermanBatmanApocalypse.jpg"
        }, 
        {
            "shared": [
                "StatuesqueStunner"
            ], 
            "shared_count": 1, 
            "id": "TheSisterhoodOfTheTravelingPants", 
            "name": "The Sisterhood of the Traveling Pants", 
            "poster_url": "TheSisterhoodOfTheTravelingPants.jpg"
        }
    ], 
    "id": "BeverlyHillsCop", 
    "name": "Beverly Hills Cop"
}