{
    "plot": "Mio's death leaves husband Takumi and 6 year old son Yuji fending for themselves. Taku occasionally suffers fainting spells, is disorganized, and fears that his health hindered Mio's happiness. Yuji overheard relatives speculate that his delivery compromised her health, and he blames himself for her death. Mio left him a picture book in which she departs for \"The Archive Star\" but re-appears during the rainy season the following year, and he eagerly awaits her return. Taking a walk in the forest outside their house, Taku and Yuji find a woman sheltering from the rain and immediately accept her as Mio. She has no memory or sense of identity, but comes home to live with them anyway. She asks Taku how they met and fell in love, and he recounts a tale of years of missed chances starting in high school until she encouraged their marriage years later. As the rainy season nears its end, Yuji finds the \"time capsule\" he hid with his mother before her death. Mio's diary is inside, and its version of the romance holds the answers to the mystery.", 
    "genres": "Drama, Fantasy, Romance", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "grief"
                ], 
                "role": "Men Can't Keep House: Although grief might have something to do with it.", 
                "id": "MenCantKeepHouse"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Missing Mom: Mio, of course.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0442268", 
    "poster_url": "BeWithYou.jpg", 
    "similar": [
        {
            "shared": [
                "MenCantKeepHouse", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheSevenDwarfs", 
            "name": "Snow White and the Seven Dwarfs"
        }, 
        {
            "shared": [
                "MenCantKeepHouse", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "BillAndTed", 
            "name": "Bill & Ted"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MenCantKeepHouse"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "IndependenceDay", 
            "name": "Independence Day", 
            "poster_url": "IndependenceDay.jpg"
        }
    ], 
    "id": "BeWithYou", 
    "name": "Be With You"
}