{
    "plot": "In a land of living machines, two young ones are chosen to seek the legendary Mask of Light to reveal the savior of all the lands from the dark forces of the Makuta. During the course of their adventure, they will call on the heroes of their people, the great Toa. These Toa, masters of nature's forces such as Fire, Wind, Earth & Water, try to protect the chosen ones as they seek their destiny.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "likely", 
                    "due"
                ], 
                "role": "Krekka and Nocturn in BIONICLE, likely also Reidak, but he may be Obfuscating Stupidity. Carapar has shown shades of this due to the effects of being regularly hypnotized by Takadox for centuries.", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [
                    "handsome", 
                    "invisible"
                ], 
                "role": "The Charmer: According to Jerbraz, he was one of the Order of Mata Nui's \"most handsome and dashing\" members, before he was rendered permanently invisible following an accident. Now he has to get by on just charm.", 
                "id": "TheCharmer"
            }, 
            {
                "adjectives": [
                    "cave-dwelling", 
                    "Onu-Matoran", 
                    "entire"
                ], 
                "role": "In BIONICLE, the cave-dwelling Onu-Matoran are an entire tribe of these.", 
                "id": "TunnelKing"
            }, 
            {
                "adjectives": [
                    "cave-dwelling", 
                    "Onu-Matoran", 
                    "entire"
                ], 
                "role": "Tunnel King: the cave-dwelling Onu-Matoran are an entire tribe of these.", 
                "id": "TunnelKing"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Clingy Jealous Girl: Vhisola to Nokama. This escalated to higher levels when Nokama became a Toa.", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [
                    "energetic", 
                    "ninja-like", 
                    "robotic"
                ], 
                "role": "Lariska from BIONICLE is an energetic ninja-like bounty hunter/assassin. The leader of the Dark Hunter organization could only keep her in check by cutting off her left arm as punishment, replacing it with a robotic one. Not really a Punch Clock Villain, as she will work for the good guys, but not enjoy it. Sadly, we don't know what she looks like.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "pharaoh-beard"
                ], 
                "role": "BIONICLE: Toa Hahli in her Inika form wore a mask that had breathing tubes forming a mustache and a goatee, and Macku had a pharaoh-beard on her mask.", 
                "id": "GirlsWithMoustaches"
            }, 
            {
                "adjectives": [
                    "many", 
                    "female", 
                    "trope-fitting", 
                    "similar", 
                    "queen"
                ], 
                "role": "In one of BIONICLE's many side-dimensions, Toa Tuyet, a corrupted female Toa managed to take over the world, turning it upside-down. While not necessarily a \"queen\", she did rule over her universe with a trope-fitting evilness. And if her plan had succeeded, probably Roodaka would have become something similar — but with the official title of a queen.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Gresh", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0369281", 
    "poster_url": "Bionicle.jpg", 
    "similar": [
        {
            "shared": [
                "ClingyJealousGirl", 
                "TheChick", 
                "TheCharmer"
            ], 
            "shared_count": 3, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "TheCharmer", 
                "DarkActionGirl"
            ], 
            "shared_count": 3, 
            "id": "ResidentEvil", 
            "name": "Resident Evil", 
            "poster_url": "ResidentEvil.jpg"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "DumbMuscle"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "DarkActionGirl"
            ], 
            "shared_count": 2, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "DumbMuscle"
            ], 
            "shared_count": 2, 
            "id": "BarbieAndTheMagicOfPegasus", 
            "name": "Barbie And The Magic Of Pegasus", 
            "poster_url": "BarbieAndTheMagicOfPegasus.jpg"
        }
    ], 
    "id": "Bionicle", 
    "name": "BIONICLE"
}