{
    "plot": "Nina (Portman) is a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her obsessive former ballerina mother Erica (Hershey) who exerts a suffocating control over her. When artistic director Thomas Leroy (Cassel) decides to replace prima ballerina Beth MacIntyre (Ryder) for the opening production of their new season, Swan Lake, Nina is his first choice. But Nina has competition: a new dancer, Lily (Kunis), who impresses Leroy as well. Swan Lake requires a dancer who can play both the White Swan with innocence and grace, and the Black Swan, who represents guile and sensuality. Nina fits the White Swan role perfectly but Lily is the personification of the Black Swan. As the two young dancers expand their rivalry into a twisted friendship, Nina begins to get more in touch with her dark side - a recklessness that threatens to destroy her.", 
    "genres": "Drama, Mystery, Thriller", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old"
                ], 
                "role": "There's also the old guy on the train who starts masturbating to Nina.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [
                    "possible", 
                    "romantic", 
                    "same", 
                    "likely", 
                    "similar"
                ], 
                "role": "Disappeared Dad: Nina's father is never seen. He's only mentioned indirectly; when discussing Thomas' possible romantic pursuit of Nina, Erica states \"I don't want you to make the same mistake I did\". He was/is most likely working in ballet, quite possibly even in a position similar to Thomas'.", 
                "id": "DisappearedDad"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Alpha Bitch: Veronica has shades of this.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Broken Bird: Nina again. Sometimes literally... maybe. Beth and possibly Erica could count as this as well.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Big Sis: Lily tries to get Nina to open up and become friends with her, and also escape her mother's influence.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "perfect"
                ], 
                "role": "Fragile Flower: There's a reason Thomas says Nina is perfect for Odette, the White Swan.", 
                "id": "FragileFlower"
            }, 
            {
                "adjectives": [
                    "similar"
                ], 
                "role": "A similar scene occurred in Black Swan.", 
                "id": "GirlsLoveStuffedAnimals"
            }, 
            {
                "adjectives": [], 
                "role": "Girls Love Stuffed Animals: As part of her downward spiral into madness Nina throws all of her stuffed animals in the trash.", 
                "id": "GirlsLoveStuffedAnimals"
            }, 
            {
                "adjectives": [], 
                "role": "Haunted Heroine", 
                "id": "HauntedHeroine"
            }, 
            {
                "adjectives": [], 
                "role": "Lipstick Lesbian: Lily and Nina. Or is it?", 
                "id": "LipstickLesbian"
            }, 
            {
                "adjectives": [
                    "whole", 
                    "beautiful"
                ], 
                "role": "Black Swan: Explains the whole plot of the ballet, and juxtaposes beautiful but sexually repressed Natalie Portman vs. smoldering sexpot Mila Kunis.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [
                    "Madonna-Whore", 
                    "oh-so-much"
                ], 
                "role": "Madonna-Whore Complex: Deconstructed, oh-so-much.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [
                    "conservative"
                ], 
                "role": "Ms. Fanservice: Lily embodies sex in everything she does in order to contrast with the sexually repressed and overly conservative Nina.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "My Beloved Smother: Nina's mother, Erica.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [], 
                "role": "Nina's mother in Black Swan who cripples her daughter's development by her overbearing parenting style and interference.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "paranoid", 
                    "schizophrenic", 
                    "such", 
                    "psychotic", 
                    "difficult", 
                    "violent", 
                    "perspective", 
                    "impossible", 
                    "real", 
                    "notable"
                ], 
                "role": "Nina Sayers from Black Swan (2010) seems to be a paranoid schizophrenic, and is as such psychotic, but definitely not psychopathic. She is clearly sexually attracted to Lily, although whether they actually ever have sex, or whether that was Nina's delusion, is difficult to know, as is whether she is violent toward anyone but herself, since the story is told from her perspective, making it impossible for the audience to know what is real and what are Nina's delusions. She is arguably, then, a notable deconstruction of this trope.", 
                "id": "PsychoLesbian"
            }, 
            {
                "adjectives": [
                    "main"
                ], 
                "role": "Erica Sayers of Black Swan, the smothering mother of the main character, who has a lot of issues.", 
                "id": "StageMom"
            }, 
            {
                "adjectives": [], 
                "role": "Stage Mom: Erica.", 
                "id": "StageMom"
            }, 
            {
                "adjectives": [
                    "virginal", 
                    "very", 
                    "old"
                ], 
                "role": "Black Swan: Nina is the (possibly literally) virginal maiden; her mom is obviously the mother, and Beth the retiring prima ballerina is the very bitter \"crone\" (by ballet standards she's old — she's like in her thirties).", 
                "id": "TheHecateSisters"
            }, 
            {
                "adjectives": [], 
                "role": "The Hecate Sisters: Nina (maiden), Erica (mother), Beth (crone).", 
                "id": "TheHecateSisters"
            }, 
            {
                "adjectives": [
                    "straight", 
                    "first", 
                    "clear", 
                    "unhappy", 
                    "good", 
                    "insane"
                ], 
                "role": "The Ingenue: Deconstructed. Nina appears to be a straight example, at first, but it soon becomes clear that she's still deeply unhappy with her \"good girl\" life. Also, absolutely insane.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [], 
                "role": "The Ophelia", 
                "id": "TheOphelia"
            }, 
            {
                "adjectives": [], 
                "role": "The Vamp: The Black Swan character embodies this trope. Nina might have to get in touch with her inner Vamp to pull off the role. Is Lily this trope naturally or is that just how Nina sees her?", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [
                    "titular", 
                    "worth"
                ], 
                "role": "Lily of Black Swan, who is in competition for the role of the titular Black Swan with the protagonist, Nina, who is a Woman in White. The movie milks this for all it's worth.", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [], 
                "role": "Nina of Black Swan, in contrast to Lily's Woman in Black.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "White/Woman"
                ], 
                "role": "Woman in White/Woman in Black: Nina and Lily, respectively. Later, they switch.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0947798", 
    "poster_url": "BlackSwan.jpg", 
    "similar": [
        {
            "shared": [
                "PsychoLesbian", 
                "GirlsLoveStuffedAnimals", 
                "LipstickLesbian", 
                "TheOphelia", 
                "TheIngenue", 
                "HauntedHeroine"
            ], 
            "shared_count": 6, 
            "id": "TheMothDiaries", 
            "name": "The Moth Diaries", 
            "poster_url": "TheMothDiaries.jpg"
        }, 
        {
            "shared": [
                "MadonnaWhoreComplex", 
                "DisappearedDad", 
                "MsFanservice", 
                "BrokenBird", 
                "HauntedHeroine"
            ], 
            "shared_count": 5, 
            "id": "DarkShadows", 
            "name": "Dark Shadows", 
            "poster_url": "DarkShadows.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "DisappearedDad", 
                "TheIngenue", 
                "TheVamp", 
                "DirtyOldMan"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "PsychoLesbian", 
                "AlphaBitch", 
                "WomanInWhite", 
                "HauntedHeroine"
            ], 
            "shared_count": 5, 
            "id": "Rebecca", 
            "name": "Rebecca", 
            "poster_url": "Rebecca.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "CoolBigSis", 
                "TheIngenue", 
                "MsFanservice", 
                "WomanInWhite"
            ], 
            "shared_count": 5, 
            "id": "SuckerPunch", 
            "name": "Sucker Punch", 
            "poster_url": "SuckerPunch.jpg"
        }
    ], 
    "id": "BlackSwan", 
    "name": "Black Swan"
}