{
    "plot": "Action/war drama based on the best-selling book detailing a near-disastrous mission in Somalia on October 3, 1993. On this date nearly 100 U.S. Army Rangers, commanded by Capt. Mike Steele, were dropped by helicopter deep into the capital city of Mogadishu to capture two top lieutenants of a Somali warlord. This lead to a large and drawn-out firefight between the Rangers and hundreds of Somali gunmen, leading to the destruction of two U.S. Black Hawk helicopters. This film focuses on the heroic efforts of various Rangers to get to the downed black hawks, centering on Sgt. Eversmann, leading the Ranger unit Chalk Four to the first black hawk crash site, Warrant Officer Durant who was captured after being the only survivor of the second black hawk crash, as well as many others who were involved.", 
    "genres": "Drama, History, Thriller", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "late"
                ], 
                "role": "Bash Brothers: Grimes and Sanderson develop this relationship. Twombly and Nelson are forced into it when the convoy leaves without them. And of course, the kings of this trope are the late Shughart and Gordon.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "live", 
                    "hilarious-slash-Tear", 
                    "clear", 
                    "minor"
                ], 
                "role": "In Black Hawk Down and Real Life, the two Medal of Honor winning snipers, Randy Shughart and Gary Gordon live, breathe,  and die this trope. From their hilarious-slash-Tear Jerker Chess game, which they never manage to finish, to their exchange of looks before they both deploy to aid the downed Night Stalker, the film makes the friendship of the two remarkably clear for two fairly minor characters.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "American", 
                    "own", 
                    "opposite", 
                    "Laser-Guided", 
                    "american"
                ], 
                "role": "Child Soldiers: One tries to shoot an American soldier, who conveniently slips at the right moment, causing the kid to shoot his own father who was standing on the opposite side of the doorway. Laser-Guided Karma: Remember that the father emptied a clip into the home of a mother and his kids who were all huddled up in fright. He inexcusably put them in danger by doing that just to get at the american.", 
                "id": "ChildSoldiers"
            }
        ]
    }, 
    "imdbid": "tt0265086", 
    "poster_url": "BlackHawkDown.jpg", 
    "similar": [
        {
            "shared": [
                "ChildSoldiers", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "TheLordOfTheRings", 
            "name": "The Lord of the Rings", 
            "poster_url": "TheLordOfTheRings.jpg"
        }, 
        {
            "shared": [
                "ChildSoldiers", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "ChildSoldiers", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "PacificRim", 
            "name": "Pacific Rim", 
            "poster_url": "PacificRim.jpg"
        }, 
        {
            "shared": [
                "BashBrothers"
            ], 
            "shared_count": 1, 
            "id": "KamenRider", 
            "name": "Kamen Rider"
        }, 
        {
            "shared": [
                "BashBrothers"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "BlackHawkDown", 
    "name": "Black Hawk Down"
}