{
    "plot": "Miguel, a young man with a horribly disfigured face, goes on a rampage at a masquerade party and rapes a girl. He then brutally hacks up the young woman with a pair of scissors. Miguel is institutionalized at a mental asylum for five years. Afterward, he is released into the care of his sister, Manuela. Along with their wheelchair bound mother, they operate a boarding school for young woman, called Europe's International Youth-Club Boarding School of Languages, on the Spanish resort of Costa Del Sol. Miguel is intrigued by Angela, a long-haired brunette, whom he first saw on the train ride from the sanitarium. The creepy Miguel follows her around. Miguel meets with Manuela to request that they resume their incestuous relationship. She reminds him that it was this relationship that made him emotionally unstable five years earlier. She says they cannot because nobody understands them: \"Only if we could get rid of everyone, then things could go back to the way they were.\" Then Angela's friends are killed one by one. One, while topless, is skewered from behind by a 12-inch knife that exits her right nipple. Another is coerced by a romantic masked Spaniard who insists on tying her up in an abandoned lumber mill (which according to her is \"kinky,\" but OK) and is decapitated quite nicely with a large power saw, complete with squirting blood from her neck. A young boy is run over mid-section by a Mercedes. Another friend is strangled by smoldering fireplace tongs. There is also the real decapitation of a snake. When the girls start to turn up missing, nobody believes Angela that there's a killer on the loose. She had seen the corpse of one girl, and it was gone as soon as she went for help. Confused and scared, Angela finally looks for help from the people who run the school.", 
    "genres": "Horror", 
    "release_year": "1981", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Final"
                ], 
                "role": "Final Girl: Angela.", 
                "id": "FinalGirl"
            }
        ]
    }, 
    "imdbid": "tt0083156", 
    "poster_url": "BloodyMoon.jpg", 
    "similar": [
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "DevilsPrey", 
            "name": "Devil's Prey", 
            "poster_url": "DevilsPrey.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "Suspiria", 
            "name": "Suspiria", 
            "poster_url": "Suspiria.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "YoureNext", 
            "name": "You're Next", 
            "poster_url": "YoureNext.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "NineDead", 
            "name": "Nine Dead", 
            "poster_url": "NineDead.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "FridayThe13thPartVANewBeginning", 
            "name": "Friday the 13th Part V: A New Beginning"
        }
    ], 
    "id": "BloodyMoon", 
    "name": "Bloody Moon"
}