{
    "plot": "Udo Kier is without a doubt the sickliest of vampires in any director's interpretation of the Bram Stoker tale. Count Dracula knows that if he fails to drink a required amount of pure virgin's [pronounced \"wirgin's\"] blood, it's time to move into a permanent coffin. His assistant (Renfield?) suggests that the Count and he pick up his coffin and take a road trip to Italy, where families are known to be particularly religious, and therefore should be an excellent place to search for a virgin bride. They do, only to encounter a family with not one, but FOUR virgins, ready for marriage. The Count discovers one-by-one that the girls are not as pure as they say they are, meanwhile a handsome servant/Communist begins to observe strange behaviour from the girls who do spend the night with the Count. It's a race for Dracula to discover who's the real virgin, before he either dies from malnourishment or from the wooden stake of the Communist!", 
    "genres": "Horror", 
    "release_year": "1974", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "middle", 
                    "certain", 
                    "semantic", 
                    "full", 
                    "entire", 
                    "similar"
                ], 
                "role": "Innocent Fanservice Girl: The two middle daughters to a certain extent, although their 'innocence' is a semantic point. They think nothing of stripping outside in full view of the entire plantation and while they do have sex with Mario, they believe it doesn't count since he is of a lower class. They seem to have similar opinions while having sex with each other. Therefore, when Dracula asks if they're virgins, they claim they are. They firmly believe they're telling the truth.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "Lesbian"
                ], 
                "role": "Lesbian Vampire: Well, bisexual. And they were bi before they were vampires. But still.", 
                "id": "LesbianVampire"
            }, 
            {
                "adjectives": [
                    "Rich"
                ], 
                "role": "Rich Bitch: The two daughters once again.", 
                "id": "RichBitch"
            }
        ]
    }, 
    "imdbid": "tt0071233", 
    "poster_url": "BloodForDracula.jpg", 
    "similar": [
        {
            "shared": [
                "InnocentFanserviceGirl", 
                "LesbianVampire"
            ], 
            "shared_count": 2, 
            "id": "TheFearlessVampireKillers", 
            "name": "The Fearless Vampire Killers", 
            "poster_url": "TheFearlessVampireKillers.jpg"
        }, 
        {
            "shared": [
                "RichBitch"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "LesbianVampire"
            ], 
            "shared_count": 1, 
            "id": "RazorBladeSmile", 
            "name": "Razor Blade Smile", 
            "poster_url": "RazorBladeSmile.jpg"
        }, 
        {
            "shared": [
                "InnocentFanserviceGirl"
            ], 
            "shared_count": 1, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "InnocentFanserviceGirl"
            ], 
            "shared_count": 1, 
            "id": "Lifeforce", 
            "name": "Lifeforce", 
            "poster_url": "Lifeforce.jpg"
        }
    ], 
    "id": "BloodForDracula", 
    "name": "Blood For Dracula"
}