{
    "plot": "College student Jeffrey Beaumont returns to his idyllic hometown of Lumberton to manage his father's hardware store while his father is hospitalized. Walking though a grassy meadow near the family home, Jeffrey finds a severed human ear. After an initial investigation, lead police Detective John Williams advises Jeffrey not to speak to anyone about the case as they investigate further. Detective Williams also tells Jeffrey that he cannot divulge any information about what the police know. Detective Williams' high school aged daughter, Sandy Williams, tells Jeffrey what she knows about the case from overhearing her father's private conversations on the matter: that it has to do with a nightclub singer named Dorothy Vallens, who lives in an older apartment building near the Beaumont home. His curiosity getting the better of him, Jeffrey, with Sandy's help, decides to find out more about the woman at the center of the case by breaking into Dorothy's apartment while he knows she's at work. What Jeffrey finds is a world unfamiliar to him, one that he doesn't truly understand but one that he is unable to deny the lure of despite the inherent dangers of being associated with a possible murder. Still, he is torn between this world and the prospect of a relationship with Sandy, the two who are falling for each other, despite Sandy already being in a relationship with Mike, the school's star football player.", 
    "genres": "Crime, Drama, Mystery", 
    "release_year": "1986", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Camp Gay: Ben the pimp is played this way by Dean Stockwell.", 
                "id": "CampGay"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Dorothy Vallens from Blue Velvet", 
                "id": "TheChanteuse"
            }
        ]
    }, 
    "imdbid": "tt0090756", 
    "poster_url": "BlueVelvet.jpg", 
    "similar": [
        {
            "shared": [
                "TheChanteuse", 
                "CampGay"
            ], 
            "shared_count": 2, 
            "id": "Life", 
            "name": "Life"
        }, 
        {
            "shared": [
                "TheChanteuse"
            ], 
            "shared_count": 1, 
            "id": "PorcoRosso", 
            "name": "Porco Rosso", 
            "poster_url": "PorcoRosso.jpg"
        }, 
        {
            "shared": [
                "CampGay"
            ], 
            "shared_count": 1, 
            "id": "SouthParkBiggerLongerAndUncut", 
            "name": "South Park: Bigger, Longer & Uncut", 
            "poster_url": "SouthParkBiggerLongerAndUncut.jpg"
        }, 
        {
            "shared": [
                "CampGay"
            ], 
            "shared_count": 1, 
            "id": "TheBoysInTheBand", 
            "name": "The Boys in the Band", 
            "poster_url": "TheBoysInTheBand.jpg"
        }, 
        {
            "shared": [
                "CampGay"
            ], 
            "shared_count": 1, 
            "id": "ILoveYouPhillipMorris", 
            "name": "I Love You Phillip Morris", 
            "poster_url": "ILoveYouPhillipMorris.jpg"
        }
    ], 
    "id": "BlueVelvet", 
    "name": "Blue Velvet"
}