{
    "plot": "1934. Young adults Bonnie Parker, a waitress, and Clyde Barrow, a criminal just released from prison, are immediately attracted to what the other represents for their life when they meet by chance in West Dallas, Texas. Bonnie is fascinated with Clyde's criminal past, and his matter-of-factness and bravado in talking about it. Clyde sees in Bonnie someone sympatico to his goals in life. Although attracted to each other physically, a sexual relationship between the two has a few obstacles to happen. Regardless, they decide to join forces to embark on a life of crime, holding up whatever establishments, primarily banks, to make money and to have fun. They don't plan on hurting anyone physically or killing anyone despite wielding loaded guns. They amass a small gang of willing accomplices, including C.W. Moss, a mechanic to fix whatever cars they steal which is important especially for their getaways, and Buck Barrow, one of Clyde's older brothers. The only reluctant tag-along is Buck's nervous wife, Blanche Barrow, a preacher's daughter. The gang's life changes after the first fatal shot is fired. Following, their willingness to shoot to kill increases to protect themselves and their livelihood. Their notoriety precedes them, so much so that no matter what one's opinion is of them, most want to have some association to the Barrow gang, to help them, to be spoken in the same breath as them, or to capture and or kill them. Of the many people they encounter in their crime spree, the one who may have the most profound effect on their lives is Texas Ranger Frank Hamer, who is looking for a little retribution.", 
    "genres": "Biography, Crime, Drama", 
    "release_year": "1967", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Hobos: The gang meets up with a camp of them after a shootout and ask for water; they get a lot of attention and are given soup as well as water.", 
                "id": "Hobos"
            }, 
            {
                "adjectives": [], 
                "role": "Clyde in Bonnie and Clyde, which might be Truth in Television.", 
                "id": "TheLoinsSleepTonight"
            }, 
            {
                "adjectives": [], 
                "role": "The Loins Sleep Tonight: \"I ain't much of a loverboy.\"", 
                "id": "TheLoinsSleepTonight"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Bonnie.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Screaming Woman: Blanche, much to the chagrin of the rest of the gang (especially Bonnie), as well as to her real-life inspiration.", 
                "id": "ScreamingWoman"
            }
        ]
    }, 
    "imdbid": "tt0061418", 
    "poster_url": "BonnieAndClyde.jpg", 
    "similar": [
        {
            "shared": [
                "ScreamingWoman", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "ScreamingWoman", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "HouseOfWax", 
            "name": "House of Wax", 
            "poster_url": "HouseOfWax.jpg"
        }, 
        {
            "shared": [
                "Hobos", 
                "ScreamingWoman"
            ], 
            "shared_count": 2, 
            "id": "ItsAWonderfulLife", 
            "name": "It's a Wonderful Life", 
            "poster_url": "ItsAWonderfulLife.jpg"
        }, 
        {
            "shared": [
                "ScreamingWoman", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "AlienS", 
            "name": "Aliens", 
            "poster_url": "AlienS.jpg"
        }, 
        {
            "shared": [
                "ScreamingWoman", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheChase", 
            "name": "The Chase", 
            "poster_url": "TheChase.jpg"
        }
    ], 
    "id": "BonnieAndClyde", 
    "name": "Bonnie and Clyde"
}