{
    "plot": "Adult film director Jack Horner is always on the lookout for new talent and it's only by chance that he meets Eddie Adams who is working as a busboy in a restaurant. Eddie is young, good looking and plenty of libido to spare. Using the screen name Dirk Diggler, he quickly rises to the top of his industry winning awards year after year. Drugs and ego however come between Dirk and those around him and he soon finds that fame is fleeting.", 
    "genres": "Drama", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "only", 
                    "constant"
                ], 
                "role": "Bigger Is Better in Bed: Basically the only thing Dirk has going for him, despite his constant attempts to prove otherwise.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [
                    "young", 
                    "massive"
                ], 
                "role": "Dirty Old Man: Colonel James is seen with a series of extremely young, often underage, girls during the film. This point is driven home rather well when we see him in prison, and he implies that when the police raided his house after his latest underage girl died of a massive cocaine overdose, they found pictures of children.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [
                    "severe"
                ], 
                "role": "The Loins Sleep Tonight: Dirk starts having problems in this area as his cocaine addiction becomes more severe, which is a bit of a problem for an adult film actor.", 
                "id": "TheLoinsSleepTonight"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "regular", 
                    "ready", 
                    "last"
                ], 
                "role": "A party early on in Boogie Nights features a girl — implied to be both underage and either a porn star or one of the Colonel's regular girls — who suffers a drug overdose as she's getting ready to have sex with a guy. The guy himself freaks out, although that's in part because it was his cocaine that caused the problem, and everyone else who gets involved seems to view the matter as a minor inconvenience at best, and the last we see of her is her being carried away from the party as if she were garbage to be disposed of.", 
                "id": "DisposableSexWorker"
            }, 
            {
                "adjectives": [
                    "Disposable", 
                    "dimensional", 
                    "disposable", 
                    "in-universe", 
                    "whole", 
                    "regular", 
                    "bad", 
                    "bad", 
                    "early", 
                    "last", 
                    "trash"
                ], 
                "role": "Disposable Sex Worker: The film is centered around sex workers, and the story explores them as three dimensional characters. However, while the story itself doesn't view sex workers as disposable, an in-universe example has some suggestions that the porn industry as a whole could (can?) display a tendency towards this mindset; a girl, heavily implied to be both underage and either a sex worker herself or one of the Colonel's regular girlfriends, suffers a bad reaction to some bad drugs she's given during the early party scene, and while the guy who gave her the drugs freaks out, everyone else seems to view the fact that she's on the floor bleeding copiously as a minor inconvenience at most. She's last seen being carried away from the party as if she were trash to be disposed of.", 
                "id": "DisposableSexWorker"
            }, 
            {
                "adjectives": [
                    "many", 
                    "outright", 
                    "own", 
                    "custodial", 
                    "own", 
                    "weird", 
                    "mother-figure", 
                    "same", 
                    "coke-fuelled", 
                    "Amber:"
                ], 
                "role": "Team Mom: Amber takes many of the younger stars in Jack's employ under her wing and mothers them, in what is all but outright stated to be a substitute for her own custodial battles over and Missing Mom nature towards her own son. Takes on a slightly weird edge when it comes to Dirk, in that she appears to view herself as a mother-figure to him while simultaneously kind of falling in love with him at the same time. Lampshaded in the case of Rollergirl, in the course of a coke-fuelled heart-to-heart with Amber:", 
                "id": "TeamMom"
            }
        ]
    }, 
    "imdbid": "tt0118749", 
    "poster_url": "BoogieNights.jpg", 
    "similar": [
        {
            "shared": [
                "DirtyOldMan", 
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 2, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }, 
        {
            "shared": [
                "DisposableSexWorker", 
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 2, 
            "id": "Pusher", 
            "name": "Pusher"
        }, 
        {
            "shared": [
                "TheLoinsSleepTonight", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "DirtyOldMan"
            ], 
            "shared_count": 2, 
            "id": "Giant", 
            "name": "Giant", 
            "poster_url": "Giant.jpg"
        }, 
        {
            "shared": [
                "DisposableSexWorker", 
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 2, 
            "id": "Nekromantik", 
            "name": "Nekromantik", 
            "poster_url": "Nekromantik.jpg"
        }
    ], 
    "id": "BoogieNights", 
    "name": "Boogie Nights"
}