{
    "plot": "Hollywood, today: Bobby Bowfinger, a run-down actor-producer-director, is reading a script which a friend has written. Completely convinced of its quality, he decides to take a last shot at fame and fortune. But the script is not that easy to sell, and a famous producer promises him to do it, but there is one condition: Kit Ramsey, Hollywood's number one star, has to be in it. So, Bobby tries his luck with Kit - who says no - and then decides to shoot the film himself. Together with the cheapest team available in Southern California, an aspiring beauty from Ohio, a diva who is just a little over the hill, a key-holding gofer from a major studio and a goon hired away from burger-flipping, Bobby sets out to shoot the science-fiction-film starring Kit Ramsey - who does not even know he's being filmed.", 
    "genres": "Comedy", 
    "release_year": "1999", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "At the end of the movie Bowfinger, Bobby Bowfinger(Steve Martin) and Jiff Ramsey(Eddie Murphy) star in a kung fu movie called \"Fake Purse Ninjas\" where Christine Baranski plays a Dragonlady type ordering a horde of ninjas to attack them.", 
                "id": "DragonLady"
            }
        ]
    }, 
    "imdbid": "tt0131325", 
    "poster_url": "Bowfinger.jpg", 
    "similar": [
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "ThePunisher1989", 
            "name": "The Punisher ", 
            "poster_url": "ThePunisher1989.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "TheCrow", 
            "name": "The Crow", 
            "poster_url": "TheCrow.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "WildWildWest", 
            "name": "Wild Wild West", 
            "poster_url": "WildWildWest.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "IDrinkYourBlood", 
            "name": "I Drink Your Blood", 
            "poster_url": "IDrinkYourBlood.jpg"
        }
    ], 
    "id": "Bowfinger", 
    "name": "Bowfinger"
}