{
    "plot": "The restorer and single mother Grace is working in an ancient church and she finds a hidden crypt with a voodoo book of resurrection. However, Father Cornelius asks her to go home and forget her findings. Her son Nathan is a sensitive and shy teenager bullied by Samson at school. He has a crush on his friend Jessica, but he does not declare to her. His best friends Diggs and Henry schedule a date of Jessica with Nathan. However her father grounds her in her bedroom and when Nathan calls Jessica, her father tells that she has dated a good looking guy in a car. Jessica flees through the window, but Nathan and Jessica fail to meet each other. Jessica takes a ride in Kenneth's car and Nathan believes that she is dating the schoolmate. He goes home, drinks whiskey and puts a rope around his neck. When Grace comes home, she opens Nathan's bedroom door and accidentally she hangs her son. Grace resurrects Nathan, but soon she finds that something did not work out when her son bites Samson and his schoolmates start eating each other.", 
    "genres": "Horror, Comedy", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Jerk Jock: Samson. Unsurprisingly, he's the first victim.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Action Girl: Jessica shows shades of this later into the film.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "Hot", 
                    "gorgeous", 
                    "international"
                ], 
                "role": "Hot Mom: Nathans mother is played by stunningly gorgeous comedienne Deirdre O'Kane (essentially the Irish version of Tina Fey for international tropers).", 
                "id": "HotMom"
            }
        ]
    }, 
    "imdbid": "tt0415679", 
    "poster_url": "BoyEatsGirl.jpg", 
    "similar": [
        {
            "shared": [
                "JerkJock", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "Undefeatable", 
            "name": "Undefeatable", 
            "poster_url": "Undefeatable.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "IAmNumberFour", 
            "name": "I Am Number Four", 
            "poster_url": "IAmNumberFour.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheSwordInTheStone", 
            "name": "The Sword in the Stone", 
            "poster_url": "TheSwordInTheStone.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "AlphaAndOmega", 
            "name": "Alpha and Omega", 
            "poster_url": "AlphaAndOmega.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "ToTheLimit", 
            "name": "To The Limit", 
            "poster_url": "ToTheLimit.jpg"
        }
    ], 
    "id": "BoyEatsGirl", 
    "name": "Boy Eats Girl"
}