{
    "plot": "Four best friends start high school. Each one is unique and likes their own thing. When Meredith, the most popular girl, sees this she automatically knows they are trouble. Eventually though Cloe joins the soccer team and hangs out with them, Sasha joins the cheer leading squad and hangs out with the cheerleaders, Jade is part of the math club so she hangs out with them, and Yasmin is left all alone. After years of not talking to each other Jade and Yasmin speak a few words in the restroom but Yasmin doesn't have the courage to tell Jade she misses her. Then the four girls are reunited when they are sent to detention for causing a food fight. After the girls are reunited they find out they are not invited to a huge party given by Meredith Then Cloe finds out that her mom got a job serving food at the party. They are forced to work for Meredith Then at the party Meredith decides to expose Yasmins secret which is her dancing and singing with a face mask. Then Yasmins friend(who she has a crush on) starts doing a dance and then everybody joins in and Meredith is humiliated. When Meredith accidentally gets thrown into the pool she calls the four best friends \"bratz.\" The girls then decide to be part of the talent show to win a scholarship. Meredith is always the one who wins but the \"bratz\" are prepared to take her down. But when Meredith finds she threatens Yasmin by telling her that if she continued preparing for the show she would expose her friends secrets. Yasmin decides to call everything off. At the end the girls still do the talent show and they tell everybody there secrets who turn out not to be so bad. The girls win and they each end up with their crushes. The girls decide to give Cloe the scholarship. The movie ends with the girls walking down a red carpet.", 
    "genres": "Comedy, Family, Music", 
    "release_year": "2007", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "out-bitch", 
                    "'It", 
                    "'FABULOUS"
                ], 
                "role": "Alpha Bitch: Meredith is trying to out-bitch both Libby from Sabrina the Teenage Witch and Tess from Camp Rock with songs like 'It's All About Me' and 'FABULOUS'.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Four Girl Ensemble", 
                "id": "FourGirlEnsemble"
            }, 
            {
                "adjectives": [
                    "Rich"
                ], 
                "role": "Rich Bitch: Meredith.", 
                "id": "RichBitch"
            }
        ]
    }, 
    "imdbid": "tt0804452", 
    "poster_url": "Bratz.jpg", 
    "similar": [
        {
            "shared": [
                "FourGirlEnsemble", 
                "AlphaBitch", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "RichBitch"
            ], 
            "shared_count": 2, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "RichBitch"
            ], 
            "shared_count": 2, 
            "id": "TheHouseBunny", 
            "name": "The House Bunny", 
            "poster_url": "TheHouseBunny.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "RichBitch"
            ], 
            "shared_count": 2, 
            "id": "Bridesmaids", 
            "name": "Bridesmaids", 
            "poster_url": "Bridesmaids.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "RichBitch"
            ], 
            "shared_count": 2, 
            "id": "WhatAGirlWants", 
            "name": "What a Girl Wants", 
            "poster_url": "WhatAGirlWants.jpg"
        }
    ], 
    "id": "Bratz", 
    "name": "Bratz"
}