{
    "plot": "Set in Scotland in a rugged and mythical time, \"Brave\" features Merida, an aspiring archer and impetuous daughter of royalty. Merida makes a reckless choice that unleashes unintended peril and forces her to spring into action to set things right.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "only", 
                    "bad", 
                    "interested"
                ], 
                "role": "Hunk: The only guy Merida seems impressed with at all, if only because of his sheer size, is a guy who looks like this. Too bad he's not really Lord Dingwall's son. Also, that guy ends up being interested in Maudie, the maid.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "Feast"
                ], 
                "role": "Lord Dingwall from Brave : \"Feast your eyes!\"", 
                "id": "ManInAKilt"
            }, 
            {
                "adjectives": [
                    "Scottish", 
                    "early"
                ], 
                "role": "Man in a Kilt: Justified as the setting is the Scottish Highlands from where the kilt originated, albeit about 800 years too early.", 
                "id": "ManInAKilt"
            }, 
            {
                "adjectives": [], 
                "role": "Pixar example: King Fergus (Merida's father) from the film Brave has mantained peace among three tribes that look for an excuse to start a war.", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Princess Merida from Brave gets along with her father much better with her mother; he even taught her how to shoot a bow.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "active", 
                    "several", 
                    "other"
                ], 
                "role": "Damsel in Distress: Merida, despite being pretty active and fearless, needs rescuing several times in the movie. Sometimes while trying to save someone else or just after escaping from some other danger.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "future", 
                    "free"
                ], 
                "role": "Everything's Better with Princesses: Played with; in a refreshing twist, being a Princess is shown for what it is, a position of future power that requires genuine work and training as opposed to being simply free to do as one pleases.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Merida — Brave (2012): First Pixar character to be a \"Disney Princess\"", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "bear"
                ], 
                "role": "Gag Boobs: Maudie, the castle maid, who has a cleavage in which you could quite literally lose a bear cub.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "literal", 
                    "late", 
                    "free", 
                    "usual", 
                    "own", 
                    "own"
                ], 
                "role": "Mama Bear: You can't miss the literal example late in the film. Queen Elinor, as a bear, breaks herself free to save her daughter and Fergus from the dreaded bear Mor'du. This is just prior to an inversion of the usual roles in the trope, in which the princess defends Elinor  against her own father, who has no idea that the bear he's fighting is his own wife.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "single"
                ], 
                "role": "Queen Elinor in Brave falls into this at times while wanting the best for her daughter Merida. Merida however does not appreciate that her mother \"is in charge of every single day of her life.\"", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "passionate"
                ], 
                "role": "Princess Merida from Brave is passionate about swordplay, horseback riding, and archery, which annoys her Proper Lady mother Queen Elinor.", 
                "id": "PassionateSportsGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Princess Merida from Brave.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "exciting", 
                    "much", 
                    "first", 
                    "other"
                ], 
                "role": "Merida from Brave plays this trope very, very straight. The film itself really only starts this way, and it's really only the mother who Merida is up against (when not getting involved with exciting drinking parties, her father is perfectly okay with much of it and even gave her her first bow for her birthday). In the end, it's not so much about her getting her way as it is her and her mother getting an understanding of each other's opinions and finding a balance.\n However, in the end Merida does get her way. But since part of the conflict with her mother was her not wanting to accept the responsibilities of a leader, which she eventually does, there actually was some compromise.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "diplomatic", 
                    "impulsive", 
                    "elegant"
                ], 
                "role": "As the measured, diplomatic counterpoint to her more impulsive husband, Queen Elinor from the film Brave carries the weight of the kingdom on her shoulders. Elinor is also very elegant and ladylike, befitting her role as the queen.", 
                "id": "TheHighQueen"
            }
        ]
    }, 
    "imdbid": "tt1217209", 
    "poster_url": "Brave.jpg", 
    "similar": [
        {
            "shared": [
                "DaddysGirl", 
                "EverythingsBetterWithPrincesses", 
                "GagBoobs", 
                "ManInAKilt", 
                "PluckyGirl", 
                "TheHighQueen"
            ], 
            "shared_count": 6, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }, 
        {
            "shared": [
                "Hunk", 
                "EverythingsBetterWithPrincesses", 
                "TheGoodKing", 
                "TheHighQueen", 
                "MamaBear"
            ], 
            "shared_count": 5, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "Hunk", 
                "DamselInDistress"
            ], 
            "shared_count": 5, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "TheGoodKing", 
                "MamaBear"
            ], 
            "shared_count": 5, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "TheGoodKing"
            ], 
            "shared_count": 4, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }
    ], 
    "id": "Brave", 
    "name": "Brave"
}