{
    "plot": "The lonely teenager Brendan finds his former girlfriend Emily dead in the entrance of a tunnel of sewage and recalls her phone call two days ago, when she said to him that she was in trouble. Brendan, who still loved Emily, met bad elements of his high-school trying to contact her, and when he succeeded, she told him that she was OK. He hides her body in the tunnel and decides to investigate the meaning and connection of four words, including \"brick\" and \"pin\", that Emily told him to find who killed her. Using the support of his nerd friend Brain, he successively meets the small time drug dealers Kara, Dode, Brad Bramish, Laura and Tugger, to reach the teenager powerful drug dealer The Pin. Slowly, Brendan unravels the motives why Emily was killed and plots a revenge.", 
    "genres": "Crime, Drama, Mystery", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Brad Bramish in Brick, though the gumshoe exposes him as a sap.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: Mostly played for laughs in the form of Brad Bramish.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "straddle", 
                    "high", 
                    "such"
                ], 
                "role": "Kara from Brick, along with  Laura Dannon. The two straddle the line between this and full-on Femme Fatale; they're high schoolers, but (seemingly) on the older end, and they're also involved in a variety of adult crimes such as drug dealing and blackmail.  And one is indirectly involved in murder.", 
                "id": "FilleFatale"
            }, 
            {
                "adjectives": [
                    "red"
                ], 
                "role": "Lady in Red: Laura wears a red Qipao when Brendan meets her.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [
                    "main"
                ], 
                "role": "The Ingenue: Subverted with Emily. Even though she is the main character's love interest and The Lost Lenore, it is soon revealed that she left him to date a drug addict,  tried to join the inner circle of a prominent drug dealer, and had sex with the aforementioned drug addict and the dealer's head enforcer. All within a span shorter than three months.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "such", 
                    "high"
                ], 
                "role": "Kara is even referred to as such in the 2006 high school noir, Brick.", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [
                    "long", 
                    "later", 
                    "odd", 
                    "black", 
                    "first", 
                    "likely", 
                    "sympathetic", 
                    "responsible"
                ], 
                "role": "Woman in Black: Kara wears a Stripperific black dress at one point and a long black robe later; not coincidentally, these are the scenes where she is the most manipulative. In a rather odd use of this trope,  Laura is also wearing black when she sleeps with Brendan; on first viewing, this is the point when the viewer is mostly likely to find her sympathetic, but it's also immediately before she becomes responsible for the death of five people and her role in Em's death is revealed.", 
                "id": "WomanInBlack"
            }
        ]
    }, 
    "imdbid": "tt0393109", 
    "poster_url": "Brick.jpg", 
    "similar": [
        {
            "shared": [
                "TheVamp", 
                "LadyInRed", 
                "JerkJock"
            ], 
            "shared_count": 3, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "TheVamp", 
                "LadyInRed"
            ], 
            "shared_count": 3, 
            "id": "DeathBecomesHer", 
            "name": "Death Becomes Her"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "TheIngenue", 
                "TheVamp"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "TheIngenue", 
                "TheVamp"
            ], 
            "shared_count": 3, 
            "id": "BlackSwan", 
            "name": "Black Swan", 
            "poster_url": "BlackSwan.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "LadyInRed"
            ], 
            "shared_count": 2, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }
    ], 
    "id": "Brick", 
    "name": "Brick"
}