{
    "plot": "In 1765 something was stalking the mountains of central France. A 'beast' that pounced on humans and animals with terrible ferocity. Indeed they beast became so notorious that the King of France dispatched envoys to find out what was happening and to kill the creature. By the end, the Beast of Gevaudan had killed over 100 people, to this day, no one is entirely sure what it was, wolf? hyena? or something supernatural? Whatever it was, shepherds had the same life-expectancy as the red-suited guys in 'Star Trek'. The Beast is a popular myth in France, albeit one rooted firmly in reality; somewhat surprisingly it is little known to the outside world, and perhaps incredibly it has never been made into a movie. Until now... Based on the true story of the Beast of the Gevaudan that terrorized France in the mid-XVIIIth century, the movie aims to tell first and explain afterwards. In the first part, a special envoy of the King of France, altogether biologist, explorer and philosopher, arrives in the Gevaudan region, in the mountainous central part of France. The Beast has been attacking women and children for months and nobody has quite been able to harm it or even take a good look at it. In the second part, our hero Chevalier de Fronsac will not only have to fight the Beast, but also ignorance, bigotry and conspiracy and will rely on two women, one an aristocrat, the other a prostitute, as well as the enigmatic Mani, an Iroquois he met in New-France (Canada).", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bigger Is Better in Bed: Mani, judging from the prostitute's reaction.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [], 
                "role": "Right Through His Pants: Fronsac with Sylvia.", 
                "id": "RightThroughHisPants"
            }, 
            {
                "adjectives": [
                    "young", 
                    "few", 
                    "possible", 
                    "other"
                ], 
                "role": "The Wise Prince: Thomas, young Marquis d'Apcher, one of the few aristocrats that fully trusts Fronsac and who sees Mani as a person, and not as a savage.  It's possible that this is why the other aristocrats never considered him to join their cult.", 
                "id": "TheWisePrince"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Femme Fatale: Sylvia.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "expensive"
                ], 
                "role": "High-Class Call Girl: Slyvia claims to be \"expensive\".", 
                "id": "HighClassCallGirl"
            }, 
            {
                "adjectives": [
                    "Italian"
                ], 
                "role": "Sylvia, the Italian courtesan, in Brotherhood of the Wolf.", 
                "id": "HighClassCallGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Monica Bellucci once again displays her willingness to disrobe. No one complains.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "papal", 
                    "French"
                ], 
                "role": "While she's probably not taken any oaths, the papal agent in the French film Brotherhood of the Wolf masquerades as a prostitute.", 
                "id": "NaughtyNuns"
            }, 
            {
                "adjectives": [], 
                "role": "The Baroness: Sylvia.", 
                "id": "TheBaroness"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "The Ingenue: The count of Monragias, Jean-Francois and Marianne's father.  And one of the few aristocrats who knew nothing about the Cult.", 
                "id": "TheIngenue"
            }
        ]
    }, 
    "imdbid": "tt0237534", 
    "poster_url": "BrotherhoodOfTheWolf.jpg", 
    "similar": [
        {
            "shared": [
                "TheBaroness", 
                "MsFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "TheBaroness", 
                "MsFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "TheBaroness", 
                "MsFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "Lucifer", 
            "name": "Lucifer"
        }, 
        {
            "shared": [
                "TheIngenue", 
                "MsFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "LemonadeJoe", 
            "name": "Lemonade Joe", 
            "poster_url": "LemonadeJoe.jpg"
        }, 
        {
            "shared": [
                "HighClassCallGirl", 
                "MsFanservice", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 3, 
            "id": "Coffy", 
            "name": "Coffy", 
            "poster_url": "Coffy.jpg"
        }
    ], 
    "id": "BrotherhoodOfTheWolf", 
    "name": "Brotherhood of the Wolf"
}