{
    "plot": "Kenai, a man who resents bears after a fight with one kills his older brother, is turned into a bear so he can see life from a different perspective. He is visited by the spirit of his older brother, and is told that, if he wishes to be changed back into a human, he must travel to the place where the lights touch the Earth, in other words, the Northern Lights. Fueled by hope, Kenai sets off on his long journey, and, along the way, encounters a younger bear, Koda, who is a chatterbox and a fun-loving spirit; Koda is trying to find his way back to his home, the Salmon Run, which, coincidentally, is right next to where the lights touch the Earth. Koda and Kenai team up, but are hunted by Kenai's other brother, Denahi, who fears that the bear has killed Kenai as well. Along the way, the two bears meet other friends, including two moose, some rams, and some mammoths, with whom they hitch a ride. However, Kenai discovers that he likes being a bear, and realizes that humans aren't only afraid of bears; through Koda's eyes, the humans are the monsters, with their long spears. With a whole new view on life, Kenai makes a decision that will change his world forever.", 
    "genres": "Animation, Adventure, Family", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Beard/Moustache: Denahi grows them while hunting Kenai.", 
                "id": "BadAssBeard"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice: All three of the brothers (not counting Koda, even if Kenai becomes his foster brother in the end), particularly Sitka and Kenai himself.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "Later", 
                    "protective"
                ], 
                "role": "Papa Wolf: Later Kenai becomes just as protective of Koda. Part of it would lead to hi being The Atoner for killing his mother.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Later", 
                    "protective"
                ], 
                "role": "Mama Bear: Very literally. Kenai messes with her. He wishes he'd lost. At first. Papa Wolf: Later Kenai becomes just as protective of Koda. Part of it would lead to hi being The Atoner for killing his mother.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Brother Bear: The bear Kenai killed as revenge for killing his older brother is actually  Koda's mother.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Nita, the priestess Tanana's daughter from Brother Bear 2.", 
                "id": "TheChiefsDaughter"
            }
        ]
    }, 
    "imdbid": "tt0328880", 
    "poster_url": "BrotherBear.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "MrFanservice", 
                "MamaBear", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BadAssBeard", 
                "MamaBear", 
                "MrFanservice"
            ], 
            "shared_count": 4, 
            "id": "TheTenCommandments", 
            "name": "The Ten Commandments", 
            "poster_url": "TheTenCommandments.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MrFanservice", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter", 
                "MrFanservice", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MrFanservice", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Tarzan", 
            "name": "Tarzan", 
            "poster_url": "Tarzan.jpg"
        }
    ], 
    "id": "BrotherBear", 
    "name": "Brother Bear"
}