{
    "plot": "\"In every generation there is a chosen one... she alone will stand against the vampires, the demons and the forces of darkness. She is the slayer.\" Buffy Summers knows this tale by heart, and no matter how hard she tries to be just a \"normal girl\", she can not escape from her destiny... Thankfully, she is not alone in her quest to save the world, as she has the help of her friends, the hilarious (and surprisingly quite effective) evil-fighting team called \"The Scooby Gang\". Together, Buffy & co. will slay their demons, survive one apocalypse after another, attend high school and college... and above all, understand that growing up can truly be Hell sometimes... literally.", 
    "genres": "Action, Drama, Fantasy", 
    "release_year": "1997–2003", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "feminine-sounding"
                ], 
                "role": "Camp Gay: Amilyn has touches of this. (Is it any wonder he's got a feminine-sounding name?)", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Merrick, who is played by Donald Sutherland. You know, Kiefer's dad.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "admirable", 
                    "clear"
                ], 
                "role": "Dirty Coward: Granted, Buffy's \"friends\" were not very admirable people to begin with. But it becomes clear how thoroughly rotten they are when the vampires storm the gym at the climax and one of them throws another girl out the window so she'll get eaten instead. Dick move, lady, dick move.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "similar", 
                    "later", 
                    "trenchcoat", 
                    "few", 
                    "scantily-clad", 
                    "suspicious"
                ], 
                "role": "A similar scene later on is even more eyebrow-raising. A basketball game is being played in the gym, and Merrick surreptitiously makes his way into the bleachers and sits down to keep watch over Buffy as she performs her cheerleading routine. Yeah, an older man in a trenchcoat whom no one has ever seen before sitting down by himself to watch a few dozen scantily-clad teenagers run and jump around - nothing suspicious about that.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Non-Action Guy: Somewhat averted with Pike (Luke Perry). He does possess rudimentary fighting skills and even gets to kill a couple of vampires himself. For the most part, though, he's a Reckless Sidekick. Buffy even informs him at one point that he shouldn't keep following her around.", 
                "id": "NonActionGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "original", 
                    "typical", 
                    "'Dumb", 
                    "first"
                ], 
                "role": "Action Girl: The original intent of the film was to take a typical horror film's 'Dumb Blonde' who either dies first or only survives because she's the hero's love interest, and make her the Chosen One of Destiny, while the Loveable Loser that she 'surprisingly' falls in love with, who would ordinarily become the Bad Ass Chosen One, takes her place as the film's Damsel in Distress.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "original"
                ], 
                "role": "In the original film version of Buffy the Vampire Slayer, Buffy had \"the mark of the Chosen One\", a mole. Buffy was less than impressed.", 
                "id": "BeautyMark"
            }, 
            {
                "adjectives": [
                    "athletic", 
                    "due", 
                    "due", 
                    "final", 
                    "entire", 
                    "sackful", 
                    "glad"
                ], 
                "role": "In Buffy the Vampire Slayer (1992), we have Oliver Pike (Luke Perry) as a Spear Counterpart. Pike isn't a fighter or very athletic, so he has to be rescued more often than not. He eventually becomes competent enough to take care of himself when Buffy's not around to protect him, kills two vampires along the way (one of them is In the Back), and even saves Buffy's life at one point (albeit unintentionally). He's given his due when Buffy has been shirking her duties as the Slayer due to  the death of her mentor on the night of Buffy's final confrontation with the Big Bad; he uses his knife to whittle an entire sackful of stakes for her so she'll be ready to take on the vampires - and she grudgingly remarks that she's glad somebody has come prepared.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "blind"
                ], 
                "role": "Decoy Damsel: A rare heroic example, with Buffy pretending to be frightened in order to lure a vampire into a blind alley so she can kill it.", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [
                    "whole", 
                    "typical", 
                    "good", 
                    "final", 
                    "first"
                ], 
                "role": "Buffy from Buffy the Vampire Slayer is a survives the whole movie, but is meant to be a subversion of the typical opening victim who dies before the title. While the good and wholesome activist girl we're meant to initially believe is the final girl turns out to be the first victim.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "Final", 
                    "final", 
                    "other", 
                    "first", 
                    "dead", 
                    "whole"
                ], 
                "role": "Final Girl: This movie is based on this subverted. The character who would normally be the final girl in any other horror is the first victim, While the ditsy blonde who is normally dead before the title survives the whole movie.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Girl Posse: Buffy and her fellow mall rats.", 
                "id": "GirlPosse"
            }, 
            {
                "adjectives": [
                    "fourteen", 
                    "old"
                ], 
                "role": "Buffy the Vampire Slayer would have been all of fourteen years old in the film, fifteen or sixteen at the start of the series, and the shortest member of the cast. She was 17 or 18 in the film; the series retconned her age.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [
                    "Lovable", 
                    "elite", 
                    "nice", 
                    "benevolent", 
                    "true", 
                    "treacherous"
                ], 
                "role": "Lovable Alpha Bitch: Buffy is definitely one of Hemery High's elite, but for the most part she is a genuinely nice person who presides over the school with a benevolent hand. The true Alpha Bitch of this film would be Buffy's treacherous second-in-command, Jennifer, who woos away Buffy's Jerk Jock boyfriend when she's not looking.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [
                    "shallow", 
                    "nasty"
                ], 
                "role": "In Buffy the Vampire Slayer, all the cheerleaders (including Buffy herself at the start of the movie) are shallow, nasty and stupid. When Buffy becomes the Slayer and gets Character Development, she stops being a cheerleader. The episode of the show was sort of a Continuity Nod.", 
                "id": "TheCheerleader"
            }, 
            {
                "adjectives": [
                    "original"
                ], 
                "role": "Buffy in the original film incarnation of Buffy the Vampire Slayer.", 
                "id": "ValleyGirl"
            }
        ]
    }, 
    "imdbid": "tt0118276", 
    "similar": [
        {
            "shared": [
                "BeautyMark", 
                "CampGay", 
                "CoolOldGuy", 
                "DirtyOldMan", 
                "DirtyCoward", 
                "LittleMissBadass"
            ], 
            "shared_count": 6, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "ActionGirl", 
                "CoolOldGuy", 
                "DirtyOldMan"
            ], 
            "shared_count": 4, 
            "id": "LupinIIIThePursuitOfHarimaosTreasure", 
            "name": "Lupin III: The Pursuit Of Harimao's Treasure"
        }, 
        {
            "shared": [
                "LittleMissBadass", 
                "CoolOldGuy", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "Ben10", 
            "name": "Ben 10"
        }, 
        {
            "shared": [
                "DamselOutOfDistress", 
                "CoolOldGuy", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "CoolOldGuy", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "BuffyTheVampireSlayer", 
    "name": "Buffy the Vampire Slayer"
}