{
    "plot": "A New York anthropologist named Professor Harold Monroe travels to the wild, inhospitable jungles of South America to find out what happened to a documentary film crew that disappeared two months before while filming a documentary about primitive cannibal tribes deep in the rain forest. With the help of two local guides, Professor Monroe encounters two tribes, the Yacumo and the Yanomamo. While under the hospitality of the latter tribe, he finds the remains of the crew and several reels of their undeveloped film. Upon returning to New York City, Professor Monroe views the film in detail, featuring the director Alan Yates, his girlfriend Faye Daniels, and cameramen Jack Anders and Mark Tomaso. After a few days of traveling, the film details how the crew staged all the footage for their documentary by terrorizing and torturing the natives. Despite Monroe's objections, the television studio Pan American still wishes to air the footage as a legitimate documentary. In order to change their minds, Monroe shows the station's executives the film's final reels, so they could see first hand how the crew's fate came to be.", 
    "genres": "Adventure, Horror", 
    "release_year": "1980", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Ms. Fanservice", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0078935", 
    "poster_url": "CannibalHolocaust.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "RazorBladeSmile", 
            "name": "Razor Blade Smile", 
            "poster_url": "RazorBladeSmile.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "TheTexasChainsawMassacre2003", 
            "name": "The Texas Chainsaw Massacre ", 
            "poster_url": "TheTexasChainsawMassacre2003.jpg"
        }
    ], 
    "id": "CannibalHolocaust", 
    "name": "Cannibal Holocaust"
}