{
    "plot": "It is 1942, America has entered World War II, and sickly but determined Steve Rogers is frustrated at being rejected yet again for military service. Everything changes when Dr. Erskine recruits him for the secret Project Rebirth. Proving his extraordinary courage, wits and conscience, Rogers undergoes the experiment and his weak body is suddenly enhanced into the maximum human potential. When Dr. Erskine is then immediately assassinated by an agent of Nazi Germany's secret HYDRA research department (headed by Johann Schmidt, a.k.a. the Red Skull), Rogers is left as a unique man who is initially misused as a propaganda mascot; however, when his comrades need him, Rogers goes on a successful adventure that truly makes him Captain America, and his war against Schmidt begins.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Mustache: Dugan. By the grace of God, Dugan.", 
                "id": "BadAssMustache"
            }, 
            {
                "adjectives": [], 
                "role": "Bash Brothers: Steve and Bucky. Tandem punching.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "straightforward", 
                    "first", 
                    "subtle", 
                    "courageous", 
                    "doe-eyed", 
                    "back"
                ], 
                "role": "Chick Magnet: Howard Stark is the more straightforward \"ladies man\" example, as shown in his first appearance. Post-procedure Steve is a more subtle version; the combination of his stage celebrity, beefcake physique, courageous spirit, and all around Nice Guy attitude attract Peggy, a foxy secretary, and a doe-eyed starstruck blond. Bucky was also one back in New York.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "first", 
                    "able", 
                    "due"
                ], 
                "role": "In Captain America: The First Avenger, Howard Stark is the straightforward ladies' man, as shown in his first appearance. Post-procedure Steve was able to catch the attention of Peggy, the foxy secretary and a starstruck blond due to a combination of his stage celebrity, Greek God physique, courage and Adorkable Nice Guy attitude.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "Chivalrous", 
                    "later"
                ], 
                "role": "Chivalrous Pervert: Howard Stark may be a playboy inventor, but when it comes to working within the SSR, he takes his job very seriously and is not going to spend his time chasing girls, as he later explains to Steve Rogers about what he actually meant by \"fondue.\" (Essentially he was requesting that he and Peggy go out and eat.)", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "respectful", 
                    "later", 
                    "fondue", 
                    "fondue", 
                    "sexual"
                ], 
                "role": "Howard Stark in Captain America: The First Avenger. He may be a playboy inventor (much like his son) but he is respectful to coworker Peggy and he later explains to Steve what he meant by having \"fondue\" with her (he was essentially asking Peggy that after a mission if she wanted to go out and eat with him. Steve had never heard of fondue before, and assumed it was a sexual euphemism.)", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [], 
                "role": "For the mature lady, Colonel Chester Phillips.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "actual"
                ], 
                "role": "Drill Sergeant Nasty: Peggy Carter dabbles in it. There is also an actual drill sergeant in the training scenes.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "same"
                ], 
                "role": "From the same universe, Captain America: The First Avenger himself, at least after he gets injected with Super Serum.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "All-American"
                ], 
                "role": "All-American Good Guy Steve Rogers.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [
                    "All-American"
                ], 
                "role": "Mr. Fanservice: Where to start.. All-American Good Guy Steve Rogers. His Badass BFF Bucky Barnes. For the mature lady, Colonel Chester Phillips. Not only do we see where Tony gets it from, but Howard Stark wears the hell out of those suits.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "2nd"
                ], 
                "role": "Officer and a Gentleman: 2nd Lt. Montgomery Falsworth.", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "many", 
                    "noteworthy"
                ], 
                "role": "Shirtless Scene: Steve gets quite a many... but they aren't really noteworthy until after he gets the serum.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "worthy", 
                    "workaholic"
                ], 
                "role": "Also worthy of note, Howard Stark similarly mentions to Steve that he considers himself more of a workaholic and his work takes priority over being The Casanova, has people in his lab working on a motorbike and attempts to ignore the Vibranium shield completely.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [
                    "well-dressed", 
                    "benevolent", 
                    "globe-trotting"
                ], 
                "role": "Howard Stark in Captain America: The First Avenger. He's alarmingly well-dressed for a benevolent, globe-trotting Mad Scientist.", 
                "id": "WaistcoatOfStyle"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "same"
                ], 
                "role": "Agent Carter combines elements of Peggy Carter (Action Girl-ness and the name and relationship to Sharon Carter) with Lt. Cynthia Glass from the Sentinel of Liberty Miniseries (who had the same look and was also Phillips' aide).", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "In the previews for Captain America: The First Avenger, Chris Evans was already acquiring an estrogen brigade.", 
                "id": "EstrogenBrigade"
            }, 
            {
                "adjectives": [
                    "Glamorous"
                ], 
                "role": "Glamorous Wartime Singer: They're a part of the USO stage show that Steve's put in.", 
                "id": "GlamorousWartimeSinger"
            }, 
            {
                "adjectives": [], 
                "role": "These ladies are part of the USO stage show in Captain America: The First Avenger.", 
                "id": "GlamorousWartimeSinger"
            }, 
            {
                "adjectives": [], 
                "role": "Hello, Nurse!: Peggy Carter. Red dress.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [
                    "ass-kicking"
                ], 
                "role": "In Captain America: The First Avenger, Peggy Carter is almost always seen in her dress uniform, and still manages to do quite a bit of ass-kicking.", 
                "id": "HotChickInABadassSuit"
            }, 
            {
                "adjectives": [
                    "impressive", 
                    "full", 
                    "drab-uniformed"
                ], 
                "role": "In Captain America: The First Avenger, Peggy Carter (Steve Rogers' ally and love interest) wears a rather impressive red dress in one scene, which particularly stands out in a pub full of drab-uniformed soldiers, all of whom fall silent when she enters.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [], 
                "role": "Lady in Red: Peggy shows up at the pub in a red dress that shows off her superhuman physique.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [
                    "unrelated"
                ], 
                "role": "Ms. Fanservice: Three words: Peggy in red. On an unrelated tangent, the USO singers during the tour montage are quite the lookers themselves and are examples in-universe. We even see the soldiers in Italy demanding that the USO \"bring back the girls\" to the stage, after Steve's performance goes south.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "shot"
                ], 
                "role": "Badass Grandma: Subverted by the woman in the antique shop that serves as the front for the Super Soldier laboratory. When the Hydra spy runs out, she grabs a machine gun... and is immediately shot dead by him. A for effort, though.", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [], 
                "role": "Sexy Secretary: Pvt. Lorraine.", 
                "id": "SexySecretary"
            }, 
            {
                "adjectives": [
                    "Territorial", 
                    "competitive"
                ], 
                "role": "Territorial Smurfette: And naturally, they're competitive over Steve.", 
                "id": "TerritorialSmurfette"
            }, 
            {
                "adjectives": [], 
                "role": "The Baroness: Madam Hydra.", 
                "id": "TheBaroness"
            }, 
            {
                "adjectives": [], 
                "role": "Peggy Carter in Captain America: The First Avenger.", 
                "id": "TheSquadette"
            }, 
            {
                "adjectives": [
                    "fondue-ing", 
                    "fondue", 
                    "later"
                ], 
                "role": "In Captain America: The First Avenger, Peggy catches Steve being kissed by a blond secretary. To make things worse, Steve retorts/asks if she and Howard Stark are \"fondue-ing\". This leads to an awkward situation where Stark explains what fondue was and when testing if the Vibranium shield could withstand a handgun, Peggy aims at Steve's head. She forgives him later when she sees a picture of her in Steve's compass during one of his operations, as if saying \"this is for you.\"", 
                "id": "WomanScorned"
            }, 
            {
                "adjectives": [
                    "retorting/asking", 
                    "fondue-ing", 
                    "later", 
                    "later"
                ], 
                "role": "Woman Scorned: After Peggy stumbles upon the blonde secretary kissing Rogers. If that weren't enough, he further ticks her off by retorting/asking if she and Stark were \"fondue-ing,\" which later leads to an awkward situation where, when \"testing\" if the Vibranium shield could withstand a handgun, she aims for his head. She forgives him later when a film of one of their operations briefly shows that his compass contains a picture of her.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0458339", 
    "poster_url": "CaptainAmericaTheFirstAvenger.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "WaistcoatOfStyle", 
                "CoolOldGuy", 
                "BashBrothers", 
                "OfficerAndAGentleman", 
                "WomanScorned", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 8, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "LadyInRed", 
                "MsFanservice", 
                "ChivalrousPervert", 
                "KnightInShiningArmor", 
                "BashBrothers", 
                "TheCasanova", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "TheSquadette", 
                "TheBaroness", 
                "CoolOldGuy", 
                "HotChickInABadassSuit", 
                "OfficerAndAGentleman", 
                "TheCasanova", 
                "BashBrothers"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "ShirtlessScene", 
                "Hunk", 
                "EstrogenBrigade", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "ChivalrousPervert", 
                "BashBrothers", 
                "Hunk", 
                "TheCasanova", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "ResidentEvil", 
            "name": "Resident Evil", 
            "poster_url": "ResidentEvil.jpg"
        }
    ], 
    "id": "CaptainAmericaTheFirstAvenger", 
    "name": "Captain America: The First Avenger"
}