{
    "plot": "Arrested during the Monmouth Rebellion and falsely convicted of treason, Dr. Peter Blood is banished to the West Indies and sold into slavery. In Port Royal, Jamaica the Governor's daughter Arabella Bishop buys him for £10 to spite her uncle, Col. Bishop who owns a major plantation. Life is hard for the men and for Blood as well. By chance he treats the Governor's gout and is soon part of the medical service. He dreams of freedom and when the opportunity strikes, he and his friends rebel taking over a Spanish ship that has attacked the city. Soon, they are the most feared pirates on the seas, men without a country attacking all ships. When Arabella is prisoner, Blood decides to return her to Port Royal only to find that it is under the control of England's new enemy, France. All of them must decide if they are to fight for their new King.", 
    "genres": "Action, Adventure", 
    "release_year": "1935", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old", 
                    "English", 
                    "first", 
                    "good", 
                    "pirate", 
                    "loyal", 
                    "British"
                ], 
                "role": "Lord Willoughby in Captain Blood. He may be an old English windbag at first, but anyone with only a silver tongue and some good news as leverage who can turn a pirate crew who scoff at sailing for the King into loyal fighting sailors for the British Navy in five minutes is a force to be reckoned with.", 
                "id": "CoolOldGuy"
            }
        ]
    }, 
    "imdbid": "tt0026174", 
    "similar": [
        {
            "shared": [
                "CoolOldGuy"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy"
            ], 
            "shared_count": 1, 
            "id": "StarTrekNemesis", 
            "name": "Star Trek: Nemesis", 
            "poster_url": "StarTrekNemesis.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy"
            ], 
            "shared_count": 1, 
            "id": "Stargate", 
            "name": "Stargate", 
            "poster_url": "Stargate.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy"
            ], 
            "shared_count": 1, 
            "id": "AHardDaysNight", 
            "name": "A Hard Day's Night", 
            "poster_url": "AHardDaysNight.jpg"
        }
    ], 
    "id": "CaptainBlood", 
    "name": "Captain Blood"
}