{
    "plot": "In this second installment to the original Care Bear Movie trilogy of the 1980s, the Care Bear Family goes on their first Caring Mission--to stop the evil doings of a demon villain, named Dark Heart, from taking over a summer camp while making the Bears and Cousins vanish forever. In exchange for the Family's capture, he gives a camper named Christy the chance to succeed as the \"Camp Champ\" over her so-named rival. While starting the Kingdom of Caring, its founders (True Heart Bear and Noble Heart Horse) will stop at nothing to end the wrath of the Bears' first villain. Christy's friends, Dawn and John, and the rest of the Family join them in doing so. Narrating the tale is the Great Wishing Star (voiced by Chris Wiggins), who also helps True Heart and Noble Heart start the Kingdom, as both of them take care of the little orphan Cubs.", 
    "genres": "Animation, Family, Fantasy", 
    "release_year": "1986", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "self-proclaimed"
                ], 
                "role": "In Care Bears Movie II: A New Generation, it's taunting from the self-proclaimed Camp Champ that leads Christy to turn to The Dark Side.", 
                "id": "JerkJock"
            }
        ]
    }, 
    "imdbid": "tt0090799", 
    "poster_url": "CareBearsMovieIIANewGeneration.jpg", 
    "similar": [
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "OurTown", 
            "name": "Our Town", 
            "poster_url": "OurTown.jpg"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "TheRageCarrie2", 
            "name": "The Rage: Carrie 2"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "TheHotChick", 
            "name": "The Hot Chick", 
            "poster_url": "TheHotChick.jpg"
        }
    ], 
    "id": "CareBearsMovieIIANewGeneration", 
    "name": "Care Bears Movie II: A New Generation"
}