{
    "plot": "Billy Bigelow has been dead for fifteen years, and now outside the pearly gates, he long waived his right to go back to Earth for a day. But he has heard that there is a problem with his family, namely his wife Julie Bigelow née Jordan and the child he never met, that problem with which he would now like to head back to Earth to assist in rectifying. Before he is allowed back to Earth, he has to get the OK from the gatekeeper, to who he tells his story... Immediately attracted to each other, he and Julie met when he worked as a carousel barker. Both stated to the other that they did not believe in love or marriage, but they did get married. Because the shrewish carousel owner, Mrs. Mullin, was attracted to Billy herself, and since she believed he was only of use as a barker if he was single to attract the young women to the carousel, she fired him. With no other job skills and unwilling to take just any job, Billy did not provide for Julie but rather lived off Julie's Aunt Nettie. But Billy figured he could be the breadwinner through his association with a criminal lowlife named Jigger Craigin, which led to his death. In going back to Earth, Billy not only hopes to help his child, but \"tell\" Julie of his true feeling for her.", 
    "genres": "Drama, Musical", 
    "release_year": "1956", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Disappeared Dad: Billy for Louise, though there is an explanation for this, and the audience gets to know what happened from Billy's point of view.", 
                "id": "DisappearedDad"
            }
        ]
    }, 
    "imdbid": "tt0049055", 
    "poster_url": "Carousel.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "TheFog", 
            "name": "The Fog", 
            "poster_url": "TheFog.jpg"
        }
    ], 
    "id": "Carousel", 
    "name": "Carousel"
}