{
    "plot": "Carrie White is a shy young girl who doesn't make friends easily. After her class mates taunt her about her horrified reaction to her totally unexpected first period one of them takes pity on her and gets Tommy Ross, her boyfriend and class hunk to invite Carrie to the senior prom. Meanwhile another girl who has been banned from the prom for her continued aggressive behaviour is not as forgiving and plans a trick to embarrass Carrie in front of the whole school. What she doesn't realise is that Carrie is ... gifted, and you really don't want to get her angry.", 
    "genres": "Horror", 
    "release_year": "1976", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Carrie White in Carrie. Her father died in an accident before she was born.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Disappeared Dad: The book version of Carrie's father died in an accident before she was born. In the 1976 film, though, it is made clear that Ralph White left Margaret for another woman, acting as a Sequel Hook for The Rage: Carrie 2.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Disappeared Dad: Carrie's father died in an accident before she was born.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "original", 
                    "nice", 
                    "prom-night", 
                    "straight-A", 
                    "professional", 
                    "original", 
                    "little", 
                    "discernible"
                ], 
                "role": "Tommy in the original film was a subversion; he was a nice boy who genuinely cared for Carrie, and was visibly pissed off when she fell victim to Chris' prom-night prank. The book subverted it further by showing that he was a straight-A student and an amateur writer, who wanted to get a college degree before pursuing a career in professional baseball. The remake (and to some extent the original film), while keeping his niceness, turned him into a Brainless Beauty for little discernible reason.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "song"
                ], 
                "role": "\"She Walks on Me\" is a song about an Alpha Bitch and the damage she does. \"Carrie, Carrie, / please come here. / No, don't you touch me. / Don't you dare!\"", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "attractive", 
                    "different", 
                    "nice"
                ], 
                "role": "Beautiful All Along: Carrie. Justified in the novel; before the prom, she deliberately wore unflattering clothes, because her mother believed that trying to look attractive is sinful. Justified in both the films for different reasons. In the 70s film, Miss Collins suggests that Carrie would look nice if she paid some attention to her appearance. In the 2002 film, she got advice from Sue and is shown reading teen fashion magazines for tips.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Referenced directly and mocked in the 2002 remake of Carrie, when the jock replies to his girlfriend's request to take Carrie to the prom.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Beautiful All Along", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "likely", 
                    "black-haired"
                ], 
                "role": "Blondes are Evil: This trope is likely the reason for Chris's Adaptation Dye-Job in the '76 and '02 versions. She is black-haired in the book, but in both of those films she was blonde. The '02 version also has a gang of blonde extras who are frequently seen turning their noses up at Carrie. Averted with Helen in the remake. Pointedly averted in the '13 version, where Portia Doubleday (whose IMDb photo shows her as a blonde) dyed her hair brown to play Chris.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "likely", 
                    "black-haired"
                ], 
                "role": "Blondes are Evil: This trope is likely the reason for Chris's Adaptation Dye Job in the '76 and '02 versions. She is black-haired in the book, but in both of those films she was blonde. The '02 version also has a gang of blonde extras who are frequently seen turning their noses up at Carrie. Averted with Helen in the remake. Pointedly averted in the '13 version, where Portia Doubleday (whose IMDb photo shows her as a blonde) dyed her hair brown to play Chris.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "likely", 
                    "brunette"
                ], 
                "role": "This trope is likely the reason two adaptations of Carrie have given Alpha Bitch Chris Hargensen an Adaptation Dye-Job. The character was brunette in the book but has been played by blondes Nancy Allen and Emilie De Ravin. The actress playing her in the 2013 remake however dyed her hair brown for the role.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "toxic"
                ], 
                "role": "Daddy's Girl: Chris in the novel and 2013 film adaptation is a particularly toxic example.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Evil Matriarch", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "religious", 
                    "fanatic", 
                    "related", 
                    "psychic", 
                    "shameful", 
                    "dreadful"
                ], 
                "role": "Carrie's mother Margaret White. A religious fanatic who fiercely abhors everything even slightly related to femininity and sexuality, and who sees her psychic daughter as nothing but an abomination and a shameful reminder of that one dreadful time when her husband had his way with her.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "female", 
                    "favorite", 
                    "troubled"
                ], 
                "role": "Female Misogynist: Margaret, in spades - the evils of women and female sexuality is one of her favorite subjects. In the book, it's implied that this comes, in part, from troubled relationships with her mother and grandmother.", 
                "id": "FemaleMisogynist"
            }, 
            {
                "adjectives": [
                    "final", 
                    "few", 
                    "comedic"
                ], 
                "role": "The slasher film final girl spoof was done a few decades previously (and just as, if not more, effectively) in 1982's Pandemonium, with the character of Candy, who was not only a comedic take on the Final Girl, but also on Carrie.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "close", 
                    "blood-shade", 
                    "color-coding", 
                    "related"
                ], 
                "role": "Carrie by Stephen King. Well, it was a red prom dress, but that's fairly close... Definitely at least qualifies for the blood-shade color-coding in the related trope Bring My Red Jacket.\n \"It's pink, Mama.\"", 
                "id": "LittleDeadRidingHood"
            }, 
            {
                "adjectives": [], 
                "role": "Spoiled Sweet: Sue Snell.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0074285", 
    "poster_url": "Carrie.jpg", 
    "similar": [
        {
            "shared": [
                "SpoiledSweet", 
                "BeautifulAllAlong", 
                "BlondesAreEvil", 
                "AlphaBitch"
            ], 
            "shared_count": 4, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "DisappearedDad", 
                "AlphaBitch", 
                "DaddysGirl"
            ], 
            "shared_count": 4, 
            "id": "ALittlePrincess", 
            "name": "A Little Princess", 
            "poster_url": "ALittlePrincess.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "DisappearedDad", 
                "JerkJock", 
                "DaddysGirl"
            ], 
            "shared_count": 4, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "BeautifulAllAlong", 
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 4, 
            "id": "BatmanReturns", 
            "name": "Batman Returns", 
            "poster_url": "BatmanReturns.jpg"
        }, 
        {
            "shared": [
                "BlondesAreEvil", 
                "AlphaBitch", 
                "FinalGirl"
            ], 
            "shared_count": 3, 
            "id": "DevilsPrey", 
            "name": "Devil's Prey", 
            "poster_url": "DevilsPrey.jpg"
        }
    ], 
    "id": "Carrie", 
    "name": "Carrie"
}