{
    "plot": "Juan Oliver wants to make a good impression at his new job as a prison officer and reports to work a day early, leaving his pregnant wife, Elena, at home. His destiny is forever changed by this fateful decision, as during his tour of the prison, an accident occurs that knocks him unconscious. He is rushed to the empty but visibly haunted walls of cell 211. As this diversion unfolds, inmates of the high security cell block strategically break free and hijack the penitentiary. Aware of the violence that is to come, the prison officers flee, leaving Juan stranded and unconscious in the heart of the riot. When Juan awakens, he immediately takes stock of the situation; in order to survive, he must pretend to be a prisoner. Juan develops a dialogue with the violent leader of the riot, Badass, and the two begin a partnership, Badass fully believing that Juan is a new inmate. Negotiations go smoothly until the rioters take three ETA (the militant Basque separatist organization) prisoners hostage. When this hits the news, it triggers a stream of prison riots throughout the country as well as demonstrations in the Basque Country. Juan quickly realizes that he is on his own as the situation becomes more politicized and the government gets involved, afraid of potential ramifications in the Basque community. As the drama heightens, unexpected shifts in character both within and without the prison occur.", 
    "genres": "Action, Drama, Thriller", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Baritone: Malamadre.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [], 
                "role": "Dirty Coward: Urrutia.", 
                "id": "DirtyCoward"
            }
        ]
    }, 
    "imdbid": "tt1242422", 
    "poster_url": "Cell211.jpg", 
    "similar": [
        {
            "shared": [
                "BadassBaritone", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "BadassBaritone", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "BadassBaritone", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Underworld", 
            "name": "Underworld", 
            "poster_url": "Underworld.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "ISpitOnYourGrave", 
            "name": "I Spit on Your Grave", 
            "poster_url": "ISpitOnYourGrave.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "WomanInTheMoon", 
            "name": "Woman in the Moon", 
            "poster_url": "WomanInTheMoon.jpg"
        }
    ], 
    "id": "Cell211", 
    "name": "Cell 211"
}