{
    "plot": "The shy, lonely and outcast teenager Andrew Detmer is bullied and has no friends at high-school and lives with his abusive and alcoholic father Richard Detmer and his terminally ill mother Karen. Andrew buys a camera to film his everyday life. His cousin Matt Garetty drives him to school and invites Andrew to go to a party at night. They meet their schoolmate Steve Montgomery in the party and they overhear a noise and find a hole in a field. They decide to explore the underground and they acquire powers. Soon the trio learns how to control their telekinetic abilities and Andrew becomes the most powerful. But he easily loses his temper and becomes dangerous while Matt tries to control him. When his mother needs a medicine and Andrew does not have enough money to buy it, his darker side overcomes and he becomes a menace.", 
    "genres": "Drama, Sci-Fi, Thriller", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "usual"
                ], 
                "role": "Big Man on Campus: Steve. Unlike the usual examples, he is a genuine Nice Guy and nice to Andrew before they all get powers.", 
                "id": "BigManOnCampus"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "blog—she", 
                    "implied", 
                    "good"
                ], 
                "role": "Matt's turn towards heroism is also implied to be somewhat influenced by him hanging around Casey and watching her blog—she's implied to be something of a Granola Girl interested in fixing the ills of the world, and he wants to look good in her eyes", 
                "id": "GranolaGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Ill Girl: Mrs. Detmer.", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [
                    "sympathetic"
                ], 
                "role": "Team Mom: Steve, who's a lot more sympathetic toward Andrew and pretty much The Heart of the trio  before he dies.", 
                "id": "TeamMom"
            }
        ]
    }, 
    "imdbid": "tt1706593", 
    "poster_url": "Chronicle.jpg", 
    "similar": [
        {
            "shared": [
                "GranolaGirl", 
                "IllGirl"
            ], 
            "shared_count": 2, 
            "id": "MyGirl", 
            "name": "My Girl", 
            "poster_url": "MyGirl.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "IllGirl"
            ], 
            "shared_count": 2, 
            "id": "UncleTomsCabin", 
            "name": "Uncle Tom's Cabin"
        }, 
        {
            "shared": [
                "TeamMom", 
                "IllGirl"
            ], 
            "shared_count": 2, 
            "id": "LittleWomen", 
            "name": "Little Women", 
            "poster_url": "LittleWomen.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "IllGirl"
            ], 
            "shared_count": 2, 
            "id": "TheSecretGarden", 
            "name": "The Secret Garden", 
            "poster_url": "TheSecretGarden.jpg"
        }, 
        {
            "shared": [
                "GranolaGirl"
            ], 
            "shared_count": 1, 
            "id": "PracticalMagic", 
            "name": "Practical Magic", 
            "poster_url": "PracticalMagic.jpg"
        }
    ], 
    "id": "Chronicle", 
    "name": "Chronicle"
}