{
    "plot": "In a far away, long ago kingdom, Cinderella is living happily with her mother and father until her mother dies. Cinderella's father remarries a cold, cruel woman who has two daughters, Drizella and Anastasia. When the father dies, Cinderella's wicked stepmother turns her into a virtual servant in her own house. Meanwhile, across town in the castle, the King determines that his son the Prince should find a suitable bride and provide him with a required number of grandchildren. So the King invites every eligible maiden in the kingdom to a fancy dress ball, where his son will be able to choose his bride. Cinderella has no suitable party dress for a ball, but her friends the mice, led by Jaques and Gus, and the birds lend a hand in making her one, a dress the evil stepsisters immediately tear apart on the evening of the ball. At this point, enter the Fairy Godmother, the pumpkin carriage, the royal ball, the stroke of midnight, the glass slipper, and the rest, as they say, is fairy tale history.", 
    "genres": "Animation, Family, Fantasy", 
    "release_year": "1950", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Anastasia's boyfriend, Dimitri, the baker boy from Cinderella II.", 
                "id": "BigBeautifulMan"
            }, 
            {
                "adjectives": [
                    "beautiful"
                ], 
                "role": "Dirty Old Man: When the king and queen are discussing Cinderella, the king is a little too impressed with how beautiful she is.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Disappeared Dad: His death is part of the film's prologue.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "clear", 
                    "dead", 
                    "dead"
                ], 
                "role": "Disappeared Dad: It's made pretty clear that Cinderella's father is dead. But we never learn where her mother went. (She's probably dead too.) And the Prince's parents are both dead in the 2013 version, opening up an opportunity for villains to seize power.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Prince Charming: He doesn't even have a first name.", 
                "id": "PrinceCharming"
            }, 
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Rebel Prince: If the King's word is to be trusted, Prince Charming is a bit like this; this is best seen at the beginning of the ball where after bowing to greet a guest the Prince looks up to his father in the balcony and yawns; that might not seem like much today but at the time depicted in the film it was like giving his old man the finger.", 
                "id": "RebelPrince"
            }, 
            {
                "adjectives": [
                    "serious"
                ], 
                "role": "The king in Cinderella seems to be of the opinion that his son is this, because he hasn't settled down and produced some heirs yet. This viewpoint gets a little more credit when the prince is acting very disinterested at the beginning of the ball, going as far as looking up at his father in the balcony and visibly yawning.(In the film's time period, this could be likened to flipping the bird at his dad.)\n Given even more credibility in the surprisingly-good Cinderella III: A Twist in Time. Once the Prince decides he's going after Cinderella, there is nothing his father can say to stop him. (The King, to his credit, lets him go once he realizes how serious the Prince is about it.)", 
                "id": "RebelPrince"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Cinderella — Cinderella (1950)", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Evil Matriarch: Lady Tremaine.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "Magical"
                ], 
                "role": "Magical Nanny: Sort of. In this version the fairy godmother really is Cinderella's godmother. She just hasn't told her she's a fairy yet.", 
                "id": "MagicalNanny"
            }, 
            {
                "adjectives": [
                    "main", 
                    "dead", 
                    "many", 
                    "alive"
                ], 
                "role": "Cinderella: The main character's mother is deceased. The Prince's mother is also absent. One of the sequels confirms that she's dead, and that the King loved her very much. (However, in many non-Disney adaptations, the Queen is still alive.)", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "atypical", 
                    "main"
                ], 
                "role": "Missing Mom: The Prince's mom is never mentioned. Until Cinderella III, where the King mentions that she was... quite atypical for a noblewoman, but they still dearly loved each other. Cinderella's mom gets a couple tiny nods; the prologue makes it clear that she died and that the main reason her dad married again was because he thought she needed a mother. The dress that Cinderella originally plans to modify to wear to the ball was, as she specifically states, her mother's.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "love", 
                    "little"
                ], 
                "role": "In the sequels of Disney's Cinderella,  Anastasia, the redheaded stepsister is retconned into a character like this; insecure, looking for love but knowing little about it, etc.", 
                "id": "NaiveEverygirl"
            }, 
            {
                "adjectives": [
                    "Naïve"
                ], 
                "role": "Naïve Everygirl: Cinderella.", 
                "id": "NaiveEverygirl"
            }, 
            {
                "adjectives": [], 
                "role": "Princess Classic", 
                "id": "PrincessClassic"
            }, 
            {
                "adjectives": [], 
                "role": "Sassy Black Woman: The fairy godmother and the queen. Especially since they're played respectively by Whitney Houston and Whoopi Goldberg.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "third", 
                    "third", 
                    "first", 
                    "second", 
                    "local"
                ], 
                "role": "In Cinderella, by the third move Anastasia becomes Spoiled Sweet, or maybe a Jerk with a Heart of Gold. The third movie shows her to be not quite the Alpha Bitch in the first movie; not only does she apologize and say \"I didn't mean that!\" when she accidentally petrifies the Fairy Godmother, but she gives up her chance to marry Prince Charming because she doesn't want to marry him if he didn't love her. And in the second, which gives the story its conclusion, the circle comes to an end as Anastasia falls for a commoner (the local baker boy and Big Beautiful Man, Dimitri), finally confronts Lady Tremaine in her bullcrap, gets to marry the man she loves and fully reconciles herself with Cindy and the Prince.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [], 
                "role": "The heroine of Cinderella maintains her optimism and purity even while living a crapsack life.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [], 
                "role": "The Ingenue: Guess who?", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "past", 
                    "short", 
                    "same"
                ], 
                "role": "Genderflipped in Cinderella. In the flashbacks to Cinderella's past, we see that her Disappeared Dad was very Tall, Dark and Handsome. Prince Charming, however, has a chubby and short dad who kinda looks like the Sultan.\n The same can be said of Prince Phillip and King Hubert", 
                "id": "TheUglyGuysHotDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "The Ugly Guy's Hot Son: The Prince and the King.", 
                "id": "TheUglyGuysHotDaughter"
            }, 
            {
                "adjectives": [
                    "archetypal", 
                    "cinematic", 
                    "own", 
                    "later"
                ], 
                "role": "Wicked Stepmother: Lady Tremaine, probably the archetypal cinematic example. She's also this to her own daughters in the later films.", 
                "id": "WickedStepmother"
            }
        ]
    }, 
    "imdbid": "tt0042332", 
    "poster_url": "Cinderella.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "BigBeautifulMan", 
                "TheUglyGuysHotDaughter", 
                "DirtyOldMan", 
                "SpoiledSweet", 
                "EverythingsBetterWithPrincesses", 
                "TheIngenue", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "PrinceCharming", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "NaiveEverygirl", 
                "SassyBlackWoman", 
                "MissingMom"
            ], 
            "shared_count": 7, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EvilMatriarch", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "SnowWhiteAndTheSevenDwarfs", 
            "name": "Snow White and the Seven Dwarfs"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EvilMatriarch", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "WickedStepmother"
            ], 
            "shared_count": 6, 
            "id": "Tangled", 
            "name": "Tangled", 
            "poster_url": "Tangled.png"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "TheUglyGuysHotDaughter", 
                "PrincessClassic", 
                "TheIngenue", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }
    ], 
    "id": "Cinderella", 
    "name": "Cinderella"
}