{
    "plot": "While searching for the daughter of a Japanese publishing magnate, private investigator Ryu Saeba and his assistant Kaori are caught up in the middle of a cruise liner highjacking. It's up to Ryu to save the day...but can he do it on an empty stomach?", 
    "genres": "Action, Comedy, Romance", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Chivalrous", 
                    "last"
                ], 
                "role": "Chivalrous Pervert: Ryo himself, to an extent. He does his best to honor his best friend's last request and not seduce her, at least.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [], 
                "role": "Dirty Old Man: Doc.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [
                    "mercenary"
                ], 
                "role": "Umibozu acts as this toward Maki Himuro, the daughter of his commander in his mercenary days: his reaction to Ryo having a mokkori before her is to shoot at Ryo's penis with a Smith & Wesson Model 29.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [
                    "first", 
                    "rich", 
                    "entire", 
                    "first", 
                    "obvious", 
                    "naive", 
                    "second", 
                    "fast", 
                    "fast", 
                    "fifth", 
                    "other", 
                    "politician", 
                    "first", 
                    "ran"
                ], 
                "role": "City Hunter has a couple examples:\n The first is a rich man who kept his daughter away from people for her entire childhood, and when she got a job in a fast food he went and hired City Hunter, knowing fully well he was not just a bodyguard but a killer too, to protect her from perverts. He had a point: first, he hired the killer only after seeing an obvious pervert flirting with his immensely naive daughter (you can imagine his horror when he finally met City Hunter and saw that he was the pervert); second, that fast food was in the middle of a territory subjected to a turf war between two rival yakuza groups, turf war that had already claimed four directors of that fast food and would claim a fifth after the end of the arc. Admittedly, he didn't know of the turf war when he hired City Hunter, but he was right.\n The other is a politician whose reaction to his daughter running away from home is to hire Umibozu (a known killer) to take her back home and murder her boyfriend. Given his daughter's reaction to Umibozu attacking with a bazooka, it wasn't the first time he did something like that. Again, he had a point by accident: she had ran from home not only to go away with her boyfriend, but also because she was being pursued by a terrorist organization for accidentally witnessing where they had placed a nuke. Also, he gave his blessing when he saw that the boyfriend reacted to the terrorists attacking her by shielding her with his body.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "Overprotective", 
                    "rich", 
                    "naive", 
                    "overprotective", 
                    "fast", 
                    "politician", 
                    "capable", 
                    "bazooka-wielding", 
                    "mercenary"
                ], 
                "role": "Overprotective Dad: Once in a while we have some client like this, like the rich man with a naive daughter (naivety caused by him being overprotective, by the way) who, upon her getting a job in a fast food, hired City Hunter to defend her (that was before he found out of the mafia war in the area of the fast food), or the politician who hired Umibozu to retrieve her runaway daughter and murder the guy he had ran away with (luckily, the daughter, knowing that her father was capable to sick a bazooka-wielding killer on her boyfriend, was using Ryo as bait for the expected killer). Umibozu acts as this toward Maki Himuro, the daughter of his commander in his mercenary days: his reaction to Ryo having a mokkori before her is to shoot at Ryo's penis with a Smith & Wesson Model 29.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "dark", 
                    "Japanese"
                ], 
                "role": "Scary Black Man: Umibozu, sort of, though he's just dark for a Japanese man.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "successful", 
                    "few"
                ], 
                "role": "The Casanova: Ryo. He's actually a very successful one until Kaori came along... Even then, Kaori can only prevent him from consummating in their home, as they will fall for him, with very few exceptions. Mick Angel, an American friend of Ryo, has the hobby of seducing married or otherwise engaged women. Especially if he's been hired to kill their man.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [
                    "first", 
                    "initial", 
                    "other", 
                    "interesting", 
                    "second", 
                    "hard", 
                    "horny", 
                    "third", 
                    "eternal"
                ], 
                "role": "Happened three times in City Hunter. The first time Ryo had been stung by a killer bee, and the initial antidote to the poison had this side effect (other versions of the antidote had rather interesting side effects). The second time a Phantom Thief hypnotizes Ryo into impotence to neutralize his \"Mokkori Power\" (aka his will to fight and win), giving Ryo a really hard time until he got horny enough to break out of the block. The third time it happened to the Phantom Thief: he had tried to hypnotize Ryo into eternal impotence, but Ryo was carrying a mirror, and the idiot hypnotized himself.", 
                "id": "TheLoinsSleepTonight"
            }, 
            {
                "adjectives": [
                    "unable", 
                    "super-potent", 
                    "side-effect"
                ], 
                "role": "The Loins Sleep Tonight: Ryo is unable to get it up after being stung by genetically engineered bee with a super-potent venom. It was a side-effect of the antidote.", 
                "id": "TheLoinsSleepTonight"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "good", 
                    "fictional", 
                    "evil", 
                    "rich", 
                    "Japanese"
                ], 
                "role": "Everything's Better With Princesses: A good number of stories involve the protection of princesses of fictional eastern and island kingdoms from evil pretenders to the throne. And if they aren't princesses, then they're Oujo of a rich Japanese family, with either EvilUncles aiming for their heritage, or being in danger of being kidnapped for a ransom.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "Several"
                ], 
                "role": "Femme Fatale: Several over the course of the series.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "variant", 
                    "large"
                ], 
                "role": "City Hunter has a variant: Kaori has legitimately large breasts, but the humour comes from her being compared to women with an even larger bust (the one who was a teenager nearly sent her in an Heroic BSOD).", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "original"
                ], 
                "role": "At the beginning of the original series' Episode 43, the Girl of the Week, Utako Yumeno, knees a man in the groin from inside a train after he had suddenly bumped into her and accidentally looked down her shirt.", 
                "id": "GirlOfTheWeek"
            }
        ]
    }, 
    "imdbid": "tt0103950", 
    "poster_url": "CityHunter.jpg", 
    "similar": [
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "ScaryBlackMan", 
                "FemmeFatale", 
                "ChivalrousPervert"
            ], 
            "shared_count": 4, 
            "id": "Lucifer", 
            "name": "Lucifer"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "EverythingsBetterWithPrincesses", 
                "OverprotectiveDad", 
                "DirtyOldMan"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "GirlOfTheWeek", 
                "GagPenis", 
                "ChivalrousPervert"
            ], 
            "shared_count": 4, 
            "id": "AustinPowers", 
            "name": "Austin Powers", 
            "poster_url": "AustinPowers.jpg"
        }, 
        {
            "shared": [
                "DirtyOldMan", 
                "FemmeFatale", 
                "ChivalrousPervert"
            ], 
            "shared_count": 3, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "OverprotectiveDad", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "LoveInTheAfternoon", 
            "name": "Love in the Afternoon", 
            "poster_url": "LoveInTheAfternoon.jpg"
        }
    ], 
    "id": "CityHunter", 
    "name": "City Hunter"
}