{
    "plot": "London-based Emily Wang gained minor notoriety from her VJ-ing on cable television. She is now more renowned for being the longtime girlfriend and pseudo manager of rock musician Lee Hauser, who seems to be on the brink of stardom. Those that know the couple believe she is a bad influence on him, and is the reason why he is a junkie. After Lee dies from an accidental heroin overdose and Emily is imprisoned for six months on possession charges, she learns that the courts have awarded custody of their young adolescent son, Jay, to Lee's aging parents, Albrecht and Rosemary Hauser, who live in Vancouver. A concerned Albrecht asks that she not attempt to see Jay for at least two years while she cleans up her act so as to give Jay a fighting chance at a decent life. Emily initially agrees, knowing that she is in no position to look after Jay. To regain her life, she decides to move back to her old stomping grounds of Paris. As Emily tries mostly unsuccessfully to become clean while eking out a living doing what she wants to earn money, which is primarily still in the realm of rock music, Rosemary poisons Jay's mind about his mother. Caught in the middle is Albrecht, who, out of personal circumstance, wants Jay to eventually have a relationship with his mother if only because he knows that he and Rosemary will not be able to look after Jay until adulthood and that Emily is the only other family he has.", 
    "genres": "Drama, Music", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Emily's father-in-law, played by Nick Nolte.", 
                "id": "CoolOldGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Missing Mom: What Emily has been to her son, and no longer wants to be.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "In-universe", 
                    "many", 
                    "latter-day"
                ], 
                "role": "Yoko Oh No: In-universe, many people in the rock scene perceive Emily as a latter-day Yoko Ono, and blame her for her boyfriend's fall into obscurity as well as for his death.", 
                "id": "YokoOhNo"
            }, 
            {
                "adjectives": [
                    "drug-related", 
                    "former"
                ], 
                "role": "Emily Wang in Clean gets blamed for the fall into obscurity and drug-related death of her boyfriend, a former rock star.", 
                "id": "YokoOhNo"
            }, 
            {
                "adjectives": [
                    "Many", 
                    "latter-day"
                ], 
                "role": "Yoko Oh No: Many people in the rock scene perceive Emily as a latter-day Yoko Ono, and blame her for her boyfriend's fall into obscurity as well as for his death.", 
                "id": "YokoOhNo"
            }
        ]
    }, 
    "imdbid": "tt0388838", 
    "poster_url": "Clean.jpg", 
    "similar": [
        {
            "shared": [
                "CoolOldGuy", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "TheSwanPrincess", 
            "name": "The Swan Princess", 
            "poster_url": "TheSwanPrincess.jpg"
        }, 
        {
            "shared": [
                "YokoOhNo", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Amelie", 
            "name": "Amélie"
        }, 
        {
            "shared": [
                "YokoOhNo", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "SesameStreet", 
            "name": "Sesame Street"
        }
    ], 
    "id": "Clean", 
    "name": "Clean"
}