{
    "plot": "In 48 B.C., Caesar pursues Pompey from Pharsalia to Egypt. Ptolemy, now supreme ruler after deposing his older sister, Cleopatra, attempts to gain favor with Caesar by presenting the conquerer with the head of Pompey, borne by his governors, Pothinos and Achillas. To win Caesar's support from her brother, Cleopatra hides herself in a rug, which Apollodorus, her servant, presents to Caesar. The Roman is immediately infatuated; banishing Ptolemy, he declares Cleopatra Egypt's sole ruler and takes her as his mistress. A son, Caesarion, is born of their union. Caesar, however, must return to Italy. Although he is briefly reunited with Cleopatra during a magnificent reception for the queen in Rome, Caesar is assassinated shortly thereafter, and Cleopatra returns to Egypt. When Mark Antony, Caesar's protégé, beholds Cleopatra aboard her elaborate barge at Tarsus some years later, he is smitten and becomes both her lover and military ally. Their liaison notwithstanding, Antony, to consolidate his position in Rome, marries Octavia, sister of the ambitious Octavian. The marriage satisfies no one. Cleopatra is infuriated, and Antony, tiring of his Roman wife, returns to Egypt. There he flaunts his liaison by marrying Cleopatra in a public ceremony. Sensing Antony's weakness, Octavian attacks and defeats his forces at Actium. Alarmed, Cleopatra withdraws her fleet and seeks refuge in her tomb.", 
    "genres": "Biography, Drama, History", 
    "release_year": "1963", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Caesar, Cicero and Sosigenes.", 
                "id": "CoolOldGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "The Woman Wearing the Queenly Mask", 
                "id": "TheWomanWearingTheQueenlyMask"
            }, 
            {
                "adjectives": [], 
                "role": "Woman Scorned: Averted. Despite all the public acknowledgements Caesar makes of his relationship to Cleopatra, Calpurnia stays dignified. Played straight with Cleopatra after Mark Antony marries Octavia. She humiliates him thoroughly during an audience when he needs a treaty from her.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0056937", 
    "poster_url": "Cleopatra.jpg", 
    "similar": [
        {
            "shared": [
                "WomanScorned", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "WomanScorned", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "Oblivion2013", 
            "name": "Oblivion ", 
            "poster_url": "Oblivion2013.jpg"
        }, 
        {
            "shared": [
                "WomanScorned", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "TheBluesBrothers", 
            "name": "The Blues Brothers", 
            "poster_url": "TheBluesBrothers.jpg"
        }, 
        {
            "shared": [
                "TheWomanWearingTheQueenlyMask", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "TheYoungVictoria", 
            "name": "The Young Victoria", 
            "poster_url": "TheYoungVictoria.jpg"
        }, 
        {
            "shared": [
                "WomanScorned", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }
    ], 
    "id": "Cleopatra", 
    "name": "Cleopatra"
}