{
    "plot": "A calamity at Dante and Randall's shops sends them looking for new horizons - but they ultimately settle at Mooby's, a fictional fast-food restaurant. Free from his dead-end job (and lodged in a new one), Dante begins to break free of his rut, planning to move away with his clingy fiancé. Dante is ready to leave the horrors of minimum-wage New Jersey behind, but Randal - always the more hostile of the two - starts to become overwhelmed by his own rancor.", 
    "genres": "Comedy", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "other", 
                    "racial", 
                    "comedian", 
                    "offensive"
                ], 
                "role": "Angry Black Woman: Wanda Sykes' character unloads on Randal when he says \"porch monkey\" and a host of other racial slurs openly in front of her. Meanwhile, her husband (played by comedian Earthquake) doesn't really give a damn and just wants the food. \"Baby, you can't taste racism!\" It's revealed in the bonus features that the majority of that scene was ad-libbed. Also a minor case of Hypocritical Humor, since before Randal insults her, she and her husband were talking about Mexican immigrants using equally offensive language.", 
                "id": "AngryBlackMan"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Bigger Is Better in Bed: Dante and Randal discuss the merits of female version of this trope.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [
                    "first", 
                    "unconventional", 
                    "good-looking", 
                    "hideous"
                ], 
                "role": "Kavorka Man : Dante. Discussed twice in-universe: the first time when Becky calls Dante's looks \"unconventional,\" and when Randal says \"You've always got two good-looking chicks fighting over you, and you're this hideous fucking CHUD.\"", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "later"
                ], 
                "role": "In Clerks II, Kinky Kelly's assistant (later revealed to be his partner) fits this trope to a T, though he's never explicitly mentioned as being gay.", 
                "id": "TheBear"
            }, 
            {
                "adjectives": [
                    "later", 
                    "other", 
                    "male", 
                    "animal"
                ], 
                "role": "The Bear: Kinky Kelly's assistant (later revealed to be his partner). Though he's never explicitly mentioned as being gay, he fits the other parts of the trope to a T. I mean, that is  a male donkey he's fucking. Although when it's another animal, perhaps the gender aspect goes out the window.", 
                "id": "TheBear"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Jay muses about this in Clerks II.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [], 
                "role": "Clerks II: Becky (Rosario Dawson).", 
                "id": "Meganekko"
            }
        ]
    }, 
    "imdbid": "tt0424345", 
    "poster_url": "ClerksII.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan", 
                "GreenSkinnedSpaceBabe", 
                "AngryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "AngryBlackMan", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "DontBeAMenaceToSouthCentralWhileDrinkingYourJuiceInTheHood", 
            "name": "Don't Be A Menace To South Central While Drinking Your Juice In The Hood", 
            "poster_url": "DontBeAMenaceToSouthCentralWhileDrinkingYourJuiceInTheHood.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "AngryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "AngryBlackMan", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "Mash", 
            "name": "M*A*S*H"
        }, 
        {
            "shared": [
                "Meganekko", 
                "AngryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "JayAndSilentBobStrikeBack", 
            "name": "Jay and Silent Bob Strike Back", 
            "poster_url": "JayAndSilentBobStrikeBack.jpg"
        }
    ], 
    "id": "ClerksII", 
    "name": "Clerks II"
}