{
    "plot": "Whilst crossing a ledge, 4000 feet above the earth, Gabe's friend's equipment fails to work and she slips out of his hand, falling to the ground. Almost a year later, Gabe is asked to go back to the same mountain range and rescue a group of 'stranded' people. The only catch is that these so called 'stranded' people are in fact looking for three boxes filled with $100,000,000 and they need a mountain ranger to lead them to them!!", 
    "genres": "Action, Adventure, Thriller", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "only", 
                    "later", 
                    "rebellious"
                ], 
                "role": "Amazon Chaser: The only member of his team Qualen actually admires is The Squadette, Kristel, who's notably smarter than the rest of his mooks (when making the fake distress call, she claims that one of their party is running out of insulin so the rescue team won't wait till after the storm). Subverted later in a Kick the Dog moment when Qualen shoots her dead solely to force the hand of another rebellious team member.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "martial-artist", 
                    "stalagmite"
                ], 
                "role": "Kynette of Cliffhanger is an evil martial-artist who dispassionately guns down a helpless teenage boy for just having seen his face. This lets us cheer when Sylvester Stallone shoves his evil heart into a stalagmite.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Black Man: Kynette, child-murderer and karate expert.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "only", 
                    "rebellious"
                ], 
                "role": "Cliffhanger. The only member of his team Qualen actually admires is Action Girl Kristel, who's smarter than the rest of his mooks (when making the fake distress call, she claims that one of their party is running out of insulin so the rescue team won't wait till after the storm).  Despite this, Qualen ruthlessly kills her to force the hand of a rebellious team member.", 
                "id": "TheSquadette"
            }
        ]
    }, 
    "imdbid": "tt0106582", 
    "poster_url": "Cliffhanger.jpg", 
    "similar": [
        {
            "shared": [
                "AmazonChaser", 
                "ScaryBlackMan", 
                "TheSquadette"
            ], 
            "shared_count": 3, 
            "id": "Predators", 
            "name": "Predators", 
            "poster_url": "Predators.jpg"
        }, 
        {
            "shared": [
                "ScaryBlackMan", 
                "TheSquadette"
            ], 
            "shared_count": 2, 
            "id": "Basic", 
            "name": "Basic", 
            "poster_url": "Basic.jpg"
        }, 
        {
            "shared": [
                "AmazonChaser", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "StreetFighter", 
            "name": "Street Fighter", 
            "poster_url": "StreetFighter.jpg"
        }, 
        {
            "shared": [
                "AmazonChaser", 
                "TheSquadette"
            ], 
            "shared_count": 2, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "AmazonChaser", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "KungFuPanda", 
            "name": "Kung Fu Panda", 
            "poster_url": "KungFuPanda.jpg"
        }
    ], 
    "id": "Cliffhanger", 
    "name": "Cliffhanger"
}