{
    "plot": "Flint Lockwood thinks he's a genius. But none of the things he invented are things that make sense or are useful. However, he has the support of his mother but when she dies, he's left alone with his father who thinks he should give it up. When the community that he lives in is in an economic crisis because their primary source of income, a sardine cannery, was shut down, Flint decides to try his latest invention, a machine that can turn water into food. But something goes wrong and the machine ends up in the atmosphere. Later it starts raining food. The shifty mayor tries to use this as a way to help their community, but when Flint senses something wrong with the machine, the mayor convinces him to ignore it. However, as Flint predicts, chaos ensues.", 
    "genres": "Animation, Comedy, Family", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "first"
                ], 
                "role": "A Lady on Each Arm: Brent's first appearance involves this.", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [], 
                "role": "Dirty Coward: The Mayor. Sure, blame Flint for your ignorant meddling.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "ocean", 
                    "giant", 
                    "ocean", 
                    "various"
                ], 
                "role": "Papa Wolf: Officer Devereaux loves his son so much that  when the leftover food dam breaks and his son is directly in the food avalanche's path, Devereaux runs all the way back from ocean's edge while carrying the giant food raft to rescue him. Then he outruns the food avalanche back to the ocean while carrying the raft containing his wife and son on in AND going through various food obstacles to safety.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "Officer Earl Devereaux from the animated Cloudy with a Chance of Meatballs. Extra points for being voiced by Mr T.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Black Man: Parodied by Officer Devereaux's devotion to his job.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "Top-Heavy"
                ], 
                "role": "Top-Heavy Guy: Officer Devereaux, Tim Lockwood and \"Baby\" Brent.", 
                "id": "TopHeavyGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Beautiful All Along: Flint encourages Sam to embrace the \"nerdy\" image she abandoned from childhood because that's who she is. Drops an anvil about the fact that beauty is in the eye of the beholder.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "ditzy", 
                    "intelligent", 
                    "beautiful"
                ], 
                "role": "Inverted in Cloudy with a Chance of Meatballs when the protagonist has the pretty, ditzy (yet secretly highly intelligent) female lead put on her glasses and scrunchie her hair into a ponytail... and he finds her profoundly more beautiful than before.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scoop: Sam Sparks.", 
                "id": "HotScoop"
            }, 
            {
                "adjectives": [], 
                "role": "Meganekko:  Sam Sparks", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "important", 
                    "scientific"
                ], 
                "role": "Cloudy with a Chance of Meatballs: Flint's mother dies when he was young. Although this was an important plot point; she encouraged him to pursue his scientific dreams and his dad never understood him. His mom was essentially their translator.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "brief"
                ], 
                "role": "Missing Mom: Flint. She did have a brief scene with him as a kid, and they mentioned she died. We just don't know how. She even appears as a ghost during the end credit montage.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0844471", 
    "poster_url": "CloudyWithAChanceOfMeatballs.jpg", 
    "similar": [
        {
            "shared": [
                "TopHeavyGuy", 
                "PapaWolf", 
                "Meganekko", 
                "BeautifulAllAlong"
            ], 
            "shared_count": 4, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "MissingMom", 
                "DirtyCoward", 
                "Meganekko", 
                "ALadyOnEachArm"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "DirtyCoward", 
                "MissingMom", 
                "ALadyOnEachArm"
            ], 
            "shared_count": 4, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MissingMom", 
                "ScaryBlackMan", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "ToKillAMockingbird", 
            "name": "To Kill a Mockingbird", 
            "poster_url": "ToKillAMockingbird.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MissingMom", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "NextAvengersHeroesOfTomorrow", 
            "name": "Next Avengers: Heroes of Tomorrow"
        }
    ], 
    "id": "CloudyWithAChanceOfMeatballs", 
    "name": "Cloudy with a Chance of Meatballs"
}