{
    "plot": "Clue is a movie about 6 guests, a butler, and a maid, who are all involved in the murders of 6 people. The guests all meet at Hill House, where you learn that Professor Plum works in D.C., where everyone else lives. Colonel Mustard is a client of Miss Scarlet, who is the ex-employer of Yvette, the maid, who had an affair with the husband of Mrs. White, etc. When Mr. Boddy, who is blackmailing each guest, gives the guests each a weapon, he tells them they should kill Wadsworth, the butler, to avoid being exposed. With Mrs. Peacock's craziness, and Mr. Green's clumsiness, the whole group finds themselves tangled in a web of murder, lies, and hilarity.", 
    "genres": "Comedy, Crime, Mystery", 
    "release_year": "1985", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "whole"
                ], 
                "role": "\"Mr. Green\" from the movie version of Clue. He's actually an FBI agent who spent the whole movie (plus whatever setup time the sting required) pretending to be gay to get into Mr. Boddy's blackmail ring. He is the one who finally killed Mr. Boddy. In the hallway. With the revolver.\n Depending on the version of the film you got.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [], 
                "role": "Battle Butler: Wadsworth doubles as both this and Mr. Exposition.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [], 
                "role": "Casanova Wannabe: Professor Plum", 
                "id": "CasanovaWannabe"
            }, 
            {
                "adjectives": [
                    "only", 
                    "main", 
                    "illegal", 
                    "political", 
                    "third"
                ], 
                "role": "Depraved Homosexual: Inverted. Mr. Green says he is being blackmailed for being gay, but is the only one of the main characters who was never involved in any illegal activity. While the others were being blackmailed for things like war profiteering, political corruption, and murder, his only \"crime\" was being homosexual. Even in the third ending, wherein everyone killed someone, his only victim was the villain, Wadsworth...and then he says he's not really gay.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "only", 
                    "main", 
                    "illegal", 
                    "third"
                ], 
                "role": "Inverted in Clue. Mr. Green says he is being blackmailed for being gay, but is also the only one of the main characters who was never involved in any illegal activity. While the others were being blackmailed for things like war profiteering, rape, and murder, his only \"crime\" was being homosexual. Even in the third ending, wherein everyone killed someone, his only victim was the villain, Wadsworth...and then he says he's not really gay.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "third", 
                    "probable"
                ], 
                "role": "Straight Gay: Mr. Green, unless  the third ending is the correct ending, in which case he was a plant (\"A plant? I thought men like you were usually called a fruit.\") from the FBI pretending to be gay so he would be blackmailed, and is in fact \"going home to sleep with [his] wife\". So he says.  He couldn't very well have told his boss something else, could he? All the evidence that he was gay burned up earlier in the movie. Given Wadsworth's surprise when going through the evidence,  it's probable that Green actually is straight - or at least being gay would not appear to be what he was being blackmailed for.", 
                "id": "StraightGay"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "strong", 
                    "disposable"
                ], 
                "role": "Black Widow: Mrs. White. \"Husbands should be like kleenex. Soft, strong, and disposable.\"", 
                "id": "BlackWidow"
            }, 
            {
                "adjectives": [
                    "good", 
                    "other"
                ], 
                "role": "This is Mrs. White's backstory in Clue. She's had five husbands, and we learn the fate of two. One was an illusionist who disappeared and never reappeared (\"He wasn't a very good illusionist\"). As for the other, according to Mrs. White, someone \"had cut off his head and his, well, you know.\"", 
                "id": "BlackWidow"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Femme Fatale:  Yvette, and Miss Scarlet in the first ending.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "modest", 
                    "French", 
                    "maid", 
                    "jiggle", 
                    "French", 
                    "modest"
                ], 
                "role": "\"Yvette, The French Maid\" (pictured above) in the movie Clue. She also wore a relatively modest version of the sexy French Maid's outfit.  Although she apparently wasn't REALLY French, or a maid...\n Given that you could use her... assets as a place to set your drink down, provided you didn't mind a little spillage from the bounce and jiggle, the fact that her French maid uniform is considered \"modest\" should tell you something about this trope.", 
                "id": "FrenchMaid"
            }, 
            {
                "adjectives": [
                    "French", 
                    "French", 
                    "maid", 
                    "French"
                ], 
                "role": "French Maid: Yvette  who isn't really French or a maid (although she says \"it's you!\" with her French accent, so it may be that the American accent was fake). But that's okay. Currently the page image for the trope.", 
                "id": "FrenchMaid"
            }, 
            {
                "adjectives": [], 
                "role": "Gag Boobs: Yvette.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [], 
                "role": "Yvette from Clue.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "imaginable", 
                    "lecherous", 
                    "conservative", 
                    "other", 
                    "sex-kitten", 
                    "alleged", 
                    "homosexual"
                ], 
                "role": "Everyone got paired up with the worst partner imaginable for that scene: Miss Scarlet with Colonel Mustard (one of her clients), Wadsworth and Mrs. White (see above), Mrs. Peacock and the lecherous Professor Plum (one's uptight and conservative, the other is a lech), and sex-kitten Yvette with alleged homosexual Mr. Green.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [], 
                "role": "Mrs Peacock in Clue seems to be this.  She's Obfuscating Insanity, at least in one of the Multiple Endings.", 
                "id": "HystericalWoman"
            }, 
            {
                "adjectives": [
                    "sympathetic"
                ], 
                "role": "Ice Queen Mrs. White is the most sympathetic when Wadsworth sobs that his wife was a socialist.", 
                "id": "IceQueen"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Colleen Camp as Yvette.  This is even justified, as she's actually one of Miss Scarlet's prostitutes. For that matter, Miss Scarlet.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0088930", 
    "poster_url": "Clue.jpg", 
    "similar": [
        {
            "shared": [
                "GagBoobs", 
                "MsFanservice", 
                "HelloNurse", 
                "FemmeFatale"
            ], 
            "shared_count": 4, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }, 
        {
            "shared": [
                "IceQueen", 
                "MsFanservice", 
                "BlackWidow"
            ], 
            "shared_count": 3, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "BattleButler", 
                "MsFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "DepravedHomosexual", 
                "MsFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "Coonskin", 
            "name": "Coonskin"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "FemmeFatale", 
                "BlackWidow"
            ], 
            "shared_count": 3, 
            "id": "TheManWithTwoBrains", 
            "name": "The Man With Two Brains", 
            "poster_url": "TheManWithTwoBrains.jpg"
        }
    ], 
    "id": "Clue", 
    "name": "Clue"
}