{
    "plot": "Cher, a high school student in Beverly Hills, must survive the ups and downs of adolescent life. Her external demeanor at first seems superficial, but rather it hides her wit, charm, and intelligence which help her to deal with relationships, friends, family, school, and the all-important teenage social life.", 
    "genres": "Comedy, Romance", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Christian", 
                    "knowledgeable", 
                    "stupid", 
                    "physical", 
                    "throw-down"
                ], 
                "role": "Cultured Badass: Christian, a Rat Pack lover, knowledgeable about the arts, and has a taste for Billie Holiday and vintage films... but you do anything so stupid that could threaten someone else's safety, he won't be afraid to confront you with the threat of a physical throw-down.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "little"
                ], 
                "role": "Clueless has the dad drop this little hint to a guy taking his daughter out:", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "Overprotective"
                ], 
                "role": "Overprotective Dad", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "naïve", 
                    "sharp"
                ], 
                "role": "Straight Gay: Subverted. Christian does indeed have some Camp Gay tendencies but Cher is too naïve to realise. Her father doesn't appear to notice either, thinking him instead a Sinatra-wannabe. Must be a California thing. Murray's Gaydar is very sharp though.", 
                "id": "StraightGay"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "good", 
                    "naive", 
                    "unusual", 
                    "actual", 
                    "considerate", 
                    "usual", 
                    "several", 
                    "unfashionable", 
                    "shallow"
                ], 
                "role": "Bratty Teenage Daughter: Cher Horowitz is a good example of the smarter (if still shallow and naive) version and is also unusual in being the actual protagonist. She's also sweeter and more considerate than the usual example in several ways, in that she's constantly fretting about her father's stress levels and need to have a proper breakfast, and reaches out to make friends with the awkward and unfashionable newcomer to the school (for pretty shallow reasons at the time, but still).", 
                "id": "BrattyTeenageDaughter"
            }, 
            {
                "adjectives": [
                    "good", 
                    "naive", 
                    "unusual", 
                    "actual", 
                    "considerate", 
                    "usual", 
                    "several", 
                    "unfashionable", 
                    "shallow"
                ], 
                "role": "Cher Horowitz from Clueless is a good example of the smarter (if still shallow and naive) version and is also unusual in being the actual protagonist. She's also sweeter and more considerate than the usual example in several ways, in that she's constantly fretting about her father's stress levels and need to have a proper breakfast, and reaches out to make friends with the awkward and unfashionable newcomer to the school (for pretty shallow reasons at the time, but still).", 
                "id": "BrattyTeenageDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Cute Clumsy Girl: Tai takes a handful of spills throughout the story.", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [
                    "primary", 
                    "possible", 
                    "vapid", 
                    "shallow", 
                    "good", 
                    "good"
                ], 
                "role": "Good Bad Girl: Most everyone, but especially Cher. The primary theme of the movie comes down to it being possible to be vapid, shallow and even a little naughty (Cher is shown drinking and smoking a little at a party) while still having a good heart with good intentions.", 
                "id": "GoodBadGirl"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Cher Horowitz of Clueless kind of starts out like this, but it's subverted as the film progresses (both in terms of taking a genuine interest in other people and in enjoying sex).", 
                "id": "JewishAmericanPrincess"
            }, 
            {
                "adjectives": [
                    "Jewish"
                ], 
                "role": "Jewish American Princess: Cher is a subversion of this.", 
                "id": "JewishAmericanPrincess"
            }, 
            {
                "adjectives": [
                    "same-sex-oriented"
                ], 
                "role": "The \"same-sex-oriented\" gym teacher in Clueless.", 
                "id": "LesbianJock"
            }, 
            {
                "adjectives": [
                    "much", 
                    "large", 
                    "motive", 
                    "good", 
                    "such", 
                    "good-doing"
                ], 
                "role": "Missing Mom: Cher's mother died during a freak complication in a routine liposuction. Granted, Cher doesn't really remember her that much, although she does pretend she's watching over her and greets the large picture of her at the front door. Josh also teases her about this being her motive for wanting to make over Tai and treat her like one of her dolls. There is one surprisingly touching scene where, when she's insecure that she isn't a good person, her father tells her he hasn't seen such good-doing since her mother, which seems to greatly comfort her.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "classic", 
                    "popular", 
                    "main", 
                    "likeable"
                ], 
                "role": "Clueless: Amber is a classic Rich Bitch, contrasted to rich, popular but flawed main character Cher, who's for the most part kindhearted and a very likeable character.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "wealthy", 
                    "stylish"
                ], 
                "role": "Cher Horowitz from Clueless is nearly the Trope Namer. She's wealthy, stylish, and rules the school with an iron fist, but it's an iron fist tempered with sweetness. She even attempts to play matchmaker to a couple of nerdy teachers. The film is an updated version of Jane Austen's Emma, who was practically the Trope Maker.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "rich", 
                    "sweet", 
                    "good"
                ], 
                "role": "Spoiled Sweet: Cher, definitely. Despite being rich, she is genuinely sweet to people and usually motivated by good feelings.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [], 
                "role": "Cher from Clueless", 
                "id": "ValleyGirl"
            }, 
            {
                "adjectives": [
                    "Several", 
                    "main", 
                    "popular"
                ], 
                "role": "Valley Girl: Several main characters are Valley Girls. This film cemented the trope in popular culture.", 
                "id": "ValleyGirl"
            }
        ]
    }, 
    "imdbid": "tt0112697", 
    "similar": [
        {
            "shared": [
                "CulturedBadass", 
                "SpoiledSweet", 
                "OverprotectiveDad", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "OverprotectiveDad", 
                "JewishAmericanPrincess", 
                "RichBitch"
            ], 
            "shared_count": 4, 
            "id": "DirtyDancing", 
            "name": "Dirty Dancing", 
            "poster_url": "DirtyDancing.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad", 
                "BrattyTeenageDaughter", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "AGoofyMovie", 
            "name": "A Goofy Movie", 
            "poster_url": "AGoofyMovie.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "OverprotectiveDad", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "Taken", 
            "name": "Taken", 
            "poster_url": "Taken.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad", 
                "BrattyTeenageDaughter", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Super8", 
            "name": "Super 8", 
            "poster_url": "Super8.jpg"
        }
    ], 
    "id": "Clueless", 
    "name": "Clueless"
}