{
    "plot": "A retired special agent named John Matrix led an elite unit and has left the armed forces to live in a secluded mountain home with his daughter Jenny. But now he is forced out of retirement when his daughter is kidnapped by a band of thugs intent on revenge! Unbeknownst to Matrix, the members of his former unit are being killed one by one. Even though Matrix' friend General Franklin Kirby gives Matrix armed guards, attackers manage to kidnap Matrix and Jenny. Matrix learns that Bennett, a former member of his Matrix' unit who was presumed dead has kidnapped him to try to force Matrix to do a political assassination for a man called Arius (who calls himself El Presidente), a warlord formerly bested by Matrix who wishes to lead a military coup in his home country. Since Arius will have Jenny killed if Matrix refuses, Matrix reluctantly accepts the demand.", 
    "genres": "Action, Adventure", 
    "release_year": "1985", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "little"
                ], 
                "role": "Papa Wolf: You harmed his little girl? You're DOOMED.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "due"
                ], 
                "role": "Bill Duke. He's actually a kind of subversion due to his trademark \"basset hound\" expression. Also, his claim to fame is his hammy scene in Predator. Less prominent nowadays than in the 80s and 90s, but he's still got it.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "own", 
                    "able", 
                    "free"
                ], 
                "role": "Distressed Damsel: Jenny, but hardly a hopeless example of the trope. Using her own resourcefulness she's able to free herself from her confinement — if not, Bennett would have cut her throat before Matrix even got near her.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "young", 
                    "second", 
                    "villainous"
                ], 
                "role": "While the entire plot of Commando revolves around John Matrix rescuing his kidnapped young daughter, Jenny, as it turns out she must have picked up something from her dad. The second her dad storms the compound and she's not tied up, she's popped a doorknob off the door to her room and rescued herself. She's almost to her dad before the villainous Bennett shows up, but had she not tried to escape earlier, she'd definitely be dead as Bennett had gone looking for her precisely to kill her.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "young", 
                    "extra", 
                    "successful"
                ], 
                "role": "Commando, in which Matrix and Cooke unintentionally barge into the motel room of a man apparently filming a porn flick with a young woman. Interestingly enough, the extra who played said woman, Ava Cadell, then went to become a successful sexologist.", 
                "id": "FanserviceExtra"
            }
        ]
    }, 
    "imdbid": "tt0088944", 
    "poster_url": "Commando.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "DamselInDistress", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "Taken", 
            "name": "Taken", 
            "poster_url": "Taken.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DamselInDistress", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "Hook", 
            "name": "Hook", 
            "poster_url": "Hook.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "FanserviceExtra", 
                "DamselOutOfDistress"
            ], 
            "shared_count": 3, 
            "id": "TheAmazingSpiderMan", 
            "name": "The Amazing Spider-Man", 
            "poster_url": "TheAmazingSpiderMan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DamselInDistress", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DamselInDistress"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "Commando", 
    "name": "Commando"
}