{
    "plot": "Cameron Poe, a highly decorated United States Army Ranger, came home to Alabama to his wife, Tricia, only to run into a few drunken regulars where Tricia works. Cameron unknowingly kills one of the drunks and is sent to a federal penitentiary for involuntary manslaughter for seven years. Cameron becomes eligible for parole and can now go home to his wife and daughter. Unfortunately, Cameron has to share a prison airplane with some of the country's most dangerous criminals, who took control of the plane and are now planning to escape the country. Cameron has to find a way to stop them while playing along. Meanwhile, United States Marshal Vincent Larkin is trying to help Cameron get free and stop the criminals, including Cyrus \"The Virus\" Grissom.", 
    "genres": "Action, Crime, Thriller", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "second"
                ], 
                "role": "Camp Gay: Sally Can't Dance, who wears a dress for the second half of the movie.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [
                    "entire"
                ], 
                "role": "William Billy Bedlam Bedford in Con Air finds his wife in bed with another man and responds by murdering her entire family.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "well-spoken", 
                    "entire", 
                    "best-selling", 
                    "in-story"
                ], 
                "role": "Diamond Dog in Con Air. He's a Malcolm Xerox without the glasses or the soapbox. Strangely, he's one of the most well-spoken characters in the entire movie, and wrote a best-selling book. And was interviewed by Geraldo. And there was talk in-story about a movie being made about him, with \"Denzel\" being cast to play him.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "well-spoken", 
                    "entire", 
                    "best-selling", 
                    "in-story"
                ], 
                "role": "Scary Black Man: Diamond Dog. He's a Malcolm Xerox without the glasses or the soapbox. Strangely, he's one of the most well-spoken characters in the entire movie, and wrote a best-selling book. And was interviewed by Geraldo. And there was talk in-story about a movie being made about him, with \"Denzel\" being cast to play him.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "separate", 
                    "final"
                ], 
                "role": "\"Sally Can't Dance\" in Con Air. How effeminate is he? Well, his nickname is \"Sally,\" he refers to men as a separate gender, he wears dresses, and in his final confrontation with the hero, Nicolas Cage's character winds up for a punch, visibly reconsiders, and slaps Sally in the face instead.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Sissy Villain: Sally Can't Dance again.", 
                "id": "SissyVillain"
            }
        ]
    }, 
    "imdbid": "tt0118880", 
    "poster_url": "ConAir.jpg", 
    "similar": [
        {
            "shared": [
                "CrazyJealousGuy", 
                "SissyVillain", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "CampGay", 
                "SissyVillain"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "Super", 
            "name": "Super", 
            "poster_url": "Super.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "AsGoodAsItGets", 
            "name": "As Good As It Gets", 
            "poster_url": "AsGoodAsItGets.jpg"
        }
    ], 
    "id": "ConAir", 
    "name": "Con Air"
}