{
    "plot": "A megalomaniac C.E.O. sends his son into the dangerous African Congo on a quest for a source of diamonds large enough and pure enough to function as powerful laser communications transmitters (or is it laser weapons?). When contact is lost with his son and the team, his sometime daughter- in-law is sent after them. She is a former CIA operative and, accompanied by gee-whiz gadgetry and a few eccentric characters (including a mercenary, a researcher with a talking gorilla, and a a nutty Indiana-Jones-type looking for King Solomon's Mines), sets out to rescue her former fiancé. What they all discover is that often what we most want turns out to be the source of our downfall.", 
    "genres": "Action, Adventure, Mystery", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Great White Hunter: Somewhat straight in the novel, although really Munro Kelly is more of a Hired Mercenary type, and also half-Indian. The trope proper is spoofed in the film.", 
                "id": "GreatWhiteHunter"
            }, 
            {
                "adjectives": [
                    "more-or-less", 
                    "black", 
                    "other", 
                    "white"
                ], 
                "role": "Similarly to the Freedom Beast example above, in the movie adaptation of Congo, Captain Munro Kelly introduces himself to the team with the line \"I'm your Great White Hunter for this trip, though I happen to be black.\"\n This is, of course, because the book Munroe was a more-or-less straight example, who the movie then made black in order to add diversity to the cast.\n In an interview, the director claimed he cast Ernie Hudson as the hunter because he disliked this trope.\n In the book, Munro was less a Great White Hunter and more along the lines of all the other white mercenaries running around in Africa at the time of writing. Also, wasn't he half Indian?", 
                "id": "GreatWhiteHunter"
            }, 
            {
                "adjectives": [
                    "stop"
                ], 
                "role": "Delroy Lindo. When he tells you to stop eating his sesame cake, you damn well better stop.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "serious"
                ], 
                "role": "Action Girl: Karen Ross kicks serious ass in the movie. In the novel she's an Ice Queen who becomes overly focused on her goal and inadvertently sets off the volcano.", 
                "id": "ActionGirl"
            }
        ]
    }, 
    "imdbid": "tt0112715", 
    "poster_url": "Congo.jpg", 
    "similar": [
        {
            "shared": [
                "ActionGirl", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheIcePirates", 
            "name": "The Ice Pirates", 
            "poster_url": "TheIcePirates.jpg"
        }, 
        {
            "shared": [
                "GreatWhiteHunter", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheExtraordinaryAdventuresOfAdeleBlancSec", 
            "name": "The Extraordinary Adventures of Adèle Blanc-Sec"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "Super", 
            "name": "Super", 
            "poster_url": "Super.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheScorpionKing", 
            "name": "The Scorpion King", 
            "poster_url": "TheScorpionKing.jpg"
        }
    ], 
    "id": "Congo", 
    "name": "Congo"
}