{
    "plot": "John Constantine is approached by Det. Angela Dodson who needs his help to prove that her twin sister Isabel's death was not a suicide. The dead woman was a devout Catholic and Angela refuses to accept that she would have taken her own life. She's asked Constantine for help because he has a reputation for dealing with the mystical. In fact, he is a demon hunter whose sole purpose on Earth is to send demons back to the nether regions. John himself has been to Hell - as a young man he too committed suicide and now knows that he is destined to return there on his death - but hopes that his good deeds may somehow find him a place in Heaven. As he looks into Isabel's death, he realizes that demons are trying to break through to the human world and his battles lead him into a direct conflict with Satan.", 
    "genres": "Drama, Fantasy, Horror", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Constantine: The personification of Lucifer. Complete with Louisiana accent and white suit, which should be noted, was missing shoes, so you could see filth literally dripping off of his bare feet. Probably hot tar or pitch — which sorta makes sense.", 
                "id": "FatSweatySouthernerInAWhiteSuit"
            }, 
            {
                "adjectives": [
                    "old-fashioned", 
                    "white"
                ], 
                "role": "Lucifer from Constantine wears old-fashioned white suit in the style of a Fat, Sweaty Southerner in a White Suit.", 
                "id": "ManInWhite"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "peripheral", 
                    "mental", 
                    "suicide", 
                    "swimming", 
                    "cross-shaped", 
                    "flowing-haired", 
                    "other"
                ], 
                "role": "Rachel Weisz plays twin sisters in Constantine, one of whom is a sort of peripheral Ophelia - confined to a mental hospital, she commits suicide by leaping from a building, plunging through a roof and into a swimming pool (a cross-shaped one to boot) where, naturally, she can float all flowing-haired and dead. The other twin begins to manifest aspects of the trope - visions and immersion in water - without actually losing her mind.", 
                "id": "TheOphelia"
            }, 
            {
                "adjectives": [
                    "suicide"
                ], 
                "role": "The Ophelia: Angela's twin sister. She even commits suicide in a swimming pool.", 
                "id": "TheOphelia"
            }
        ]
    }, 
    "imdbid": "tt0360486", 
    "poster_url": "Constantine.jpg", 
    "similar": [
        {
            "shared": [
                "FatSweatySouthernerInAWhiteSuit"
            ], 
            "shared_count": 1, 
            "id": "TinyToonAdventuresHowISpentMyVacation", 
            "name": "Tiny Toon Adventures: How I Spent My Vacation", 
            "poster_url": "TinyToonAdventuresHowISpentMyVacation.jpg"
        }, 
        {
            "shared": [
                "FatSweatySouthernerInAWhiteSuit"
            ], 
            "shared_count": 1, 
            "id": "TheMuppetMovie", 
            "name": "The Muppet Movie", 
            "poster_url": "TheMuppetMovie.jpg"
        }, 
        {
            "shared": [
                "ManInWhite"
            ], 
            "shared_count": 1, 
            "id": "RaidersOfTheLostArk", 
            "name": "Raiders of the Lost Ark", 
            "poster_url": "RaidersOfTheLostArk.jpg"
        }, 
        {
            "shared": [
                "TheOphelia"
            ], 
            "shared_count": 1, 
            "id": "WutheringHeights", 
            "name": "Wuthering Heights", 
            "poster_url": "WutheringHeights.jpg"
        }, 
        {
            "shared": [
                "ManInWhite"
            ], 
            "shared_count": 1, 
            "id": "CapeFear", 
            "name": "Cape Fear", 
            "poster_url": "CapeFear.jpg"
        }
    ], 
    "id": "Constantine", 
    "name": "Constantine"
}