{
    "plot": "While driving through the Arizona desert, Albuquerque based independent trucker Martin Penwald - who goes by the handle \"Rubber Duck\" - along with his fellow truckers \"Pig Pen\" and \"Spider Mike\", are entrapped by unscrupulous Sheriff Lyle \"Cottonmouth\" Wallace using a key tool of the trucker's trade, the citizens' band (CB) radio. Rubber Duck and Cottonmouth have a long, antagonistic history. When this encounter later escalates into a more physical one as Cottonmouth threatens Spider Mike, a man who just wants to get home to his pregnant wife, Rubber Duck and other the truckers involved, including Spider Mike, Pig Pen and \"Widow Woman\", go on the run, figuring the best thing to do being to head to New Mexico to avoid prosecution. Along for the ride is Melissa, a beautiful photographer who just wanted a ride to the airport. As news of what happened spreads over the CB airwaves, other truckers join their convoy as a show of support. Cottonmouth rallies other law enforcement officers throughout the southwest, they who soon learn that stopping Rubber Duck, the face of the now highly public standoff, is not as easy as shooting him and the truck due to his highly explosive cargo. As the standoff escalates, New Mexico Governor Jerry Haskins joins the fray, he who sees the strong public support for the truckers being something on which he can capitalize politically.", 
    "genres": "Action, Drama", 
    "release_year": "1978", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "much"
                ], 
                "role": "Non-Action Guy: Rubber Duck isn't much of a fighter; and lets his truck, wits, and friends do the work for him.", 
                "id": "NonActionGuy"
            }
        ]
    }, 
    "imdbid": "tt0077369", 
    "poster_url": "Convoy.jpg", 
    "similar": [
        {
            "shared": [
                "NonActionGuy"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy"
            ], 
            "shared_count": 1, 
            "id": "Bloodlust", 
            "name": "Bloodlust"
        }, 
        {
            "shared": [
                "NonActionGuy"
            ], 
            "shared_count": 1, 
            "id": "BunnyAndTheBull", 
            "name": "Bunny and the Bull", 
            "poster_url": "BunnyAndTheBull.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy"
            ], 
            "shared_count": 1, 
            "id": "TheHuntForRedOctober", 
            "name": "The Hunt for Red October", 
            "poster_url": "TheHuntForRedOctober.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy"
            ], 
            "shared_count": 1, 
            "id": "Pocahontas", 
            "name": "Pocahontas", 
            "poster_url": "Pocahontas.jpg"
        }
    ], 
    "id": "Convoy", 
    "name": "Convoy"
}