{
    "plot": "Cookie's Fortune unfolds over an eventful Easter weekend in the small town of Holly Springs, Mississippi. The town residents are peaceful, kind folk -- with the exception of Camille Dixon -- a pushy theatre director with an incredibly shy younger sister, Cora, whose estranged daughter Emma has just returned to town. On the heels of her latest play, Camille is shocked to discover that her Aunt Jewel Mae \"Cookie\" Orcutt has committed suicide. Terrified at the thought of how this will tarnish the family name, she eats the suicide note to make it look like a burglary. This set-up leads the police to one main suspect, Willis Richland, who also happens to be Cookie's best friend. Although the rest of the town is convinced Willis didn't commit the crime, an outside investigator isn't so sure. As Easter Sunday and opening night of the play arrive, the truth comes out, revealing more secrets than anyone could have possibly imagined.", 
    "genres": "Comedy, Drama", 
    "release_year": "1999", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "The Hecate Sisters: Camille is the Crone, Cora is the Mother, and Emma is the Madien", 
                "id": "TheHecateSisters"
            }
        ]
    }, 
    "imdbid": "tt0126250", 
    "poster_url": "CookiesFortune.jpg", 
    "similar": [
        {
            "shared": [
                "TheHecateSisters"
            ], 
            "shared_count": 1, 
            "id": "PracticalMagic", 
            "name": "Practical Magic", 
            "poster_url": "PracticalMagic.jpg"
        }, 
        {
            "shared": [
                "TheHecateSisters"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "TheHecateSisters"
            ], 
            "shared_count": 1, 
            "id": "Inferno", 
            "name": "Inferno", 
            "poster_url": "Inferno.jpg"
        }, 
        {
            "shared": [
                "TheHecateSisters"
            ], 
            "shared_count": 1, 
            "id": "Halloweentown", 
            "name": "Halloweentown", 
            "poster_url": "Halloweentown.jpg"
        }, 
        {
            "shared": [
                "TheHecateSisters"
            ], 
            "shared_count": 1, 
            "id": "CrouchingTigerHiddenDragon", 
            "name": "Crouching Tiger, Hidden Dragon", 
            "poster_url": "CrouchingTigerHiddenDragon.jpg"
        }
    ], 
    "id": "CookiesFortune", 
    "name": "Cookie's Fortune"
}