{
    "plot": "Over a thirty-six hour period in Los Angeles, a handful of disparate people's lives intertwine as they deal with the tense race relations that belie life in the city. Among the players are: the Caucasian district attorney, who uses race as a political card; his Caucasian wife, who, having recently been carjacked by two black men, believes that her stereotypical views of non-whites is justified and cannot be considered racism; the two black carjackers who use their race both to their advantage and as an excuse; partnered Caucasian police constables, one who is a racist and uses his authority to harass non-whites, and the other who hates his partner because of those racist views, but who may have the same underlying values in his subconscious; a black film director and his black wife, who believes her husband doesn't support their black background enough, especially in light of an incident with the racist white cop; partnered police detectives and sometimes lovers, one Hispanic female and the other black male, the latter who is dealing with a drugged out mother that feels he isn't concerned enough about taking care of family; an East Asian man who is run over but who is hiding some valuable cargo in the back of his van; a Persian store owner, who feels he isn't getting satisfaction from American society when his store is robbed time and time again; and a Hispanic locksmith, who just wants to keep his family, especially his adolescent daughter, safe in a seemingly unsafe world.", 
    "genres": "Drama", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "vagina-shaped"
                ], 
                "role": "The strange janitor in Famine is constantly fingering the vagina-shaped scar on his face.", 
                "id": "CrustyCaretaker"
            }
        ]
    }, 
    "imdbid": "tt0375679", 
    "poster_url": "Crash.jpg", 
    "similar": [
        {
            "shared": [
                "CrustyCaretaker"
            ], 
            "shared_count": 1, 
            "id": "WutheringHeights", 
            "name": "Wuthering Heights", 
            "poster_url": "WutheringHeights.jpg"
        }, 
        {
            "shared": [
                "CrustyCaretaker"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "CrustyCaretaker"
            ], 
            "shared_count": 1, 
            "id": "TheBurning", 
            "name": "The Burning", 
            "poster_url": "TheBurning.jpg"
        }, 
        {
            "shared": [
                "CrustyCaretaker"
            ], 
            "shared_count": 1, 
            "id": "TheRockyHorrorPictureShow", 
            "name": "The Rocky Horror Picture Show", 
            "poster_url": "TheRockyHorrorPictureShow.jpg"
        }, 
        {
            "shared": [
                "CrustyCaretaker"
            ], 
            "shared_count": 1, 
            "id": "SilentHill", 
            "name": "Silent Hill", 
            "poster_url": "SilentHill.jpg"
        }
    ], 
    "id": "Crash", 
    "name": "Crash"
}