{
    "plot": "Born Christmas Day 1960, Zac Beaulieu is the fourth of five sons of Gervais and Laurianne Beaulieu. Zac feels somewhat disconnected to his brothers, all of whom are different from each other. They include the bookworm Christian who is the eldest, the dumb jock Antoine who is third, and the youngest Yvan. But Zac has the most contempt for his second eldest brother, the shiftless druggie Raymond. To his devout Catholic mother, Zac is her miracle son, both for being born the same day as Jesus Christ (a fact which Zac has always hated), and because a Tupperware-selling mystic once told her that he has the power to heal. Laurianne has always coddled Zac, the two who have a special if unspoken bond. But Zac wants more to please his father, who wants more than anything in his sons that they grow up to be man's men and not sissies. As Zac goes through his mid-teens to early twenties, Zac isn't sure if he can live up to the ideals of either his mother or especially his father. A young man with stress-induced asthma, Zac just wants to be what he considers normal, which includes getting rid of his asthma. But more importantly, he wants to get rid of the underlying thoughts that he has and which most going through puberty have, but that for him are becoming more prevalent as he grows older.", 
    "genres": "Comedy, Drama", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "very"
                ], 
                "role": "Armored Closet Gay: Zac doesn't come to terms with his sexuality until the very end of the film.", 
                "id": "ArmouredClosetGay"
            }, 
            {
                "adjectives": [
                    "Bishōnen"
                ], 
                "role": "Bishōnen: Zac. Paul too.", 
                "id": "Bishonen"
            }, 
            {
                "adjectives": [
                    "first", 
                    "slow", 
                    "entire", 
                    "stingy"
                ], 
                "role": "Mr. Fanservice: Ohh Zac. The first appearance of him all grown up is him waking up in his underwear. Then there's a slow pan of his entire body. The rest of the film isn't too stingy with his Shirtless Scenes either.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Straight Gay: Zac. One of the reasons why he denies that he's gay to himself and to others is because of the fact that he doesn't act like a stereotype.", 
                "id": "StraightGay"
            }
        ]
    }, 
    "imdbid": "tt0401085", 
    "similar": [
        {
            "shared": [
                "StraightGay", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "TheBirdcage", 
            "name": "The Birdcage", 
            "poster_url": "TheBirdcage.jpg"
        }, 
        {
            "shared": [
                "StraightGay", 
                "ArmouredClosetGay"
            ], 
            "shared_count": 2, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "Bishonen", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "Godspell", 
            "name": "Godspell"
        }, 
        {
            "shared": [
                "Bishonen", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "NinjaAssassin", 
            "name": "Ninja Assassin", 
            "poster_url": "NinjaAssassin.jpg"
        }, 
        {
            "shared": [
                "StraightGay", 
                "ArmouredClosetGay"
            ], 
            "shared_count": 2, 
            "id": "VictorVictoria", 
            "name": "Victor/Victoria"
        }
    ], 
    "id": "CRAZY", 
    "name": "C.R.A.Z.Y."
}