{
    "plot": "When some Russian rebels takes control of some ICBM's, the Americans mobilize. Among the vessels sent is the nuclear sub, the Alabama. But before they leave they need a new X.O. and among the choices is Commander Hunter, who hasn't seen much action. But the ship's Captain, Ramsey OK's him. While on the way, there was an incident and Hunter disagreed with how Ramsey handled it, it's evident that Ramsey doesn't think much of Hunter because Hunter was college educated while Ramsey worked his way up. They're given orders to attack but when they were in the process of receiving another order, the ship's communications were damaged, so the entire message was not received. Ramsey decides to continue with their previous order while Hunter wants to reestablish contact first. That's when the two men butt heads that ends with Hunter relieving Ramsey. Later when some men die, some of the officers feel that Hunter is not up to the task so they team up to retake control. But Hunter has taken precautions.", 
    "genres": "Action, Drama, Thriller", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "top", 
                    "near", 
                    "fanatical"
                ], 
                "role": "A Father to His Men - Hunter leads from the bottom up, contrasting with Ramsey's lead from the top style. Nevertheless, the men have a near fanatical devotion to Ramsey.", 
                "id": "AFatherToHisMen"
            }
        ]
    }, 
    "imdbid": "tt0112740", 
    "poster_url": "CrimsonTide.jpg", 
    "similar": [
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "Downfall", 
            "name": "Downfall"
        }, 
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "CatherineTheGreat", 
            "name": "Catherine The Great", 
            "poster_url": "CatherineTheGreat.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "TheKeep", 
            "name": "The Keep", 
            "poster_url": "TheKeep.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "BeneathHill60", 
            "name": "Beneath Hill 60", 
            "poster_url": "BeneathHill60.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "Lincoln", 
            "name": "Lincoln", 
            "poster_url": "Lincoln.jpg"
        }
    ], 
    "id": "CrimsonTide", 
    "name": "Crimson Tide"
}