{
    "plot": "A Seattle history professor, drawn back to his estranged family on the Oregon coast to execute his late mother's estate, is reaquainted with his best friend from childhood, with whom he has a long-awaited tryst. Caught in an accelerating series of events, he discovers aspects of his father's New Age cult which take on a dangerous and apocalyptic significance.", 
    "genres": "Drama, Horror, Thriller", 
    "release_year": "2007", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Cthulhu (2007). Worn by Tori Spelling's character when she tries to seduce the protagonist. When that doesn't work (as he's gay) she resorts to other methods.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [
                    "barbed", 
                    "justifiable"
                ], 
                "role": "Cthulhu (2007). Julia (a blonde girl in a red top) the liquor store clerk who tries to warn the protagonist and ends up tied to a bitthead with barbed wire as a sacrifice to the Deep Ones. There's also a scene where she panics when the protagonist stops his car on a backwoods road at night — clearly she has a justifiable phobia about The Lost Woods.", 
                "id": "LittleDeadRidingHood"
            }, 
            {
                "adjectives": [
                    "barbed"
                ], 
                "role": "Little Dead Riding Hood: Julia (a blonde girl in a red top) the liquor store clerk who tries to warn the protagonist and ends up tied to a bitthead with barbed wire as a sacrifice to the Fish People.", 
                "id": "LittleDeadRidingHood"
            }, 
            {
                "adjectives": [], 
                "role": "Cthulhu (2007). Susan tries to seduce the protagonist, Russell Marsh, as part of the Cult of Dagon's plan to have him pass on his seed (creating a Hybrid Monster). As Russell is gay, her charms don't work on him, so she drugs and rapes him instead.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0478126", 
    "poster_url": "Cthulhu.jpg", 
    "similar": [
        {
            "shared": [
                "LittleDeadRidingHood"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "Sunrise", 
            "name": "Sunrise", 
            "poster_url": "Sunrise.jpg"
        }, 
        {
            "shared": [
                "GirlishPigtails"
            ], 
            "shared_count": 1, 
            "id": "MonsterHouse", 
            "name": "Monster House", 
            "poster_url": "MonsterHouse.jpg"
        }, 
        {
            "shared": [
                "GirlishPigtails"
            ], 
            "shared_count": 1, 
            "id": "TheMuppetMovie", 
            "name": "The Muppet Movie", 
            "poster_url": "TheMuppetMovie.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "Cthulhu", 
    "name": "Cthulhu"
}