{
    "plot": "1987: A 13 year old natural born dancer with fire in his heels and snakes in his hips is working himself up to explode all over the UK Junior Salsa Championships. But then: a freakish bullying incident on the mean streets of London robs him of his confidence, and our young hero finds his life diverted down a very different path. So it is that 22 years later, an adult Bruce Garrett (Nick Frost) finds himself out-of-shape and unloved - trapped in a downward spiral of self-pity, repression and Nando's take-outs. Only Julia (Rashida Jones), his smart, funny, gorgeous new American boss, gives him reason to live. But she's untouchable. Out of his league, so he imagines, with her perfect smile and perfect life. Unknown to Bruce however, Julia has issues all of her own. Luckily for him, she also has a secret passion. Then there's Drew (Chris O'Dowd), his alpha male colleague and horny king-monkey of the office. With Drew making no secret of his desire to get (his words) \"all up inside Julia\", Bruce is forced into action. And thus, Bruce is once again brought face-to-face with the darkest and most powerful of his inner demons. Somehow, someway, and with a lot of hand-holding from loyal sister Sam (Olivia Colman) Bruce must learn how to unshackle his dancing beast, regain his long lost fury and claim the love of his life...and he's going to do it all On The Dance Floor...", 
    "genres": "Comedy", 
    "release_year": "2014", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Camp Gay: Bejan, who lives and thrives in a sparkly, spicy ecosystem of clubs and salsa dancing. And ball waxes.", 
                "id": "CampGay"
            }
        ]
    }, 
    "imdbid": "tt2390237", 
    "poster_url": "CubanFury.jpg", 
    "similar": [
        {
            "shared": [
                "CampGay"
            ], 
            "shared_count": 1, 
            "id": "SouthParkBiggerLongerAndUncut", 
            "name": "South Park: Bigger, Longer & Uncut", 
            "poster_url": "SouthParkBiggerLongerAndUncut.jpg"
        }, 
        {
            "shared": [
                "CampGay"
            ], 
            "shared_count": 1, 
            "id": "TheBoysInTheBand", 
            "name": "The Boys in the Band", 
            "poster_url": "TheBoysInTheBand.jpg"
        }, 
        {
            "shared": [
                "CampGay"
            ], 
            "shared_count": 1, 
            "id": "ILoveYouPhillipMorris", 
            "name": "I Love You Phillip Morris", 
            "poster_url": "ILoveYouPhillipMorris.jpg"
        }, 
        {
            "shared": [
                "CampGay"
            ], 
            "shared_count": 1, 
            "id": "Spaceballs", 
            "name": "Spaceballs", 
            "poster_url": "Spaceballs.jpg"
        }, 
        {
            "shared": [
                "CampGay"
            ], 
            "shared_count": 1, 
            "id": "CasinoRoyale1967", 
            "name": "Casino Royale ", 
            "poster_url": "CasinoRoyale1967.jpg"
        }
    ], 
    "id": "CubanFury", 
    "name": "Cuban Fury"
}