{
    "plot": "Hoping for a more exciting life than the suburban drawl he currently inhabits, nerdy salary man Morgan Sullivan takes a job as an industrial spy at Digicorp, a global computer corporation. Digicorp assigns him the duty of flying to various conventions around America, recording the speeches that are made. But when Sullivan meets a mysterious woman he begins to realize that his job may not be what it seems, as he descends into a dark underworld of brainwashing and struggles to maintain his own identity.", 
    "genres": "Mystery, Sci-Fi, Thriller", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "later", 
                    "identical"
                ], 
                "role": "Henpecked Husband: Even after he's done all the cooking and cleaning, Morgan's wife shouts at him when he tells her he's going to be working freelance instead of going to work for her father. Thankfully Morgan has Taken a Level in Badass, and he refuses to go along with her plans for him. We later see an identical situation, with \"Jack\"'s wife ordering him about around the house and directing his career path.", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [], 
                "role": "House Husband: Justified in that his wife is the breadwinner, but Morgan clearly doesn't enjoy being one.", 
                "id": "HouseHusband"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Adrenaline Makeover: See Becoming the Mask.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "industrial"
                ], 
                "role": "Another male example, Morgan Sullivan of the film adaptation of Philip K. Dick's Cypher begins as an awkward and insecure mid-level suit who takes a job in industrial espionage. In the process of inventing and adopting personality and character quirks for his cover, confidence noticeably grows in his posture and speech patterns, he begins smoking and knocking back scotch casually, then loses the glasses and tie while dressing and hairstyling more fashionably.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [], 
                "role": "Femme Fatale: Rita Foster.", 
                "id": "FemmeFatale"
            }
        ]
    }, 
    "imdbid": "tt0284978", 
    "poster_url": "Cypher.jpg", 
    "similar": [
        {
            "shared": [
                "HenpeckedHusband", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "AbsoluteBeginners", 
            "name": "Absolute Beginners", 
            "poster_url": "AbsoluteBeginners.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "TheIncredibles", 
            "name": "The Incredibles"
        }, 
        {
            "shared": [
                "HenpeckedHusband", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "DeathBecomesHer", 
            "name": "Death Becomes Her"
        }, 
        {
            "shared": [
                "HenpeckedHusband", 
                "FemmeFatale"
            ], 
            "shared_count": 2, 
            "id": "GreatExpectations", 
            "name": "Great Expectations", 
            "poster_url": "GreatExpectations.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "Cypher", 
    "name": "Cypher"
}