{
    "plot": "Volcanologist Harry Dalton and mayor Rachel Wando of Dante's Peak try to convince the city council and the other volcanologists that the volcano right above Dante's peak is indeed dangerous. People's safety is being set against economical interests.", 
    "genres": "Action, Adventure, Thriller", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "responsible", 
                    "adversarial"
                ], 
                "role": "Disappeared Dad: The Wando children's father left Rachel and them. Ruth, his mother, holds Rachel responsible for that, and their relationship is adversarial as a result.", 
                "id": "DisappearedDad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Disposable", 
                    "gung-ho", 
                    "dragged", 
                    "volcanic"
                ], 
                "role": "Disposable Woman: Harry's fiancee, Marianne, a really gung-ho geologist, refuses to leave until dragged bodily by Harry. She suffers death by volcanic projectile only moments into the film.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "Marian", 
                    "site", 
                    "volcanic"
                ], 
                "role": "Marian fills this role in Dantes Peak. Harry's fiancee is a psychotically involved geologist. She's so gonzo for volcanoes Harry has to practically drag her kicking and screaming to leave the site of the eruption because the readings are so incredible. As they're driving frantically from the area, volcanic rock is falling from the sky.  One punches through the roof and hits Marian in her head. Harry has to look on in horror as she convulses. He reaches for her and she dies in his arms.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "single", 
                    "single", 
                    "titular", 
                    "restaurant"
                ], 
                "role": "Dantes Peak: The character of Rachel Wando is not only a single mother, but is in charge of pretty much every single aspect of the titular town's business and politics including being the mayor, running a restaurant, etc. etc.", 
                "id": "GlamorousSingleMother"
            }, 
            {
                "adjectives": [
                    "sulfuric", 
                    "boat", 
                    "first"
                ], 
                "role": "Never Mess with Granny: Ruth saves everyone by  jumping into a lake of sulfuric acid and pushing along a boat with four people in it so they can get to the docks. Goddamn. It actually makes up for the fact that she was the reason they were there in the first place.", 
                "id": "NeverMessWithGranny"
            }
        ]
    }, 
    "imdbid": "tt0118928", 
    "poster_url": "DantesPeak.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "DisposableWoman"
            ], 
            "shared_count": 2, 
            "id": "Godzilla2014", 
            "name": "Godzilla ", 
            "poster_url": "Godzilla2014.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DisposableWoman"
            ], 
            "shared_count": 2, 
            "id": "TopGun", 
            "name": "Top Gun", 
            "poster_url": "TopGun.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DisposableWoman"
            ], 
            "shared_count": 2, 
            "id": "GeekCharming", 
            "name": "Geek Charming"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DisposableWoman"
            ], 
            "shared_count": 2, 
            "id": "StarTrekIITheWrathOfKhan", 
            "name": "Star Trek II: The Wrath of Khan", 
            "poster_url": "StarTrekIITheWrathOfKhan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DisposableWoman"
            ], 
            "shared_count": 2, 
            "id": "StarTrek", 
            "name": "Star Trek", 
            "poster_url": "StarTrek.jpg"
        }
    ], 
    "id": "DantesPeak", 
    "name": "Dante's Peak"
}