{
    "plot": "Phil and Claire Foster are a couple who have been married for several years. Their days consists of them taking care of their children and going to work and coming home and going to bed. But they find time to have a date night wherein they go out and spend some time together. When another couple they know announce that they're separating because they're in a rut, Phil feels that he and Claire could be too. So when date night comes Phil decides to do something different. So they go into the city and try to get into a new popular restaurant. But when it's full and still wanting to do this, Phil decides to take the reservation of a couple who doesn't show up. While they're having dinner two men approach them and instructs them to stand up and go with them. They think the men are with the restaurant and want to talk to them about taking someone else's reservation. But it appears the couple whose reservation they took crossed someone and the two men work for this person. The men are after something, but whatever it is they don't have it.", 
    "genres": "Comedy, Crime, Romance", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Another one is the bouncer at the Peppermint Hippo, whose voice is insanely deep.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Black Man: One of the corrupted cops after the Fosters, played by Common no less. Another one is the bouncer at the Peppermint Hippo, whose voice is insanely deep.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Walking Shirtless Scene: Mark Wahlberg's character Holbrooke, much to Claire's delight and Phil's annoyance.", 
                "id": "WalkingShirtlessScene"
            }
        ]
    }, 
    "imdbid": "tt1279935", 
    "poster_url": "DateNight.jpg", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "BadassBaritone"
            ], 
            "shared_count": 2, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "LiloAndStitch", 
            "name": "Lilo & Stitch", 
            "poster_url": "LiloAndStitch.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "KungFuPanda", 
            "name": "Kung Fu Panda", 
            "poster_url": "KungFuPanda.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "Predator", 
            "name": "Predator", 
            "poster_url": "Predator.jpg"
        }, 
        {
            "shared": [
                "BadassBaritone", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }
    ], 
    "id": "DateNight", 
    "name": "Date Night"
}