{
    "plot": "In a world 10 years into the future, vampires make up the vast majority of the population with only 5% of the human race remaining. This presents particular challenges as the vampires' food supply - human blood - is dwindling and rationing is now the norm. There is growing evidence that vampires deprived of an adequate blood supply are themselves evolving into wild, vile creatures that attack anyone and anything in order to survive. Dr. Edward Dalton, a vampire and hematologist who works for a pharmaceutical firm, has been working on finding an artificial blood supply that will meet the vampire society's needs. He is sympathetic to humans and sees his work as a way of alleviating their suffering but his views on finding a solution change considerably when he meets someone who found a way to transform himself from being a vampire to again take human form.", 
    "genres": "Action, Fantasy, Horror", 
    "release_year": "2009", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Audrey in Daybreakers, she gets captured no less than three times, and the men are called upon to save her every time.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Faux Action Girl: Audrey; she gets captured no less than three times, and the men are called upon to save her every time.", 
                "id": "FauxActionGirl"
            }
        ]
    }, 
    "imdbid": "tt0433362", 
    "poster_url": "Daybreakers.jpg", 
    "similar": [
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "ShrekTheThird", 
            "name": "Shrek the Third", 
            "poster_url": "ShrekTheThird.jpg"
        }, 
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "TheBladeMaster", 
            "name": "The Blade Master"
        }, 
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "ResidentEvilDegeneration", 
            "name": "Resident Evil Degeneration"
        }, 
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "Speed2CruiseControl", 
            "name": "Speed 2: Cruise Control", 
            "poster_url": "Speed2CruiseControl.jpg"
        }
    ], 
    "id": "Daybreakers", 
    "name": "Daybreakers"
}