{
    "plot": "Deadpool is hired and smitten by the enigmatically psychotic Typhoid Mary. But who is his target?", 
    "genres": "Action, Comedy, Fantasy", 
    "release_year": "2013–", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "previous"
                ], 
                "role": "Though previous incarnations implied it, the latest retcon of Deadpool's backstory implicitly reveals this about his father.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "insane", 
                    "hot"
                ], 
                "role": "Deadpool is one of the ugliest men in Marvel (which is why he rarely removes his mask), he's insane and not very mature. Yet all of his love interests are extremely hot women.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "lovely"
                ], 
                "role": "Kavorka... CHICK MAGNET: Aww hells yeah, you know it, ladies. Vanessa, Typhoid Mary, Siryn, Dr. Betty, Professor Veronica,Lady Deadpool, Outlaw, Morrigan, Felicia, and not to mention the millions upon millions of others, who have succumbed to my 25 Charisma stat. In my Marvel Vs Capcom 3 ending, I got to mac with most of the lovely ladies at my slammin' party after wasting Galactus's purple pimply ass! Until I accidentally wiped out Cleveland... whoops!", 
                "id": "KavorkaMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "attractive", 
                    "natural", 
                    "pre-altered", 
                    "enough"
                ], 
                "role": "Butter Face: Nice, saliently muscled body (under the spandex anyway) but the face is... not that attractive to say the least. Until I recently reverted my face to its natural, pre-altered space! As if I didn't have enough ladies chasing after me already...", 
                "id": "ButterFace"
            }, 
            {
                "adjectives": [
                    "hideous", 
                    "terminal", 
                    "nonlethal"
                ], 
                "role": "Male example: Deadpool who has a smokin' body but whose face is anything but gorgeous. At least as long as he's wearing his tights, because the rest of his body is just as scarred and hideous as his face. Justified - the tumors are caused by a terminal cancer he's suffering from, which his healing factor makes nonlethal, but doesn't cure.\n Played straight by his alternate reality female counterpart Lady Deadpool. Hot bod, but her face is as ugly as Deadpool's.", 
                "id": "ButterFace"
            }, 
            {
                "adjectives": [
                    "octogenarian", 
                    "dangerous"
                ], 
                "role": "Of course, Blind Al from Deadpool. A witty disabled octogenarian who scares Girl Scouts for a hobby and can hold her own with one of the most dangerous people on the planet? I wanna be her when I grow up.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "quirky", 
                    "female", 
                    "few", 
                    "traditional"
                ], 
                "role": "Deadpool has had an Estrogen Brigade of fun, quirky, female geeks for a few years now, mostly because they get a kick out of his Black Comedy sense of humor. Now he's getting a more traditional Estrogen Brigade, since he's being portrayed by Ryan Reynolds.", 
                "id": "EstrogenBrigade"
            }, 
            {
                "adjectives": [
                    "Common", 
                    "great"
                ], 
                "role": "Most Common Superpower: Outlaw! She has Super Strength, you pervs. Also, a great rack.", 
                "id": "MostCommonSuperpower"
            }, 
            {
                "adjectives": [
                    "old", 
                    "old"
                ], 
                "role": "Death from the old Joe Kelly run of Deadpool was pretty much a Perky Goth. That or just a plain old death obsessed, somehow corporeal, skeleton of some sort.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [], 
                "role": "Sandi is The Chick", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt2622240", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "TheChick", 
                "CoolOldLady"
            ], 
            "shared_count": 3, 
            "id": "Dinosaur", 
            "name": "Dinosaur", 
            "poster_url": "Dinosaur.jpg"
        }, 
        {
            "shared": [
                "EstrogenBrigade", 
                "DisappearedDad", 
                "CoolOldLady"
            ], 
            "shared_count": 3, 
            "id": "TheLorax", 
            "name": "The Lorax", 
            "poster_url": "TheLorax.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CoolOldLady"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CoolOldLady"
            ], 
            "shared_count": 2, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan", 
                "TheChick"
            ], 
            "shared_count": 2, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }
    ], 
    "id": "Deadpool", 
    "name": "Deadpool"
}