{
    "plot": "In 2012, amid economic chaos and high unemployment, Americans watch by the millions as criminals with life sentences race armored cars on Terminal Island. Two-thirds of the combatants die but the winner may earn his freedom. On the day he loses his job, steelworker Jensen Ames is arrested for his wife's murder. Sent to Terminal Island, he's offered an out by the steely and manipulative Warden Hennessey - race as the popular mask-wearing (but now dead) champion, Frankenstein, or rot in prison. Jensen makes the bargain. As the three-stage race approaches, he realizes that the whole thing may be a set up - can an anonymous man behind a mask get revenge and win his release?", 
    "genres": "Action, Sci-Fi, Thriller", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "naked"
                ], 
                "role": "Mr. Fanservice: A naked Luke Goss in the prequel.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "third", 
                    "dead", 
                    "second"
                ], 
                "role": "Pretty Boy: One of the drivers in the third movie is nicknamed Pretty Boy, and looks the part. He's a coward who leaves his navigator for dead after his car flips. Luke is called \"Pretty Boy\" by Katrina in the second film. Later, as Frankenstein, he asks if she was expecting another pretty boy.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "dangerous"
                ], 
                "role": "Scary Black Man: Machine Gun Joe. Inmates are terrified of him. Weyland in the prequels, by virtue of being played by the hulking Ving Rhames. Big Bill in 2, the most dangerous fighter in Death Match.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Coach in Death Race. His sentence was actually over years ago, but he stays in prison because he has nowhere else to go.", 
                "id": "TheOldConvict"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Broken Bird: A rare male example with Jensen after his wife is murdered.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "first", 
                    "second", 
                    "third"
                ], 
                "role": "Ms. Fanservice: Case in the first movie, September Jones and Katrina in the second, and Satana, Katrina, and Amber in the third.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "female", 
                    "actual"
                ], 
                "role": "Wrench Wench: The female navigators are all brought in to help run the cars. Played straight with Case, who wields an actual wrench to fix to guns at one point.", 
                "id": "WrenchWench"
            }
        ]
    }, 
    "imdbid": "tt0452608", 
    "poster_url": "DeathRace.jpg", 
    "similar": [
        {
            "shared": [
                "BrokenBird", 
                "MsFanservice", 
                "MrFanservice", 
                "TheOldConvict"
            ], 
            "shared_count": 4, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "PrettyBoy", 
                "BrokenBird", 
                "MrFanservice", 
                "ScaryBlackMan"
            ], 
            "shared_count": 4, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "MsFanservice", 
                "MrFanservice", 
                "ScaryBlackMan"
            ], 
            "shared_count": 4, 
            "id": "EscapeFromNewYork", 
            "name": "Escape from New York", 
            "poster_url": "EscapeFromNewYork.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MrFanservice", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "TheScorpionKing", 
            "name": "The Scorpion King", 
            "poster_url": "TheScorpionKing.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "MsFanservice", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "Bunraku", 
            "name": "Bunraku", 
            "poster_url": "Bunraku.jpg"
        }
    ], 
    "id": "DeathRace", 
    "name": "Death Race"
}