{
    "plot": "The Cahulawassee River valley in Northern Georgia is one of the last natural pristine areas of the state, which will soon change with the imminent building of a dam on the river, which in turn will flood much of the surrounding land. As such, four Atlanta city slickers - alpha male Lewis Medlock, generally even-keeled Ed Gentry, slightly condescending Bobby Trippe, and wide-eyed Drew Ballinger - decide to take a multi-day canoe trip on the river, with only Lewis and Ed having experience in outdoor life. They know going in that the area is ethno-culturally homogeneous and isolated, but don't understand the full extent of such until they arrive and see what they believe is the result of generations of inbreeding. Their relatively peaceful trip takes a turn for the worse when half way through they encounter a couple of hillbilly moonshiners. That encounter not only makes the four battle their way out of the valley intact and alive, but threatens the relationships of the four as they do and are asked to do things they never thought possible within themselves.", 
    "genres": "Adventure, Drama, Thriller", 
    "release_year": "1972", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "straight", 
                    "other", 
                    "creepy", 
                    "and/or", 
                    "good", 
                    "suspicious", 
                    "sufficient", 
                    "famous", 
                    "benevolent"
                ], 
                "role": "Corrupt Hick: The film would seem to be both played straight and subverted. On the one hand, the rapists themselves play this deadly straight. On the other,  we never see the rapists again and while the rest of the hillbilly town is set up to be creepy and/or evil, they never really do anything, good or bad. There's one police officer who mentions that his brother-in-law went missing recently and is suspicious of the protagonists, but the sheriff rightly says they don't have sufficient evidence to arrest them and instead advises that they leave the town and never return. Especially subverted in the case of the mentally challenged banjo player (probably the most famous character in the film), whose banjo playing provides a creepy soundtrack but who is otherwise benevolent.", 
                "id": "CorruptHick"
            }
        ]
    }, 
    "imdbid": "tt0068473", 
    "poster_url": "Deliverance.jpg", 
    "similar": [
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "Coonskin", 
            "name": "Coonskin"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "Diggstown", 
            "name": "Diggstown", 
            "poster_url": "Diggstown.jpg"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "PootieTang", 
            "name": "Pootie Tang", 
            "poster_url": "PootieTang.jpg"
        }
    ], 
    "id": "Deliverance", 
    "name": "Deliverance"
}