{
    "plot": "Daigo Kobayashi is a devoted cellist in an orchestra that has just been dissolved and now finds himself without a job. Daigo decides to move back to his old hometown with his wife to look for work and start over. He answers a classified ad entitled \"Departures\" thinking it is an advertisement for a travel agency only to discover that the job is actually for a \"Nokanshi\" or \"encoffineer,\" a funeral professional who prepares deceased bodies for burial and entry into the next life. While his wife and others despise the job, Daigo takes a certain pride in his work and begins to perfect the art of \"Nokanshi,\" acting as a gentle gatekeeper between life and death, between the departed and the family of the departed. The film follows his profound and sometimes comical journey with death as he uncovers the wonder, joy and meaning of life and living.", 
    "genres": "Drama", 
    "release_year": "2008", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "same", 
                    "due", 
                    "small"
                ], 
                "role": "Daigo's office mate is herself a Missing Mom and deeply regrets it. She says (and it's implied that Daigo's dad could have been the same way) that she can't return due to being from a small town where she would be viciously persecuted.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "Bad", 
                    "old"
                ], 
                "role": "Bad Ass Grandma: The old lady who runs the public baths single-handedly  until she collapses.", 
                "id": "NeverMessWithGranny"
            }
        ]
    }, 
    "imdbid": "tt1069238", 
    "poster_url": "Departures.jpg", 
    "similar": [
        {
            "shared": [
                "NeverMessWithGranny", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }, 
        {
            "shared": [
                "NeverMessWithGranny", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Ratatouille", 
            "name": "Ratatouille", 
            "poster_url": "Ratatouille.jpg"
        }, 
        {
            "shared": [
                "NeverMessWithGranny", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "SummerWars", 
            "name": "Summer Wars", 
            "poster_url": "SummerWars.jpg"
        }, 
        {
            "shared": [
                "NeverMessWithGranny"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "Departures", 
    "name": "Departures"
}