{
    "plot": "In a happy suburban neighborhood surrounded by white picket fences with flowering rose bushes, sits a black house with a dead lawn. Unbeknownst to the neighbors, hidden beneath this home is a vast secret hideout. Surrounded by a small army of minions, we discover Gru, planning the biggest heist in the history of the world. He is going to steal the moon. (Yes, the moon!) Gru delights in all things wicked. Armed with his arsenal of shrink rays, freeze rays, and battle-ready vehicles for land and air, he vanquishes all who stand in his way. Until the day he encounters the immense will of three little orphaned girls who look at him and see something that no one else has ever seen: a potential Dad. The world's greatest villain has just met his greatest challenge: three little girls named Margo, Edith and Agnes.", 
    "genres": "Animation, Comedy, Family", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "villainous", 
                    "own", 
                    "above-and-beyond"
                ], 
                "role": "A Father to His Men: Gru toward the minions, in a rare villainous example. He seems to genuinely care about them, and is upset when he has to lay them off.  The minions reciprocate the feeling by offering to tap into their own savings to complete the Moon launch, indicating that Gru really was an above-and-beyond employer and that the minions really care about him in return.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "primary"
                ], 
                "role": "Mr. Perkins in Despicable Me. Of course, the fact that he turns out to be the father of the primary villain, and therefore arguably the Big Bad, cannot be underestimated. Tellingly, the Bank of Evil where he works was formerly Lehman Brothers.", 
                "id": "MorallyBankruptBanker"
            }, 
            {
                "adjectives": [
                    "over-protective"
                ], 
                "role": "Gru in Despicable Me eventually grows into one. He becomes very over-protective in the sequel when Margo begins showing interest in boys and dating.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Gru, during the climax. A minor example occurs during the carnival game sequence, when the barker nearly makes Agnes cry.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Margo in Despicable Me is this to the two younger girls, Edith and Agnes, though Word of God has stated that the three are not biologically related. However, they legally become sisters after Gru adopts them.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "own"
                ], 
                "role": "In Despicable Me, Gru's three adopted daughters are each, in her own way, Daddy's Girl. Agnes is the Cheerful Child, Edith is the Cloud Cuckoo Lander Tomboy, and Margo is the Deadpan Snarker Defrosting Ice Queen. And he dotes on all three.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Gru blew up a carnival game to get one for his adopted daughter in Despicable Me.", 
                "id": "GirlsLoveStuffedAnimals"
            }, 
            {
                "adjectives": [
                    "Despicable"
                ], 
                "role": "For Despicable Me: We have the cutest daughters, Margo, Edith, and Agnes.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [
                    "Despicable"
                ], 
                "role": "Despicable Me: Margo", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [], 
                "role": "Stage Dad: Mr. Perkins, shown when he tips off his son Vector that Gru stole the shrink ray from him.", 
                "id": "StageMom"
            }, 
            {
                "adjectives": [
                    "Despicable", 
                    "innocent"
                ], 
                "role": "Despicable Me has Margo, Edith, and Agnes, the most innocent of Gru's adopted daughters.", 
                "id": "TheCutie"
            }, 
            {
                "adjectives": [
                    "overprotective", 
                    "bitter"
                ], 
                "role": "Tomboy and Girly Girl: Edith is a naughty and loudmouth kid who has a taste for weapons, although she likes to wear pink all the time, but acts pretty apathetic. Margo is an overprotective older sister of the girls who is also quite bitter, but she could qualify for being a girly girl, especially Agnes.", 
                "id": "TomBoyAndGirlyGirl"
            }, 
            {
                "adjectives": [
                    "interested", 
                    "high-tech", 
                    "hollowed-out", 
                    "dead", 
                    "violent", 
                    "gross", 
                    "same"
                ], 
                "role": "Edith from Despicable Me. She is interested in Gru's cool high-tech gadgets, thinks its cool that her bed is a hollowed-out bomb, was excited about Gru shaping her pancakes like a \"dead guy\", is violent to grown-ups she doesn't like and has a generally gross sense of humor. However, she is in the same ballet class as her sisters and is always seen wearing pink, especially her pink sherpa hat.", 
                "id": "TomboyWithAGirlyStreak"
            }
        ]
    }, 
    "imdbid": "tt1323594", 
    "poster_url": "DespicableMe.jpg", 
    "similar": [
        {
            "shared": [
                "DaddysGirl", 
                "OverprotectiveDad", 
                "Meganekko", 
                "MadScientistsBeautifulDaughter", 
                "AFatherToHisMen"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "Meganekko", 
                "GirlsLoveStuffedAnimals", 
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "TomboyWithAGirlyStreak", 
                "Meganekko", 
                "TomBoyAndGirlyGirl", 
                "TheCutie"
            ], 
            "shared_count": 4, 
            "id": "ButImACheerleader", 
            "name": "But I'm a Cheerleader", 
            "poster_url": "ButImACheerleader.jpg"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "TomBoyAndGirlyGirl", 
                "AFatherToHisMen"
            ], 
            "shared_count": 3, 
            "id": "TigerCruise", 
            "name": "Tiger Cruise", 
            "poster_url": "TigerCruise.png"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "Meganekko", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 3, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }
    ], 
    "id": "DespicableMe", 
    "name": "Despicable Me"
}