{
    "plot": "The son of Zamindar Narayan Mukherjee, Devdas (Shahrukh Khan) was born with a silver spoon in his mouth. He grew up in the lush village of Taj Sonapur, where he spent his childhood, indulged by his lovely playmate Paro (Aishwarya). They grew up sharing a special relationship, in which they existed only to each other. Oblivious of all the differences of status and background, a bond that would never break grew between them. Slowly, it changed to love but it was still unsaid. But the reverie was broken when his family sent Devdas to London for education. Paro's world crashed knowing that her Devdas would be gone and she lit a diya, for it signified the fast coming back of her loved one. Years passed and Devdas returned. Devdas was besotted by her stunning beauty and longed to have her back. But Zamindar Narayan Mukherjee (Vijay Crishna), Devdas' father, met Paro's mother Sumitra's (Kiran Kher) marriage proposal with condescending arrogance. It caused a rift between the families and even though Devdas tried to convince his father, only antagonism came his way. Finally, he moved away from Paro and wrote a letter to her, asking her to forget him. Only, he didn't realize that he would never be able to forget her ever! And much later, when he reached out to her, it was too late as she was far too humiliated. She scorned him for not standing by her and they parted forever with a heart-broken Paro entering into a chaste marriage with a wealthy, much older man, Zamindar Bhuvan (Vijayendra Ghagte), while a shattered Devdas walked towards anguish, alcoholism & Chandramukhi (Madhuri Dixit). Chandramukhi, a stunning courtesan instantly lost her heart to Devdas. A unique bond was formed between both as he could share with her the intense pain of his unfulfilled love for Paro. Meanwhile, Paro, on the other hand, performed her worldly duties sincerely, but inside her heart, she could never forget Devdas for a moment. Strange was the fate of Devdas. Intensely loved by two women, who were never meant to be his. One whom he could never love and one whom he could never stop loving...", 
    "genres": "Musical, Romance", 
    "release_year": "2002", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "High", 
                    "'courtesan"
                ], 
                "role": "High Class Call Girl: What 'courtesan' can translate to.", 
                "id": "HighClassCallGirl"
            }, 
            {
                "adjectives": [
                    "'courtesan"
                ], 
                "role": "Hooker with a Heart of Gold: Chandramukhi. High Class Call Girl: What 'courtesan' can translate to.", 
                "id": "HookerWithAHeartOfGold"
            }
        ]
    }, 
    "imdbid": "tt0238936", 
    "similar": [
        {
            "shared": [
                "HighClassCallGirl", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "DeconstructingHarry", 
            "name": "Deconstructing Harry", 
            "poster_url": "DeconstructingHarry.jpg"
        }, 
        {
            "shared": [
                "HighClassCallGirl", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "PrettyWoman", 
            "name": "Pretty Woman", 
            "poster_url": "PrettyWoman.jpg"
        }, 
        {
            "shared": [
                "HighClassCallGirl", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "FoxyBrown", 
            "name": "Foxy Brown", 
            "poster_url": "FoxyBrown.jpg"
        }, 
        {
            "shared": [
                "HighClassCallGirl", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "TheHouseOfTheSpirits", 
            "name": "The House of the Spirits", 
            "poster_url": "TheHouseOfTheSpirits.jpg"
        }, 
        {
            "shared": [
                "HighClassCallGirl", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "DeuceBigalow", 
            "name": "Deuce Bigalow", 
            "poster_url": "DeuceBigalow.jpg"
        }
    ], 
    "id": "Devdas", 
    "name": "Devdas"
}