{
    "plot": "During an attack on a pack of Iguanodon, an egg is separated and ends up with the possession of a group of lemurs. The lemurs care for this egg and the young creature born from it, which they call Aladar. When a meteor shower hits earth, Aladar and his family must leave their homeland. Away from home and as close to danger as they have ever been, they meet up with a huge group of dinosaurs, led by Kron and Bruton. All together they are trying to reach the nesting grounds, but it's not going to be easy.", 
    "genres": "Animation, Adventure, Family", 
    "release_year": "2000", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Plio, Aladar's adopted mother from Dinosaur, for some reason actually does not have a husband despite already having a daughter named Suri.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "tyrannical", 
                    "same"
                ], 
                "role": "Kron, the tyrannical Iguanodon leader from Dinosaur. What gave this away was the fact that he was voiced by the same actor who played Sebastian from The Little Mermaid.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Cool Old Lady: Both Eema and Baylene.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "nearby", 
                    "nearby", 
                    "eventual", 
                    "biological", 
                    "other", 
                    "many", 
                    "last"
                ], 
                "role": "Dinosaur:\n Aladar is separated from his mother when his egg is unexpectedly taken away from her nest by a hungry Oviraptor while his mother was trying to protect said nest from the Carnotaurus. The Oviraptor then takes the egg into a nearby forest where it proceeds to crack it open and eat the fetus inside, but loses the egg to another Oviraptor. While the two Oviraptors begin to fight over the egg, Aladar's egg rolls off a ledge and into a nearby river where it is then picked up by a passing Pterodactyl. The Pterodactyl then flies the egg all the way to Lemur Island (home to Aladar's eventual foster family of lemurs) and leaves it there, where he will eventually hatch and be adopted. It's implied that his biological mother was either killed by the Carnotaurus (who also smashed her other eggs) or was among the many dinosaurs that was killed by the meteorite.\n Inverted with Baylene however. She, despite being one of the oldest dinosaurs in the film, actually lost her spouse, as well of all of her siblings and her descendants to the meteorite, therefore making her the last surviving Brachiosaurus on Earth. Also, Plio, the lemur girl that adopts Aladar, despite her father being the chief of the lemur clan, actually doesn't have a mother as well. Inverted with Plio herself, where even though she already has a daughter named Suri, she actually doesn't have a husband.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Suri", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0130623", 
    "poster_url": "Dinosaur.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "CoolOldLady", 
                "ScaryBlackMan", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "ToKillAMockingbird", 
            "name": "To Kill a Mockingbird", 
            "poster_url": "ToKillAMockingbird.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CoolOldLady", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "TheChick", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Epic", 
            "name": "Epic"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CoolOldLady", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "FlyAwayHome", 
            "name": "Fly Away Home", 
            "poster_url": "FlyAwayHome.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "TheChick", 
                "CoolOldLady"
            ], 
            "shared_count": 3, 
            "id": "Deadpool", 
            "name": "Deadpool"
        }
    ], 
    "id": "Dinosaur", 
    "name": "Dinosaur"
}