{
    "plot": "After the suicide of the teenager Allen Clark, his family decides to move from Chicago to the quiet Cradle Bay Island seeking a peaceful life for the siblings Steve and Lindsay Clark. When Steve joins the local high-school, the outcast Gavin Strick befriends Steve and introduces his also rejected friend Rachel Wagner to the newcomer. Gavin exposes to Steve in the refectory the punks, the nerds and the different tribes of the school and he defends the weird theory that a sinister force changes the behavior of the annoyingly perfect \"Blue Ribbons\", a group of good students that wear identical jackets and gather in the Yogurt Shoppe. Further he tells that he had witnessed the blue ribbon Andy Efkin killing their schoolmate Mary Jo that is missing and the local Officer Cox covering the murder. Steve does not believe on Gavin words, but when his friend is submitted to the treatment of Dr. Edgar Caldicott and immediately changes his behavior, joining the Blue Ribbons, Steve and Rachel decides to investigate the mystery discovering the dark secret of the perfect behavior.", 
    "genres": "Horror, Mystery, Sci-Fi", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "male"
                ], 
                "role": "Jerk Jock: The male Blue Ribbons are almost every \"asshole jock\" stereotype rolled together and cranked Up to Eleven, kicking the dog about once every ten minutes.", 
                "id": "JerkJock"
            }
        ]
    }, 
    "imdbid": "tt0134619", 
    "poster_url": "DisturbingBehavior.jpg", 
    "similar": [
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "OurTown", 
            "name": "Our Town", 
            "poster_url": "OurTown.jpg"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "TheRageCarrie2", 
            "name": "The Rage: Carrie 2"
        }, 
        {
            "shared": [
                "JerkJock"
            ], 
            "shared_count": 1, 
            "id": "TheHotChick", 
            "name": "The Hot Chick", 
            "poster_url": "TheHotChick.jpg"
        }
    ], 
    "id": "DisturbingBehavior", 
    "name": "Disturbing Behavior"
}