{
    "plot": "Former dentist, Dr. King Schultz, buys the freedom of a slave, Django, and trains him with the intent to make him his deputy bounty hunter. Instead, he is led to the site of Django's wife who is under the hands of Calvin Candie, a ruthless plantation owner.", 
    "genres": "Western", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "white", 
                    "flamboyant", 
                    "ill-fitting", 
                    "other", 
                    "over-the-top"
                ], 
                "role": "Agent Peacock: When given the chance to dress like a white man, Django goes a bit overboard by dressing up in an outrageously flamboyant and ill-fitting thing. Even the other slaves on Big Daddy's plantation think it's a bit over-the-top.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Dr. Schultz.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "proper"
                ], 
                "role": "Cultured Badass: Schultz. Speaks in a refined, proper manner and has a decent knowledge of German folklore. He's also a Guile Hero who's a pretty mean quickdraw and badass bounty hunter.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "natural", 
                    "red-hot"
                ], 
                "role": "Distressed Dude: Like Kerry Washington, Jamie Foxx goes au natural for his torture scene, which involves Django being suspended from the ceiling while Billy Crash pokes his genitals with a red-hot knife.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "hilarious"
                ], 
                "role": "Grumpy Old Man: Stephen, Candie's butler, combines this with being a completely remorseless Jerk Ass. Still hilarious.", 
                "id": "GrumpyOldMan"
            }, 
            {
                "adjectives": [
                    "nice", 
                    "white", 
                    "other", 
                    "related"
                ], 
                "role": "Big Papa, a plantation owner from Django Unchained is seen wearing a pretty nice white suit, and he manages to avoid that other, related trope while he's wearing it.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [], 
                "role": "Man in White: Big Daddy, narrowly averting the Fat, Sweaty Southerner in a White Suit trope. After all, it is Sonny Crockett.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [
                    "old", 
                    "own"
                ], 
                "role": "Similarly, his role in Django Unchained has him as an old and frail head house slave working for slave owner Calvin Candie.  He is then shown subtly manipulating Candie, and after Candie's death, his family and workers, for his own, petty ends.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "vicious", 
                    "full", 
                    "brutal", 
                    "young", 
                    "white", 
                    "forcing", 
                    "other"
                ], 
                "role": "Django Unchained (being set during the Antebellum South) features two particularly vicious deconstructions: Spencer \"Big Daddy\" Bennett and Calvin J. Candie. Both are plantation owners and slavers, and Deliberate Values Dissonance is in full effect with their monstrously brutal treatment of slaves.\n Big Daddy (pictured above) is seen having young girls whipped for accidentally breaking eggs, and heads a gang of proto-klansmen. Also, he's Don Johnson in a white suit.\n Candie (Leonardo Dicaprio) manages to be even worse: his hobbies include the study of the racist pseudo-science phrenology and forcing his slaves to fight each other to the death in “mandingo” fights for his amusement. We also see him having slaves unwilling to fight torn apart by hungry dogs.", 
                "id": "SouthernGentleman"
            }, 
            {
                "adjectives": [
                    "vicious", 
                    "full", 
                    "brutal", 
                    "young", 
                    "forcing", 
                    "other"
                ], 
                "role": "Southern Gentleman: Being set during the Antebellum South, the film features two particularly vicious deconstructions: Spencer \"Big Daddy\" Bennett and Calvin J. Candie. Both are plantation owners and slavers, and Deliberate Values Dissonance is in full effect with their monstrously brutal treatment of slaves. Big Daddy is seen having young girls whipped for accidentally breaking eggs, and heads a gang of proto-klansmen. Candie manages to be even worse: his hobbies include the study of the racist pseudo-science phrenology and forcing his slaves to fight each other to the death in “mandingo” fights for his amusement. We also see him having slaves unwilling to fight torn apart by hungry dogs.", 
                "id": "SouthernGentleman"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "several", 
                    "happy", 
                    "other", 
                    "available", 
                    "French"
                ], 
                "role": "Beautiful Slave Girl: Seen several times. Candie owns at least three of these. Sheba is made to wear alluring attire, and is apparently something of a consort to Candie. She seems pretty happy with her role. Broomhilda, on the other hand, is openly made available to Candie's visitors to show his \"hospitality\", and is traumatized by it. He also owns a slave who's forced to wear a French Maid Outfit.", 
                "id": "BeautifulSlaveGirl"
            }, 
            {
                "adjectives": [
                    "several", 
                    "happy", 
                    "other", 
                    "available", 
                    "French"
                ], 
                "role": "Seen several times in Django Unchained. Candie owns at least three of these. Sheba is made to wear alluring attire, and is apparently something of a consort to Candie. She seems pretty happy with her role. Broomhilda, on the other hand, is openly made available to Candie's visitors to show his \"hospitality\", and is traumatized by it. He also owns a slave who's forced to wear a French Maid Outfit.", 
                "id": "BeautifulSlaveGirl"
            }, 
            {
                "adjectives": [
                    "little", 
                    "able", 
                    "straight"
                ], 
                "role": "Damsel in Distress: Broomhilda. She exists entirely on the level of plot device, receiving very little characterization aside from being Django's wife, having a tendency to attempt to escape, and being able to speak German. Oddly for a Tarantino film, played completely straight.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "first", 
                    "fantasy", 
                    "hot"
                ], 
                "role": "Django Unchained: The first time that Django's wife Broomhilda is seen outside of flashbacks and fantasy sequences, she's naked in the \"hot box\" as punishment for trying to run away from Candieland, however the circumstances make it very much Fan Disservice.", 
                "id": "GirlInABox"
            }, 
            {
                "adjectives": [
                    "hot"
                ], 
                "role": "Girl in a Box: Broomhilda's introduction, having been isolated in the \"hot box\" for attempting to escape.", 
                "id": "GirlInABox"
            }, 
            {
                "adjectives": [
                    "Für"
                ], 
                "role": "Harp of Femininity: Candie's sister Lara plays Beethoven's \"Für Elise\" on one of these — at least, she does until Schultz angrily demands her to stop.", 
                "id": "HarpOfFemininity"
            }, 
            {
                "adjectives": [
                    "in-universe"
                ], 
                "role": "Ms. Fanservice: Sheba, being her in-universe role as well.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt1853728", 
    "poster_url": "DjangoUnchained.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "CoolOldGuy", 
                "ScaryBlackMan", 
                "AgentPeacock", 
                "DistressedDude", 
                "GirlInABox"
            ], 
            "shared_count": 6, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "GirlInABox", 
                "MsFanservice", 
                "ScaryBlackMan", 
                "ManInWhite", 
                "AgentPeacock"
            ], 
            "shared_count": 5, 
            "id": "TheTransporter", 
            "name": "The Transporter", 
            "poster_url": "TheTransporter.jpg"
        }, 
        {
            "shared": [
                "DistressedDude", 
                "DamselInDistress", 
                "HarpOfFemininity", 
                "CoolOldGuy"
            ], 
            "shared_count": 4, 
            "id": "TheAristocats", 
            "name": "The Aristocats", 
            "poster_url": "TheAristocats.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "MsFanservice", 
                "CoolOldGuy", 
                "GirlInABox"
            ], 
            "shared_count": 4, 
            "id": "ClashOfTheTitans", 
            "name": "Clash of the Titans", 
            "poster_url": "ClashOfTheTitans.jpg"
        }, 
        {
            "shared": [
                "SouthernGentleman", 
                "ScaryBlackMan", 
                "CoolOldGuy", 
                "ManInWhite"
            ], 
            "shared_count": 4, 
            "id": "ToKillAMockingbird", 
            "name": "To Kill a Mockingbird", 
            "poster_url": "ToKillAMockingbird.jpg"
        }
    ], 
    "id": "DjangoUnchained", 
    "name": "Django Unchained"
}