{
    "plot": "Late one night, a beautiful and well-dressed young woman, Grace, arrives in the mountainous old mining town of Dogville as a fugitive; following the sound of gunshots in the distance which have been heard by Tom, the self-appointed moral spokesman for the town. Persuaded by Tom, the town agree to hide Grace, and in return she freely helps the locals. However, when the Sheriff from a neighbouring town posts a Missing notice, advertising a reward for revealing her whereabouts, the townsfolk require a better deal from Grace, in return for their silence; and when the Sheriff returns some weeks later with a Wanted poster, even though the citizens know her to be innocent of the false charges against her, the town's sense of goodness takes a sinister turn and the price of Grace's freedom becomes a workload and treatment akin to that of a slave. But Grace has a deadly secret that the townsfolk will eventually encounter.", 
    "genres": "Crime, Drama, Thriller", 
    "release_year": "2003", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "reluctant"
                ], 
                "role": "Grace from Dogville turns out to be a reluctant Mafia Princess.", 
                "id": "MafiaPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Mafia Princess: Grace turns out to be one.", 
                "id": "MafiaPrincess"
            }
        ]
    }, 
    "imdbid": "tt0276919", 
    "poster_url": "Dogville.jpg", 
    "similar": [
        {
            "shared": [
                "MafiaPrincess"
            ], 
            "shared_count": 1, 
            "id": "OnTheJob", 
            "name": "On The Job", 
            "poster_url": "OnTheJob.jpg"
        }, 
        {
            "shared": [
                "MafiaPrincess"
            ], 
            "shared_count": 1, 
            "id": "BatmanMysteryOfTheBatwoman", 
            "name": "Batman: Mystery of the Batwoman", 
            "poster_url": "BatmanMysteryOfTheBatwoman.jpg"
        }, 
        {
            "shared": [
                "MafiaPrincess"
            ], 
            "shared_count": 1, 
            "id": "Pusher", 
            "name": "Pusher"
        }, 
        {
            "shared": [
                "MafiaPrincess"
            ], 
            "shared_count": 1, 
            "id": "HighStakes", 
            "name": "High Stakes", 
            "poster_url": "HighStakes.jpg"
        }, 
        {
            "shared": [
                "MafiaPrincess"
            ], 
            "shared_count": 1, 
            "id": "KickAss", 
            "name": "Kick-Ass", 
            "poster_url": "KickAss.jpg"
        }
    ], 
    "id": "Dogville", 
    "name": "Dogville"
}