{
    "plot": "Dr Jack Mickler, a psychiatrist, is only 10 days away from his retirement. A week before he is due to leave, he encounters a young man who attempts suicide- would be a pretty straightforward case except the young man claims to be Don Juan, the fabled Spanish nobleman and world renowned seducer/lover of woman. Despite original hostility from his coworkers Jack manages to persuade his associates to put the boy in his care for 10 days after which the boy will undergo an evaluation to be either released from psychiatric care or sent to a mental institution. However, as the 10 days progresses Dr Mickler and the other staff become gradually drawn into to the young man's exotic world of love, passion and pleasure as he recounts his story to them. Whilst doing so the man's philosophies and zeal for life and love begins to revive Dr MIckler's somewhat passionless relationship with his wife, Marilyn as well as challenging his own views and ethics to the point where both he and the audience begin to question: could this young man truly be Don Juan?", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "'real", 
                    "'imaginary", 
                    "old", 
                    "such"
                ], 
                "role": "Disappeared Dad: Both the 'real' and 'imaginary' accounts of John's background agree that  John's father was killed, well before John was old enough to cope with such a loss. Dr. Mickler  gradually takes over that role in John's life.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "loose-fitting", 
                    "new", 
                    "personal", 
                    "'unaltered", 
                    "female"
                ], 
                "role": "Disguised in Drag: The Sultana disguises John (most fetchingly!◊) in loose-fitting harem costumes, to prevent the Sultan from discovering her new personal attendant is an entirely 'unaltered' male. (One could suspect that the script-writers invented this to showcase Depp's talent for female impersonation, but it's actually lifted from Lord Byron's poem.)", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [
                    "eunuch", 
                    "trustworthy", 
                    "considerate", 
                    "obvious", 
                    "enjoyable"
                ], 
                "role": "Eunuchs Are Evil: Averted. Baba, the eunuch assigned to watch over John in the Sultan's palace, is trustworthy and considerate (though, for fairly obvious reasons, he really doesn't want to hear about John's enjoyable liaisons with the Sultana).", 
                "id": "EunuchsAreEvil"
            }, 
            {
                "adjectives": [
                    "early"
                ], 
                "role": "KidAnova: In the backstory he told to Mickler, John recognized his vocation very early in life. Like, before he could talk.", 
                "id": "KidAnova"
            }, 
            {
                "adjectives": [], 
                "role": "Lady Killer In Love: John's condition throughout the film.", 
                "id": "LadyKillerInLove"
            }, 
            {
                "adjectives": [
                    "poster-boy", 
                    "various", 
                    "good"
                ], 
                "role": "Mr. Fanservice: To the max!◊ This is Johnny Depp at his poster-boy best. Watching him in his various flattering costumes is like savoring a assortment of very good chocolates.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "much"
                ], 
                "role": "The Charmer: John is very much this, with or without the Don Juan accouterments.", 
                "id": "TheCharmer"
            }
        ]
    }, 
    "imdbid": "tt0112883", 
    "poster_url": "DonJuanDemarco.jpg", 
    "similar": [
        {
            "shared": [
                "LadyKillerInLove", 
                "TheCharmer", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "LadyKillerInLove", 
                "TheCharmer", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "TheATeam", 
            "name": "The A-Team", 
            "poster_url": "TheATeam.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MrFanservice", 
                "DisguisedInDrag"
            ], 
            "shared_count": 2, 
            "id": "TheBirdcage", 
            "name": "The Birdcage", 
            "poster_url": "TheBirdcage.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "TheCharmer"
            ], 
            "shared_count": 2, 
            "id": "AllDogsGoToHeaven", 
            "name": "All Dogs Go to Heaven", 
            "poster_url": "AllDogsGoToHeaven.jpg"
        }
    ], 
    "id": "DonJuanDemarco", 
    "name": "Don Juan DeMarco"
}