{
    "plot": "Shankar Singh and his wife, Meera, live in Jodhpur, Rajasthan, India along with widowed paternal grandmother, Laxmibai, his mom, Gowri, and dad, Randhir. The family feel that they are blessed after Meera's entry in this family. Shankar must go and abroad in Saudi Arabia and bids farewell to Meera, promising to keep in touch, which he does, and also sends them a large portion of his earnings, which is used to pay off the family's debts. Then when no word is received from him, a worried Meera phones, and is devastated to learn that Shankar has been killed by being thrown off a 10th floor balcony. Her status quickly changes, her jewelery, ornaments, fancy clothes are taken off, and she is told to remain indoors. wear dark clothes, and is only allowed to pray at a Mandir. Things brighten up for Meera when she befriends an Islamic woman, Zeenat, who has come all the way from Himachal Pradesh to look for her husband, Amir Khan. Shortly thereafter, Meera's world is turned upside down when she finds out that her father-in-law plans to make her the mistress of a wealthy building contractor, Chopra, for a sum of Five Lakh Rupees; she endures further trauma when she finds out that Zeenat is the wife of the man who has been accused of killing her husband, is merely here to persuade her to sign a Mafi-Naama, which would ensure the release of her husband from the Saudi jails, and prevent his death. Hurt, humiliated and confused Meera refuses to sign this document, and is confined to a locked room by Randhir. It looks like Zeenat may lose her husband after all, and Meera may end up being Chopra's temporary mistress.", 
    "genres": "Drama", 
    "release_year": "2006", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Subverted.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Determined Homesteader's Wife: Zeenat.", 
                "id": "DeterminedHomesteadersWife"
            }
        ]
    }, 
    "imdbid": "tt0824316", 
    "poster_url": "Dor.jpg", 
    "similar": [
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "HouseOfFlyingDaggers", 
            "name": "House of Flying Daggers", 
            "poster_url": "HouseOfFlyingDaggers.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "TurtlesForever", 
            "name": "Turtles Forever", 
            "poster_url": "TurtlesForever.png"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }
    ], 
    "id": "Dor", 
    "name": "Dor"
}