{
    "plot": "Follows the adventures of an extraordinarily strong young boy named Goku as he searches for the seven dragon balls. These balls, when combined, can grant the owner any one wish he desires. Along the way he makes many new friends, and enemies, and he trains to become the strongest fighter in the world.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "1986–", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "English"
                ], 
                "role": "Whenever English dub Version of Goku goes Super Saiyan 3, he invokes this trope by lowering his voice an octave to show he means business. And let's not get started on the badassery that is Super Saiyan 4...", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Satan of Dragon Ball.", 
                "id": "CarpetOfVirility"
            }, 
            {
                "adjectives": [], 
                "role": "Red Ribbon's General Blue (all but implied to be gay) in Dragon Ball.", 
                "id": "EffeminateMisogynisticGuy"
            }, 
            {
                "adjectives": [
                    "homosexual", 
                    "powerful", 
                    "mercenary"
                ], 
                "role": "General Blue of the Red Ribbon Army from Dragon Ball also comes across as both Camp and Macho Camp (but calling him gay is his Berserk Button). General Blue, the humorously homosexual, yet frighteningly powerful villain who gives Goku a run for his money until he is killed by billion-zeni mercenary Tao Pai Pai.", 
                "id": "MachoCamp"
            }, 
            {
                "adjectives": [], 
                "role": "Trunks himself does his best to skirt this trope, what with being a musclebound Dragon Ball Z character, his extreme attachment to his \"best friend\" Goten and his seeming indifference to girls.", 
                "id": "MachoCamp"
            }, 
            {
                "adjectives": [], 
                "role": "On Dragon Ball, all the men of the Son family qualify. And Trunks.", 
                "id": "NakedShotaroBoy"
            }, 
            {
                "adjectives": [
                    "noble", 
                    "later", 
                    "few", 
                    "normal"
                ], 
                "role": "The King of the World from Dragon Ball is a minor character, but is shown to be a kind and noble ruler (and later in the story, one of the few Earthlings to figure out that normal means will just get people killed against Cell.)", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Chi-Chi from Dragon Ball.", 
                "id": "AnimeChineseGirl"
            }, 
            {
                "adjectives": [
                    "bubble", 
                    "popular", 
                    "sixth"
                ], 
                "role": "Bulma from the Dragon Ball series enjoys taking bubble baths and has a very popular shower scene in the sixth episode.", 
                "id": "BathingBeauty"
            }, 
            {
                "adjectives": [], 
                "role": "Android 18 before her Heel-Face Turn. Played straight with Launch's Superpowered Evil Side.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "martial", 
                    "martial", 
                    "second", 
                    "same"
                ], 
                "role": "Chi-Chi in Dragonball Z acts like this towards her eldest son, Gohan, wanting him to be a scholar and avoid the violent lifestyle of his father. In the end, Gohan becomes a scholar (though he still enjoys martial arts), and she ends up pushing martial arts training on her second son Goten much the same way. However, Gohan himself repeatedly states that he likes being a scholar.", 
                "id": "EducationMama"
            }, 
            {
                "adjectives": [
                    "only", 
                    "female", 
                    "brilliant", 
                    "brilliant", 
                    "former", 
                    "martial", 
                    "other", 
                    "independent", 
                    "more-or-less", 
                    "standard", 
                    "due"
                ], 
                "role": "In Dragon Ball, the only three female main characters are Bulma, Chichi, and Videl. Bulma's father is a brilliant scientist and the owner and president of Capsule Corporation (although Bulma herself is also a brilliant scientist and was introduced long before he was), Chichi's father is the Ox King, and Videl's father is Mr. Satan (Hercule in the American version), a former world martial arts champion, superstar, and the #1 human fighter who doesn't use Ki. There is also Android 18, who provides an example of the other variety, being introduced as an independent villain alongside her brother, then receding into the role of Krillin's wife and more-or-less retiring from fighting.\n Videl's not quite a standard example. She was mainly introduced in the story due to being Mr. Satan's daughter, but she explicitly points out that he doesn't let her train with him. Despite this, she's still managed to become stronger than he is, and had the sense to go to Gohan to get him to teach her some of his abilities, like flying.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "tomboyish", 
                    "common", 
                    "later"
                ], 
                "role": "Bulma from Dragon Ball is this. Aside from being The Chick, she has tomboyish traits and often shares common interests with her friends in the Dragon Ball Gang (and later, the Z Fighters). Her love for mechanics and gadgetry is a plus factor.", 
                "id": "OneOfTheBoys"
            }, 
            {
                "adjectives": [], 
                "role": "That's the outfit Future Trunks is forced to wear by Kid Trunks and Goten in Trunk's New Look: Babysitting.", 
                "id": "PlayboyBunny"
            }, 
            {
                "adjectives": [
                    "early"
                ], 
                "role": "In an early volume of Dragonball, Bulma does this with a diamond. It doesn't go in her bra. Krillin, upon being given the gem, holds it up to his noseless face, trying to see if it smelled.\n But wait... he doesn't have a nose!", 
                "id": "Ptitleba4e2b2g"
            }, 
            {
                "adjectives": [
                    "Mid-Dragon", 
                    "gun-crazy", 
                    "fashion-conscious", 
                    "blue-haired", 
                    "naive", 
                    "adventurous", 
                    "overprotective", 
                    "irresponsible"
                ], 
                "role": "Mid-Dragon Ball has some fun with this trope. Bulma and Lunch vary on which is the tomboy and which is the girly girl depending on which of Lunch's personalities is dominant. If Lunch is in her blonde form, she's a gun-crazy kleptomaniac and Bulma is a fashion-conscious non-combatant. If Lunch is in her blue-haired form, however, she's a naive Yamato Nadeshiko and Bulma is the adventurous Wrench Wench. DBZ also has Chichi and Bulma, where Chichi is the overprotective Education Mama and Bulma is one of her husband's irresponsible friends.", 
                "id": "TomBoyAndGirlyGirl"
            }, 
            {
                "adjectives": [
                    "responsible"
                ], 
                "role": "Bulma from Dragon Ball is this. She's handy with gadgets, and, along with her father, is usually responsible for creating spaceships, as well as Trunks' time machine.", 
                "id": "WrenchWench"
            }
        ]
    }, 
    "imdbid": "tt0280249", 
    "similar": [
        {
            "shared": [
                "TomBoyAndGirlyGirl", 
                "BlondesAreEvil", 
                "NeverASelfMadeWoman", 
                "WrenchWench"
            ], 
            "shared_count": 4, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "BlondesAreEvil", 
                "NeverASelfMadeWoman", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "BlondesAreEvil", 
                "TomBoyAndGirlyGirl", 
                "OneOfTheBoys"
            ], 
            "shared_count": 3, 
            "id": "EverAfter", 
            "name": "Ever After"
        }, 
        {
            "shared": [
                "MachoCamp", 
                "NeverASelfMadeWoman", 
                "WrenchWench"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "AnimeChineseGirl", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "DragonBall", 
    "name": "Dragon Ball"
}