{
    "plot": "The future America is an irradiated waste land. On its East Coast, running from Boston to Washington DC, lies Mega City One - a vast, violent metropolis where criminals rule the chaotic streets. The only force of order lies with the urban cops called \"Judges\" who possess the combined powers of judge, jury and instant executioner. Known and feared throughout the city, Dredd is the ultimate Judge, challenged with ridding the city of its latest scourge - a dangerous drug epidemic that has users of \"Slo-Mo\" experiencing reality at a fraction of its normal speed. During a routine day on the job, Dredd is assigned to train and evaluate Cassandra Anderson, a rookie with powerful psychic abilities thanks to a genetic mutation. A heinous crime calls them to a neighborhood where fellow Judges rarely dare to venture - a 200 storey vertical slum controlled by prostitute turned drug lord Ma-Ma and her ruthless clan. When they capture one of the clan's inner circle, Ma-Ma overtakes the compound's control center and wages a dirty, vicious war against the Judges that proves she will stop at nothing to protect her empire. With the body count climbing and no way out, Dredd and Anderson must confront the odds and engage in the relentless battle for their survival.", 
    "genres": "Action, Sci-Fi", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Baritone/Guttural"
                ], 
                "role": "Badass Baritone/Guttural Growler: Karl Urban does a deep voice for Dredd that puts Christian Bale's Batman to shame (and the actor admits was hard to sustain).", 
                "id": "BadassBaritone"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Judge Anderson.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Black Boss Lady: The Chief Judge.", 
                "id": "BlackBossLady"
            }, 
            {
                "adjectives": [], 
                "role": "The Chief Judge in Dredd, whose meetings with the title character bookend the movie.", 
                "id": "BlackBossLady"
            }, 
            {
                "adjectives": [
                    "big"
                ], 
                "role": "Ma-Ma in Dredd mostly plays with blades, but when she uses a gun it's a really big one.", 
                "id": "SmallGirlBigGun"
            }, 
            {
                "adjectives": [
                    "Small", 
                    "only", 
                    "massive"
                ], 
                "role": "Small Girl, Big Gun: The only time we see Ma-Ma using a gun is when she's using a massive Gatling gun on the Judges.", 
                "id": "SmallGirlBigGun"
            }
        ]
    }, 
    "imdbid": "tt1343727", 
    "poster_url": "Dredd.jpg", 
    "similar": [
        {
            "shared": [
                "SmallGirlBigGun", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "KickAss", 
            "name": "Kick-Ass", 
            "poster_url": "KickAss.jpg"
        }, 
        {
            "shared": [
                "BlackBossLady", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "StarshipTroopers", 
            "name": "Starship Troopers", 
            "poster_url": "StarshipTroopers.jpg"
        }, 
        {
            "shared": [
                "SmallGirlBigGun", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "AlienS", 
            "name": "Aliens", 
            "poster_url": "AlienS.jpg"
        }, 
        {
            "shared": [
                "SmallGirlBigGun", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "Zeiram", 
            "name": "Zeiram", 
            "poster_url": "Zeiram.jpg"
        }, 
        {
            "shared": [
                "SmallGirlBigGun", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "PrincessMononoke", 
            "name": "Princess Mononoke", 
            "poster_url": "PrincessMononoke.jpg"
        }
    ], 
    "id": "Dredd", 
    "name": "Dredd"
}