{
    "plot": "In the far future, a duke and his family are sent by the Emperor to a sand world from which comes a spice that is essential for interstellar travel. The move is designed to destroy the duke and his family, but his son escapes and seeks revenge as he uses the world's ecology as one of his weapons.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "1984", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "such", 
                    "fanatical", 
                    "implied"
                ], 
                "role": "A Father to His Men: Lampshaded when Duke Leto Atreides risks his life and the priceless Spice to save his men; Liet-Kynes comments that a man such as that would inspire fanatical loyalty. It's implied that this is exactly why the Emperor wants him dead, because he fears Leto will use his popularity to depose him. There are further hints that this may be a mask designed expressly for the purpose, although it's explicitly contradicted by the prequels.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [], 
                "role": "Cultured Badass: Pretty much everyone.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Baron Vladimir Harkonnen in Dune.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "main", 
                    "youthful", 
                    "first", 
                    "old", 
                    "second", 
                    "same", 
                    "unaware", 
                    "depraved", 
                    "likely"
                ], 
                "role": "Depraved Homosexual: Baron Vladimir Harkonnen. Though at the time of the main series of books his lust is placed solely on adolescent boys, mention of youthful exploits with women is made. The first is his fifteen year old nephew and the second is his grandson of the same age, though he was unaware of this relation. The prequels make him even more depraved, casually mentioning that his conquests aren't particularly likely to survive the act.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [], 
                "role": "Paul Atreides in Dune. That Momma's Boy ain't no Momma's Boy!", 
                "id": "MommasBoy"
            }, 
            {
                "adjectives": [
                    "gratuitous"
                ], 
                "role": "Mr. Fanservice: Feyd's utterly gratuitous speedo scene in the film. Sting's running five miles a day really paid off.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "general", 
                    "patriarchal", 
                    "patriarchal", 
                    "strong", 
                    "first", 
                    "Shai-Hulud", 
                    "abolish", 
                    "male", 
                    "noble", 
                    "patriarchal", 
                    "find", 
                    "noble", 
                    "all-female", 
                    "great", 
                    "elite", 
                    "rigid", 
                    "sexual", 
                    "reproductive", 
                    "selective", 
                    "other"
                ], 
                "role": "Dune in general is patriarchal outside of the Bene Geserit sisterhood, with women exposed to socially sanctioned subordination and violence.\n Fremen society is patriarchal, and even though Fremen women are strong and fearless, they're still treated like subordinates. For example, a man dying at the hands of a woman is considered embarassing, as Chani notes when she kills a man who wanted to duel with Paul in the first novel. Also, sietch leaders are always male. In Dune Messiah, Farok tells Scytale that Fremen sacrificed virgins to Shai-Hulud (a practice Farok thinks should return) before Liet-Kynes made them abolish the practice. Finally, male duel victors inherit the wives of their defeated foes as spoils of war, with the wives having no say in the matter.\n Some Fremen men have no qualms about rape through force or deception. In Dune Messiah, Farok's son gives semuta to Otheym's daughter \"in the hope of winning a woman of the [Fremen] for himself despite his blindness.\" Farok speaks casually about the conquest of Naraj and his son's forced impregnantion of Naraj women.\n The noble houses of Dune are rigidly patriarchal, headed only by men. Female nobles and concubines do find ways to manipulate events, but it is always behind the scenes. The noble houses also practice arranged marriage, or in Irulan's case, forced marriage.\n Even the all-female Bene Geserit sisterhood doesn't fully escape this trope. Granted, Reverend Mothers wield a great deal of power, and the sisterhood provides women with elite training and avenues for getting ahead. However, the sisterhood also exerts rigid control over initiates' sexual and reproductive lives for the sake of its selective breeding program, deciding who they will marry, who they will have sex with, and when and if they will bear children. The idea that initiates might have other plans is never considered.", 
                "id": "NoWomansLand"
            }, 
            {
                "adjectives": [
                    "general", 
                    "patriarchal", 
                    "patriarchal", 
                    "strong", 
                    "first", 
                    "Shai-Hulud", 
                    "practive", 
                    "male", 
                    "first", 
                    "sexual", 
                    "female", 
                    "several", 
                    "female", 
                    "fair", 
                    "male", 
                    "noble", 
                    "patriarchal", 
                    "find", 
                    "noble", 
                    "all-female", 
                    "great", 
                    "elite", 
                    "rigid", 
                    "sexual", 
                    "reproductive", 
                    "selective", 
                    "other", 
                    "horrific"
                ], 
                "role": "No Woman's Land: In general, the Dune universe is patriarchal outside of the Bene Geserit sisterhood, with women exposed to socially sanctioned subordination and violence. Fremen society is patriarchal, and even though Fremen women are strong and fearless, they're still treated like subordinates. For example, a man dying at the hands of a woman is considered embarassing, as Chani notes when she kills a man who wanted to duel with Paul in the first novel. Sietch leaders are always male. In Dune Messiah, Farok tells Scytale that Fremen sacrificed virgins to Shai-Hulud (a practive Farok wants to see return) before Liet-Kynes abolished the practice. Finally, male duel victors inherit the wives of their defeated foes as spoils of war, with the wives having no say in the matter. Jamis killed Harah's first husband in a duel for the stated purpose of taking Harah for his wife. Some Fremen men have no qualms about rape through force or deception. In Dune Messiah, Farok's son gives semuta to Otheym's daughter \"in the hope of winning a woman of the [Fremen] for himself despite his blindness.\" Farok speaks casually about the conquest of Naraj and his son's forced impregnantion of Naraj women. Slavery, sexual or otherwise, is an accepted practice in the Dune universe. Irulan recounts the story of secretly seeing Fenring offer Emperor Shaddam a female sex slave, only for Shaddam to politely refuse. Feyd also has several female sex slaves (but, to be fair, the Baron has male sex slaves as well). The noble houses of Dune are rigidly patriarchal, headed only by men. Female nobles and concubines do find ways to manipulate events, but it is always behind the scenes. The noble houses also practice arranged marriage, or in Irulan's case, forced marriage. Even the all-female Bene Geserit sisterhood doesn't fully escape this trope. Granted, Reverend Mothers wield a great deal of power, and the sisterhood provides women with elite training and avenues for getting ahead. However, the sisterhood also exerts rigid control over initiates' sexual and reproductive lives for the sake of its selective breeding program, deciding who they will marry, who they will have sex with, and when and if they will bear children. The idea that initiates might have other plans is never considered. Perhaps the most horrific example of this trope is the story behind the Tleilaxu's axlotl tanks.", 
                "id": "NoWomansLand"
            }, 
            {
                "adjectives": [
                    "human", 
                    "little", 
                    "brutish", 
                    "arch-enemy", 
                    "later", 
                    "first", 
                    "second", 
                    "third"
                ], 
                "role": "Dune has House Harkonnen this way. Headed by Baron Vladimir Harkonnen, human life is of little consequence to the Baron or his nephews, the brutish Glossu Rabban and Harkonnen's heir Feyd-Rautha.\n Ironically, it's the Baron's grandson and granddaughter (whose relation to him was hidden, and who are also the children of his arch-enemy, who he tried to kill) and later great-grandson who actually become overlords, although the first is a subversion, the second is possessed, and the third is a Necessarily Evil Dark Messiah.", 
                "id": "OverlordJr"
            }, 
            {
                "adjectives": [], 
                "role": "Duncan Idaho more so. See The Casanova above.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [
                    "own", 
                    "such", 
                    "original"
                ], 
                "role": "The Prelude to Dune novels by Brian Herbert and Kevin J. Anderson ( if one acknowledges that they exist) have two examples:\n Shaddam Corrino IV poisons his father, Elrood IX, to get the throne.\n Glossu \"Beast\" Rabban kills his father Abulurd. Abulurd tells him: \"You couldn't kill your own father. You are not such a beast.\" Glossu kills him and responds: \"From now on you may call me Beast.\"\n In the original Dune novel, Feyd-Rautha Harkonnen is one part this to two parts Bastard Understudy.", 
                "id": "TheEvilPrince"
            }, 
            {
                "adjectives": [], 
                "role": "Paul Atreides of Dune goes through all three phases as his character develops throughout the series.\n Apparently he goes at the rate of at least one face per novel, in terms of books 1-3, of course.", 
                "id": "TheThreeFacesOfAdam"
            }, 
            {
                "adjectives": [
                    "open"
                ], 
                "role": "Leto II from the miniseries Children of Dune is always either shirtless or wearing his shirt half open.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "first", 
                    "good", 
                    "short"
                ], 
                "role": "Action Girl / Action Mom: Chani. Jessica as well in the first book, when she has to be. Her fight with Stilgar is a good example: short, to the point, and lets her and Paul introduce themselves to the Fremen properly.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "necessary", 
                    "God-Emperor", 
                    "maternal", 
                    "temporary"
                ], 
                "role": "In Dune the Bene Gesserit can fight with nearly superhuman capability if necessary, and Heretics of Dune introduces the Honored Matres. Leto II justifies this trope when he forms the Fish-Speakers in God-Emperor of Dune: he believes their maternal instinct will prevent them from succumbing to bloodlust or quests for power, and they're a temporary army since they're all about him, so they'll lack a unifying force once he dies. It's all part of his Golden Path for humanity.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [], 
                "role": "Leto II's Fish Speakers, an Amazon Brigade, become more feared than the Sardaukar.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [
                    "due", 
                    "natural", 
                    "tough", 
                    "full-blooded", 
                    "literal", 
                    "remote-controlled"
                ], 
                "role": "Dune:\n Jessica, due to her Bene Gesserit upbringing; Fremen leader Stilgar even worries when he first meets her that she'd end up ruling his people (the toughest warriors in the known galaxy) through Asskicking Equals Authority alone. She's technically not a princess, but she's the natural daughter of a Baron, concubine of a Duke, and mother of one God Emperor and grandmother of another one.\n Her daughter-in-law Chani is technically this to the Fremen, as the daughter of Liet-Kynes and every bit as tough as any full-blooded Fremen man or woman.\n Her granddaughter Ghanima would be a literal example, especially after surviving an assassination attempt involving remote-controlled tigers.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "galactic", 
                    "personal", 
                    "male"
                ], 
                "role": "The Fish Speakers, God-Emperor Leto II's galactic occupation army, whose elite members make up his personal guard unit. Entirely female as part of his master plan for humanity's destiny and to prevent things like his soldiers raping civilians or otherwise abusing their monopoly on violence (like every male army in history).", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [
                    "Bible-thumper", 
                    "due", 
                    "own", 
                    "technological", 
                    "economic", 
                    "bad", 
                    "first"
                ], 
                "role": "Evil Matriarch: In the prequels, Duke Leto Atreides' mother, Helena, is generally a thorn in the side of the Atreides household,  and hatches a plot to kill her husband, the Old Duke Paulus. She is eventually exiled to the Sisters in Isolation to spend the rest of her life. She is also a Bible-thumper and hates the Ixians supposedly due to their (alleged) violations of the no-AI rule, but mostly because House Vernius (the rulers of Ix) beat her own House Richese in the technological and economic game. Anything bad that happens to the Ixians is God's will in her mind.  When Paul shows up on the doorstep of the Sisters retreat, Helena at first wants nothing to do with her grandson, even though he is being hunted by assassins.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "In the prequels to the Dune series, Duke Leto Atreides' mother, Helena, is generally a thorn in the side of the Atreides household, and hatches a plot to kill her husband, the Old Duke Paulus. She is eventually exiled to the Sisters in Isolation to spend the rest of her life.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "The Reverend Mother in Dune. Also the Fremen tribal elderwomen.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "single", 
                    "specific", 
                    "selective"
                ], 
                "role": "The Honored Matres in the Dune universe have this as their signature style of unarmed combat, and have developed it to the point where a single kick can be instantly lethal. They are also, for reasons connected with specific training and possibly selective breeding, extremely fast. Some of the best Bene Gesserit adepts are a match for them, but that's about it.", 
                "id": "KickChick"
            }, 
            {
                "adjectives": [], 
                "role": "Lady of War: Jessica", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "gleeful"
                ], 
                "role": "Dune: Alia. Even more so in the novel. While the David Lynch film either glosses over it or fails to explain it, in the scene from the movie after she kills Baron Harkonnen, where she's out on the battlefield with the crysknife and the strangely gleeful look on her face, she is actually engaged in systematically killing the enemy wounded.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Bear: Jessica", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "other", 
                    "pregnant", 
                    "pregnant"
                ], 
                "role": "The Lady Jessica, in Dune, quickly forces Stilgar (the leader of his sietch and therefore its mightiest warrior) to submit and keep the other Fremen at bay. She does this while not heavily pregnant but pregnant nonetheless.", 
                "id": "PregnantBadass"
            }, 
            {
                "adjectives": [
                    "interesting", 
                    "mortal", 
                    "first"
                ], 
                "role": "Lady Jessica Atreides in Dune is an interesting twist. She has Undying Loyalty to the Atreides family. She is rebelling against the Bene Gesserit order by having a son instead of a daughter (yes she can control that — she's a Bene Gesserit). She's also  the daughter of the Baron Harkonnen. As in head of House Harkonnen, the Atreides' mortal enemies, via a Bene Gesserit breeding scheme. She doesn't know it at first, and she's not pleased when she finds out.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "safe", 
                    "other", 
                    "loyal", 
                    "fair"
                ], 
                "role": "Lady Jessica acts as her semi-husband's aide in Dune. She once with mild bitterness notes that this makes her a perfectly safe trusty of Atreides state secrets.\n Leto trusts her, but that doesn't stop some of his other assistants from questioning whether she's more loyal to House Atreides or Bene Gesserit. Which would be a fair concern, except for the fact that she actually does love Leto and for his sake has disobeyed her orders to have a daughter rather than a son with him.", 
                "id": "SexySecretary"
            }
        ]
    }, 
    "imdbid": "tt0087182", 
    "poster_url": "Dune.jpg", 
    "similar": [
        {
            "shared": [
                "CulturedBadass", 
                "WalkingShirtlessScene", 
                "LittleMissBadass", 
                "TheThreeFacesOfAdam", 
                "AFatherToHisMen", 
                "TheCasanova", 
                "OverlordJr", 
                "LadyOfWar", 
                "BodyguardBabes", 
                "MommasBoy", 
                "BadassPrincess"
            ], 
            "shared_count": 11, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "MamaBear", 
                "PregnantBadass", 
                "AmazonBrigade", 
                "LittleMissBadass", 
                "LadyOfWar", 
                "BodyguardBabes", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "KillBill", 
            "name": "Kill Bill", 
            "poster_url": "KillBill.jpg"
        }, 
        {
            "shared": [
                "MamaBear", 
                "EvilMatriarch", 
                "LadyOfWar", 
                "MrFanservice", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 6, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "MamaBear", 
                "RebelliousPrincess", 
                "OverlordJr", 
                "MrFanservice", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 6, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "GrandeDame", 
                "EvilMatriarch", 
                "KickChick", 
                "TheCasanova", 
                "MommasBoy"
            ], 
            "shared_count": 6, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "Dune", 
    "name": "Dune"
}