{
    "plot": "The Empire of Izmer has long been a divided land. The Mages - an elite group of magic-users - rule whilst the lowly commoners are powerless. Izmer's young Empress, Savina, wants equality and prosperity for all, but the evil Mage Profion is plotting to depose her and establish his own rule. The Empress possesses a scepter which controls Izmer's Golden Dragons. To challenge her rule, Profion must have the scepter, and tricks the Council of Mages into believing Savina is unfit to hold it. Knowing that Profion will bring death and destruction to Izmer, Savina must find the legendary Rod of Savrille, a mythical rod that has the power to control Red Dragons, a species even mightier than the Gold. Enter two thieves, Ridley and Snails, who unwittingly become instrumental in Savina's search for the Rod. Joined by a feisty Dwarf named Elwood, and helped by the Empress's expert tracker, the Elf Norda, the young heroes go in search of the Rod of Savrille. From the deadly maze of the Thieves Guild at Antius to an Elven Village, secret grotto and abandoned castles, Ridley and his band must outwit Profion's chief henchman Damodar at every turn while, back in Izmer, Profion prepares to do battle with the Empress. All depends on the Rod, but the outcome of the race to reach it first is far from certain, and Izmar's very survival hangs in the balance.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "2000", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "High", 
                    "common"
                ], 
                "role": "High Heel-Face Turn: Akordia, in the most common way of falling in love with the Hero.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Witch: Akordia", 
                "id": "HotWitch"
            }
        ]
    }, 
    "imdbid": "tt0190374", 
    "poster_url": "DungeonsAndDragonsTheBookOfVileDarkness.jpg", 
    "similar": [
        {
            "shared": [
                "HighHeelFaceTurn", 
                "HotWitch"
            ], 
            "shared_count": 2, 
            "id": "IMarriedAWitch", 
            "name": "I Married A Witch", 
            "poster_url": "IMarriedAWitch.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "HotWitch"
            ], 
            "shared_count": 2, 
            "id": "BeautifulCreatures", 
            "name": "Beautiful Creatures", 
            "poster_url": "BeautifulCreatures.jpg"
        }, 
        {
            "shared": [
                "HotWitch"
            ], 
            "shared_count": 1, 
            "id": "PracticalMagic", 
            "name": "Practical Magic", 
            "poster_url": "PracticalMagic.jpg"
        }, 
        {
            "shared": [
                "HotWitch"
            ], 
            "shared_count": 1, 
            "id": "TheWitchesOfOz", 
            "name": "The Witches Of Oz", 
            "poster_url": "TheWitchesOfOz.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }
    ], 
    "id": "DungeonsAndDragonsTheBookOfVileDarkness", 
    "name": "Dungeons & Dragons: The Book of Vile Darkness"
}