{
    "plot": "In London, the Russian pregnant teenager Tatiana arrives bleeding in a hospital, and the doctors save her baby only. The Russian descendant midwife Anna Khitrova finds Tatiana's diary written in Russian language in her belongings and decided to find her family to deliver the baby, she brings the diary home and ask her uncle Stepan to translate the document. Stepan refuses, but Anna finds a card of a restaurant owned by the Russian Semyon inside the diary and she visits the old man trying to find a lead to contact Tatiana's family. When she mentions the existence of the diary, Semyon immediately offers to translate the document. However, Stepan translates part of the diary and Anna discovers that Semyon and his sick son Kirill had raped Tatiana when she was fourteen years old and forced her to work as prostitute in a brothel of their own. Further, Semyon is the dangerous boss of the Russian mafia \"Vory v Zakone\", jeopardizing the safety of Anna and her family. Meanwhile, Semyon's driver Nikolai Luzhin gets close to Kirill and Semyon, climbing positions in the criminal organization, but he helps Anna, her family and the baby.", 
    "genres": "Crime, Mystery, Thriller", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Gayngster: Kirill is pretty obviously gay.", 
                "id": "Gayngster"
            }, 
            {
                "adjectives": [
                    "Russian", 
                    "Russian", 
                    "big", 
                    "right-hand"
                ], 
                "role": "Kirill in Eastern Promises. It's highly taboo in the Russian mob, so he has someone killed just for insinuating that one of the Russian mobsters was gay. He's got a really big thing for his right-hand man, played by Viggo Mortensen.", 
                "id": "Gayngster"
            }, 
            {
                "adjectives": [
                    "heavy"
                ], 
                "role": "Grumpy Old Man: Anna's racist uncle Stepan. With a heavy dose of Jerk with a Heart of Gold.", 
                "id": "GrumpyOldMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Disposable"
                ], 
                "role": "Disposable Sex Worker: Tatiana, and it seems that most of the prostitutes shown will end up like this.", 
                "id": "DisposableSexWorker"
            }, 
            {
                "adjectives": [
                    "stark"
                ], 
                "role": "A couple girls from Semyon's family - his granddaughters - get plenty of attention in Eastern Promises. Not as extreme of an example as some of the others here, but the way they're treated is used for a stark contrast with how Semyon and the rest of his family treat women, even implicitly children who may be his granddaughters' ages.", 
                "id": "MafiaPrincess"
            }
        ]
    }, 
    "imdbid": "tt0765443", 
    "poster_url": "EasternPromises.jpg", 
    "similar": [
        {
            "shared": [
                "Gayngster", 
                "DisposableSexWorker"
            ], 
            "shared_count": 2, 
            "id": "IchiTheKiller", 
            "name": "Ichi the Killer", 
            "poster_url": "IchiTheKiller.jpg"
        }, 
        {
            "shared": [
                "MafiaPrincess", 
                "DisposableSexWorker"
            ], 
            "shared_count": 2, 
            "id": "Pusher", 
            "name": "Pusher"
        }, 
        {
            "shared": [
                "MafiaPrincess", 
                "DisposableSexWorker"
            ], 
            "shared_count": 2, 
            "id": "TheGodfather", 
            "name": "The Godfather", 
            "poster_url": "TheGodfather.jpg"
        }, 
        {
            "shared": [
                "Gayngster", 
                "GrumpyOldMan"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "GrumpyOldMan"
            ], 
            "shared_count": 1, 
            "id": "MonsterHouse", 
            "name": "Monster House", 
            "poster_url": "MonsterHouse.jpg"
        }
    ], 
    "id": "EasternPromises", 
    "name": "Eastern Promises"
}