{
    "plot": "The beautiful princess Giselle is banished by an evil queen from her magical, musical animated land and finds herself in the gritty reality of the streets of modern-day Manhattan. Shocked by this strange new environment that doesn't operate on a \"happily ever after\" basis, Giselle is now adrift in a chaotic world badly in need of enchantment. But when Giselle begins to fall in love with a charmingly flawed divorce lawyer who has come to her aid - even though she is already promised to a perfect fairy tale prince back home - she has to wonder: Can a storybook view of romance survive in the real world?", 
    "genres": "Comedy, Family, Fantasy", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "former", 
                    "estranged"
                ], 
                "role": "Angry Black Man: Gender Flipped by Robert's client and the bus driver that Edward encountered in Times Square, though the latter is really justified for being angry. Downplayed by the former's estranged husband. Completely averted by the guys who sang with Giselle at Central Park.", 
                "id": "AngryBlackMan"
            }, 
            {
                "adjectives": [
                    "enormous", 
                    "top", 
                    "forcing"
                ], 
                "role": "Distressed Dude: At the end of the film, Narissa turns into an enormous dragon, grabbing Robert and flying with him to the top of the Woolworth Building, forcing Giselle to save the day.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "next"
                ], 
                "role": "Knight In Shining Armour: The movie begins with Prince Edward saving Giselle from a troll and they plan to get married the next day.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice: Patrick Dempsey and James Marsden.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "Wrong"
                ], 
                "role": "Prince Charming: Edward, parodied. In addition to his cluelessness, he's revealed to have a bit of an ego problem, but he never gets to the level of Prince Charmless. Also subverted.  Edward is merely Wrong Genre Savvy, as witnessed when instantly realizes and selflessly reacts to his kiss having no effect on Giselle.", 
                "id": "PrinceCharming"
            }, 
            {
                "adjectives": [
                    "Sensitive", 
                    "top", 
                    "no-nonsense"
                ], 
                "role": "Sensitive Guy and Manly Man: Played with. Edward is the Warrior Prince, while Robert is a Non-Action Guy. However, Edward is an over the top Romantic, while Robert is the one with a no-nonsense snarky attitude.", 
                "id": "SensitiveGuyAndManlyMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: After spending most of the movie as a Princess Classic, Giselle turns into either this or Action Survivor to fight the Big Bad.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Clingy Jealous Girl: Nancy had shades of this during the ball.", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Gender Flipped, which Narissa humorously lampshades.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses: Of course, since it's a parody of the movies that foster the mindset.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Graceful Ladies Like Purple: Giselle in the ball.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [], 
                "role": "Giselle from Enchanted doesn't get why Robert is so flustered when he walks in on her in the shower.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Innocent Fanservice Girl: Giselle during the shower scene.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "evil"
                ], 
                "role": "In Enchanted, Giselle claims what really happened is that Red was evil and tried to kill the Wolf with an ax before Pip saved him.", 
                "id": "LittleRedFightingHood"
            }, 
            {
                "adjectives": [
                    "happen", 
                    "late", 
                    "first", 
                    "extra", 
                    "other"
                ], 
                "role": "Giselle, the fairytale princess from Enchanted and breaks up an existing affair in the process. In addition, the breakup and associated hookup happen late because at first Giselle is eternally devoted to someone else. These extra Love Interests hook up with each other in the end.", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [
                    "Magical"
                ], 
                "role": "Magical Girlfriend: What else would you call Giselle in New York?", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [
                    "straight", 
                    "similar"
                ], 
                "role": "Manic Pixie Dream Girl: Giselle, though she's not an entirely straight example given her character growth and the fact that Robert himself is performing a similar role for her.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Enchanted: Morgan's mother left. We had the explanation, and it was significant. Prince Edward has a missing mom too, hence his stepmother.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "dead"
                ], 
                "role": "Missing Mom: Morgan and Giselle share a bonding moment over neither having ever had a \"shopping with Mom\" experience. Bonus points in that Morgan's mom isn't dead, but actually left her family.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "every-girl", 
                    "naïve"
                ], 
                "role": "Pictured above is Giselle from Enchanted who is not an \"every-girl\" but certainly naïve.", 
                "id": "NaiveEverygirl"
            }, 
            {
                "adjectives": [
                    "nice", 
                    "new"
                ], 
                "role": "Giselle from Enchanted is this trope to the letter. When faced with the wildlife of New York City - gnats, pigeons, and cockroaches - she forces herself to smile and admit \"Well, it's always nice to make new friends!\"", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Princess Classic: Giselle, also parodied.", 
                "id": "PrincessClassic"
            }, 
            {
                "adjectives": [], 
                "role": "Sassy Black Woman: Robert's client and the bus driver in Times Square.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [], 
                "role": "The Fashionista: Nancy, who is a fashion designer.  When she left with Edward, Giselle takes over her business.", 
                "id": "TheFashionista"
            }, 
            {
                "adjectives": [], 
                "role": "The Ingenue: Giselle.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Giselle is definitely a very frilly and girly girl, while Nancy is a career woman who wears pantsuits and glasses.", 
                "id": "TomBoyAndGirlyGirl"
            }, 
            {
                "adjectives": [
                    "intentional", 
                    "meant", 
                    "amalgamation/parody/lampshade", 
                    "classic", 
                    "Evil/Vain", 
                    "last", 
                    "magic"
                ], 
                "role": "Vain Sorceress: Narissa. Though, that must have been intentional; she is meant to be an amalgamation/parody/lampshade of the classic Disney \"Evil/Vain Sorceress\" villains, most notably Maleficent, the Queen from Snow White, Ursula, and perhaps just a dash of Lady Tremaine (well, that last one doesn't really use magic unless you count one of the sequels, but still).", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in Black: Narissa.", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in White: Giselle when she first arrives in New York.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0461770", 
    "poster_url": "Enchanted.jpg", 
    "similar": [
        {
            "shared": [
                "PrinceCharming", 
                "InnocentFanserviceGirl", 
                "EverythingsBetterWithPrincesses", 
                "GracefulLadiesLikePurple", 
                "MissingMom", 
                "PluckyGirl", 
                "MrFanservice", 
                "ActionGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 9, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "KnightInShiningArmor", 
                "PluckyGirl", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "DistressedDude", 
                "ActionGirl"
            ], 
            "shared_count": 9, 
            "id": "Tangled", 
            "name": "Tangled", 
            "poster_url": "Tangled.png"
        }, 
        {
            "shared": [
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "SensitiveGuyAndManlyMan", 
                "DamselInDistress", 
                "PluckyGirl", 
                "TheIngenue", 
                "ActionGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 8, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "PrinceCharming", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "WomanInWhite", 
                "DistressedDude", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 8, 
            "id": "Fantaghiro", 
            "name": "Fantaghiro"
        }, 
        {
            "shared": [
                "KnightInShiningArmor", 
                "ClingyJealousGirl", 
                "TheFashionista", 
                "TomBoyAndGirlyGirl", 
                "MagicalGirlfriend", 
                "DamselInDistress", 
                "NaiveEverygirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 8, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }
    ], 
    "id": "Enchanted", 
    "name": "Enchanted"
}