{
    "plot": "The Earth was ravaged by the Formics, an alien race seemingly determined to destroy humanity. Seventy years later, the people of Earth remain banded together to prevent their own annihilation from this technologically superior alien species. Ender Wiggin, a quiet but brilliant boy, may become the savior of the human race. He is separated from his beloved sister and his terrifying brother and brought to battle school in orbit around earth. He will be tested and honed into an empathetic killer who begins to despise what he does as he learns to fight in hopes of saving Earth and his family.", 
    "genres": "Action, Sci-Fi", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "much", 
                    "severe"
                ], 
                "role": "Drill Sergeant Nasty: Sgt. Dap is a textbook example. He becomes much less severe when Ender gets promoted.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "Ender’s", 
                    "British", 
                    "few", 
                    ")"
                ], 
                "role": "The film version of Ender’s Game portrays Sergeant James Dap as a Scary Black Man with a British accent who constantly yells at Launchies and makes Ender \"drop and give [him] 20\" for doing what he previously claims to allow (i.e. ask legitimate questions). While Ender is doing push-ups, he continues to yell at him, telling Ender that he's never going to make commander and that Dap will never salute him. After Ender replies that Dap will, Dap adds 20 more push-ups (although he stops Ender after a few more). Finally, he yells for Ender to \"shut it\" when the boy continues to mouth off. Later, though, after Ender does make commander, Dap salutes him and treats him with respect.", 
                "id": "DrillSergeantNasty"
            }
        ]
    }, 
    "imdbid": "tt1731141", 
    "similar": [
        {
            "shared": [
                "DrillSergeantNasty"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DrillSergeantNasty"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "DrillSergeantNasty"
            ], 
            "shared_count": 1, 
            "id": "TheBarberOfSiberia", 
            "name": "The Barber of Siberia", 
            "poster_url": "TheBarberOfSiberia.jpg"
        }, 
        {
            "shared": [
                "DrillSergeantNasty"
            ], 
            "shared_count": 1, 
            "id": "Basic", 
            "name": "Basic", 
            "poster_url": "Basic.jpg"
        }, 
        {
            "shared": [
                "DrillSergeantNasty"
            ], 
            "shared_count": 1, 
            "id": "ProblemChild", 
            "name": "Problem Child", 
            "poster_url": "ProblemChild.jpg"
        }
    ], 
    "id": "EndersGame", 
    "name": "Ender’s Game"
}