{
    "plot": "A man, Joel Barish, heartbroken that his girlfriend Clementine underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realizes that he still loves her, and may be too late to correct his mistake.", 
    "genres": "Drama, Romance, Sci-Fi", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bastard Boyfriend: Patrick for Clementine,  Howard for Mary.", 
                "id": "BastardBoyfriend"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Hard-Drinking", 
                    "drunk"
                ], 
                "role": "Hard-Drinking Party Girl: Clementine and Mary often get \"amiably drunk\" (the latter even smokes pot). Clem and Joel's breakup is prompted by her driving home from a party drunk and damaging Joel's car.", 
                "id": "HardDrinkingPartyGirl"
            }, 
            {
                "adjectives": [
                    "Hard-Drinking", 
                    "drunk"
                ], 
                "role": "Hard-Drinking Party Girl: Clementine and Mary often get \"amiably drunk\" (the latter even smokes pot).", 
                "id": "HardDrinkingPartyGirl"
            }, 
            {
                "adjectives": [
                    "certain", 
                    "fucked-up", 
                    "own", 
                    "MPDG-ness", 
                    "Lacuna:"
                ], 
                "role": "Clementine in Eternal Sunshine of the Spotless Mind is this type of character, though the relationship plays out more realistically. She even references the \"you complete me\" line, to her distaste, from Jerry Maguire. She also Lampshades this to a certain degree, saying that Joel shouldn't expect her to \"save\" him, and that she's \"just a fucked-up girl looking for her own peace of mind.\" Joel sums up her MPDG-ness and the film's deconstruction of it during his tape recording for Lacuna:", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "common", 
                    "inexplicable", 
                    "free-spirited", 
                    "interested", 
                    "quiet", 
                    "subconscious", 
                    "real", 
                    "first", 
                    "interested", 
                    "forcing"
                ], 
                "role": "Manic Pixie Dream Girl: Subverted and thoroughly deconstructed with Clementine. As a Deconstructed Character Archetype she shows what happens once the novelty of the Manic Pixie Dream Girl wears off and the meaning of the term becomes apparent. It also subverts a common element of the trope, in that it's usually inexplicable that the free-spirited girl would be so interested in the quiet, reserved guy. At the beginning of the movie it seems like Clementine is fascinated by Joel for no reason, but it's actually that her subconscious is influencing her with the forgotten remnants of her feelings for him when they were together. When we see their real first meeting, she is interested in him initially but quickly gets bored, forcing him to work to make a relationship happen.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "fucked-up", 
                    "own", 
                    "common", 
                    "inexplicable", 
                    "free-spirited", 
                    "interested", 
                    "quiet", 
                    "subconscious", 
                    "real", 
                    "first", 
                    "interested", 
                    "forcing"
                ], 
                "role": "Manic Pixie Dream Girl: Clementine. Lampshaded (\"I'm not a concept, Joel. I'm just a fucked-up girl looking for my own peace of mind\"), and a deconstruction insofar as it shows what happens once the novelty of the Manic Pixie Dream Girl wears off and the meaning of the words becomes apparent. It also subverts a common element of the Manic Pixie Dream Girl, in that it is usually inexplicable that the free-spirited girl would be so interested in the quiet, reserved guy. At the beginning of the movie it seems like Clementine is fascinated by Joel for no reason, but it's actually that her subconscious is influencing her with the forgotten remnants of her feelings for him when they were together. When we see their real first meeting, she is interested in him initially but quickly gets bored, forcing him to work to make a relationship happen.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "many"
                ], 
                "role": "Ms. Fanservice: Kate Winslet and Kirsten Dunst get many nice underwear shots.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0338013", 
    "poster_url": "EternalSunshineOfTheSpotlessMind.jpg", 
    "similar": [
        {
            "shared": [
                "HardDrinkingPartyGirl", 
                "MsFanservice", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "TheWayWayBack", 
            "name": "The Way Way Back", 
            "poster_url": "TheWayWayBack.jpg"
        }, 
        {
            "shared": [
                "BastardBoyfriend", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "NorwegianWood", 
            "name": "Norwegian Wood", 
            "poster_url": "NorwegianWood.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "CrocodileDundee", 
            "name": "Crocodile Dundee", 
            "poster_url": "CrocodileDundee.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "JustLikeHeaven", 
            "name": "Just Like Heaven", 
            "poster_url": "JustLikeHeaven.jpg"
        }
    ], 
    "id": "EternalSunshineOfTheSpotlessMind", 
    "name": "Eternal Sunshine of the Spotless Mind"
}