{
    "plot": "The astronauts William Xu, Rosa Dasque, Dr. Daniel Luxembourg, Dr. Katya Petrovna, Andrei Blok and James Corrigan travel to the moon of Jupiter known as Europa in the spacecraft Europa One. Their assignment is to investigate the existence of life in Europa, based on the discovery of water in the moon. When they experience communication breakdown, Andrei and Corrigan need to go outside the spacecraft to repair it. However, Corrigan accidentally contaminates his suit with hydrazine and he is left behind in space. When they land, they miss their target and they decide to drill the ice to research. Then Katya collects samples proving the existence of one alien organism from Europa but she has a tragic accident. The survivors decide to return to Earth with their discovery but there is a problem with the engines and they get stranded in Europa. Will they be able to fix the engines and return to Earth with their findings?", 
    "genres": "Sci-Fi, Thriller", 
    "release_year": "2013", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Final", 
                    "short"
                ], 
                "role": "Final Girl:  Averted. While some clips seem to be of Rosa being interviewed after the mission, this is in fact footage she herself recorded a short time before her death.", 
                "id": "FinalGirl"
            }
        ]
    }, 
    "imdbid": "tt2051879", 
    "poster_url": "EuropaReport.jpg", 
    "similar": [
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "DevilsPrey", 
            "name": "Devil's Prey", 
            "poster_url": "DevilsPrey.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "Suspiria", 
            "name": "Suspiria", 
            "poster_url": "Suspiria.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "YoureNext", 
            "name": "You're Next", 
            "poster_url": "YoureNext.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "NineDead", 
            "name": "Nine Dead", 
            "poster_url": "NineDead.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "FridayThe13thPartVANewBeginning", 
            "name": "Friday the 13th Part V: A New Beginning"
        }
    ], 
    "id": "EuropaReport", 
    "name": "Europa Report"
}