{
    "plot": "N/A", 
    "genres": "Animation, Fantasy", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Amazon Chaser: Henry wants to know how \"Nicole\" lives with that kind of passion. He says to her, \"You swim alone, climb rocks, rescue servants. Is there anything you don't do?\" Later in the scene she hoists him over her shoulders to save his life.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "strong"
                ], 
                "role": "Ever After: Prince Henry is fascinated by the way \"Nicole\" climbs trees, swims alone, and is strong enough to hoist him over her shoulders.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [], 
                "role": "Dastardly Whiplash: Le Pieu is essentially a Renaissance France variation on this archetype.", 
                "id": "DastardlyWhiplash"
            }, 
            {
                "adjectives": [
                    "overseas", 
                    "trouble"
                ], 
                "role": "Distressed Dude: Maurice, whom Danielle saves from being sold and shipped overseas near the beginning of the film. Henry runs into some trouble with a band of gypsies, leading to Danielle being the one to save him.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [], 
                "role": "At the end of Ever After when Prince Henry shows up to “rescue” Danielle from Pierri Le Pieu.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [
                    "insufferable"
                ], 
                "role": "Prince Henry from Ever After finds it insufferable to be defined by his position.", 
                "id": "RebelPrince"
            }, 
            {
                "adjectives": [
                    "princely", 
                    "first", 
                    "rebellious", 
                    "snobbish", 
                    "few"
                ], 
                "role": "Rebel Prince: Henry isn't keen to assume his princely duties, and first meets Danielle when he's running away from home. At first, he's rebellious out of snobbish boredom, but after meeting with Danielle a few times, his rebelliousness grows to be for the good of his kingdom's people.", 
                "id": "RebelPrince"
            }, 
            {
                "adjectives": [], 
                "role": "Prince Henry from Ever After is bored by the idea of peasants until he meets Danielle, who actually is a peasant. He takes his servants for granted because they're servants, it's what they do.", 
                "id": "ShelteredAristocrat"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Danielle swims, climbs trees and punches people in the face.  Later frees herself from slavery by threatening her captor with a sword.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "pitiful"
                ], 
                "role": "Danielle of Ever After averts the \"alas, I am but a pitiful female\" personality pretty well throughout the movie, but Took a Level in Badass near the end when Monsieur Le Pieu has essentially kidnapped her, and is getting rather creepy. She threatens him with a sword, and has quite successfully rescued herself by the time Henry arrives. That whole spiel she delivers during said scene was just a Moment of Awesome. Also when she punched her wicked stepsister in the face.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "blond", 
                    "antagonistic"
                ], 
                "role": "Blondes are Evil: Marguerite again, very blond and very much an antagonistic bitch.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "main"
                ], 
                "role": "Danielle was very much Daddy's Girl in Ever After, which was the main reason for her stepmother's intense dislike of her.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Inverted. By the time that Henry shows up to rescue Danielle  from Le Pieu, she has already freed herself.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "pitiful"
                ], 
                "role": "Danielle of Ever After averts the \"alas, I am but a pitiful female\" personality throughout the movie and Took a Level in Badass near the end when Monsieur Le Pieu has essentially kidnapped her, and is getting creepy. She threatens him with a sword, and has rescued herself by the time Henry arrives.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "elderly", 
                    "negative", 
                    "unclear", 
                    "direct", 
                    "French"
                ], 
                "role": "The elderly noblewoman who summons the brothers Grimm in Ever After is identified in the end credits as \"Grande Dame,\" though she avoids all of the negative aspects of the trope. Her exact title (or name, for that matter) is unclear, except that she is a direct descendant of the French royal family according to her ending narration.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "step-mother"
                ], 
                "role": "As Ever After begins Danielle tells her friend Gustave that no matter her gender she can \"whip\" him. By the time her step-mother arrives the girl has some mud on her but her friend is covered.", 
                "id": "OneOfTheBoys"
            }, 
            {
                "adjectives": [
                    "Gender-flipped"
                ], 
                "role": "Gender-flipped in Ever After: Prince Henry does not want to have an Arranged Marriage and take on the duties of his kingdom. See Rebel Prince.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "Ever After: Rodmilla and Marguerite. Henry may also count as a male example. They all undergo a Break the Haughty process by the end.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "Rich", 
                    "male"
                ], 
                "role": "Rich Bitch: Rodmilla and Marguerite. Henry may also count as a male example, at least at first.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "lady-turned-servant"
                ], 
                "role": "Ever After has the lady-turned-servant Danielle De Barbarac dressed up as a courtier who climbs trees and rescues servants.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [
                    "classic", 
                    "horrible", 
                    "nice", 
                    "nice"
                ], 
                "role": "Some versions of the classic Cinderella story have one stepsister who isn't horrible and is actually nice to the heroine. In the live-action Cinderella adaptation Ever After, Marguerite is a Dumb Blonde Rich Bitch, but Jacqueline is rather nice, just easily cowed by her mother and sister.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "short", 
                    "boyish", 
                    "interested"
                ], 
                "role": "Tomboy and Girly Girl: Danielle is the tomboy to Marguerite and Jacqueline for reasons outline under Amazon Chaser. The short of it is she has boyish hobbies and they are more interested in the best dress for a ball.", 
                "id": "TomBoyAndGirlyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Lady Rodmilla de Ghent of Ever After.", 
                "id": "WickedStepmother"
            }, 
            {
                "adjectives": [], 
                "role": "Wicked Stepmother: Wouldn't be a Cinderella retelling without one, would it?", 
                "id": "WickedStepmother"
            }
        ]
    }, 
    "imdbid": "tt1592864", 
    "similar": [
        {
            "shared": [
                "KnightInShiningArmor", 
                "SpiritedYoungLady", 
                "WickedStepmother", 
                "BadassDamsel", 
                "DistressedDude", 
                "OneOfTheBoys", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "Tangled", 
            "name": "Tangled", 
            "poster_url": "Tangled.png"
        }, 
        {
            "shared": [
                "DamselOutOfDistress", 
                "AmazonChaser", 
                "SpiritedYoungLady", 
                "RebelliousPrincess", 
                "DamselInDistress", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "DamselOutOfDistress", 
                "RebelliousPrincess", 
                "SpoiledSweet", 
                "BadassDamsel", 
                "DistressedDude", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "DistressedDude", 
                "BadassDamsel", 
                "AmazonChaser", 
                "ActionGirl", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 5, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "DistressedDude", 
                "DamselInDistress", 
                "TomBoyAndGirlyGirl", 
                "ActionGirl", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 5, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }
    ], 
    "id": "EverAfter", 
    "name": "Ever After"
}