{
    "plot": "The myth of King Arthur brought once again to the screen. Uthur Pendragon is given the mystical sword Excalibur by the wizard Merlin. At his death Uthur buries the sword into a stone, and the next man that can pull it out will be King of England. Years later Arthur, Uthur's bastard son draws Excalibur and becomes king. Guided by Merlin, Arthur marries Guenivere and gathers the Knights of the Round Table. Arthur's evil half-sister Morgana sires a son with him, who may prove his downfall.", 
    "genres": "Adventure, Drama, Fantasy", 
    "release_year": "1981", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "first"
                ], 
                "role": "John Boorman's Excalibur takes this pretty literally with Lancelot. In his first scene, his armor is buffed almost to a mirror finish.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [
                    "dark", 
                    "first", 
                    "rusty"
                ], 
                "role": "Knight in Shining Armor: Averted at the beginning of the movie, where the armors are more dark and matte than shiny, then played straight after the first encounter with Lancelot, but they do get rusty later. Another facet of the Fisher King aspect. The better Arthur's doing, the shinier the armor.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [], 
                "role": "Right Through His Armour: Justified, as Uther had to keep his armour on to maintain the illusion.", 
                "id": "RightThroughHisPants"
            }, 
            {
                "adjectives": [
                    "absolute", 
                    "full"
                ], 
                "role": "The absolute pinnacle of this trope can be seen in the 1981 movie Excalibur, where Uther Pendragon has a sex scene in full plate armor. At least he removes the codpiece...", 
                "id": "RightThroughHisPants"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Some of Helen Mirren's outfits — of course, she might qualify as Ms. Fanservice wearing a burlap sack... Guinevere ain't too shabby either, and displays herself quite nicely when she takes it all off for her love scene in the forest with Lancelot.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "live", 
                    "magical", 
                    "young", 
                    "middle", 
                    "powerful", 
                    "natural", 
                    "evil", 
                    "sacrificial", 
                    "magic", 
                    "old"
                ], 
                "role": "A live action example can be seen in Excalibur: Morgana Le Fay uses her magical powers to keep herself looking young into middle age. Interestingly, when Merlin goes into her dream and tricks her into casting a powerful mist spell, she releases so much energy that she ages far beyond what her natural age was originally.\n In fact, just about any evil sorceress in any show, (especially those who use a forbidden, \"sacrificial\" form of magic to maintain their appearance) will wind up becoming old and wrinkly — or turning to dust completely — once their power is broken.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in White: Igraine", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0082348", 
    "poster_url": "Excalibur.jpg", 
    "similar": [
        {
            "shared": [
                "VainSorceress", 
                "MsFanservice", 
                "WomanInWhite"
            ], 
            "shared_count": 3, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "RightThroughHisPants", 
                "MsFanservice", 
                "WomanInWhite"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "WomanInWhite", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 3, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "WomanInWhite", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 3, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "Excalibur", 
    "name": "Excalibur"
}