{
    "plot": "Joel, the owner of an extract manufacturing plant, constantly finds himself in precarious situations that steadily worsen by the minute. First, his soon-to-be floor manager acquires a serious injury in a machine malfunctioning accident that subsequently endangers the wellbeing of his company. Second, his personal life doesn't fair much better when he takes the advice of his bartending friend Dean during a drug-induced brainstorming session on how to test his wife's faithfulness. Finally, compounding these catastrophes is new employee Cindy, who happens to be a scam artist intent on milking the company for all its worth. Now, Joel must attempt to piece his company and his marriage back together all while trying to figure out what he's really after in life.", 
    "genres": "Comedy, Crime, Romance", 
    "release_year": "2009", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Gossipy Hens: Two of the women on the assembly line at Reynolds Extract spend most of their time talking about how nobody else is doing their jobs except them. Early in the movie, one of them decides she won't do her job because \"nobody else\" is doing theirs; this is what sets off the chain reaction leading to Step's loss of part of his manhood. These characters also become a case of a Karma Houdini as they never get called out on it and  get to keep their jobs.", 
                "id": "GossipyHens"
            }
        ]
    }, 
    "imdbid": "tt1225822", 
    "poster_url": "Extract.jpg", 
    "similar": [
        {
            "shared": [
                "GossipyHens"
            ], 
            "shared_count": 1, 
            "id": "PracticalMagic", 
            "name": "Practical Magic", 
            "poster_url": "PracticalMagic.jpg"
        }, 
        {
            "shared": [
                "GossipyHens"
            ], 
            "shared_count": 1, 
            "id": "PeytonPlace", 
            "name": "Peyton Place", 
            "poster_url": "PeytonPlace.jpg"
        }, 
        {
            "shared": [
                "GossipyHens"
            ], 
            "shared_count": 1, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "GossipyHens"
            ], 
            "shared_count": 1, 
            "id": "FerrisBuellersDayOff", 
            "name": "Ferris Bueller's Day Off", 
            "poster_url": "FerrisBuellersDayOff.jpg"
        }, 
        {
            "shared": [
                "GossipyHens"
            ], 
            "shared_count": 1, 
            "id": "TheWomen", 
            "name": "The Women", 
            "poster_url": "TheWomen.jpg"
        }
    ], 
    "id": "Extract", 
    "name": "Extract"
}