{
    "plot": "Sean Archer, a very tough, rugged FBI Agent. Who is still grieving for his dead son Michael. Archer believes that his son's killer is his sworn enemy, a very powerful criminal, Castor Troy. One day, Archer has finally cornered Castor, however, their fight has knocked out Troy cold. As Archer finally breathes easy over the capture of his enemy, he finds out that Troy has planted a bomb that will destroy the entire city of Los Angeles and all of its inhabitants. Unfortunately the only other person who knows its location is Castor's brother Pollux, and he refuses to talk. The solution, a special operation doctor that can cut off people's faces, and can place a person's face onto another person. Archer undergoes one of those surgeries to talk to Pollux. However, Castor Troy somehow regains consciousness and now wants revenge on Archer for taking his face. Not only is Troy ruining Archer's mission, but his personal life as well. Archer must stop Troy again. This time, it's personal.", 
    "genres": "Action, Crime, Sci-Fi", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Husky Russkie: Ivan Dubov.", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [
                    "other", 
                    "criminal-free", 
                    "own"
                ], 
                "role": "Papa Wolf: Ironically, Castor and Archer play this on each other's child. Castor beats up the boyfriend trying to rape Jamie in his car in Castor's driveway. Meanwhile Archer finds out that Castor has a son and Sasha is trying her best to raise Adam to avoid a criminal-free lifestyle also counts. Archer subsequently spends the shootout with Castor's SWAT team trying to protect Adam while also trying to keep his own agents safe and taking on Castor.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "Face/Off", 
                    "attractive"
                ], 
                "role": "In Face/Off, we see Castor Troy pose as a minister to plant a bomb in the LA Convention Center, then he does a sexy dance in front of some attractive choirgirls who are singing Handel's \"Hallelujah Chorus\". Gotta love some Nicolas Cage.", 
                "id": "SexyPriest"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed"
                ], 
                "role": "Sharp-Dressed Man: John Travolta, whether playing Archer or Castor, spends most of his time wearing three piece suits.", 
                "id": "SharpDressedMan"
            }
        ]
    }, 
    "imdbid": "tt0119094", 
    "poster_url": "FaceOff.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "SharpDressedMan", 
                "HuskyRusskie"
            ], 
            "shared_count": 3, 
            "id": "PacificRim", 
            "name": "Pacific Rim", 
            "poster_url": "PacificRim.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HuskyRusskie"
            ], 
            "shared_count": 2, 
            "id": "TheAristocats", 
            "name": "The Aristocats", 
            "poster_url": "TheAristocats.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "SexyPriest"
            ], 
            "shared_count": 2, 
            "id": "TheQuickAndTheDead", 
            "name": "The Quick and the Dead", 
            "poster_url": "TheQuickAndTheDead.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HuskyRusskie"
            ], 
            "shared_count": 2, 
            "id": "TheBoondockSaints", 
            "name": "The Boondock Saints", 
            "poster_url": "TheBoondockSaints.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HuskyRusskie"
            ], 
            "shared_count": 2, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }
    ], 
    "id": "FaceOff", 
    "name": "Face/Off"
}