{
    "plot": "Lucy, a 17 year old girl, sets out on journey to become a full-fledged wizard and joins the strongest and most (in) famous guild FAIRY TAIL where she meets Natsu, Happy, Gray and Erza, who treat her more like family than friends. This epic series takes us through all the dangers that the members of fairy tail face and eventually overcome through mutual love and friendship.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "2009–", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "due", 
                    "former"
                ], 
                "role": "Fairy Tail: Loke is initially portrayed this way, directly due to his former partner /master who was a Rare Female Example of this trope", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [], 
                "role": "No doubt, Loke/Leo from Fairy Tail is a player, but he's always there for Lucy when she needs him (unless he's out with his girlfriend).", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "honorable"
                ], 
                "role": "In Fairy Tail, Elfman wears one adorned with a character meaning \"honorable man\".", 
                "id": "Fundoshi"
            }, 
            {
                "adjectives": [
                    "other", 
                    "Celestial"
                ], 
                "role": "Crux from Fairy Tail. However he can also use \"sleep\" to gather up informations about other Celestial Spirits.", 
                "id": "SeniorSleepCycle"
            }, 
            {
                "adjectives": [
                    "blatant"
                ], 
                "role": "Gildartz from Fairy Tail.\n Loki is a far more blatant example,  until The Reveal and his return to the spirit world. When he  thinks he's dying and starts withdrawing from everything, he's revealed to have had four girlfriends at once.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [], 
                "role": "Elfman of Fairy Tail post-Time Skip.", 
                "id": "TopHeavyGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Fairy Tail\n Natsu's vest isn't exactly concealing.\n Gray, who is prone to unconsciously stripping down to his underwear, is an even better example.", 
                "id": "WalkingShirtlessScene"
            }, 
            {
                "adjectives": [
                    "big", 
                    "Boisterous", 
                    "short", 
                    "White-Haired"
                ], 
                "role": "From Fairy Tail, there's the character Elfman, who's quite a big Boisterous Bruiser with short hair. The only reason his hair is this color is probably so he matches with his White-Haired Pretty Girl sisters, Mirajane and Lisanna.", 
                "id": "WhiteHairedPrettyBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Ur from Fairy Tail.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [], 
                "role": "Mermaid Heel in Fairy Tail.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [], 
                "role": "Lucy Heartfilia from Fairy Tail. She typically has a bath scene atleast once in almost every story arc while wearing her Modesty Towel in the bathtub for the anime version.", 
                "id": "BathingBeauty"
            }, 
            {
                "adjectives": [
                    "out-of-place", 
                    "Girlish", 
                    "such", 
                    "expansive", 
                    "attractive", 
                    "powerful", 
                    "compact"
                ], 
                "role": "In Fairy Tail, the Gonk fetishist has a couple of these in his employ, but the summon spirit Virgo takes the cake; she's approximately the size of a minivan, with a face like a pug that hates everyone in the world, alarmingly out-of-place Girlish Pigtails, and such an expansive bosom that her blouse's buttons burst. Later, when Lucy makes a contract with her, it turns out she actually can look very attractive if she wants, but she always takes on the form she thinks will please the contract-holder. Contrary to Natsu's observation, she's not any less powerful in a more compact form.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "bad-tempered", 
                    "same", 
                    "evil"
                ], 
                "role": "From Fairy Tail, guildmates and Badass Action Girls Erza and Mirajane were badly broken in their childhood, leading them to become respectively aloof and bad-tempered youths. Erza's  parents were killed by the same people that enslaved her. After befriending Jellal, she attempts to have him escape from the Tower of Heaven. Her plan fell through and she was tortured, leading to her losing her eye. Jellal was also tortured and turned evil, and he'd banished her from the Tower of Heaven, telling her that her friends left behind would suffer in her place. She also witnesses the death of her grandfather figure Rob. Mirajane lost her parents, and  after using her Take-Over powers to defeat a demon rampaging her home village, she and her siblings were horribly scorned and exiled by the townspeople who thought that Mirajane was possessed. Both of them Took a Level in Kindness over the course of the story.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "unintentional", 
                    "several"
                ], 
                "role": "Lucy and Erza from Fairy Tail both qualify. In Lucy's case it is usually unintentional, but Erza... well, she keeps several cosplay outfits in her Hyperspace Arsenal.", 
                "id": "CosplayOtakuGirl"
            }, 
            {
                "adjectives": [
                    "entire"
                ], 
                "role": "Ikaruga, Angel, Erza Knightwalker, and Minerva from Fairy Tail.\n Juvia, Ultear and Meredy were Dark Action Girls until their Heel Face Turns.\n Kyouka and Seilah of Tartarus are candidates for the Darkest Action Girls in the entire series so far.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Erza Scarlett from Fairy Tail has hoards of men and Lucy swooning when they see her in action. Also, Lucy. She has tons of Les Yay with other girls and in the anime, Levy wouldn't mind seeing her butt. Mirajane is said to have captured the hearts of men and woman across the land, and Lucy openly drools over her bikini magazine photos", 
                "id": "EvenTheGirlsWantHer"
            }, 
            {
                "adjectives": [
                    "Lampshaded", 
                    "large", 
                    "good", 
                    "large", 
                    "other", 
                    "female", 
                    "first", 
                    "face-first", 
                    "pain"
                ], 
                "role": "Lampshaded in Fairy Tail: While Lucy's breasts aren't unrealistically large (though good luck finding any near that size in the most communities), they are notably large, perhaps more so than most or any of the other female characters. While under the influence of a body swap spell, Gray switches places with Lucy, whereupon his first action is to lose his balance, nearly falling face-first into a table. He spends the rest of the episode complaining of back pain.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [], 
                "role": "Erza from Fairy Tail in her flashback wielding two BFSES.", 
                "id": "GirlWithPsychoWeapon"
            }, 
            {
                "adjectives": [
                    "post-Time", 
                    "long"
                ], 
                "role": "In Fairy Tail, Lucy's signature hairstyle used to be one pigtail at her right temple and the rest of her hair loose, but post-Time Skip, she has taken a liking to this trope and almost always has her hair in two pigtails at her backhead. Wendy, who is the Token Mini-Moe of the series, also regularly wears her long hair in pigtails.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [
                    "stuffed"
                ], 
                "role": "Juvia from Fairy Tail, though she also has a stuffed Gray doll, which reflects her slightly less innocent Stalker with a Crush tendencies. Lucy and Wendy are also regularly featured with stuffed animals on the splash pages.", 
                "id": "GirlsLoveStuffedAnimals"
            }, 
            {
                "adjectives": [
                    "titular", 
                    "other", 
                    "clear", 
                    "S-Class", 
                    "ferocious", 
                    "demolish"
                ], 
                "role": "Mirajane Strauss from Fairy Tail is the guild's mother figure who cooks and serves drinks in the titular guild. She is also a gravure model, and has never worn pants once in the series. She is charming and friendly, and loves to gossip with other members, especially with Lucy concerning her love life. When pushed to the edge, it becomes clear why Mira holds S-Class rank in Fairy Tail as she transforms into a ferocious demon using her Satan Soul powers, which were enough to trash Freed Justine and Kamika, and even  demolish the Tartaros demons' respawn point.", 
                "id": "GirlyBruiser"
            }, 
            {
                "adjectives": [], 
                "role": "Cana and Erza from Fairy Tail.", 
                "id": "GodivaHair"
            }, 
            {
                "adjectives": [
                    "responsible", 
                    "alcoholic", 
                    "titular", 
                    "much", 
                    "new"
                ], 
                "role": "Cana from Fairy Tail (no pun intended) goes Up to Eleven: her profile states that she's responsible for 30% of the consumption of alcoholic drinks in the titular guild, and started drinking twice as much ever since her bottle buddy Macao got a new girlfriend.\n Chapter 338 portrays Kagura as this.", 
                "id": "HardDrinkingPartyGirl"
            }, 
            {
                "adjectives": [
                    "bad", 
                    "person—just", 
                    "belong", 
                    "villainous", 
                    "only", 
                    "bad", 
                    "top", 
                    "such", 
                    "late", 
                    "straight", 
                    "only", 
                    "villainous", 
                    "only", 
                    "Freudian", 
                    "close", 
                    "subject", 
                    "physical", 
                    "true", 
                    "timid", 
                    "apologetic"
                ], 
                "role": "Fairy Tail loves this trope:\n Juvia from Phantom Lord joins Fairy Tail after her defeat because she falls head over heels for Gray during their fight. She was never actually a bad person—just gloomy and a bit anti-social—but she did belong to a villainous guild.\n Coco from Edolas counts, even though she is the only one of her group who doesn't have a bad bone in her body. On top of that, none of the Edolas villains can really be called such because all they want is to ensure the survival of their realm, even if it means killing much of the residents of Magnolia; Coco defects because their plan also entails the sacrifice of Lily, her closest friend.\n Erza Nightwalker similarly has a change of heart, but it happens too late to make any difference to the story.\n Ultear and Merudy from Grimoire Heart; it's played especially straight for Ultear, who committed evil deeds without remorse because she thought her mother abandoned and replaced her as a child.\n Saber Tooth features an inversion: Minerva, the only (villainous) female of her guild, is the only one who doesn't pull a Heel-Face Turn.\n  She just has been revealed to have a Freudian Excuse and thus seems pretty close to making the turn.\n Flare from Raven Tail also turns. She is cruel and creepy when her guildmates are around, but is subject to quite a bit of physical abuse when she fails to meet their expectations. Once her guild is liquidated, her true personality is shown to be quite timid and apologetic (but still creepy).", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "young"
                ], 
                "role": "Fairy Tail's Erza Scarlet has this in her backstory, a young girl leading slaves to freedom with her newfound magic powers. It is even specifically referenced in the chapter title of the manga.", 
                "id": "JeanneDArchetype"
            }, 
            {
                "adjectives": [
                    "serious", 
                    "dead"
                ], 
                "role": "Ur from Fairy Tail to her daughter Ultear, though it wasn't intentional. She took said daughter to some scientist tam because Ultear was an Ill Girl in serious risk, but they kidnapped her instead and told Ur she was dead.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "Mysterious", 
                    "bad"
                ], 
                "role": "Wendy from Fairy Tail has elements of this, including a Mysterious Past, bad guys wanting her (in the case of Brain), non-action status, bit of a Distressed Damsel, purehearted and kind, and The Medic.", 
                "id": "MysticalWaif"
            }, 
            {
                "adjectives": [], 
                "role": "Erza from Fairy Tail wears one while trying to help out Wendy. The males definitely approve.", 
                "id": "NaughtyNurseOutfit"
            }, 
            {
                "adjectives": [
                    "magic", 
                    "little", 
                    "active"
                ], 
                "role": "Eclair in the Fairy Tail movie: The Pheonix Priestess. Justified in that she not only doesn't practice magic, she also hates it, but it's a little strange to see a Neutral Female in an endless sea of Action Girls.\n Lucy herself does take an active role in most battles, but she filled this role during the fight with the Lullaby monster. In the anime version, Happy even made fun of this trope.\n Erza Scarlet herself even averts this trope at times. For example, at one point during Natsu's fight with Laxus, Erza punched Natsu in the stomach and attempted to take on Laxus herself!", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [
                    "actual"
                ], 
                "role": "Virgo from Fairy Tail. Bonus points, she used to be used as an actual body guard.", 
                "id": "NinjaMaid"
            }, 
            {
                "adjectives": [
                    "preferential"
                ], 
                "role": "Lucy Heartfilia from Fairy Tail grew up as one but she left because her father focused on his business instead of her to the point of neglect. That being said, no one in the Fairy Tail guild gives her preferential treatment and she prefers it that way.", 
                "id": "Ojou"
            }, 
            {
                "adjectives": [
                    "perky", 
                    "same", 
                    "perky", 
                    "complete", 
                    "usual"
                ], 
                "role": "Mirajane from Fairy Tail isn't quite \"perky\" in her youth - she's Hot-Blooded. She basically had the same personality as Natsu. However, after  she loses her sister Lisanna she becomes a Proper Lady.\n Juvia Lockser easily breaks her gloomy facade, only to become perky and the complete opposite to her usual personality(but mostly to Gray though).", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [
                    "favorite", 
                    "same", 
                    "other", 
                    "such"
                ], 
                "role": "In Fairy Tail, Erza Scarlet is asked by a reporter what's her favorite \"armor\" (among the hundred she can \"Ex-quip\" at will). Her answer? The Bunny suit. And then Lucy, starving for attention from the same reporter, dresses in turn as a Playboy Bunny. (Which may be an Actor Allusion considering which other Aya Hirano character has worn such a costume.)", 
                "id": "PlayboyBunny"
            }, 
            {
                "adjectives": [], 
                "role": "All the females in Fairy Tail: Erza, Lucy, Mirajane, Ur, etc..", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "feminine", 
                    "adorable", 
                    "capable", 
                    "feminine", 
                    "soft"
                ], 
                "role": "Fairy Tail:\n It presents the mild mannered Mirajane, who is not only the most feminine member of Fairy Tail but adorable and capable of cooking. She runs the guild from behind the scenes and her rank as a mage is Class S.\n Edo-Cana is even more feminine and soft than Mirajane.", 
                "id": "ProperLady"
            }, 
            {
                "adjectives": [], 
                "role": "In an omake chapter of Fairy Tail , Erza produces a lead pipe... Well, there's a reason it's on this page.", 
                "id": "Ptitleba4e2b2g"
            }, 
            {
                "adjectives": [
                    "male", 
                    "happy", 
                    "amusing", 
                    "catch", 
                    "wide-eyed"
                ], 
                "role": "Fairy Tail\n Gray is a male example. His training to resist the cold left him with a habit of stripping down to his boxers without realising it, and he's always embarrassed to find out he's half-naked.\n Another example is Lucy, whose clothing always manages to rip just enough to cover the naughty bits. She's understandably not very happy about it.\n This culminates in an amusing scene in the movie where Lucy runs out of the shower without realizing that her towel didn't quite catch and ends up in front of the now wide-eyed Gray and Natsu, prompting the following exchange:", 
                "id": "ReluctantFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "female", 
                    "different", 
                    "hot", 
                    "amusing"
                ], 
                "role": "Fairy Tail:\n Erza Scarlet mentions in one episode that maybe she should walk around the guild naked. In a hotsprings scene, some of the girls are bathing when they realize the boys are spying on them. Erza's reaction is to let them in.\n Natsu seems to be like this too. When he ends up naked along with his female guildmates in two different contexts (Lucy, Erza and Wendy at a hot spring and Lisanna in a prison), he has some rather amusing reactions about the fact that they are in the nude, but he doesn't seem to mind nor think about that they also get to see him naked.\n Lucy Ashley, unlike Lucy Heartfilia, is a bit shameless and offers to let Natsu see her naked.", 
                "id": "ShamelessFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "past", 
                    "naive"
                ], 
                "role": "Juvia Loxar, from Fairy Tail gets like this over Gray Fullbuster. She's a little older than some of the girls on this page (17), but due to her lonely past she is very unsocialized when we first see her, and is very naive and immature as a result.", 
                "id": "SmittenTeenageGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Cana and Evergreen from Fairy Tail are 5'8\" and 5'9\", respectively, according to the official height chart. Since Fairy Tail is a World of Buxom, where pretty much all of the protagonists are goodlooking, they also qualify as stunners.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [], 
                "role": "Erza Scarlett from Fairy Tail, when she's not in Stern Teacher Mode.", 
                "id": "StrangeGirl"
            }, 
            {
                "adjectives": [
                    "entire"
                ], 
                "role": "In Fairy Tail, Erza fits this role among Team Natsu as well as The Big Gal. As far as the entire guild goes, Mirajane shares this role with her, but she's also their cover girl.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [
                    "useful", 
                    "other"
                ], 
                "role": "Fairy Tail has Lucy, who is rare in that she has the Point of View of the story and is a Supporting Protagonist. She is also useful in battle, but indirectly kicks ass through Summon Magic. The other girl of the team, Erza, is The Big Guy.", 
                "id": "TheChick"
            }, 
            {
                "adjectives": [
                    "major"
                ], 
                "role": "Erza from Fairy Tail is a Lady of War who loves to dress up, has over 100 outfits, and according to Word of God she once scared a major fashion designer into designing pretty armor for her.", 
                "id": "TheFashionista"
            }, 
            {
                "adjectives": [
                    "other", 
                    "cute", 
                    "such"
                ], 
                "role": "Lucy of Fairy Tail, although it's usually overshadowed by other character traits, or just not plot-relevant. However, she does vocally admit to putting effort into being cute for this purpose, although her outfits also tend to be overshadowed by the more Stripperific outfits worn by... well, everyone. Other 'clues' are also semi-frequently given, such as Erza's reaction to some of her underwear in a drawer.", 
                "id": "TheTease"
            }, 
            {
                "adjectives": [
                    "Perpetual"
                ], 
                "role": "Fairy Tail has Lucy and her father. She looks almost exactly like her mother. Her father is by no means ugly though, mostly he just comes off as one because he's a Perpetual Frowner.", 
                "id": "TheUglyGuysHotDaughter"
            }, 
            {
                "adjectives": [
                    "tomboyish", 
                    "enjoy"
                ], 
                "role": "Erza Scarlett from Fairy Tail is a tomboyish Badass Action Girl but she does enjoy feminine costumes ranging from fancy dresses to a bunny outfit.", 
                "id": "TomboyWithAGirlyStreak"
            }, 
            {
                "adjectives": [
                    "stupid", 
                    "bossy", 
                    "right", 
                    "sad", 
                    "able"
                ], 
                "role": "In Fairy Tail, Lucy at some point finds out that she just lost her father. After visiting his grave, she goes for a walk with Natsu and Happy. As fate would have it, two Valley Girls appear soon after and bitch about how they hate their stupid, bossy, smelling fathers - right in front of Lucy who is so sad that she is not even able to cry. Natsu does not take it well.", 
                "id": "ValleyGirl"
            }, 
            {
                "adjectives": [
                    "blue", 
                    "hereditary", 
                    "magic", 
                    "dead", 
                    "little", 
                    "white"
                ], 
                "role": "Mirajane of Fairy Tail has pure white hair and blue eyes. Apparently, though, it's hereditary and has nothing to do with her age, personality, or magic, since both Elfman and their dead little sister, Lisana, have white hair.", 
                "id": "WhiteHairedPrettyGirl"
            }, 
            {
                "adjectives": [
                    "dead", 
                    "notable", 
                    "only", 
                    "white"
                ], 
                "role": "At one point in Fairy Tail Erza Scarlet has a dream that she's dead and during the time she's wearing a pure white gown (notable one of the only times she wears white in the series)", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "only", 
                    "recent", 
                    "hefty", 
                    "noteworthy", 
                    "grumpy", 
                    "other"
                ], 
                "role": "In Fairy Tail, the only thing that can make Juvia more of a Smitten Teenage Girl around Gray than she usually is (and that is quite saying something), is when he gets some Ship Tease (at least what is ship tease from her point of view, not necessarily from the audience's point of view) with another guy, usually Lyon. In the most recent OVA, she even has a hefty nosebleed when she thinks Gray is kissing with another guy. It is quite noteworthy with how grumpy she usually gets when Gray is just talking to other girls.", 
                "id": "YaoiFangirl"
            }
        ]
    }, 
    "imdbid": "tt1528406", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "ALadyOnEachArm", 
                "TheUglyGuysHotDaughter", 
                "DarkActionGirl", 
                "TheCasanova", 
                "ProperLady", 
                "HardDrinkingPartyGirl", 
                "ActionMom", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 10, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "ChivalrousPervert", 
                "TheUglyGuysHotDaughter", 
                "TheFashionista", 
                "TheCasanova", 
                "TheChick", 
                "BrawnHilda"
            ], 
            "shared_count": 6, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "Fundoshi", 
                "BathingBeauty", 
                "WhiteHairedPrettyGirl", 
                "EvenTheGirlsWantHer", 
                "ActionMom", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "GodivaHair", 
                "TeamMom", 
                "ProperLady", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "ReluctantFanserviceGirl", 
                "ChivalrousPervert", 
                "TeamMom", 
                "WomanInWhite", 
                "TheChick"
            ], 
            "shared_count": 6, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }
    ], 
    "id": "FairyTail", 
    "name": "Fairy Tail"
}