{
    "plot": "Reed Richards, a brilliant but timid and bankrupt scientist, is convinced that evolution can be triggered by clouds of cosmic energy, and has calculated that Earth is going to pass one of these clouds soon. Together with his friend and partner, the gruff yet gentle astronaut muscle-man Ben Grimm, Reed convinces his conceited MIT classmate Dr. Victor Von Doom, now CEO of his own enterprise, to allow him access to his privately-owned space station. Von Doom agrees in exchange for control over the experiment and a majority of the profits from whatever benefits it brings. He thus brings aboard Susan Storm, his shy, though assertive chief genetics researcher and a former lover of Reed's with whom she had an acrimonious break-up, and her diametrically opposed brother Johnny, the maverick and hot-headed playboy pilot. The astronauts make it home intact; however, before long they begin to mutate, developing strange and amazing powers as a result of their exposure to the cloud! Reed is able to stretch like rubber; Sue can turn invisible and create force fields, especially when angered; Johnny can produce fire at supernova temperatures, and is able to fly; and Ben is transformed into \"The Thing\", a large, rock-like creature with super strength. After Ben, brooding about his situation on the Brooklyn Bridge, inadvertently causes a major traffic pile-up whilst attempting to stop a man about to commit suicide, the four manage to use their powers to prevent any loss of life and to rescue a fire truck and its crew from falling off the bridge in a resulting explosion. The media dubs the team the 'Fantastic Four', and whilst Johnny eagerly embraces his powers and new life, Ben - the most heavily disfigured - particularly suffers from his transformation; his disfigurement has caused his fiancée to abandon him and has seen him shunned and feared by much of New York. Blaming himself, Reed vows to return Ben to his human form, and he, Sue and Ben work on a cure, constructing a healing chamber in Reed's high tech Baxter Building loft-turned-laboratory. During this time, Reed and Susan begin to grow close once again, and Susan admits that she is not interested in Victor, but ended their relationship because Reed feared to commit, thinking only in terms of variables. Unknown to the others, however, Victor's body is also mutating; he is turning into organic metal capable of absorbing and manipulating electrical energy known as Doctor Doom. As a result of the disastrous expedition, his company is going bankrupt and he is losing public stature; blaming Reed for his misfortunes, Victor swears revenge. And Reed, Ben, Susan, and Johnny must defeat Victor Von Doom and foil his evil plans once and for all.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "The Casanova: Johnny.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "comic"
                ], 
                "role": "Action Girl: Sue, of course. Also Cpt. Frankie Raye. (Nova from the comic books)", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "Fantastic", 
                    "beautiful", 
                    "very", 
                    "skilled"
                ], 
                "role": "Fantastic Four: Sue Storm, a.k.a. the Invisible Woman. She was acknowledged as extremely beautiful from the very beginning but she was the \"hair in a bun, glasses on the face\" science girl. Starting from the moment they get back to Earth, she starts wearing the hair down and ditches the glasses. The movie progresses through her reconciling with Reed, and by the end of the movie they're an Adventure Duo plus two. By the sequel, she's way more skilled with her powers and takes no crap, even from Reed.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "Fantastic", 
                    "portrayal"
                ], 
                "role": "Fantastic Four: The 2005 movie. Jessica Alba's portrayal of Sue Storm.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "whole", 
                    "first", 
                    "second", 
                    "reshot", 
                    "obvious", 
                    "in-universe"
                ], 
                "role": "Ms. Fanservice: Sue. Or more accurately, Jessica Alba. Even more specifically, Jessica Alba in a skintight spandex jumpsuit. Lampshaded during the 2005 film. She also gets all her clothes burned off when she and Johnny switch powers in the sequel. In front of a whole load of people. At least in the first movie she still has her underwear. Which she has to take off so no one can follow her... Alba reports that her death scene in the second movie was reshot with the direction to die sexier. Made even more obvious since her power is to bend perceptions or something to that effect. Opinions vary whether her stripping it off is justified in-universe.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0120667", 
    "poster_url": "FantasticFour.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "Meganekko", 
                "MsFanservice"
            ], 
            "shared_count": 3, 
            "id": "AFineMess", 
            "name": "A Fine Mess", 
            "poster_url": "AFineMess.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "Comic8", 
            "name": "Comic 8"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "ResidentEvil", 
            "name": "Resident Evil", 
            "poster_url": "ResidentEvil.jpg"
        }
    ], 
    "id": "FantasticFour", 
    "name": "Fantastic Four"
}