{
    "plot": "A young man leaves Ireland with his landlord's daughter after some trouble with her father, and they dream of owning land at the big give-away in Oklahoma ca. 1893. When they get to the new land, they find jobs and begin saving money. The man becomes a local bare-hands boxer, and rides in glory until he is beaten, then his employers steal all the couple's money and they must fight off starvation in the winter, and try to keep their dream of owning land alive. Meanwhile, the woman's parents find out where she has gone and have come to the U.S. to find her and take her back.", 
    "genres": "Adventure, Drama, Romance", 
    "release_year": "1992", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "other", 
                    "other", 
                    "other"
                ], 
                "role": "In Far and Away, Shannon urges Joseph to come with her and be her servant boy while she's running away to America (since she's secretly taken a liking to him, but also because she wants a way to protect herself); he, on the other hand, angrily rejects the idea.\n Later, when he's faced with no other alternative (other than getting shot and dying), he does end up choosing to become her servant for the time being. Although he doesn't miss any opportunities to snark at her while doing so.", 
                "id": "MistressAndServantBoy"
            }, 
            {
                "adjectives": [
                    "other", 
                    "other", 
                    "other", 
                    "servant"
                ], 
                "role": "Mistress and Servant Boy: Shannon urges Joseph to come with her and be her servant boy while she's running away to America (since she's secretly taken a liking to him, but also because she wants a way to protect herself); he, on the other hand, angrily rejects the idea. Later, when he's faced with no other alternative (other than getting shot and dying), he does end up becoming her servant for the time being. Although he doesn't miss any opportunities to snark at her while doing so.", 
                "id": "MistressAndServantBoy"
            }
        ]
    }, 
    "imdbid": "tt0104231", 
    "poster_url": "FarAndAway.jpg", 
    "similar": [
        {
            "shared": [
                "MistressAndServantBoy"
            ], 
            "shared_count": 1, 
            "id": "TheEmperorsNewGroove", 
            "name": "The Emperor's New Groove", 
            "poster_url": "TheEmperorsNewGroove.jpg"
        }, 
        {
            "shared": [
                "MistressAndServantBoy"
            ], 
            "shared_count": 1, 
            "id": "SunsetBoulevard", 
            "name": "Sunset Boulevard"
        }, 
        {
            "shared": [
                "MistressAndServantBoy"
            ], 
            "shared_count": 1, 
            "id": "ThePrincessBride", 
            "name": "The Princess Bride", 
            "poster_url": "ThePrincessBride.png"
        }, 
        {
            "shared": [
                "MistressAndServantBoy"
            ], 
            "shared_count": 1, 
            "id": "TheProposal", 
            "name": "The Proposal", 
            "poster_url": "TheProposal.jpg"
        }, 
        {
            "shared": [
                "MistressAndServantBoy"
            ], 
            "shared_count": 1, 
            "id": "FleshForFrankenstein", 
            "name": "Flesh for Frankenstein", 
            "poster_url": "FleshForFrankenstein.jpg"
        }
    ], 
    "id": "FarAndAway", 
    "name": "Far And Away"
}