{
    "plot": "Jerry works in his father-in-law's car dealership and has gotten himself in financial problems. He tries various schemes to come up with money needed for a reason that is never really explained. It has to be assumed that his huge embezzlement of money from the dealership is about to be discovered by father-in-law. When all else falls through, plans he set in motion earlier for two men to kidnap his wife for ransom to be paid by her wealthy father (who doesn't seem to have the time of day for son-in-law). From the moment of the kidnapping, things go wrong and what was supposed to be a non-violent affair turns bloody with more blood added by the minute. Jerry is upset at the bloodshed, which turns loose a pregnant sheriff from Brainerd, MN who is tenacious in attempting to solve the three murders in her jurisdiction.", 
    "genres": "Crime, Drama, Thriller", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Dirty Coward: Jerry is too cowardly to admit that he's lost a bunch of money. Instead, he tries to steal money from his father-in-law to cover his debt.", 
                "id": "DirtyCoward"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "pregnant", 
                    "typical"
                ], 
                "role": "Action Mom: Marge is a pregnant example, who will presumably become the more typical variety.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "realistic"
                ], 
                "role": "Marge Gunderson in Fargo does a nicely realistic interpretation.", 
                "id": "PregnantBadass"
            }, 
            {
                "adjectives": [
                    "Pregnant"
                ], 
                "role": "Pregnant Badass: Marge might be the foremost example in cinema.", 
                "id": "PregnantBadass"
            }, 
            {
                "adjectives": [
                    "wealthy", 
                    "passive", 
                    "complete"
                ], 
                "role": "Spoiled Sweet: Jerry's wife comes from an exorbitantly wealthy family, but she still acted like the sweetest passive mother ever, complete with pink sweater.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0116282", 
    "poster_url": "Fargo.jpg", 
    "similar": [
        {
            "shared": [
                "SpoiledSweet", 
                "ActionMom", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Taken", 
            "name": "Taken", 
            "poster_url": "Taken.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "GeorgeOfTheJungle", 
            "name": "George of the Jungle", 
            "poster_url": "GeorgeOfTheJungle.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }
    ], 
    "id": "Fargo", 
    "name": "Fargo"
}