{
    "plot": "The fairies live in a peaceful place in the forest called Fern Gully which has been protected for many years by Magi, a wise fairy with strong powers. Her grand-daughter Crysta is a charming, beautiful fairy that is very intrigued about the world outside of Fern Gully. She along with the other fairies in the forest do not believe humans exist and are only in stories, until a crazy bat by the name of Batty, comes and tells them all these crazy stories about how he was captured by humans and experimented on. At first no one believes him except Crysta and she is determined to find out if humans are real. She goes to a place called Mount Warning, where the evil shadow of destruction Hexxus is known to be trapped, and finds a human named Zak. When he is almost crushed by a tree Crysta accidently shrinks him to fairy-size and he falls on a tree that is about to be devoured by \"The Leveller\". \"The Leveller\" is a wood cutting machine that has been cutting down every tree the humans have been putting red Xs on. Crysta saves Zak from \"The Leveller\" which she thinks is just a monster but she cannot properly un-shrink him. To avoid her being mad at him Zak tells her that the red Xs keep the monster back instead of what they are really there for, which is to pick which trees to cut down. They decide to take Zak to Magi so she can un-shrink him, on the way Zak sees the forest really for the first time with all its beauty and life. Back toward Mount Warning the humans have accidently released Hexxus who is set on destroying Fern Gully, he uses \"The Leveller\" to cut down all the trees to Fern Gully. When Crysta, Zak and Batty make it back to Fern Gully the fairies cannot believe the Zak is really a human and they all excited to see him and learn about him. The only one who is truly worried is Magi, she goes to check on the path to Fern Gully and sees that it is beginning destroyed and Hexxus is coming this way. She shows Crysta the red Xs and tells her the trees cannot be saved. With Hexxus drawing closer and closer to Fern Gully, Magi calls for all the fairies to come around to tells them of the danger. She uses the last of her magic to try and protect Fern Gully.", 
    "genres": "Animation, Adventure, Family", 
    "release_year": "1992", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Missing Mom: Crysta's mother is never seen nor mentioned.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Crysta from FernGully has a father who closely resembles the Sultan from Aladdin as a fairy.", 
                "id": "TheUglyGuysHotDaughter"
            }
        ]
    }, 
    "imdbid": "tt0104254", 
    "poster_url": "FernGullyTheLastRainforest.jpg", 
    "similar": [
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "AGoofyMovie", 
            "name": "A Goofy Movie", 
            "poster_url": "AGoofyMovie.jpg"
        }, 
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }, 
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "BatmanMysteryOfTheBatwoman", 
            "name": "Batman: Mystery of the Batwoman", 
            "poster_url": "BatmanMysteryOfTheBatwoman.jpg"
        }, 
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Cinderella", 
            "name": "Cinderella", 
            "poster_url": "Cinderella.jpg"
        }
    ], 
    "id": "FernGullyTheLastRainforest", 
    "name": "FernGully: The Last Rainforest"
}