{
    "plot": "A massive corporate conglomerate, Octopus Inc., run by a shrewd and cruel tycoon named Rod McCain, purchases a UK-based leisure company, and also the failing London Marwood Zoo. To bring more business to the zoo, Octopus hires a new manager, Rollo Lee, who promptly comes up with a way to increase profits-do away with all the animals except for the ferocious ones. This new Fierce Creatures Policy shocks the Marwood zookeepers, led by the unendingly talkative Adrian \"Bugsy\" Malone. Eventually, Rod McCain's son Vince, along with the up-and-coming business executive Willa Weston, take control of the zoo and revoke the Fierce Creatures Policy. Vince instead comes up with many under-handed and vicious schemes to attract customers-unauthorized celebrity endorsements, shoddy, overpriced zoo merchandise, and using robotic animals instead of real ones. However, Vince is also stealing from the zoo's funds, and when his father finds out, he rears to turn the zoo into a Japanese-owned golf course. Meanwhile, Willa has grown to love the zoo and its animals, and, along with her newly-reformed love interest Rollo, plot with the zookeepers to save the zoo from the McCains.", 
    "genres": "Comedy", 
    "release_year": "1997", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "careerwear"
                ], 
                "role": "Ms. Fanservice: Jamie Lee Curtis. As Roger Ebert puts it, she dresses as businesswomen would dress if careerwear was designed by Maidenform. (Or maybe more like a stripper in character as a businesswoman.)", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0119115", 
    "poster_url": "FierceCreatures.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "RazorBladeSmile", 
            "name": "Razor Blade Smile", 
            "poster_url": "RazorBladeSmile.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "TheTexasChainsawMassacre2003", 
            "name": "The Texas Chainsaw Massacre ", 
            "poster_url": "TheTexasChainsawMassacre2003.jpg"
        }
    ], 
    "id": "FierceCreatures", 
    "name": "Fierce Creatures"
}