{
    "plot": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.", 
    "genres": "Drama", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Joe/Jack/Tyler", 
                    "own"
                ], 
                "role": "Fight Club: Joe/Jack/Tyler Durden takes this WAY too far. Extinguishing lit cigarettes against his own skin as a form of foreplay, burning himself with lye just so he can experience pain, and defeating a mobster by letting the mobster beat him to a bloody pulp.", 
                "id": "MachoMasochism"
            }, 
            {
                "adjectives": [
                    "attractive"
                ], 
                "role": "Mr. Fanservice: Most conversations about how attractive Brad Pitt is will mention this film.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "Sensitive", 
                    "first", 
                    "certain", 
                    "general"
                ], 
                "role": "Sensitive Guy and Manly Man: The Narrator and Tyler at first appear to be this to a certain extent, then we realize fairly soon that they are Not So Different in terms of their attitude toward society and life in general, and this is before we find out that  Tyler is actually the narrator's split personality.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "first", 
                    "certain", 
                    "general"
                ], 
                "role": "The Narrator and Tyler from Fight Club at first appear to be this to a certain extent, then we realize fairly soon that they are Not So Different in terms of their attitude toward society and life in general, and this is before we find out that Tyler is actually the narrator's split personality.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "sixth"
                ], 
                "role": "Shirtless Scene: The sixth rule of Fight Club says \"no shirts, no shoes\". Bob averts this rule without comment. Guess why?◊ (It also saved money on makeup effects.)", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Fight Club provides a rare male example:", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [], 
                "role": "Gag Boobs: Bob is a rare male example.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "dirty", 
                    "mental", 
                    "unhealthy", 
                    "social", 
                    "own", 
                    "selfish", 
                    "different", 
                    "flamboyant", 
                    "serious", 
                    "homoerotic", 
                    "surprising"
                ], 
                "role": "Fight Club:\n A truly disturbing example in the form of Marla Singer, who could perhaps best be described as what happens when the Manic Pixie Dream Girl grows up. Marla is dirty, living in poverty, and clearly suffering some form of mental illness, and gets into a fairly unhealthy relationship with Tyler. The narrator is dissatisfied with social norms and consumerist trends, but lacks the will to break out of the mold on his own, leading to his association with Tyler. Marla actually infuriates the narrator because she simply doesn't care about anything. She even calls him out on all his selfish justifications for his behavior being no worse or different than her own.\n In a way, the confident, flamboyant Tyler is also a MPDG to the uptight nameless narrator. There's a serious homoerotic subtext between them throughout the movie (less surprising when you realize that the author is gay). The narrator just drifts through life until Tyler shows up, and their relationship changes his life and his outlook forever. And then you find out that Tyler was just the narrator's split personality all along. At the end, he kills \"Tyler\" off.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Manic Pixie Dream Girl: Darkly subverted with Marla. Tyler is sort of a Manic Pixie Dream Guy.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt0137523", 
    "poster_url": "FightClub.jpg", 
    "similar": [
        {
            "shared": [
                "ShirtlessScene", 
                "SensitiveGuyAndManlyMan", 
                "MrFanservice", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 4, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MrFanservice", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan", 
                "MrFanservice", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MrFanservice", 
                "MachoMasochism"
            ], 
            "shared_count": 3, 
            "id": "Predator", 
            "name": "Predator", 
            "poster_url": "Predator.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "FightClub", 
    "name": "Fight Club"
}