{
    "plot": "A mysterious Irishman, Finian, and his beautiful daughter Sharon, arrive one day in Rainbow Valley, a small Southern town of tobacco sharecroppers in the mythical state of Missitucky. The town has its own resident dreamer, Woody Mahoney, who thinks that he might be able to put the town on the map by crossing mint with tobacco so that it'll grow already mentholated. Finian's come to the town because he's stolen a leprechaun's crock of gold and plans to plant it in the ground so it'll grow faster (or else why would the Americans have rushed to dig the gold out of California only to plant it back in the ground at Fort Knox?). But trouble arrives in the form of Og the leprechaun, who has followed Finian to America and is bent on retrieving his gold. Meanwhile, the bigoted Senator Billboard Rawkins, in an effort to stop progress in his state in the form of a new dam and hydroelectric system, plans to take the remaining parcel of land needed to stop the project - Woody's, which Finian has purchased to save from the auctioneer's gavel. But then the government's geologists reveal to the Senator that gold has been detected on the property! Rawkins and his men confront the sharecroppers to seize their land using as an excuse an obscure law making it a felony for blacks and whites to live together, but when Sharon, outraged at this bigotry, cries out while standing right over the pot of gold, \"I wish to God you were black ...\" all hell breaks loose as wishes come true.", 
    "genres": "Family, Fantasy, Musical", 
    "release_year": "1968", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Some productions of Finians Rainbow make Senator Rawkins look this way, though it isn't indicated in the script and doesn't follow Original Cast Precedent.", 
                "id": "FatSweatySouthernerInAWhiteSuit"
            }
        ]
    }, 
    "imdbid": "tt0062974", 
    "poster_url": "FiniansRainbow.jpg", 
    "similar": [
        {
            "shared": [
                "FatSweatySouthernerInAWhiteSuit"
            ], 
            "shared_count": 1, 
            "id": "TinyToonAdventuresHowISpentMyVacation", 
            "name": "Tiny Toon Adventures: How I Spent My Vacation", 
            "poster_url": "TinyToonAdventuresHowISpentMyVacation.jpg"
        }, 
        {
            "shared": [
                "FatSweatySouthernerInAWhiteSuit"
            ], 
            "shared_count": 1, 
            "id": "TheMuppetMovie", 
            "name": "The Muppet Movie", 
            "poster_url": "TheMuppetMovie.jpg"
        }, 
        {
            "shared": [
                "FatSweatySouthernerInAWhiteSuit"
            ], 
            "shared_count": 1, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "FatSweatySouthernerInAWhiteSuit"
            ], 
            "shared_count": 1, 
            "id": "TheFoxAndTheHound", 
            "name": "The Fox and the Hound", 
            "poster_url": "TheFoxAndTheHound.jpg"
        }, 
        {
            "shared": [
                "FatSweatySouthernerInAWhiteSuit"
            ], 
            "shared_count": 1, 
            "id": "TheRoadToWellville", 
            "name": "The Road To Wellville", 
            "poster_url": "TheRoadToWellville.jpg"
        }
    ], 
    "id": "FiniansRainbow", 
    "name": "Finian's Rainbow"
}