{
    "plot": "In this animated tale, a tiny village is destroyed by a surging glacier, which serves as the deadly domain for the evil Ice Lord, Nekron. The only survivor is a young warrior, Larn, who vows to avenge this act of destruction. The evil continues, however, as Nekron's palace of ice heads straight towards Fire Keep, the great fortress ruled by the good King Jarol. When Jarol's beautiful daughter, Teegra, is abducted by Nekron's sub-human ape-like creatures, Larn begins a daring search for her. What results is a tense battle between good and evil, surrounded by the mystical elements of the ancient past.", 
    "genres": "Animation, Fantasy, Adventure", 
    "release_year": "1983", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "attentive"
                ], 
                "role": "Mr. Fanservice: The men don't wear anything more concealing than the women, and their musculature is drawn with attentive detail.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "whole"
                ], 
                "role": "Shirtless Scene: Basically the whole movie.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "sissy", 
                    "enough"
                ], 
                "role": "Necron from Fire and Ice, he may look like a sissy but he has the ability to give Curb Stomp Battles to anyone foolish enough to attack him.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "capable"
                ], 
                "role": "Sissy Villain: Nekron. Surprisingly, he's quite a capable swordsman despite this, and loves the idea of a Worthy Opponent.", 
                "id": "SissyVillain"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "many", 
                    "tough", 
                    "resourceful", 
                    "own"
                ], 
                "role": "Action Girl: Teegra, in many instances. Almost every time she's captured, she's tough and resourceful enough to escape on her own — before the heroes arrive.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "sharp"
                ], 
                "role": "Damsel out of Distress: Teegra's length of time in captivity depends solely on how quickly she can pilfer a dagger from one of her captors, or even just a sharp stick. Once that happens...", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "thong"
                ], 
                "role": "Fire and Ice: Princess Teegra. Don't let the thong bikini fool you... With her getting captured isn't a matter of waiting for the hero, but a matter of seeing what clever scheme she concocts to escape this time.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses: Princess Teegra with the added bonus of a string bikini!", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "sort-of"
                ], 
                "role": "Neutral Female: Teegra zigzags with this one and Action Girl, going from crying and laying helplessly to stabbing people with sticks or throwing knives into their hearts (and then standing by, watching her sort-of boyfriend get the crap kicked out of him for a minute).", 
                "id": "NeutralFemale"
            }
        ]
    }, 
    "imdbid": "tt0085542", 
    "poster_url": "FireAndIce.jpg", 
    "similar": [
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "ShirtlessScene", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "ShirtlessScene", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "ShirtlessScene", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "MirrorMirror", 
            "name": "Mirror, Mirror"
        }, 
        {
            "shared": [
                "DamselOutOfDistress", 
                "SissyVillain", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "FireAndIce", 
    "name": "Fire and Ice"
}