{
    "plot": "Leo and Ulrich are life long friends. Home, on leave from their military training, Leo sees the beautiful Felicitas at the railroad station. Awed by her beauty, they meet again at the ball and quietly leave together. In her room, her husband, about whom she has neglected to inform Leo, comes in and challenges Leo to a duel. The duel is done, the Count is killed, and Felicitas is a widow. Leo, however, is 'requested' to serve 5 years in Africa and he tells Ulrich to watch over Felicitas while he is gone. After 3 years, Ulrich is able to get a pardon for Leo, and all that Leo thinks about on the way home is Felicitas. When he arrives, he learns that Felicitas has married Ulrich. Felicitas likes that Ulrich is rich and she never told Ulrich the truth about Leo and her. Leo is crushed and does not visit them which saddens Ulrich as he does not know the reason why. Leo tries to stay away from her, but Felicitas uses every opportunity to tempt him to return to her as her lover. She creating a deadly triangle with the two life long friends.", 
    "genres": "Drama, Romance", 
    "release_year": "1926", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "The Vamp: Felicitas, whose sexuality gets Count von Rhaden killed, ruins Leo's life, and nearly ruins Ulrich as well.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0016884", 
    "poster_url": "FleshAndTheDevil.jpg", 
    "similar": [
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "Sunrise", 
            "name": "Sunrise", 
            "poster_url": "Sunrise.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "DrMabuseTheGambler", 
            "name": "Dr. Mabuse, the Gambler", 
            "poster_url": "DrMabuseTheGambler.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "Neighbors2014", 
            "name": "Neighbors", 
            "poster_url": "Neighbors2014.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "TheLairOfTheWhiteWorm", 
            "name": "The Lair of the White Worm", 
            "poster_url": "TheLairOfTheWhiteWorm.jpg"
        }
    ], 
    "id": "FleshAndTheDevil", 
    "name": "Flesh and the Devil"
}