{
    "plot": "In Serbia, Baron Frankenstein lives with the Baroness and their two children. He dreams of a super-race, returning Serbia to its grand connections to ancient Greece. In his laboratory, assisted by Otto, he builds a desirable female body, but needs a male who will be superbody and superlover. He thinks he has found just the right brain to go with a body he's built, but he's made an error, taking the head of a asexual aesthete. Meanwhile, the Baroness has her lusts, and she fastens on Nicholas, a friend of the dead lad. Can the Baron pull off his grand plan? He brings the two zombies together to mate. Meanwhile, Nicholas tries to free his dead friend. What about the Baron's children?", 
    "genres": "Horror", 
    "release_year": "1973", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "due", 
                    "male", 
                    "female", 
                    "interested"
                ], 
                "role": "This would later come back to bite Frankenstein in the backside since he initially thought Sacha was The Casanova due to a series of misinterpreted events, and decided to use his brain for the male creature, hoping he would mate with his female creature.  Turns out, he's not interested.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "wealthy", 
                    "farmhands/stable", 
                    "physical", 
                    "servant", 
                    "aware"
                ], 
                "role": "In both Flesh For Frankenstein and Blood For Dracula, this trope is deconstructed by showing wealthy women lusting after their farmhands/stable boys for pure physical pleasure and the \"servant boy\" being fully aware and not caring, even going so far as to throw it back in their faces when they mouth off.", 
                "id": "MistressAndServantBoy"
            }, 
            {
                "adjectives": [
                    "sure", 
                    "little", 
                    "possible", 
                    "female", 
                    "entire"
                ], 
                "role": "Ms. Fanservice: The Baroness Frankenstein would make sure she wore as little as possible when meeting with Nicholas. Not to be outdone, the female monster is topless the entire time.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "Rich", 
                    "wealthy"
                ], 
                "role": "Rich Bitch: The Baroness is quite wealthy and enjoys torturing her husband or manipulating the help into sleeping with her.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "own"
                ], 
                "role": "The Vamp: Baroness Frankenstein. She seems to be luring Nicholas in for her own pleasure but it soon gets him in deeper trouble than expected.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0071508", 
    "poster_url": "FleshForFrankenstein.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "TheVamp", 
                "MsFanservice"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "TheVamp", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "MansfieldPark", 
            "name": "Mansfield Park", 
            "poster_url": "MansfieldPark.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "RichBitch"
            ], 
            "shared_count": 2, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }
    ], 
    "id": "FleshForFrankenstein", 
    "name": "Flesh for Frankenstein"
}