{
    "plot": "In 1937 China, during the second Sino-Japanese war, a mortician, John (Christian Bale) arrives at a Catholic church in Nanjing to prepare a priest for burial. Upon arrival he finds himself the lone adult among a group of convent girl students and prostitutes from a nearby brothel. When he finds himself in the unwanted position of protector of both groups from the horrors of the invading Japanese army, he discovers the meaning of sacrifice and honor.", 
    "genres": "Drama, History, War", 
    "release_year": "2011", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "care", 
                    "cellar", 
                    "damaged", 
                    "young", 
                    "repentant"
                ], 
                "role": "Hooker with a Heart of Gold: Inverted at the start: when we first meet the women they embody the Chinese stereotype of prostitutes: \"Prostitutes never care about a falling nation, they sing and dance while others are dying.\" They monopolize the cellar and refuse to let the girls hide there. Very soon, however, we're shown what's beneath the veneer; damaged, wounded young women who just want to survive. They take care of the wounded Pu Sheng and grieve when he dies, are repentant at essentially having caused the death of two of the girls, and in the end they decide to play the trope straight and defy the stereotype, by taking the students' place.", 
                "id": "HookerWithAHeartOfGold"
            }
        ]
    }, 
    "imdbid": "tt1410063", 
    "poster_url": "FlowersOfWar.jpg", 
    "similar": [
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "Purgatory", 
            "name": "Purgatory", 
            "poster_url": "Purgatory.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "Django", 
            "name": "Django", 
            "poster_url": "Django.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "McCabeAndMrsMiller", 
            "name": "McCabe & Mrs. Miller", 
            "poster_url": "McCabeAndMrsMiller.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "TheBarberOfSiberia", 
            "name": "The Barber of Siberia", 
            "poster_url": "TheBarberOfSiberia.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }
    ], 
    "id": "FlowersOfWar", 
    "name": "Flowers Of War"
}