{
    "plot": "Roddy is a decidedly upper-crust \"society mouse\" who lives the life of a beloved pet in a posh Kensington flat. When a sewer rat named Sid comes spewing out of the sink and decides he's hit the jackpot, Roddy schemes to rid himself of the pest by luring him into the \"whirlpool.\" Sid may be an ignorant slob, but he's no fool, so it is Roddy who winds up being flushed away into the bustling sewer world of Ratropolis. There Roddy meets Rita, an enterprising scavenger who works the sewers in her faithful boat, the Jammy Dodger. Roddy immediately wants out, or rather, up; Rita wants to be paid for her trouble; and, speaking of trouble, the villainous Toad - who royally despises all rodents equally, making no distinction between mice and rats--wants them iced... literally. The Toad dispatches his two hapless hench-rats, Spike and Whitey, to get the job done. When they fail, the Toad has no choice but to send to France for his cousin - that dreaded mercenary, Le Frog.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2006", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "many"
                ], 
                "role": "Missing Mom: It's never explained how the Toad got so many children.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0424095", 
    "poster_url": "FlushedAway.jpg", 
    "similar": [
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "IndependenceDay", 
            "name": "Independence Day", 
            "poster_url": "IndependenceDay.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Epic", 
            "name": "Epic"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "StarTrekInsurrection", 
            "name": "Star Trek: Insurrection", 
            "poster_url": "StarTrekInsurrection.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "FlushedAway", 
    "name": "Flushed Away"
}