{
    "plot": "Classic tale of teenage rebellion and repression features a delightful combination of dance choreography and realistic and touching performances. When teenager Ren McCormack and his family move from big-city Chicago to a small Midwestern town, he's in for a real case of culture shock. Though he tries hard to fit in, the streetwise Ren can't quite believe he's living in a place where rock music and dancing are illegal. However, there is one small pleasure: Ariel Moore, a troubled but lovely blonde with a jealous boyfriend. And a Bible-thumping minister, who is responsible for keeping the town dance-free. Ren and his classmates want to do away with this ordinance, especially since the senior prom is around the corner, but only Ren has the courage to initiate a battle to abolish the outmoded ban and revitalize the spirit of the repressed townspeople. Fast-paced drama is filled with such now-famous hit songs as the title track and \"Let's Hear It for the Boy\".", 
    "genres": "Drama, Music, Romance", 
    "release_year": "1984", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "willing"
                ], 
                "role": "Corrupt Hick: Subverted with Reverend Moore, who genuinely thinks he's doing the right thing. He is also willing to listen to Ren's argument, and stops a group of people burning \"unseemly\" books from the library.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [], 
                "role": "Footloose: Nicely subverted with the preacher note played by John Lithgow. He finally figures out how to let go when his flock starts burning books.", 
                "id": "CorruptHick"
            }
        ]
    }, 
    "imdbid": "tt0087277", 
    "poster_url": "Footloose.jpg", 
    "similar": [
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "Coonskin", 
            "name": "Coonskin"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "Diggstown", 
            "name": "Diggstown", 
            "poster_url": "Diggstown.jpg"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "PootieTang", 
            "name": "Pootie Tang", 
            "poster_url": "PootieTang.jpg"
        }
    ], 
    "id": "Footloose", 
    "name": "Footloose"
}