{
    "plot": "Wealthy music producer Alan James lives with his beautiful Russian girlfriend Laura, thirty years younger than him, whom he met while he was in Russia on business. They have a three-year-old son. Alan is a music legend, having produced black music during the 60's and 70's, the golden era of Memphis Soul. They live an affluent life in a sprawling mansion on the banks of the Mississippi in Memphis, Tennessee. But, although she is comfortable, Laura feels lonely and isolated. Alan has an estranged adult son from a previous marriage, Michael, a literature professor, who is married and lives with his wife in Los Angeles. Michael and his father have a complicated relationship that is marred by disappointment, hampered by jealousy, and fueled by anger. When Michael returns home to Memphis for the first time in many years, although he had at first disapproved of his father's young girlfriend, a painful and dangerous love affair develops between him and Laura, his contemporary. As this forbidden passion deepens in the bedrooms and bars of modern Memphis, Laura comes to an illuminating self-confrontation that will change her soul and her life forever.", 
    "genres": "Drama, Music, Romance", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Forty Shades of Blue has one with Michael James (Darren Burrows) while doing it with Laura (Dina Korzun).", 
                "id": "TheGruntingOrgasm"
            }, 
            {
                "adjectives": [], 
                "role": "The Grunting Orgasm: Michael gives one when having sex with Laura.", 
                "id": "TheGruntingOrgasm"
            }
        ]
    }, 
    "imdbid": "tt0395543", 
    "poster_url": "FortyShadesOfBlue.jpg", 
    "similar": [
        {
            "shared": [
                "TheGruntingOrgasm"
            ], 
            "shared_count": 1, 
            "id": "PumpUpTheVolume", 
            "name": "Pump Up The Volume", 
            "poster_url": "PumpUpTheVolume.jpg"
        }, 
        {
            "shared": [
                "TheGruntingOrgasm"
            ], 
            "shared_count": 1, 
            "id": "MacGruber", 
            "name": "MacGruber", 
            "poster_url": "MacGruber.jpg"
        }, 
        {
            "shared": [
                "TheGruntingOrgasm"
            ], 
            "shared_count": 1, 
            "id": "TheCooler", 
            "name": "The Cooler", 
            "poster_url": "TheCooler.jpg"
        }, 
        {
            "shared": [
                "TheGruntingOrgasm"
            ], 
            "shared_count": 1, 
            "id": "TheresSomethingAboutMary", 
            "name": "There's Something About Mary"
        }
    ], 
    "id": "FortyShadesOfBlue", 
    "name": "Forty Shades Of Blue"
}