{
    "plot": "It's 1994 in Long Beach, California. Idealistic Erin Gruwell is just starting her first teaching job, that as freshman and sophomore English teacher at Woodrow Wilson High School, which, two years earlier, implemented a voluntary integration program. For many of the existing teachers, the integration has ruined the school, whose previously stellar academic standing has been replaced with many students who will be lucky to graduate or even be literate. Despite choosing the school on purpose because of its integration program, Erin is unprepared for the nature of her classroom, whose students live by generations of strict moral codes of protecting their own at all cost. Many are in gangs and almost all know somebody that has been killed by gang violence. The Latinos hate the Cambodians who hate the blacks and so on. The only person the students hate more is Ms. Gruwell. It isn't until Erin holds an unsanctioned discussion about a recent drive-by shooting death that she fully begins to understand what she's up against. And it isn't until she provides an assignment of writing a daily journal - which will be not graded, and will remain unread by her unless they so choose - that the students begin to open up to her. As Erin tries harder and harder to have resources provided to teach properly (which often results in her needing to pay for them herself through working second and third jobs), she seems to face greater resistance, especially from her colleagues, such as Margaret Campbell, her section head, who lives by regulations and sees such resources as a waste, and Brian Gelford, who will protect his \"priviledged\" position of teaching the senior honors classes at all cost. Erin also finds that her teaching job is placing a strain on her marriage to Scott Casey, a man who seems to have lost his own idealistic way in life.", 
    "genres": "Biography, Crime, Drama", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Several"
                ], 
                "role": "Troubled, but Cute: Several of Erin's students.", 
                "id": "TroubledButCute"
            }
        ]
    }, 
    "imdbid": "tt0463998", 
    "poster_url": "FreedomWriters.jpg", 
    "similar": [
        {
            "shared": [
                "TroubledButCute"
            ], 
            "shared_count": 1, 
            "id": "Gunslinger", 
            "name": "Gunslinger", 
            "poster_url": "Gunslinger.gif"
        }, 
        {
            "shared": [
                "TroubledButCute"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "TroubledButCute"
            ], 
            "shared_count": 1, 
            "id": "TheWildOne", 
            "name": "The Wild One", 
            "poster_url": "TheWildOne.jpg"
        }, 
        {
            "shared": [
                "TroubledButCute"
            ], 
            "shared_count": 1, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "TroubledButCute"
            ], 
            "shared_count": 1, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }
    ], 
    "id": "FreedomWriters", 
    "name": "Freedom Writers"
}