{
    "plot": "Writer Peter Morgan's legendary battle between Richard Nixon, the disgraced president with a legacy to save, and David Frost, a jet-setting television personality with a name to make, in the story of the historic encounter that changed both their lives. For three years after being forced from office, Nixon remained silent. But in summer 1977, the steely, cunning former commander-in-chief agreed to sit for one all-inclusive interview to confront the questions of his time in office and the Watergate scandal that ended his presidency. Nixon surprised everyone in selecting Frost as his televised confessor, intending to easily outfox the breezy British showman and secure a place in the hearts and minds of Americans (as well as a $600,000 fee). Likewise, Frost's team harbored doubts about their boss' ability to hold his own. But as cameras rolled, a charged battle of wits resulted.", 
    "genres": "Drama, History", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "protective"
                ], 
                "role": "Papa Wolf: Inverted. Jack Brennan is extremely protective of Nixon, who serves as a father figure, and threatens to ruin Frost if he damages his image.", 
                "id": "PapaWolf"
            }
        ]
    }, 
    "imdbid": "tt0870111", 
    "poster_url": "FrostNixon.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "GodzillaVsDestoroyah", 
            "name": "Godzilla vs. Destoroyah"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "FrostNixon", 
    "name": "Frost/Nixon"
}