{
    "plot": "Anna, a fearless optimist, sets off on an epic journey - teaming up with rugged mountain man Kristoff and his loyal reindeer Sven - to find her sister Elsa, whose icy powers have trapped the kingdom of Arendelle in eternal winter. Encountering Everest-like conditions, mystical trolls and a hilarious snowman named Olaf, Anna and Kristoff battle the elements in a race to save the kingdom. From the outside Anna's sister, Elsa looks poised, regal and reserved, but in reality, she lives in fear as she wrestles with a mighty secret-she was born with the power to create ice and snow. It's a beautiful ability, but also extremely dangerous. Haunted by the moment her magic nearly killed her younger sister Anna, Elsa has isolated herself, spending every waking minute trying to suppress her growing powers. Her mounting emotions trigger the magic, accidentally setting off an eternal winter that she can't stop. She fears she's becoming a monster and that no one, not even her sister, can help her.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "dismissive", 
                    "first"
                ], 
                "role": "In Frozen, Kristoff was dismissive of Princess Anna at first. The first spark appears when she clobbers an attacking wolf with a lute.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "heroic"
                ], 
                "role": "Kristoff, the hardy ice-harvesting mountain man from Frozen, has an appreciated heroic build (and a Lantern Jawof Justice to boot).", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "white", 
                    "prominent", 
                    "white", 
                    "last", 
                    "white", 
                    "good-guy"
                ], 
                "role": "Prince Hans, from Frozen, has an element of white in all his suits, most prominent in the suit he wears for the coronation. Meaningfully, as we build up to The Reveal, he switches to a dark blue suit, and when he exposes his treachery, he takes off his white gloves, the last white element of his clothing. He puts them back on when he leaves Anna, however, and keeps up his good-guy act until he has Elsa at his mercy.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [], 
                "role": "In Frozen, Hans is a gentleman Prince Charming while Kristoff is a loner, rough-around-the-edges, smelly mountain man.", 
                "id": "NobleMaleRoguishMale"
            }, 
            {
                "adjectives": [
                    "Noble", 
                    "rugged", 
                    "true", 
                    "noble"
                ], 
                "role": "Noble Male, Roguish Male: The gentle nobleman Hans in contrast to rugged mountain man Kristoff. Inverted, as Hans' true character is Machiavellian and uses the noble ruse as a tool to usurp the throne, while Kristoff's persona was implied by the trolls to have been created to protect himself and hide his inner kindness and goodness.", 
                "id": "NobleMaleRoguishMale"
            }, 
            {
                "adjectives": [
                    "good", 
                    "naive", 
                    "love", 
                    "evil"
                ], 
                "role": "Deconstructed by Arendelle's King and Queen in Frozen. Despite their good intentions, their desire to protect their children only keep them from developing skills that they only learn during the course of the film. Elsa becomes an Ineffectual Loner who shuts her emotions out from everyone, including her sister. Anna grew up naive about how love works and very quickly decides to get married to a man she'd just met.  Who turned out evil and only wanted to use Anna to marry into his way to rule Arendelle.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "Overprotective", 
                    "real", 
                    "naive", 
                    "own", 
                    "naivete"
                ], 
                "role": "Overprotective Dad: Deconstructed. The King and Queen's desire to protect their children and so they isolated them away from anything that could hurt them, including each other. Because of this they are denied the life experiences that real life people need to develop. Thus, it only served to keep them from developing the skills they ended up having to learn during the course of the film. Elsa became an Ineffectual Loner who shut out her emotions from everyone, including her sister. Anna grew up very naive as to how love works, or the world or even her own kingdom, resulting in her getting engaged to a man she barely knows who turns out to be a Gold Digger and is just using Anna's naivete to marry his way into ruling Arendelle.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "good"
                ], 
                "role": "Frozen: Prince Hans. Has charm, just not the good kind.", 
                "id": "PrinceCharmless"
            }, 
            {
                "adjectives": [
                    "sensitive", 
                    "rugged"
                ], 
                "role": "Manly Man And Sensitive Guy: Kristoff is the Manly Mountain Man to Hans' gentlemanly Sensitive Guy. It turns out that Hans is actually the villain, and Kristoff is actually a sensitive guy beneath his rugged exterior.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "sharp-dressed", 
                    "well-mannered", 
                    "noble", 
                    "arrogant", 
                    "power-mad", 
                    "other", 
                    "sensitive"
                ], 
                "role": "Kristoff and Hans — Hans is the sharp-dressed, well-mannered noble who appears friendly and charming; but he's really an arrogant, power-mad Jerkass who would murder to get what he wants. Kristoff wears tattered clothes, was raised by trolls, and is a grumpy ice harvester who claims to hate other people; but he's actually a sensitive, caring, brave man who would do anything for the ones he loves.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "own", 
                    "evil"
                ], 
                "role": "Like Flynn above, both Kristoff and Prince Hans in Frozen fit this trope in their own Adorkable way.  Unlike Flynn, the latter is an evil version of this trope.", 
                "id": "TheCharmer"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "own", 
                    "rightful"
                ], 
                "role": "Evil Prince: Prince Hans is most certainly evil, but unlike most examples of this trope, it's not his own kingdom he's trying to kill the rightful heirs to and usurp, possibly because he has twelve older brothers and there's no way he can kill all of them off without casting suspicion onto himself.", 
                "id": "TheEvilPrince"
            }, 
            {
                "adjectives": [
                    "own", 
                    "first"
                ], 
                "role": "Prince Hans in Frozen.  Since knocking off his twelve older brothers would be a lot of work, his ambitions involve usurping a throne outside his own kingdom through either manipulation and marriage or murder, whichever comes first.", 
                "id": "TheEvilPrince"
            }, 
            {
                "adjectives": [
                    "young"
                ], 
                "role": "Troubled, but Cute: Elsa is a lovely young lady and isolates herself because of her fear of her powers.", 
                "id": "TroubledButCute"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "forth", 
                    "stereotypical", 
                    "life-threatening", 
                    "captive", 
                    "helpless"
                ], 
                "role": "Anna veers back and forth between being a borderline Action Girl to a Distressed Damsel, but never in a stereotypical manner. When she's hurt, it's legitimately life-threatening because her heart and body are slowly freezing solid. When she's taken captive she's just about on her deathbed, so one can forgive any \"helpless\" vibes, because she's honestly helpless.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "giant", 
                    "giant"
                ], 
                "role": "Princess Anna in Frozen smacks down a wolf with a lute, fends off a giant Snowlem,  sacrifices her life for her sister, and punches her ex-fiance in the face, sending him flying over a railing. She is most assuredly badass. Her sister, Queen Elsa, has ice powers that can kill people via impaling or giant snowmen. Luckily for everyone, she doesn't actually go through with killing people.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "happy", 
                    "little", 
                    "past"
                ], 
                "role": "Queen Elsa from Frozen used to be a happy kid until one night when she hit her little sister in the head with her ice powers. After that incident, she refused to use her powers, detached herself from her sister, and locked herself in her room. She's pretty much lived the past thirteen years of her life in isolation and fear of herself and hurting others.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "strong", 
                    "quick", 
                    "clear", 
                    "giant", 
                    "entire", 
                    "intensive", 
                    "tortured", 
                    "normal", 
                    "soul", 
                    "proportional", 
                    "resilient", 
                    "particular", 
                    "chickified", 
                    "sudden", 
                    "vulnerable", 
                    "several", 
                    "fanfic", 
                    "incapable", 
                    "human", 
                    "nightmarish"
                ], 
                "role": "Frozen fanfics pairing Elsa and Anna tend to do this to Anna. In the film, she's a strong character who's quick to take action, keeps a clear head whilst being pursued by wolves and giant snowmen, doesn't hesitate to come to the rescue of others, and never cries during the entire film, despite suffering an intensive Trauma Conga Line. Fanfiction tends to morph her into a tortured soul who managed to bottle up her grief during the events of the film, and, once everything is back to normal, quickly breaks down and pours her heart out to whatever soul will listen, usually Elsa. The wimpiness of Anna in fanfiction is usually proportional to the strength of Elsa; the more resilient Elsa is in any particular fic, the more chickified Anna becomes. Generally, Anna's sudden chickification is explained by the shock of having her sister back, and the years of loneliness she endured during the film's prologue.\n Elsa herself can also qualify; although she is far more emotionally vulnerable then Anna and breaks down several times during the film, her tendencies tend to be exaggerated in fanfic, making her a wreck incapable of human contact as a result of isolation (despite it being her who first reached out to Anna at the party in the film) and constantly suffering nightmarish flashbacks to the events of the film and its climax.", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [
                    "little", 
                    "main"
                ], 
                "role": "Queen Elsa from Frozen used to be this to her little sister, Princess Anna, when they were young. After almost accidentally killing Anna with her powers, she all but ignored her existence and ultimately isolated herself from the world. By the end of the main events of the film,  they have rekindled their relationship.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [], 
                "role": "Anna from Frozen. She's Rapunzel but somehow Turned Up to Eleven.", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [
                    "different", 
                    "own"
                ], 
                "role": "Damsel in Distress: Both Anna and Elsa become this at different parts of the movie. Interestingly, they both go down the Damsel out of Distress route, with Elsa using her powers to break out of the castle dungeons and Anna lifting the curse placed on her on her own, without needing a True Love's Kiss.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "specially-made", 
                    "several", 
                    "entire"
                ], 
                "role": "Elsa of Frozen gets imprisoned and shackled with specially-made manacles meant to serve as Power Limiters near the end of the movie. However, as hinted at several points earlier in the movie, covering her hands only helps her control her powers and doesn't totally stop them, so she proceeds to freeze both her shackles and the entire room until she could shatter them and break out.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Emotionless Girl: What Elsa tries to be, suppressing her emotions.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "magical", 
                    "massive", 
                    "emotional"
                ], 
                "role": "Princess Elsa from Frozen is a deconstruction. Because her magical powers are controlled by her emotions, Elsa has grown up trying to be emotionless (\"Conceal, don't feel\") but it's taken a massive emotional toll on her (and her family) until a moment of anger towards her sister causes her to snap and lose control of her powers, thus exiling herself to the mountains.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "first", 
                    "unpopular", 
                    "merchandisable", 
                    "few", 
                    "classic", 
                    "dynamic", 
                    "and/or", 
                    "integrated", 
                    "various", 
                    "music", 
                    "classic", 
                    "popular", 
                    "non-princess", 
                    "thin", 
                    "original", 
                    "normal", 
                    "able", 
                    "jungle", 
                    "male", 
                    "actual", 
                    "Tangled", 
                    "birth", 
                    "Wreck-It", 
                    "single"
                ], 
                "role": "Elsa — Frozen (2013): Elsa being the first \"Disney Princess\" to actually be a queen\n The reason the Disney Animated Canon is stuffed with princesses is actually because they draw so much on fairy tales... but as of the 1990s, they centered merchandising on the princess characters, and you know the rest. Actually, only some of the princess characters got in; those that had bit parts, were from unpopular movies, or just weren't as merchandisable were shoved in the back. And they've tried a few times to add non-royals into the line, despite Mulan, Esmeralda, and Alice definitely not being princesses, either to ease concerns that the classic pantheon wasn't dynamic and/or integrated enough (Mulan being the best Action Girl they could use, since they didn't have one) or to fill out various storybooks, music albums, etc. Pocahontas, another honorary member of the group, actually is, but might not have been considered \"classic\" when the line was introduced. (That, or her clothes aren't considered pretty enough.) Naturally, this was somewhat referenced in Kingdom Hearts, where those who qualified as \"Princesses of Heart\" just happened to be popular characters on both sides of the Pacific. Alice, a non-princess, was in fact added to the list, with the thin justification that she becomes a queen in the original books (and as foreshadowing that another seemingly normal character is also one). Ariel was in fact REMOVED from the list for Kingdom Hearts, probably because, as a mermaid, she wouldn't be able to leave Atlantica to interact with the larger plot, but she gets to be an Action Girl Guest Star Party Member.\n Other commonly forgotten Disney princesses (or queens) include Eilonwy, Tiger Lily, Kidagakash, Maid Marian (mentioned in the film to be King Richard's niece), and Nala (by marriage to Simba). If you stretch, you can also include Jane (queen of the jungle), Alice (who becomes a queen in the chess sense in Through the Looking Glass), Megara (who originally was a daughter of King Chreon), and Kida (daughter of the king for almost 10,000 years, and becomes queen in the end).\n Ironically, the Powers That Be at Disney have been downplaying the princess element of its films after theorizing that marketing The Princess and the Frog as a Princess movie turned away the male demographic. This is mainly limited to the films' marketing and not their actual content, however: Tangled upgrades Rapunzel from a commoner into a princess by birth, Wreck-It Ralph turns out to have an unexpected princess in Vanellope, although she decides that she'd rather be president, and Frozen gives a fairy tale that originally didn't have a single princess in it two princess characters (although one of them is technically a queen).", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "Final"
                ], 
                "role": "Final Girl: Parker.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "Girlish", 
                    "formal", 
                    "formal"
                ], 
                "role": "Girlish Pigtails: Anna wears braided pigtails in every scene except those leading up to and during the coronation ball. Because it's a formal affair, she styles her hair into a more formal and grown up fashion.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [
                    "/Everything", 
                    "benevolent"
                ], 
                "role": "God Save Us from the Queen!/Everything's Better with Princesses: Queen Elsa and her sister, Princess Anna. Played With and possibly defied in both cases. Elsa wants more than anything to be a benevolent queen but her ice powers covered the country in snow.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "dangerous", 
                    "unintentional", 
                    "aware", 
                    "queen", 
                    "much"
                ], 
                "role": "Played with in Frozen. Elsa, the elder sister, has dangerous ice powers and she is the one who is made queen. When these powers are discovered, she has to flee which brings an endless winter. However, this is unintentional on her part; she is not even aware she is causing it.  Ultimately averted, as she remains queen and is much beloved after she learns to control her powers.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [], 
                "role": "In Frozen, Queen Elsa wears a purple cape as part of her coronation regalia.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [
                    "elegant", 
                    "equal", 
                    "few", 
                    "sad"
                ], 
                "role": "Queen Elsa from Frozen possesses both icy, elegant beauty, and ice powers equal to those of a cruel winter Goddess. Despite appearances (and a few unfortunate accidents) to the contrary, she isn't the least bit evil, just very sad and isolated.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [], 
                "role": "Ice Queen: Again, Elsa. However, her cold demeanor is all an act to prevent herself from accidentally freezing the people she cares about.", 
                "id": "IceQueen"
            }, 
            {
                "adjectives": [], 
                "role": "In Frozen Queen Elsa fights and defeats the Duke of Weselton's bodyguards while wearing her conjured gown of ice.", 
                "id": "KickingAssInAllHerFinery"
            }, 
            {
                "adjectives": [
                    "former", 
                    "optimistic", 
                    "cheerful"
                ], 
                "role": "Light Feminine and Dark Feminine: Anna and Elsa respectively: the former is optimistic and cheerful, whereas the latter is troubled and aloof.", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "inside"
                ], 
                "role": "Princess Anna is this to the outdoorsy ice harvester Kristoff in Frozen. Her naivete and spontaneity come from having been cooped up inside the caste for most of her life with no friends. Thus she's excited to meet anyone and completely trust them, which eventually bites her in the butt.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Anna from Frozen. The traits that define her are her sheer optimism and energy.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "if-slightly-wiser", 
                    "romantic"
                ], 
                "role": "Plucky Girl: Though she is dejected by her sister's distance, Anna never loses faith that she can rekindle their relationship, and by the end of the film is still the kind, if-slightly-wiser romantic that she was in the beginning.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "Rebellious", 
                    "rebellious"
                ], 
                "role": "Rebellious Princess: The theme behind the cut song \"We Know Better\". Elsa is also a rebellious queen.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Screaming Woman: Parker.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [
                    "rebellious", 
                    "spunky"
                ], 
                "role": "Princess Anna in Frozen fits most of the defining traits mentioned above. While not overtly rebellious, she's very spunky and feisty, in contrast to her demure sister Elsa.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [
                    "young", 
                    "dangerous", 
                    "first", 
                    "naivete", 
                    "headlong", 
                    "cold", 
                    "first"
                ], 
                "role": "Frozen: Anna was sheltered from the outside world at a young age because of her sister's dangerous powers. When the castle finally opens to outsiders, she promptly falls in love with the first handsome man she sees who turns out to be taking advantage of her naivete and when her sister blankets the kingdom in Endless Winter, she rushes headlong into the cold to find a way to reach her without bothering to put some winter clothes on at first and nearly freezes to death as a result.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "next", 
                    "magical"
                ], 
                "role": "Elsa in Frozen. She represses her feelings and isolates herself from others because she is next in line to the throne...and she is absolutely terrified of screwing up. It doesn't help that anxiety makes her Power Incontinence worse...and her magical abilities are potentially deadly.", 
                "id": "TheWomanWearingTheQueenlyMask"
            }, 
            {
                "adjectives": [], 
                "role": "Anna in Frozen to contrast her sister Elsa.", 
                "id": "TomboyPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Queen Elsa from Disney's Frozen, an adaptation of Andersen's Snow Queen.", 
                "id": "WinterRoyalLady"
            }, 
            {
                "adjectives": [], 
                "role": "Winter Royal Lady: Elsa. Her cold beauty is only emphasized by her ice powers.", 
                "id": "WinterRoyalLady"
            }
        ]
    }, 
    "imdbid": "tt2294629", 
    "poster_url": "Frozen.jpg", 
    "similar": [
        {
            "shared": [
                "SpiritedYoungLady", 
                "EverythingsBetterWithPrincesses", 
                "SensitiveGuyAndManlyMan", 
                "HotWitch", 
                "GodSaveUsFromTheQueen", 
                "TomboyPrincess", 
                "LightFeminineAndDarkFeminine", 
                "Hunk", 
                "IceQueen", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 11, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "OverprotectiveDad", 
                "RebelliousPrincess", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "TomboyPrincess", 
                "Chickification", 
                "BadassPrincess", 
                "PluckyGirl", 
                "ActionGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 10, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad", 
                "ManInWhite", 
                "KickingAssInAllHerFinery", 
                "EverythingsBetterWithPrincesses", 
                "SensitiveGuyAndManlyMan", 
                "LightFeminineAndDarkFeminine", 
                "TheIngenue", 
                "PluckyGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 9, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "AmazonChaser", 
                "PrinceCharmless", 
                "KickingAssInAllHerFinery", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "PluckyGirl", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 8, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "SensitiveGuyAndManlyMan", 
                "DamselInDistress", 
                "PluckyGirl", 
                "TheIngenue", 
                "ActionGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 8, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }
    ], 
    "id": "Frozen", 
    "name": "Frozen"
}