{
    "plot": "The Elric brothers' mother is dead and their father has long since abandoned them. Deciding to perform a forbidden human transmutation to bring their mother back, they end up losing their bodies. Now Edward must join the military in order to gain certain alchemical privileges, with his one goal being to restore his brother to his original state. But with war on the horizon it's only a matter of time before they are both forced to question their morals and ultimately decide the value of human life.", 
    "genres": "Animation, Comedy, Drama", 
    "release_year": "2003–2004", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old", 
                    "current"
                ], 
                "role": "The Mustangs are a father and mother pair to the men of both their old unit and their current one, in the Elemental Chess Trilogy.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [], 
                "role": "Greed in Fullmetal Alchemist is introduced this way.", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [
                    "strong"
                ], 
                "role": "In Fullmetal Alchemist, Father is a strong candidate for the title of Greed's archenemy.", 
                "id": "ArchnemesisDad"
            }, 
            {
                "adjectives": [
                    "high-ranking", 
                    "Brigadier-General", 
                    "immediate"
                ], 
                "role": "Basque Grand of Fullmetal Alchemist. He's not the leader of the country, but he is a high-ranking officer (a Brigadier-General at the time of his death) and during his time as a Colonel Badass was Roy Mustang's immediate superior during the Ishvalan Civil War.", 
                "id": "BaldBlackLeaderGuy"
            }, 
            {
                "adjectives": [
                    "other", 
                    "long", 
                    "impressive", 
                    "own"
                ], 
                "role": "In Fullmetal Alchemist, Alex Luis Armstrong and Sig Curtis (who befriended each other through Pec Flex) work together to curb stomp Sloth in a scene that is Rated M for Manly.\n This is after Alex and his older sister Olivier got through a very long period of wearing him down; Sig only came in at the end, and the Armstrong team was pretty damn impressive in its own right.\n Ed and Al obviously do this, too. They have a lot of practice fighting together.\n When Ed and Ling or Ed and Greelin are working together, they generally produce shades of this even when not actively engaged in combat. With lots of bickering.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "common", 
                    "fic", 
                    "powerful"
                ], 
                "role": "Either Roy Mustang or Envy in Fullmetal Alchemist. With the latter, it's so common it's almost Fanon at this point, especially if they're basing the fic on the 2003 anime (where he's significantly more powerful, and his MO is basically For the Evulz).", 
                "id": "BastardBoyfriend"
            }, 
            {
                "adjectives": [
                    "stubble"
                ], 
                "role": "Fullmetal Alchemist's Roy Mustang sports a bit of stubble while  grieving the death of his best friend.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "Mix-and-Match", 
                    "hog/porcupine", 
                    "first", 
                    "human-based", 
                    "special"
                ], 
                "role": "As the series carries on in Fullmetal Alchemist the Chimaera stop being Mix-and-Match Critters and end up becoming more like these, by the end of the series we have a gorilla, a hog/porcupine mix, a frog or toad...thing, and a lion.\n Additionally, the first human-based chimeras introduced were people (special forces soldiers in the 2003 anime) who were combined with a dog, a bull, a snake, a lizard, and a crocodile, respectively.  Except for Bido the lizard chimera, they all killed rather quickly, though.", 
                "id": "BeastMan"
            }, 
            {
                "adjectives": [], 
                "role": "Sig Curtis of Fullmetal Alchemist.", 
                "id": "BigBeautifulMan"
            }, 
            {
                "adjectives": [], 
                "role": "Garfiel, the automail mechanic who apprentices Winry in Fullmetal Alchemist.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [], 
                "role": "Major Edward Elric from Fullmetal Alchemist earned his commission in Amestris' State Military at the tender age of twelve.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [], 
                "role": "Fuhrer King Bradley  aka Wrath, who despite being at least 60 and regularly complaining about feeling his age is one of the most badass characters in the Fullmetal Alchemist universe.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "love", 
                    "quite", 
                    "obvious", 
                    "happy", 
                    "first", 
                    "platonic"
                ], 
                "role": "This is hinted at just once in Fullmetal Alchemist, when the Animated Armor serial killer Barry the Chopper attacks Riza Hawkeye. Because she shoots him instead of freaking out and screaming, he decides that he's in love with her. She puts in a call to her commanding officer, Roy Mustang, who arrives on the scene to witness Barry putting his arms around her waist. It's quite obvious that Riza is not happy with the situation, and Roy reacts by growling and putting on his ignition gloves, telling her to move out of the way so he can set Barry on fire for the impertinence. (This is the first hint in the story that the relationship between Roy and Riza isn't exactly platonic.)", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Fullmetal Alchemist: The perfect mixture of culture and badass has been passed down the Armstrong family line for GENERATIONS!", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "military", 
                    "own", 
                    "first", 
                    "useful", 
                    "later", 
                    "new", 
                    "hatred"
                ], 
                "role": "Yoki from Fullmetal Alchemist constantly suffers the consequences of his scumbag actions, mostly because he keeps lying and backstabbing so he can bribe his way into a higher military rank. Every nasty scheme backfires, landing him in nastier and nastier situations to the point that he's the manga's resident Chew Toy. One of the characters even points out it's entirely his own fault how he gets into these messes. Eventually he finally starts to move out of this, first becoming actually useful, and then later showing some courage by ramming a car into Pride. This was the accusation of Kimblee against Pride. On realizing he was near death, Pride tried to take over Ed's body as a new host, just moments after explaining his hatred of humans. Kimblee couldn't stand the cowardice and hypocrisy.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Subverted in Fullmetal Alchemist. Hohenheim is called this by the other characters after he says he'd rather group up with Lan Fan alone to monopolize her attention. In actuality, he intends to let her leave to go find her Love Interest while he fights the Big Bad alone.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [
                    "huge", 
                    "blood-related", 
                    "entire", 
                    "bitter", 
                    "eventual"
                ], 
                "role": "Fullmetal Alchemist: Hohenheim left the family when Ed and Al were very young. He did have huge reasons, namely preventing his evil blood-related creation from absorbing the entire country into intself, becoming god, and conquering the world, but Ed is (understandably) still bitter about it.\n Envy is a bit more bitter about it, which leads to his extreme daddy issues and eventual patricide.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "significant", 
                    "sexy"
                ], 
                "role": "The AU Fullmetal Alchemist Edvy fanfiction The Seven Names of Envy Angevin involves this as a fairly significant part of the plot, having Envy disguise himself as 'Julia Vasquez', a flirty, sexy Hispanic girl immigrating from the States. It's also how he figures out he likes guys.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [
                    "male", 
                    "first", 
                    "female", 
                    "original", 
                    "Japanese"
                ], 
                "role": "Envy from Fullmetal Alchemist, who is male in the first anime series being Hohenhemin and Dante's son, but can shapeshift into a woman if he wishes. In the official character book for the manga, the section under Envy is described as \"Of uncertain gender.\" He even had a female voice actor in the original Japanese, English, and Hungarian dubs, and this appearance is played for laughs in the Chibi Party OVA.", 
                "id": "DudeLooksLikeALady"
            }, 
            {
                "adjectives": [
                    "manipulative", 
                    "sympathetic", 
                    "complex"
                ], 
                "role": "Averted with Roy Mustang from Fullmetal Alchemist. He initially seems aloof and manipulative, but not only is a hero, but one of the most sympathetic, complex and detailed characters in the series.", 
                "id": "EvilRoy"
            }, 
            {
                "adjectives": [
                    "standard", 
                    "final", 
                    "hot"
                ], 
                "role": "Van Hohenheim from Fullmetal Alchemist looks older than the standard  and is MUCH. much older than he looks, but fits in like whoa.\n Hughes too.\n Father in his final form. It helps that he looks like a younger Hohenheim\n And in the end of the manga, Ed becomes a hot dad too. With Winry as his Hot Mom companion.", 
                "id": "HotDad"
            }, 
            {
                "adjectives": [
                    "wider-reaching", 
                    "up—they", 
                    "true", 
                    "few", 
                    "extra", 
                    "wrong", 
                    "long-term"
                ], 
                "role": "The Elric brothers seem like this at the beginning of Fullmetal Alchemist, before the wider-reaching plot arcs start up—they travel from place to place, righting wrongs and searching for leads on how to get their bodies back.\n Especially true in the 2003 anime version, which had a few extra filler episodes near the beginning that consisted almost entirely of the Elrics going somewhere, righting some wrong, and going along their merry way, with the episode tying in minimally or not at all to the long-term plot.", 
                "id": "KnightErrant"
            }, 
            {
                "adjectives": [
                    "over-the-top", 
                    "whole", 
                    "sexual"
                ], 
                "role": "Fullmetal Alchemist's Garfiel. Though he might be more of a Camp Gay character depending on how you interpret him (he even cross-dresses from time to time and has an over-the-top feminine walk).\n Alex Louis Armstrong might count as this, although there's only one incident in the whole manga that goes even as far as innuendo about his sexual orientation. Then again, this trope may have been passed down the Armstrong Line for generations!", 
                "id": "MachoCamp"
            }, 
            {
                "adjectives": [
                    "Several", 
                    "white", 
                    "wear", 
                    "white", 
                    "humanoid", 
                    "white", 
                    "true"
                ], 
                "role": "Several characters in Fullmetal Alchemist donned in white exemplify Light Is Not Good:\n Solf J. Kimblee took to wearing a white suit after his release from prison. The author has stated this is because she thinks people who wear white suits are weird.\n Fans have also taken to calling the unnamed alchemist working for Father simply \"the man in white\".\n Father's humanoid forms are outfitted in white togas, while his true form is a Living Shadow.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [
                    "poor", 
                    "horrible", 
                    "other"
                ], 
                "role": "Poor, poor Edward Elric. This canonically extremely badass teenage Child Soldier character seems to do nothing in Yaoi fanfics except get pregnant and suffer horrible Badass Decay every time he turns around. The other father is most commonly his commanding officer who is fourteen years older than him, except for that time Envy was the \"mom.\"", 
                "id": "MisterSeahorse"
            }, 
            {
                "adjectives": [], 
                "role": "Edward and Alphonse Elric from Fullmetal Alchemist both dearly loved their mother Trisha, so much that they didn't want to accept her death and attempted to revive her.", 
                "id": "MommasBoy"
            }, 
            {
                "adjectives": [
                    "mechanical", 
                    "open"
                ], 
                "role": "Winry, from Fullmetal Alchemist, shows the ability to fix most mechanical gadgets and break open locks (sealed with alchemy!) in addition to being a master of fixing automail.", 
                "id": "MrFixit"
            }, 
            {
                "adjectives": [], 
                "role": "Ling from Fullmetal Alchemist.", 
                "id": "NoShirtLongJacket"
            }, 
            {
                "adjectives": [
                    "other", 
                    "occasional"
                ], 
                "role": "In Fullmetal Alchemist, Major Armstrong lives this trope, especially compared to the behavior of most of the other officers in the Amestrian Army, who range from sexist pigs, shameless flirts, Badass Briggs soldiers and pencil necked stiffs (with the occasional psychopath thrown into the mix).", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "old", 
                    "loyal"
                ], 
                "role": "Pride in Fullmetal Alchemist. Somewhat of a subversion since he's actually over three centuries old, but he still sees himself as his father's loyal child.", 
                "id": "OverlordJr"
            }, 
            {
                "adjectives": [
                    "three-year-old"
                ], 
                "role": "Pictured above: In Fullmetal Alchemist, Maes Hughes holds three-year-old boys at gunpoint as they attempt to play with his daughter Elysia on her birthday. Complete with Scary Shiny Glasses.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "bloody", 
                    "epic"
                ], 
                "role": "Alex Louis Armstrong of Fullmetal Alchemist. It has been ♥♥♥ PASSED DOWN THE ARMSTRONG LINE FOR GENERATIONS! ♥♥♥\n He befriended Sig Curtis, Izumi's husband, through a flex-off. It was bloody hilarious. And it was followed by BLOODY AWESOME!\n Speaking of Curtis, his Pec Flex was so epic his shirt exploded.", 
                "id": "PecFlex"
            }, 
            {
                "adjectives": [
                    "tough", 
                    "short-tempered", 
                    "sensitive"
                ], 
                "role": "In Fullmetal Alchemist, Edward Elric is tough and short-tempered and his brother Alphonse is a sensitive Kindhearted Cat Lover.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "androgynous", 
                    "effeminate", 
                    "murderous", 
                    "much", 
                    "unusual", 
                    "female", 
                    "worth", 
                    "gender-neutral", 
                    "male"
                ], 
                "role": "Fullmetal Alchemist\n Envy has an extremely androgynous appearance, coupled with an effeminate outfit. However, he is a ruthless, murderous nutcase who goes out of his way to cause as much suffering as he can.\n Envy is something of an unusual case, as they technically don't have a gender, with the (default) form they choose to take being somewhere between female and male. It should, however, be worth noting that most characters through the series refer to Envy using male pronouns, though this is because in the English language, \"He\" is the gender-neutral pronoun someone is supposed to say when the gender is unknown.\n This is only the case in the manga and Brotherhood anime. In the 2003 anime, Envy is definitely male and Ed's older brother.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "own", 
                    "good"
                ], 
                "role": "Sig Curtis from Fullmetal Alchemist is a butcher, but isn't particularly violent. Don't provoke him, though. It's for your own good.", 
                "id": "TheButcher"
            }, 
            {
                "adjectives": [
                    "adoptive", 
                    "original", 
                    "straight"
                ], 
                "role": "Subverted in the manga version of Fullmetal Alchemist where Roy Mustang pretends he's this to cover up the fact that  he uses prostitutes, whose madam is his adoptive mother, as spies. The original anime plays this straight because the subversion happens after the anime Overtook the Manga.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [
                    "legendary", 
                    "beautiful", 
                    "good", 
                    "very", 
                    "powerful", 
                    "full-body"
                ], 
                "role": "Fullmetal Alchemist:\n The legendary Major Armstrong has shades of this trope in both his combat skill and utter infatuation with himself and his beautiful muscles. Definitely a good guy though.\n There's also the homunculus Greed, who rarely uses his very powerful full-body armored form, because it makes his face ugly.\n Kimblee's a bit paranoid about getting blood on his suit, not that it ever stops him. He also seems to care quite a bit for his hat, too.", 
                "id": "TheFightingNarcissist"
            }, 
            {
                "adjectives": [
                    "high", 
                    "reflective", 
                    "new"
                ], 
                "role": "From Fullmetal Alchemist: Ed is the Hunter, Mustang is the Lord, and Hohenheim is the Prophet.\n Alternatively, Ling as the Hunter (eager to prove himself to become the emperor), Roy as the Lord (experienced, high ranked, and has to balance his goal of overthrowing the government with investigating  Hughes's murder), and Ed as Prophet (the most reflective of the three, he advises Ling not to search for the philosopher's stone, has given up on reviving his mother, his new goal is to correct his wrongs)", 
                "id": "TheThreeFacesOfAdam"
            }, 
            {
                "adjectives": [
                    "half-naked", 
                    "next", 
                    "several", 
                    "new"
                ], 
                "role": "Fullmetal Alchemist\n Both Greed and Ling in the manga wear vest/jacket-type things that nevertheless leave their chests and tummies nice and visible. Foreshadowing?\n In Chapter 104,  after Father absorbs God, he ends up looking just like Hohenheim. Specifically, a half-naked, teenage Hohenheim. And he spends the next several chapters like this too. Quickly turns into Fan Disservice after Hohenheim's countermeasure strips him of the souls needed to comfortably contain his new power, causing unsightly, bulging veins to pop all over his body.\n Armstrong is always getting his shirt ripped off when he flexes his muscles.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "other", 
                    "several", 
                    "internal"
                ], 
                "role": "Izumi Curtis from Fullmetal Alchemist is a housewife and proud of it, and more or less adopted the protagonists after they lost their mother. She can - and does - beat up most of the other characters in the series (and, for bonus points, does so despite the fact that she's missing several internal organs).", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "single", 
                    "person/chimera/immortal", 
                    "brilliant"
                ], 
                "role": "Izumi Curtis from Fullmetal Alchemist will proudly proclaim herself a House Wife while simultaneously kicking the ass of every single person/chimera/immortal who dares to hurt her surrogate kids. Then she beats said surrogate kids up herself! And when your surrogate kids are two of the most brilliant combat alchemists in the world, that's saying something.", 
                "id": "ApronMatron"
            }, 
            {
                "adjectives": [
                    "Four-Star"
                ], 
                "role": "Princess Mei Chang from Fullmetal Alchemist (manga and Brotherhood) is definitely this, combined with Cute Bruiser and Badass Adorable.\n Olivier Mira Armstrong, the Four-Star Badass in charge of the Briggs Fortress, is this without actually being royalty; in the manga, her men are shown to occasionally refer to her as \"the Princess\" or \"our Queen\".", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Maria Ross in Fullmetal Alchemist has one too. When Envy impersonates her, he forgets to add it, so Hughes realizes something's up. It doesn't save him.", 
                "id": "BeautyMark"
            }, 
            {
                "adjectives": [], 
                "role": "Lust and Sloth from Fullmetal Alchemist act as two of Dante's bodyguards for the most part.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [], 
                "role": "Pinako Rockbell, Winry's grandmother from Fullmetal Alchemist.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [], 
                "role": "Elysia Hughes to her father Maes, in Fullmetal Alchemist.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "attractive", 
                    "bloodlust"
                ], 
                "role": "Lust from Fullmetal Alchemist. Although she's quite attractive, her personality isn't very sexualised, leading some fans to theorise that she's actually bloodlust.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "in-story", 
                    "busy", 
                    "un-princessy", 
                    "regal"
                ], 
                "role": "Fullmetal Alchemist\n The manga mostly avoids the trope, but does have one character — Mei Chang — who is a daughter of the Emperor of Xing. She's only rarely identified in-story as a princess, however, and almost never acts like one; she's too busy being Badass Adorable.\n In what can only be described as a subversion, there's also Olivier Mira Armstrong, whose mannerisms are about as un-princessy as you can get while still being a regal Lady of War. But in the manga, her men (the Briggs Bears) occasionally refer to her as \"the Princess\" as a sign of their love and respect.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "In episode 27 of Fullmetal Alchemist: Brotherhood, Pinako of all people appears to have been this.", 
                "id": "HardDrinkingPartyGirl"
            }, 
            {
                "adjectives": [
                    "military", 
                    "top"
                ], 
                "role": "Riza Hawkeye from Fullmetal Alchemist. Admittedly, it's a military uniform and not a \"suit\" per se, but it's undeniably badass.\n Olivia Armstrong too. She even wears a fur lined Badass Long Coat over the top of her uniform occasionally.", 
                "id": "HotChickInABadassSuit"
            }, 
            {
                "adjectives": [
                    "scary", 
                    "Social", 
                    "current", 
                    "military"
                ], 
                "role": "General Olivier Armstrong from Fullmetal Alchemist is held to be scary by her soldiers, her family, and The Protagonist. She, a Social Darwinist, ruthlessly and literally cuts the current military government down to size so that she can become Fuhrer, and she, despite her extremism, is still considered a protagonist.", 
                "id": "IronLady"
            }, 
            {
                "adjectives": [
                    "slinky"
                ], 
                "role": "In Fullmetal Alchemist, when Alphonse is abducted by Greed and his chimera, Al's beloved alchemy master Izumi calmly strolls into the sewers and beats the crap out of anyone who gets in her way. Her chosen attire for the occasion is a slinky black cocktail dress.", 
                "id": "KickingAssInAllHerFinery"
            }, 
            {
                "adjectives": [
                    "powerful", 
                    "competent", 
                    "short", 
                    "loyal"
                ], 
                "role": "Major General Olivier Mira Armstrong in Fullmetal Alchemist. She is legitimately terrifying, cool as a cucumber, powerful as hell, incredibly competent, and also a bit of a bitch. She can call Ed short and he doesn't even try to argue. She refuses to abandon her subordinates, though she refuses to actually admit she cares. They are very loyal.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Fullmetal Alchemist:\n There's one female in each group of eight - Action Girl Riza Hawkeye as Light Feminine, The Vamp Lust as Dark Feminine.\n During the latter parts of the series, on the heroes side we have both the aforementioned Hawkeye as Light Feminine and Major General Iron Lady Olivier Armstrong as the Dark, who also play on the pairing.", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "cute", 
                    "good"
                ], 
                "role": "May Chang in Fullmetal Alchemist has cute braids, a little panda and very good manners. She also keeps pace with Scar and Ed when fighting off monsters.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [
                    "cute", 
                    "adorable", 
                    "cute", 
                    "young"
                ], 
                "role": "Fullmetal Alchemist: Riza Hawkeye is the Crazy Alchemist's Beautiful Daughter.\n Not to mention Nina. Sure, she is just five and anything but a love interest to the heroes, but she is cute, adorable, adores her State Alchemist Dad who shelters her  and maybe would have grown into a very cute young woman if her father hadn't used her for chimera experiments that ultimately doomed her.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Lust from Fullmetal Alchemist.\n Interestingly she bemoans that Jean Havoc was smart enough not to tell her anything despite her best attempts", 
                "id": "MataHari"
            }, 
            {
                "adjectives": [
                    "Sheska/Sczieska", 
                    "ineffective", 
                    "several", 
                    "hot"
                ], 
                "role": "Fullmetal Alchemist: Sheska/Sczieska even works in a library.\n At one point in the story, Riza pops out the lenses from Fury's glasses and parades around in them, as a (somewhat ineffective) disguise. She also wears glasses in several omakes and a video game. The \"reason\" for all this seems to be she just looks hot in them.\n Discussed Trope in the movie's extras when the director Mizushima and Rie Kugimiya (Alphonse) talk about glasses for three minutes and invoke the popularity of the meganekko.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "adoptive"
                ], 
                "role": "Roy's aunt and adoptive mother Madame Christmas in Fullmetal Alchemist.", 
                "id": "MissKitty"
            }, 
            {
                "adjectives": [
                    "few", 
                    "dead", 
                    "disastrous", 
                    "young", 
                    "unstable", 
                    "own", 
                    "birth", 
                    "young", 
                    "biological"
                ], 
                "role": "Fullmetal Alchemist has more than a few examples.\n The Elric brothers' mother, Trisha, is dead, so both boys tried to rectify the situation by attempting to bring her back to life through alchemy (with disastrous results), both basically become the parent to the other. Edward is also hostile to the notion of his father.\n Winry Rockbell is raised by her grandmother Pinaco after both parents were killed by Scar during the Ishval War.\n Scar's parents are killed by Kimblee when he attacks the area where Scar lives.\n Riza's mother presumably died when she was young leaving her with her mentally unstable father.\n Nina Tucker's mother was killed, though she thinks that her mother abandoned her. More precisely, Shou Tucker turned his own wife into a chimera, and she died shortly afterwards.\n Mustang's birth parents died when he was a young child. He was raised by one Madame Christmas.  Who is actually his biological aunt.\n The homunculi have a father, but no mother. This is first addressed by Pride, when he mentions that he never knew what it was like to have a mother until he was adopted by Mrs. Bradley.\n Wrath in the 2003 anime version. He rejects Izumi as his mother when he eventually meets her, and loses his surrogate mother Sloth near the end of the series. In The Movie, he and Izumi are ultimately Together in Death.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "various", 
                    "own", 
                    "own", 
                    "young", 
                    "..but", 
                    "personal", 
                    "comical", 
                    "famous"
                ], 
                "role": "Fullmetal Alchemist plays with this in various ways, primarily averting it. Lan Fan plays it straight, having been raised and trained by her grandfather to continue the family business of guarding the Yao Clan's heir. Riza Hawkeye made her own career, but story wise she's mostly defined as Roy's right hand. Especially incriminating is that Roy was her father's apprentice and he was the one who learned flame alchemy, whereas her part in it was to act as a living document of the technique. Izumi Curtis and Oliver Mira Armstrong both avert this completely, having gained everything through their own efforts. Izumi goes on to become the Badass Teacher of the Elric Brothers, while she acted as the young brothers' guardian. Meanwhile, Oliver is the daughter of a retired General.....but as a Social Darwinist, she actively rejects connections having value over personal ability. In a comical moment, it's revealed that the famous Armstrong Super Strength and size comes from their mother. Finally, Winry Rockbell is another example that averts the trope. The Rockbell Automail business was founded by Pinako, who continues to run it while training her granddaughter everything she knows. Her son chose to become a doctor, leaving Winry as the heir to the business.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Winry Rockbell and May Chang from Fullmetal Alchemist. Riza Hawkeye and Izumi Curtis are adult versions.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "sweet", 
                    "willing", 
                    "little"
                ], 
                "role": "Fullmetal Alchemist:\n Ed and Al Elric's Missing Mom Trisha. In all the flashbacks she is sweet and loving to her kids and willing to wait forever for her husband.\n Hughes's wife Gracia and the Armstrongs's little sister Katharine.", 
                "id": "ProperLady"
            }, 
            {
                "adjectives": [
                    "polite", 
                    "monstrous"
                ], 
                "role": "Fullmetal Alchemist: Selim Bradley is the king's son and generally polite (aside from bugging Edward by calling him small.) Although that's an act, and he is actually the monstrous Pride...and \"Father\" doesn't give a damn about him. After his rebirth, he seems to be this once and for all, being concerned about an injured bird.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "iron-fisted", 
                    "much", 
                    "young", 
                    "nice-looking", 
                    "weak", 
                    "foolish", 
                    "single", 
                    "military", 
                    "ambitious", 
                    "own"
                ], 
                "role": "In Fullmetal Alchemist, Lust is this.\n Olivier Mira Armstrong, iron-fisted queen of the Briggs fortress, is very much a Sexpot Rosa Klebb, being a young, nice-looking lady with immunity to Mustang's charms (deeming him weak and foolish), and not a single instance of using her looks to get what she wants.  Subverted in that she is, at her worst, a Neutral Hero Antagonist. She cares about her men and, unlike most of the military leaders, isn't tempted by promises of immortality. While ominously ambitious, she readily lays her own plans aside to save her country from Father.", 
                "id": "TheBaroness"
            }, 
            {
                "adjectives": [
                    "sweet", 
                    "naive", 
                    "well-meaning"
                ], 
                "role": "May Chang from Fullmetal Alchemist is a sweet, naive and well-meaning princess. Did we mention that she can also kick your ass?", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "logical"
                ], 
                "role": "In Fullmetal Alchemist, Winry gives Ed some earrings to look after. It's actually for a logical reason, but it's clearly intended to hint at this trope.", 
                "id": "TheLadysFavour"
            }, 
            {
                "adjectives": [
                    "equal", 
                    "large", 
                    "female", 
                    "overall", 
                    "perfect"
                ], 
                "role": "Fullmetal Alchemist, in general. This is a universe which seems to have a universal draft, or at least equal opportunities for women, as there's a pretty large percentage of female soldiers, including Riza Hawkeye, Olivier Armstrong, Maria Ross, Rebecca Catalina, and a decent number of background soldiers, overall amounting ten to fifteen perfect of the soldiers shown. Martel was also once a soldier before she became a Chimera.", 
                "id": "TheSquadette"
            }, 
            {
                "adjectives": [
                    "good", 
                    "complete", 
                    "memorable", 
                    "adorable", 
                    "hot", 
                    "gorgeous", 
                    "other", 
                    "him◊"
                ], 
                "role": "A near textbook case is in Fullmetal Alchemist, where Alex Armstrong gets the idea that Lt. Havoc would just love to date his sister Catherine. After Havoc spends a good deal of time freaking over what she'll look like after seeing her super-stout father and giantess mother (complete with the memorable \"Pomato\" theory), it turns out that Catherine is an adorable moe girl that looks nothing like her brother, father, or mother...who then promptly rejects him. Additionally, Alex also has the totally hot, absurdly badass sister Olivier Armstrong. (An Omake from the manga shows that in addition to Alex's two gorgeous sisters, he also has two other sisters who look just like him◊, only bigger.)", 
                "id": "TheUglyGuysHotDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Lust from Fullmetal Alchemist", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [], 
                "role": "Lust from Fullmetal Alchemist", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [
                    "old", 
                    "medical"
                ], 
                "role": "Winry Rockbell of Fullmetal Alchemist (pictured above). Winry made her first automail when she was eleven years old, and her Weapon of Choice is a wrench. You never see her covered in grease tough, since automail construction is very fine work and actually more a medical profession.\n Her grandmother Pinako is also one of these.", 
                "id": "WrenchWench"
            }
        ]
    }, 
    "imdbid": "tt0421357", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "BeastMan", 
                "CrazyJealousGuy", 
                "MadScientistsBeautifulDaughter", 
                "ALadyOnEachArm", 
                "DaddysGirl", 
                "TheUglyGuysHotDaughter", 
                "DisappearedDad", 
                "TheFightingNarcissist", 
                "EverythingsBetterWithPrincesses", 
                "ProperLady", 
                "DirtyCoward", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 14, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "WalkingShirtlessScene", 
                "DirtyCoward", 
                "MisterSeahorse", 
                "SpoiledSweet", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "OfficerAndAGentleman", 
                "TheCasanova", 
                "SensitiveGuyAndManlyMan", 
                "MommasBoy", 
                "PecFlex", 
                "DisguisedInDrag"
            ], 
            "shared_count": 13, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "ChildSoldiers", 
                "TheBaroness", 
                "DirtyCoward", 
                "MisterSeahorse", 
                "CoolOldGuy", 
                "DarkActionGirl", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "AFatherToHisMen", 
                "PluckyGirl"
            ], 
            "shared_count": 11, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "WalkingShirtlessScene", 
                "LittleMissBadass", 
                "TheThreeFacesOfAdam", 
                "AFatherToHisMen", 
                "TheCasanova", 
                "OverlordJr", 
                "LadyOfWar", 
                "BodyguardBabes", 
                "MommasBoy", 
                "BadassPrincess"
            ], 
            "shared_count": 11, 
            "id": "Dune", 
            "name": "Dune", 
            "poster_url": "Dune.jpg"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "CrazyJealousGuy", 
                "DaddysGirl", 
                "NoShirtLongJacket", 
                "SissyVillain", 
                "DirtyCoward", 
                "OverlordJr", 
                "TheVamp", 
                "BodyguardBabes", 
                "TheBaroness"
            ], 
            "shared_count": 10, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }
    ], 
    "id": "FullmetalAlchemist", 
    "name": "Fullmetal Alchemist"
}