{
    "plot": "Phillip Fry is a 25-year-old pizza delivery boy whose life is going nowhere. When he accidentally freezes himself on December 31, 1999, he wakes up 1,000 years in the future and has a chance to make a fresh start. He goes to work for the Planet Express Corporation, a futuristic delivery service that transports packages to all five quadrants of the universe. His companions include the delivery ship's captain, Leela, a beautiful one-eyed female alien who kicks some serious butt, and Bender, a robot with very human flaws.", 
    "genres": "Animation, Comedy, Sci-Fi", 
    "release_year": "1999–", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "capable", 
                    "same", 
                    "last", 
                    "same", 
                    "new", 
                    "new", 
                    "later", 
                    "last"
                ], 
                "role": "Good news everyone! Professor Farnsworth of Futurama, who is also very old.  And capable of making you read this in his voice.\n Extra credit goes to the episode \"A Big Ball of Garbage\", where he goes to an inventors' competition, realizes the invention he brought (the death clock) is the same one he showed last year, attempts to invent the same thing again after it's pointed out to him (\"I need a new invention! Perhaps some kind of death clock...\"), quickly creates a new invention (the smell-o-scope) to replace it, then only hours later... \"Eureka!\" \"You built the smell-o-scope?\" \"No, I remembered that I'd already built it last year!\"", 
                "id": "AbsentMindedProfessor"
            }, 
            {
                "adjectives": [
                    "Transcended", 
                    "early", 
                    "real", 
                    "black", 
                    "seminal"
                ], 
                "role": "Transcended metaphorically in early episodes of Futurama which let Bender the robot speak up on behalf of the oppressed robot class. His dissatisfaction with life on Earth sometimes mirrored real life criticisms made by black nationalists, notably in the episode \"Fear of a Bot Planet,\" the episode title itself an allusion to a seminal Public Enemy album.", 
                "id": "AngryBlackMan"
            }, 
            {
                "adjectives": [
                    "human-robot"
                ], 
                "role": "Parodied in Futurama where Professor Farnsworth is against human-robot marriages because he dated a robot who eventually left him.", 
                "id": "ArmouredClosetGay"
            }, 
            {
                "adjectives": [], 
                "role": "Futurama episode \"Where No Fan Has Gone Before\": Melllvar hits this trope dead center.", 
                "id": "BasementDweller"
            }, 
            {
                "adjectives": [
                    "pointed", 
                    "evil"
                ], 
                "role": "In the Futurama episode \"Lesser of Two Evils,\" Fry assumes that Flexo, a bending unit who looks identical to Bender except for a pointed beard, must be Bender's Evil Twin. He isn't, Bender is the evil one.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "beard-shaped", 
                    "few"
                ], 
                "role": "Futurama: Whenever Bender stops drinking, he develops a beard-shaped patch of rust. Fry occasionally develops a beard of sorrow in a few episodes.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "first", 
                    "later", 
                    "first", 
                    "sexual", 
                    "second"
                ], 
                "role": "Futurama: Zapp Brannigan. He sure acts like a stud. But on first meeting Leela in \"Love's Labours Lost in Space\" she ends up having pity sex with him; This is later revealed to be his first, and for some time after, only sexual encounter. (The second was something he probably would have liked to forget...)", 
                "id": "CasanovaWannabe"
            }, 
            {
                "adjectives": [
                    "male", 
                    "attractive", 
                    "female", 
                    "strong", 
                    "Amy—who", 
                    "Kif—tried"
                ], 
                "role": "In Futurama episode \"The Butterjunk Effect,\" Fry gets sprayed with pheromones from a male alien Butterfly and becomes irresistibly attractive to women who take the \"performance enhancer\" known as \"nectar,\" since it causes them to emit female butterfly pheromones. It's so strong even Amy—who is technically married to Kif—tried to have sex with him.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "good", 
                    "old"
                ], 
                "role": "On Futurama, they did the Freud Was Right version: Bender's antenna has to be snipped so they can get satellite. The entire apartment complex can't get satellite. By the end of the episode, Bender's antenna was reattached, and they moved back in to good old Robot Arms, with Fry still in the closet.", 
                "id": "CircumcisionAngst"
            }, 
            {
                "adjectives": [
                    "many", 
                    "other", 
                    "next", 
                    "second", 
                    "sweet", 
                    "nearby", 
                    "very", 
                    "same", 
                    "H-Word", 
                    "only", 
                    "charged"
                ], 
                "role": "There are many examples from Futurama\n When the chips are down, Zapp Brannigan is a coward. This quote from him sums it up.\n Bender. In one of the movies, he, Amy and one other character are trapped by a bunch of orcs in a castle. Bender tells the two ladies he has a plan, The next scene shows him holding them up in the and tells the orcs to take his friends first, just to give him one more second of sweet sweet life. In \"Bendin' in the Wind,\" the crew is plunging off a cliff. Bender grabs a nearby cable, loudly declaring, \"I'll save ME!\" The rest of the crew is only saved by grabbing his legs just in time.\n Fry is also this. In \"The Series Has Landed\" Fry gets a moon rover caught in a lunar dust pool. He declares \"It's every man for himself!\" and bails out, only to sink up to his neck in the very same dust. He immediately calls for Leela to save him. He gets called this in \"War is the H-Word\" when he, wielding the only charged phaser, blasts himself a hole to hide in. Though at the end of that episode, he does ride a bouncing ball to the peace meeting to save the life of his best friend.\n Towards the end of the series Leela would seem to override Fry's cowardice, particularly in \"A Farewell to Arms\"  Fry chooses to stay behind on an apparently doomed Earth to let Leela have a chance of life.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "robo-sex"
                ], 
                "role": "Bender does this on Futurama. In the episode \"Raging Bender\" he is forced to wrestle as the Gender Bender, in a tutu and blonde wig. And in \"Bend Her\", he undergoes a robo-sex change to compete in the Olympics under the name Coilette.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [], 
                "role": "Fry from Futurama chased comically after Leela. As time went on Leela returned more and more of his affection.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "anthropomorphic", 
                    "white"
                ], 
                "role": "Futurama\n Parodied with the anthropomorphic chicken lawyer.\n Played straight in the Atlantic episode with a Fat Southern Merman in a white suit.", 
                "id": "FatSweatySouthernerInAWhiteSuit"
            }, 
            {
                "adjectives": [], 
                "role": "Referenced in Futurama:", 
                "id": "Gayngster"
            }, 
            {
                "adjectives": [
                    "Near-Death", 
                    "skeptical", 
                    "160-year-old"
                ], 
                "role": "Played with in the Futurama episode \"A Clone of My Own\". When Fry has to pretend to be the professor so the Planet Express crew can sneak into the Near-Death Star, but the robot guards are skeptical about his age, Fry instantly convinces them he is a 160-year-old man by shouting \"Hey, you kids! Get off my lawn!\"", 
                "id": "GrumpyOldMan"
            }, 
            {
                "adjectives": [
                    "reclusive", 
                    "hobo-levitating", 
                    "aromatic", 
                    "first"
                ], 
                "role": "Futurama has hobos... in space! Bender meets a reclusive chef Helmut Spargle who lives in a space hobo metropolis. Using only leftovers and garbage, Spargle can bake a pie with hobo-levitating aromatic properties (because they have jet packs somehow).\n The hobos actually refer to Bender as a robo, a Robot Hobo; at first he's offended, because he thought they said \"romo\".", 
                "id": "Hobos"
            }, 
            {
                "adjectives": [
                    "amoral", 
                    "alcoholic", 
                    "several", 
                    "few", 
                    "diplomatic"
                ], 
                "role": "Bender from Futurama. He's a rude, amoral, alcoholic, kleptomaniac robot whose hooked up with several fembots and even a few human women, though this may be chalked up to All Girls Want Bad Boys.\n They also lampshade Kissinger's success when Nixon is lauding his diplomatic skills.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [], 
                "role": "On Futurama, Fry and Bender are shown multiple times to live like this.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [
                    "aptly-named", 
                    "pregnant", 
                    "home-brewed", 
                    "birth", 
                    "ale", 
                    "implant", 
                    "oblivious", 
                    "complete", 
                    "other", 
                    "high-ranked"
                ], 
                "role": "Futurama:\n Done with the alien Kif in the aptly-named \"Kif Gets Knocked Up A Notch\". Apparently, his species has a strange method of reproduction.\n \"The Route of All Evil\" has Bender \"pregnant\" with home-brewed beer. Complete with \"birth\". \"It's an ale! 5 gallons, four ounces!\"\n Zapp Brannigan technically has this happen to him in one of the comics. Captured by a species of alien he was leading a war against, they secretly implant larva in his body and stuff him with food, intending to use him as a kind of combination unwitting suicide bomber and troop transport. The oblivious Brannigan would be returned to his side when the larvae were near complete development, enabling them to rip their way out of his body and start killing the other high-ranked officials.", 
                "id": "MisterSeahorse"
            }, 
            {
                "adjectives": [], 
                "role": "Walt, Larry and Igner of Futurama are a trio of this trope. They allow themselves to be entirely dominated by their mother, Mom. Igner is a retard, Larry is a coward, and Walt has the worst Oedipus Complex you'll ever see.", 
                "id": "MommasBoy"
            }, 
            {
                "adjectives": [
                    "stand-up"
                ], 
                "role": "Fry from Futurama. While he certainly has his moments (only person who can defeat the Brainspawn?), in most stand-up fights he's cowering behind Leela.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [
                    "twenty-six-star", 
                    "lecherous", 
                    "irresponsible", 
                    "moronic"
                ], 
                "role": "Though a twenty-six-star General rather than a captain, \"captain\" Zapp Brannigan subverted this in Futurama with his incredibly lecherous (and cowardly, and irresponsible, and moronic...) behaviour.", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "luscious", 
                    "wiggle"
                ], 
                "role": "Futurama has Barbados Slim, and his luscious pecs. They apparently wiggle by themselves.", 
                "id": "PecFlex"
            }, 
            {
                "adjectives": [], 
                "role": "Zap Brannigan in Futurama.", 
                "id": "PrinceCharmingWannabe"
            }, 
            {
                "adjectives": [
                    "own", 
                    "different"
                ], 
                "role": "Futurama: Fry still managed to impregnate his own grandmother despite wearing tighty-whities.\n Bit of an inversion really, because not only was Fry's grandmother covered up more so than Fry, she was wearing different lingerie than what she had when she jumped on him.", 
                "id": "RightThroughHisPants"
            }, 
            {
                "adjectives": [], 
                "role": "Professor Farnsworth in Futurama once fell asleep while skiing and woke up at the lodge with a bronze medal around his neck.\n Less Then Hero had this gem:", 
                "id": "SeniorSleepCycle"
            }, 
            {
                "adjectives": [
                    "classic", 
                    "courageous", 
                    "other", 
                    "weary", 
                    "boisterous"
                ], 
                "role": "Zapp Brannigan and Kif Kroker from Futurama. Zapp is a classic Ted Baxter Captain, and sees himself as a manly courageous stud. Kif on the other hand starts out as a weary Deadpan Snarker but grows more into the Sensitive Guy mold through his relationship with Amy.\n A lesser example would be the Fry the Socially-Awkward Hero and Bender the boisterous Hedonist.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [], 
                "role": "The Futurama episode \"Raging Bender\" has Bender become a pro wrestler, though after his popularity dies down, he's forced to become a crossdressing sissy heel called the Gender Bender.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "muscular"
                ], 
                "role": "Mocked in Futurama when a muscular, dashing, macho man knocks down Fry's sand castle and hits on Leela. She rejects him, but when he tells her it was a business proposition that they didn't understand, she offers to go for a stroll with him, slightly disappointed that he wasn't attracted to her. He then adds insult to injury by telling Leela \"No thanks ma'am, I'm actually gay\" and walking off.", 
                "id": "StraightGay"
            }, 
            {
                "adjectives": [
                    "former", 
                    "martial"
                ], 
                "role": "Fnog, Leela's former martial arts instructor in Futurama. \"Better than being a girl. Like you. You're a girl!\"", 
                "id": "StrawMisogynist"
            }, 
            {
                "adjectives": [
                    "personal", 
                    "ugly", 
                    "enormous"
                ], 
                "role": "In the Futurama episode \"Benderama\", the crew has to deliver personal hygiene supplies to an ugly giant. He is 50 feet tall, and while most of his body parts are enormous, one part...isn't.", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [], 
                "role": "Futurama: In \"Neutopia\", Fry gets hit in the crotch, but it doesn't hurt. He checks and immediately notices the problem.", 
                "id": "TestesTest"
            }, 
            {
                "adjectives": [], 
                "role": "Bender from Futurama, although he usually goes after hookerbots, and does fall in love occasionally.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [
                    "rich"
                ], 
                "role": "Fry on Futurama. Also, Amy is a Rare Female Example; it helps that she's rich though.\n What about Bender? He's turned doing nothing into an art form.", 
                "id": "TheSlacker"
            }, 
            {
                "adjectives": [
                    "big", 
                    "prosthetic", 
                    "second", 
                    "only"
                ], 
                "role": "Futurama: Fry doesn't seem to have a problem with Leela's big ol' eye. In fact, when Leela gets a prosthetic second eye in \"The Cyber House Rules\", Fry is the only one who objects, saying that he liked her better the way she was. Eventually she renounces her decision, admitting Fry was right all along. (Although she still tells him to shut up after he cheers)", 
                "id": "UnderstandingBoyfriend"
            }, 
            {
                "adjectives": [], 
                "role": "Barbados Slim, Futurama.", 
                "id": "WalkingShirtlessScene"
            }, 
            {
                "adjectives": [
                    "stubble"
                ], 
                "role": "Flexo's metal beard in Futurama.\n Also Bender sports rust stubble if he goes too long without drinking.", 
                "id": "WeirdBeard"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Futurama: Leela.", 
                "id": "ActionGirlFriend"
            }, 
            {
                "adjectives": [
                    "gigantic", 
                    "muscular", 
                    "scantily-clad", 
                    "male", 
                    "due", 
                    "crushed"
                ], 
                "role": "In Futurama, the Amazonians, from the planet Amazonia, are a race of gigantic, muscular, scantily-clad tribal women. There were male Amazonians but they all died out due to crushed pelvises from sex, or, as they call it, snu-snu. Both Fry and Zapp were equally horrified and turned on when they received the sentence of death by snu-snu. Kif is just plain horrified.", 
                "id": "AmazonianBeauty"
            }, 
            {
                "adjectives": [
                    "Chinese"
                ], 
                "role": "Amy Wong from Futurama. She's of Chinese descent, but she's from Mars. (Her parents own half of Mars. \"The good half,\" so they claim.)", 
                "id": "AnimeChineseGirl"
            }, 
            {
                "adjectives": [
                    "second-most", 
                    "male", 
                    "good-looking", 
                    "well-liked", 
                    "ditzy", 
                    "easy", 
                    "applied"
                ], 
                "role": "Amy Wong of Futurama fame. Basically the second-most archetypal example, particularly of Type Two. Literally every male character makes note of how good-looking she is, she's richer than God, and well-liked by everyone. She acts so ditzy that it's easy to forget that she was introduced as a graduate student in applied physics (and eventually gets her PhD.)", 
                "id": "AsianAirhead"
            }, 
            {
                "adjectives": [
                    "robotic", 
                    "obvious"
                ], 
                "role": "Futurama has the robotic Nurse Ratchet, an obvious parody of Nurse Ratched.", 
                "id": "BattleaxeNurse"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "irate", 
                    "shotgun-wielding", 
                    "new", 
                    "true"
                ], 
                "role": "Futurama\n One episode had Fry and Bender stranded on the moon. A farmer offers them shelter with the stipulation that they stay away from his three beautiful robot daughters: two Daisy Duke types and The Crushinator, a pink combine / tank. Later, we see Bender fleeing from an irate, shotgun-wielding farmer.\n In \"300 Big Boys\", the reveal that the professor's new girlfriend was one of these who had been using stem cells to hide her true appearance, just like he had. They both smile and resume the torrid kissing.", 
                "id": "BigBeautifulWoman"
            }, 
            {
                "adjectives": [
                    "large", 
                    "combat-oriented", 
                    "female", 
                    "general"
                ], 
                "role": "Leela of Futurama has large breasts and is the most combat-oriented crewmember (and female in general) in the show.", 
                "id": "BoobsOfSteel"
            }, 
            {
                "adjectives": [
                    "single", 
                    "giant", 
                    "normal"
                ], 
                "role": "In the Futurama pilot, Leela is introduced this way, as Fry's Male Gaze only sees her from behind until she turns around, revealing her single, giant eye. Since she looks perfectly \"normal\" otherwise (better, in fact) it doesn't bother him (or the audience) for long.\n Gender Bender Fry seems to be one to Zap, as he greets him with the line \"Hello from the neck down\".", 
                "id": "ButterFace"
            }, 
            {
                "adjectives": [], 
                "role": "There's Hatty MacDoogal, a crazy cat lady on Futurama who tends to carry a cat around with her and calls anything she doesn't know the word for a \"kajigger\" or a \"whatchacallit\".", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [], 
                "role": "Amy Wong from Futurama", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "one-eyed", 
                    "human", 
                    "subterranean", 
                    "human", 
                    "able", 
                    "vertical", 
                    "extra"
                ], 
                "role": "Leela from Futurama, a beautiful one-eyed woman descended from a race inflicted with all kinds of Body Horror, is a particularly justified example: her parents and people are formerly human, subterranean mutants and the fact that she happened to be born looking almost human is why they were able to pass her off as a Human Alien and send her to the surface world for a better life than they could give her. Averted with plenty of underground female mutants though. Such deformities include slimy green skin, vertical mouths, extra arms and tentacles.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Futurama's Mom.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "Futurama: Fry, Leela, and Bender are forced to take refuge at a farm on the moon. The farmer lets them stay, so long as they stay away from his robot daughters. Guess what Bender doesn't do... Let the record show that he didn't touch the Crushinator. A lady that fine, you've gotta romance first!", 
                "id": "FarmersDaughter"
            }, 
            {
                "adjectives": [
                    "one-shot"
                ], 
                "role": "Amy Wong and Dr. Zoidberg in Futurama temporarily turn into Fragile Flowers in a one-shot joke when Bender is trying to get Fry to cry out a liquid alien emperor trapped in his body:", 
                "id": "FragileFlower"
            }, 
            {
                "adjectives": [
                    "early", 
                    "perennial"
                ], 
                "role": "Parodied twice in Futurama. Zoidberg spots a lobster in a tank this way (and ends up leaving the bar with it) in an early episode, Love's Labours Lost in Space, back before Flanderization had rendered him the perennial loveless loser. And in the episode \"Bendless Love\", when Bender first sees Anglelyne, she appears out of focus - until the foreman orders the dirty glass in front of her removed.\n This is also inverted as the glass is curved, distorting and muting her curvy body.", 
                "id": "GaussianGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Mrs. Astor from Futurama. Even nitroglycerine is intimidated by her.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "public", 
                    "super-skinny", 
                    "old"
                ], 
                "role": "This is Mom's public persona on Futurama. Behind closed doors, she's a super-skinny bitter old crone.", 
                "id": "GrannyClassic"
            }, 
            {
                "adjectives": [
                    "mutant", 
                    "many", 
                    "green"
                ], 
                "role": "A lampshade hanging of this occurs in Futurama, in the episode where Zapp Brannigan tricks Leela into sleeping with him. From the Captain's Log, dictated to Kif at the end of the episode:\n Of course, the irony when you realize that Leela turns out to be a mutant human, not an alien, makes it even more hilarious.\n To many women over the course of the show, Kif is the green skinned space babe.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "Hooker-bot", 
                    "solid"
                ], 
                "role": "Parodied in the Futurama episode \"Hell is Other Robots\", there is Hooker-bot 5000, programmed with a heart of solid gold.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "comedian", 
                    "comedian", 
                    "medical"
                ], 
                "role": "In Futurama, Dr. Zoidberg's aunt first criticizes him for wanting to become a comedian instead of a doctor, then for giving up his dream of becoming a comedian to go to medical school.", 
                "id": "JewishMother"
            }, 
            {
                "adjectives": [
                    "hard", 
                    "Hiiiii-YA"
                ], 
                "role": "Leela in Futurama has a pretty hard punch, but she uses kicks a lot more. \"Hiiiii-YA!\"", 
                "id": "KickChick"
            }, 
            {
                "adjectives": [
                    "opposite", 
                    "same"
                ], 
                "role": "Parodied in Futurama, when Fry buys pirated Lucy Liu downloaded from the Internet and put on a blank robot to date, and his friends try to stop him with a film showing how without the struggle to impress the opposite or same sex, society would collapse.", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [
                    "prim", 
                    "slobby"
                ], 
                "role": "In Futurama, a prim bureaucrat is utterly turned on after hours by Fry's horrifyingly slobby lifestyle.", 
                "id": "NaughtyByNight"
            }, 
            {
                "adjectives": [
                    "own"
                ], 
                "role": "Futurama inverts it, as both Leela, who is an orphan and the captain of the crew, and Mom, the matriarch of her own company, earned their ranks. Indeed, it was Mom who made the Professor into the success he was.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "regular"
                ], 
                "role": "Futurama. Mom, in spades. Although she is by no means a Cool Old Lady, being firmy in Evil Matriarch camp.\n Farnsworth refers to electromatter, which Yivo is made of, as being regular matter's \"badass grandma\".", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [
                    "entire"
                ], 
                "role": "Futurama has an entire planet of Amazonian women. Amy briefly dressed like one.", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [
                    "giant"
                ], 
                "role": "Futurama: Corporate tycoon \"Mom\" hides the controlling device of the world's robots in her bra. At the end of the episode it's also shown that Professor Farnsworth keeps the controls of his giant albino shouting mutant gorillas in his pants.", 
                "id": "Ptitleba4e2b2g"
            }, 
            {
                "adjectives": [
                    "tube-top"
                ], 
                "role": "Inverted in an episode of Futurama, where Fry's mermaid fiancee wears a tube-top.", 
                "id": "SeashellBra"
            }, 
            {
                "adjectives": [
                    "commercial"
                ], 
                "role": "In the Futurama episode \"Neutopia\", Leela, Amy and LaBarbarba become Sexy Stewardesses when the Planet Express ship is changed into a commercial airline.", 
                "id": "SexyStewardess"
            }, 
            {
                "adjectives": [
                    "public", 
                    "normal", 
                    "common"
                ], 
                "role": "The cast of Futurama tend to bounce around this. In some episodes, public nudity is completely normal, while in others, you can be arrested for streaking. Hilariously, the most common offender is Professor Farnsworth.", 
                "id": "ShamelessFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "non-anime"
                ], 
                "role": "A non-anime example who nevertheless fits this trope to a T: Leela from Futurama.", 
                "id": "ShortTank"
            }, 
            {
                "adjectives": [
                    "due", 
                    "various"
                ], 
                "role": "Leela on Futurama occasionally takes up causes due to her love of various animals.", 
                "id": "SoapBoxSadie"
            }, 
            {
                "adjectives": [
                    "love-obsessed", 
                    "female"
                ], 
                "role": "Parodied in the Futurama episode \"Love and Rocket\", where upgrading the Planet Express ship's computer caused it to become a love-obsessed and unbalanced female voiced by Sigourney Weaver, no less!", 
                "id": "SpaceshipGirl"
            }, 
            {
                "adjectives": [
                    "own", 
                    "nice", 
                    "laundry"
                ], 
                "role": "Amy Wong from Futurama; her parents own half of Mars (the good half), but she's quite nice, in addition to being a ditzy klutz who always dresses like it's laundry day.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "busy"
                ], 
                "role": "Futurama flips the genders. Fry's mother is a hardcore Packers fan, and his father is too busy preparing for the latest conspiracy to give a damn what anyone else is doing.", 
                "id": "SportsWidow"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Futurama:\n Leela, who stands shoulder to shoulder with Fry and can clobber anyone, and still be gorgeous.\n Hermes' wife, Labarbara Conrad, is noticeably taller than nearly every other human we meet. She's also slim and a dark beauty.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "H-Word"
                ], 
                "role": "In the Futurama episode \"War Is the H-Word\", Leela disguises herself as a man named \"Lee Lemon\" in order to join the army. Zapp Brannigan is still attracted to her without seeing through the disguise leading to some... confusing feelings.", 
                "id": "SweetPollyOliver"
            }, 
            {
                "adjectives": [
                    "O'Manahan"
                ], 
                "role": "Futurama: Chief O'Manahan from the episode Law and Oracle.", 
                "id": "TheLadette"
            }, 
            {
                "adjectives": [
                    "delusional", 
                    "other", 
                    "has-been"
                ], 
                "role": "In the Futurama episode \"That's Lobstertainment!\", Dr. Zoidberg's uncle Harold Zoid is a silent film star who now lives in obscurity in a retirement home. While not as delusional as Norma Desmond, Harold still believes he's one film away from getting back into the business, and tries to use his nephew's money to make that film. At other times, he seems resigned to his fate as a has-been.", 
                "id": "WhiteDwarfStarlet"
            }, 
            {
                "adjectives": [], 
                "role": "In Futurama: Bender's Big Score, the Planet Express crew is being attacked by yeti... until Leela runs at them shouting, \"Don't mess with me! I just got dumped!\" and the yeti run away in terror.\n Earlier in the episode \"Mother's Day\", Mom led a robot rebellion which her sons put down to the remaining ill effects of this trope,", 
                "id": "WomanScorned"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "attractive", 
                    "hideous"
                ], 
                "role": "In Futurama, Leela is the most beautiful mutant, ever. Of course, mutants being mutants, it means she is simply mildly attractive rather than hideous.", 
                "id": "WorldsMostBeautifulWoman"
            }
        ]
    }, 
    "imdbid": "tt0149460", 
    "similar": [
        {
            "shared": [
                "BeardOfSorrow", 
                "WalkingShirtlessScene", 
                "DirtyCoward", 
                "MisterSeahorse", 
                "SpoiledSweet", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "OfficerAndAGentleman", 
                "TheCasanova", 
                "SensitiveGuyAndManlyMan", 
                "MommasBoy", 
                "PecFlex", 
                "DisguisedInDrag"
            ], 
            "shared_count": 13, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "DirtyCoward", 
                "SpoiledSweet", 
                "SweetPollyOliver", 
                "NeverASelfMadeWoman", 
                "BeardOfEvil", 
                "WeirdBeard", 
                "OfficerAndAGentleman", 
                "SissyVillain", 
                "WomanScorned", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 11, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "MenCantKeepHouse", 
                "MisterSeahorse", 
                "NeverASelfMadeWoman", 
                "BeardOfEvil", 
                "GrumpyOldMan", 
                "DirtyCoward", 
                "CuteMonsterGirl", 
                "SissyVillain", 
                "WeirdBeard"
            ], 
            "shared_count": 9, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "ChickMagnet", 
                "DoggedNiceGuy", 
                "WalkingShirtlessScene", 
                "KavorkaMan", 
                "CasanovaWannabe", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "MagicalGirlfriend", 
                "CuteClumsyGirl"
            ], 
            "shared_count": 9, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan", 
                "SissyVillain", 
                "SexyStewardess", 
                "MagicalGirlfriend", 
                "TheCasanova", 
                "SensitiveGuyAndManlyMan", 
                "JewishMother", 
                "ActionGirlFriend"
            ], 
            "shared_count": 8, 
            "id": "TheFifthElement", 
            "name": "The Fifth Element", 
            "poster_url": "TheFifthElement.jpg"
        }
    ], 
    "id": "Futurama", 
    "name": "Futurama"
}