{
    "plot": "The sci-fi television series \"Galaxy Quest\", which took place aboard the intergalactic spaceship NSEA Protector, starred Jason Nesmith as suave Commander Peter Quincy Taggert, Gwen DeMarco as sexy communications person Lt. Tawny Madison (a role which consisted solely of repeating what the computer stated, much to Gwen's annoyance), Shakespearean trained Sir Alexander Dane as alien Dr. Lazarus, Fred Kwan as engineer Tech Sgt. Chen, and Tommy Webber as child gunner Laredo. Seventeen years after the series last aired, it lives on in the hearts of its rabid fans. However, it lives on in infamy for its stars, who have not been able to find meaningful acting work since. Their current lives revolve around cashing in on however those roles will afford, which usually entails attending fan conventions or worse, such as shopping mall openings. Only Jason seems to relish his lot in life, until he finds out that his co-stars detest him because of his superior attitude as \"the Commander\", and much of the public considers him a laughing stock. Their lives change when Jason is approached by who he thinks are convention fans asking for help. They are in reality an alien race called Thermians, led by Mathesar, who have modeled their existence after the series, which they believe to be real. When Jason and then the rest of his co-stars (along with Guy Fleegman, who was killed off before the opening credits in only one episode) go along with the Thermians, Jason's co-stars who believe they are off to yet another paying gig, they learn that they have to portray their Galaxy Quest roles for real. With no scriptwriters to get them to a happy and heroic ending, they have to trust that their play acting will work, especially in dealing with the Thermian's nemesis, General Sarris. Guy in particular fears that he will go the way his character did on the series. But when they run across technical issues that they as actors didn't care anything about during the filming of the series and thus now don't know how to deal with, they need to find someone who should know what to do.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "rabid", 
                    "exact", 
                    "in-movie", 
                    "young"
                ], 
                "role": "Subverted in Galaxy Quest when Jason Nesmith is contacted by the Thermians. He thinks that they're particularly rabid fanboys who have built an exact replica of the the Protector in their parents' basement. He's only two-thirds right.\n Guy Fleegman, whose character played a Red Shirt in the in-movie TV-show, can be spotted in one scene hitting on a young woman who responds with \"but you live with your mom!\"", 
                "id": "BasementDweller"
            }, 
            {
                "adjectives": [
                    "Bishōnen", 
                    "holographic"
                ], 
                "role": "Bishōnen: The Thermians... or should we say, their holographic disguises.", 
                "id": "Bishonen"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fixit: Fred Kwan. He's the one handling the engine.", 
                "id": "MrFixit"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Jason Nesmith.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Bridge Bunny / Communications Officer: Gwen DeMarco \"I repeat everything the computer says.\"", 
                "id": "BridgeBunnies"
            }, 
            {
                "adjectives": [
                    "pile", 
                    "stupid", 
                    "gon", 
                    "trouble", 
                    "own"
                ], 
                "role": "Galaxy Quest plays this trope snarkily straight. Gwen DeMarco's official capacity is inherited from her character in the Show Within a Show, Tawny Madison. Her job is to repeat everything the computer says, word-for-word. Lampshaded into a pile of smoking ash about three-quarters of the way through the movie: \"Listen - I have one job to do on this ship, and it's stupid, but I'm gonna do it!\"\n Also by the fact that the computer literally will not listen to anyone but her.\n It's no wonder the Thermians had trouble running the ship they built, when their own computer won't listen to them.", 
                "id": "BridgeBunnies"
            }, 
            {
                "adjectives": [], 
                "role": "Faux Action Girl: Gwen, in-universe. She is shown kicking ass in the Galaxy Quest intro, but her role on the show is to recite what the computer says.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [
                    "aware", 
                    "good"
                ], 
                "role": "Ms. Fanservice: Gwen DeMarco, and she's well aware of it. Worth mentioning: when TV Guide interviewed Jeri Ryan about playing Seven of Nine, a good chunk of the article was about her costume and how exactly she filled it out. Clearly, the writers did the research...", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "tall"
                ], 
                "role": "Statuesque Stunner: Gwen, as she's portrayed by Sigourney Weaver, is over six feet tall.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "in-universe", 
                    "original", 
                    "straight-for"
                ], 
                "role": "The Chick: Gwen really spoofs this. She gives a rant early in the movie about an interview that was mostly about \"My boobs and how they fit into my suit.\" Her character in the in-universe original series plays it straight-for the actress it's an Enforced Trope because the aliens copied her function from the show.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0177789", 
    "poster_url": "GalaxyQuest.jpg", 
    "similar": [
        {
            "shared": [
                "Bishonen", 
                "ShirtlessScene", 
                "StatuesqueStunner", 
                "FauxActionGirl"
            ], 
            "shared_count": 4, 
            "id": "StreetFighter", 
            "name": "Street Fighter", 
            "poster_url": "StreetFighter.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "ShirtlessScene", 
                "MsFanservice", 
                "FauxActionGirl"
            ], 
            "shared_count": 4, 
            "id": "VanHelsing", 
            "name": "Van Helsing"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MsFanservice", 
                "TheChick"
            ], 
            "shared_count": 3, 
            "id": "AttackOfTheClones", 
            "name": "Attack of the Clones"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MsFanservice", 
                "TheChick"
            ], 
            "shared_count": 3, 
            "id": "GIJoeRetaliation", 
            "name": "G.I. Joe: Retaliation", 
            "poster_url": "GIJoeRetaliation.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MsFanservice", 
                "TheChick"
            ], 
            "shared_count": 3, 
            "id": "PitchPerfect", 
            "name": "Pitch Perfect", 
            "poster_url": "PitchPerfect.jpg"
        }
    ], 
    "id": "GalaxyQuest", 
    "name": "Galaxy Quest"
}