{
    "plot": "Social warfare erupts when three high school clique queens battle for supremacy: drama diva Caprice, Mormon princess 'Shley and blonde fashionista Fawcett. When unassuming Tanner is outted, he finds himself cast as the hottest new teen-girl accessory: The Gay Best Friend. The clique queens immediately pounce and makeover Tanner into their ideal arm candy, forcing him to choose between popularity and the true friends - including his own B.F.F. Brent - that he's leaving behind.", 
    "genres": "Comedy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Christian", 
                    "willing"
                ], 
                "role": "Armored Closet Gay: Topher admits he's gay and pulls the moves on Tanner, but he's not about to out himself to the Mormon tabernacle.  When he hooks up with Christian, he says he's willing to do just that.", 
                "id": "ArmouredClosetGay"
            }, 
            {
                "adjectives": [], 
                "role": "Brent van Camp.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [], 
                "role": "Disappeared Dad: Brent's father is not mentioned. He and his mother live alone.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "homophobic", 
                    "ex-boyfriend"
                ], 
                "role": "Jerk Jock: The homophobic bully Hamilton, who's also Fawcett's ex-boyfriend.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [], 
                "role": "Straight Gay: When Tanner is outed, everybody is surprised since he doesn't seem to have any stereotypically gay traits. He does get slightly campier over the course of the film.", 
                "id": "StraightGay"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "long"
                ], 
                "role": "The Alpha Bitch Fawcett is named after the Charlie's Angels star, and is also famed for her long blonde locks.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "sad", 
                    "slippery", 
                    "own", 
                    "meaningful"
                ], 
                "role": "Crazy Cat Lady: Seems to be the sad ultimate fate of Ms Hoegel, the teacher who runs the Gay Straight Alliance. She started on the slippery slope after her own GBF left her for San Francisco with a leather queen. Now it seems the most meaningful relationship in her life is with \"Anderson Coo-purr\".", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [
                    "high", 
                    "willing", 
                    "approachable", 
                    "only", 
                    "homophobic", 
                    "only", 
                    "romantic", 
                    "hot", 
                    "British"
                ], 
                "role": "GBF focuses on a high school with three alpha bitches, all of whom reveal a far nicer side. 'Shley is willing to befriend Tanner despite Mormonism forbidding it, and is generally the nicest and most approachable out of the three of them. Fawcett is the only one to stand up for Tanner re: the school's homophobic prom policies. Caprice is the only girl to understand Tanner needs a romantic life and isn't a neutered purse-poodle- so she tries to set him up with a hot British guy.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [
                    "Lovable", 
                    "'Shley", 
                    "willing", 
                    "approachable", 
                    "only", 
                    "homophobic", 
                    "only", 
                    "romantic", 
                    "hot", 
                    "British"
                ], 
                "role": "Lovable Alpha Bitch: All three queen bees reveal a nicer side: 'Shley (who is willing to befriend Tanner despite Mormonism forbidding it, and is generally the nicest and most approachable out of the three of them) Fawcett (who is the only one to stand up for Tanner re: the school's homophobic prom policies). Caprice (the only girl to understand Tanner needs a romantic life and isn't a neutered purse-poodle- so she tries to set him up with a hot British guy)", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [
                    "biological"
                ], 
                "role": "Missing Mom: Tanner's biological mother is not mentioned. Instead, he has a cheery stepmother.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "non-malevolent"
                ], 
                "role": "My Beloved Smother: A non-malevolent example in Mrs Van Camp. She wants to show her son she loves him as he is so badly that she ends up being hilariously inappropriate. Brokeback Mountain, anyone?", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "mouthy", 
                    "social", 
                    "Dramatic"
                ], 
                "role": "Sassy Black Woman: Caprice embodies this trope. She's loud, mouthy, and has the social standing to back it up. She even wins \"Most Dramatic\" (which, according to Tanner, is shorthand for \"Bitchiest\") at the end of the school year. Lampshaded when McKenzie says she's excited to have an S.B.F. (Sassy Black Friend).", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "'Shley", 
                    "old-fashioned", 
                    "sexual", 
                    "extreme"
                ], 
                "role": "Seemingly Wholesome '50s Girl: Queen of the Mormon kids 'Shley, who appears at first to be a prissy, pure, old-fashioned girl, is revealed to be obsessed with learning sexual techniques to please her closet-case boyfriend. It gets especially extreme when she seduces Glenn, who she thinks is gay and therefore \"doesn't count\". When the others burst in on her straddling him, she scolds them when they gasp the Lord's name in vain.", 
                "id": "SeeminglyWholesomeFiftiesGirl"
            }
        ]
    }, 
    "imdbid": "tt2429074", 
    "poster_url": "GBF.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "GeekCharming", 
            "name": "Geek Charming"
        }, 
        {
            "shared": [
                "MissingMom", 
                "CampGay", 
                "SassyBlackWoman", 
                "JerkJock"
            ], 
            "shared_count": 4, 
            "id": "TheCuriosityOfChance", 
            "name": "The Curiosity Of Chance", 
            "poster_url": "TheCuriosityOfChance.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch", 
                "ArmouredClosetGay"
            ], 
            "shared_count": 4, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "MyBelovedSmother", 
                "JerkJock", 
                "LovableAlphaBitch", 
                "SassyBlackWoman"
            ], 
            "shared_count": 4, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "MyBelovedSmother", 
                "AlphaBitch", 
                "LovableAlphaBitch", 
                "SassyBlackWoman"
            ], 
            "shared_count": 4, 
            "id": "Hairspray", 
            "name": "Hairspray", 
            "poster_url": "Hairspray.jpg"
        }
    ], 
    "id": "GBF", 
    "name": "GBF"
}