{
    "plot": "Do San (the God of gamblers) is a legendary gambler helped by his supernatural abilities. He undertakes to help a friend pay a debt by beating his friend's advisory at the card table. Despite being assigned a bodyguard Do San has a freak accident which leaves him with partial memory loss and at a mental stage of a child. The small time hustler Knife, his side-kick and his girl friend, being responsible for the accident takes care of the retarded Do San. After some time they discover that he has not lost all of his powers and takes him on a round at the local gambling halls. After being chased by both Knife's loan-shark and enemies closer to the home of Do San, a final showdown at the card tables may take place.", 
    "genres": "Action, Comedy, Drama", 
    "release_year": "1989", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Disposable", 
                    "first", 
                    "egregious", 
                    "crush", 
                    "final", 
                    "responsible"
                ], 
                "role": "Disposable Woman: God of Gamblers, God of Gamblers Returns, and God of Gamblers 3: The Early Stage (Prequel to the first two films) contained particularly egregious examples of this trope. Any woman who Ko Chun loved, or any woman who have a crush on him, WILL ALWAYS die before the final game goes into play, giving him all the reasons for revenge on his opponent, who ALWAYS happened to be responsible for their deaths.", 
                "id": "DisposableWoman"
            }
        ]
    }, 
    "imdbid": "tt0097244", 
    "poster_url": "GodOfGamblers.jpg", 
    "similar": [
        {
            "shared": [
                "DisposableWoman"
            ], 
            "shared_count": 1, 
            "id": "KamenRider", 
            "name": "Kamen Rider"
        }, 
        {
            "shared": [
                "DisposableWoman"
            ], 
            "shared_count": 1, 
            "id": "Stargate", 
            "name": "Stargate", 
            "poster_url": "Stargate.jpg"
        }, 
        {
            "shared": [
                "DisposableWoman"
            ], 
            "shared_count": 1, 
            "id": "TheDarkKnight", 
            "name": "The Dark Knight", 
            "poster_url": "TheDarkKnight.jpg"
        }, 
        {
            "shared": [
                "DisposableWoman"
            ], 
            "shared_count": 1, 
            "id": "TheYakuza", 
            "name": "The Yakuza", 
            "poster_url": "TheYakuza.jpg"
        }, 
        {
            "shared": [
                "DisposableWoman"
            ], 
            "shared_count": 1, 
            "id": "Godzilla2014", 
            "name": "Godzilla ", 
            "poster_url": "Godzilla2014.jpg"
        }
    ], 
    "id": "GodOfGamblers", 
    "name": "God Of Gamblers"
}