{
    "plot": "Godzilla returns to terrorize Japan! This time, however, Japan has two new weapons to defend themselves. The Gryphon, a high-tech ship, and the Dimension Tide, a device that creates artificial black holes! During a test of the Dimension Tide, eggs appear in the city of Shibuya and hatch into terrifying Meganurons! These creatures need water to grow and flood the city of Shibuya by breaking underground water veins. As they multiply and grow, they start to feed on the energy of humans. After gathering enough energy, they transform in to giant dragonfly monsters called Meganuras! And now they target Godzilla for energy to feed to the larva of their queen, which eventually hatches into the terrifying 60-meter Megaguirus who also begins to attack Godzilla for his energy. Now a 3-way battle between Godzilla, the Megaguirus, and humans begins! Will Godzilla win? Will humanity survive?", 
    "genres": "Action, Horror, Sci-Fi", 
    "release_year": "2000", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Kiriko Tsujimori, who climbs onto a swimming Godzilla and risks her life so the failing Dimension Tide would target Godzilla. Megaguirus as well is a nonhuman example.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "prominent"
                ], 
                "role": "Team Mom: Professor Yoshizawa. Warm and kind, she's a prominent figure in the Dimension Tide project and has the respect of the noncomforming Kudo and the cool Kiriko. She even breaks up a fight between the two when Dimension Tide first fails.", 
                "id": "TeamMom"
            }
        ]
    }, 
    "imdbid": "tt0255198", 
    "poster_url": "GodzillaVsMegaguirus.jpg", 
    "similar": [
        {
            "shared": [
                "TeamMom", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "HaloLegends", 
            "name": "Halo Legends", 
            "poster_url": "HaloLegends.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "HappilyEverAfter", 
            "name": "Happily Ever After", 
            "poster_url": "HappilyEverAfter.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "SuperSentai", 
            "name": "Super Sentai"
        }, 
        {
            "shared": [
                "TeamMom", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheDescent", 
            "name": "The Descent", 
            "poster_url": "TheDescent.jpg"
        }
    ], 
    "id": "GodzillaVsMegaguirus", 
    "name": "Godzilla vs. Megaguirus"
}