{
    "plot": "In 1999, the Janjira nuclear plant was mysteriously destroyed with most hands lost including supervisor Joe Brody's colleague and wife, Sandra. Years later, Joe's son, Ford, a US Navy ordnance disposal officer, must go to Japan to help his estranged father who obsessively searches for the truth of the incident. In doing so, father and son discover the disaster's secret cause on the wreck's very grounds. This enables them to witness the reawakening of a terrible threat to all of Humanity, which is made all the worse with a second secret revival elsewhere. Against this cataclysm, the only hope for the world may be Godzilla, but the challenge for the King of the Monsters will be great even as Humanity struggles to understand the destructive ally they have.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2014", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "absent", 
                    "present", 
                    "literal"
                ], 
                "role": "Disappeared Dad: Joe Brody becomes one in the emotionally absent but physically present sense after the Janjira disaster. He then becomes one in the literal sense right after he and his son Ford have finally reconciled upon the latter realizing Joe wasn't an obsessed crazyhead.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "absent", 
                    "present", 
                    "literal"
                ], 
                "role": "In Godzilla (2014), Joe Brody becomes one in the emotionally absent but physically present sense after the Janjira disaster. He then becomes one in the literal sense right after he and his son Ford have finally reconciled upon the latter realizing Joe wasn't an obsessed crazyhead.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "other", 
                    "dangerous"
                ], 
                "role": "In Godzilla (2014), Godzilla's more heavily built than other versions of the character, but it doesn't make him any less dangerous.", 
                "id": "StoutStrength"
            }, 
            {
                "adjectives": [
                    "comparable", 
                    "M.U.T.O.s", 
                    "large", 
                    "big", 
                    "bear", 
                    "other", 
                    "aerial", 
                    "climactic", 
                    "able", 
                    "few"
                ], 
                "role": "Godzilla (2014):\n The King of the Monsters himself, obviously the humans have nothing that is even comparable in the muscle department but also none of the M.U.T.O.s came close to matching him in strength. The female MUTO was almost as large as Godzilla but the big guy can easily overpower her using only one hand and without putting any weight behind it.\n This is consistent with how a bear, which was one of the basis of his fighting style, compares to most other creatures in its habitat.\n Not that the MUTOs were exactly pushovers. The male MUTO, during one of his aerial attacks in the climactic fight, is able to drag Godzilla a few hundred feet.", 
                "id": "WorldsStrongestMan"
            }, 
            {
                "adjectives": [
                    "comparable", 
                    "M.U.T.O.s", 
                    "large", 
                    "big", 
                    "bear", 
                    "other", 
                    "aerial", 
                    "climactic", 
                    "able", 
                    "few"
                ], 
                "role": "World's Strongest Man: The King of the Monsters himself, obviously the humans have nothing that is even comparable in the muscle department but also none of the M.U.T.O.s came close to matching him in strength. The female MUTO was almost as large as Godzilla but the big guy can easily overpower her using only one hand and without putting any weight behind it. This is consistent with how a bear, which was one of the basis of his fighting style, compares to most other creatures in its habitat. Not that the MUTOs were exactly pushovers. The male MUTO, during one of his aerial attacks in the climactic fight, is able to drag Godzilla a few hundred feet.", 
                "id": "WorldsStrongestMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "young", 
                    "dad", 
                    "guilt-wracked", 
                    "obsessive", 
                    "guilt-fueled"
                ], 
                "role": "Sandra Brody in Godzilla (2014). She promises young son Ford that they'll work out a way to surprise dad Joe after work. She helps him hang the HAPPY BIRTHDAY sign for Joe before coming out to kiss Joe and wish him happy birthday (he'd forgotten in his concern over the tremors). She then dutifully follows Joe's request that her team go check the reactor. She wisely commands her team out when the tremors begin again, stops to pick up a fallen comrade, and then pulls off her mask when it no longer matters because she won't get out — just to tearfully say goodbye to the grieving and guilt-wracked husband who sent her down there in the firs place, setting him up for 15 years of obsessive guilt-fueled angst.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Sandra Brody by the Janjira reactor breach in Godzilla (2014).", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0831387", 
    "poster_url": "Godzilla2014.jpg", 
    "similar": [
        {
            "shared": [
                "WorldsStrongestMan", 
                "DisappearedDad", 
                "StoutStrength"
            ], 
            "shared_count": 3, 
            "id": "ThePrincessBride", 
            "name": "The Princess Bride", 
            "poster_url": "ThePrincessBride.png"
        }, 
        {
            "shared": [
                "WorldsStrongestMan", 
                "DisappearedDad", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "LesMiserables", 
            "name": "Les Misérables"
        }, 
        {
            "shared": [
                "WorldsStrongestMan", 
                "StoutStrength", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "PippiLongstocking", 
            "name": "Pippi Longstocking", 
            "poster_url": "PippiLongstocking.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DisposableWoman", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "GeekCharming", 
            "name": "Geek Charming"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DisposableWoman", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "StarTrek", 
            "name": "Star Trek", 
            "poster_url": "StarTrek.jpg"
        }
    ], 
    "id": "Godzilla2014", 
    "name": "Godzilla "
}