{
    "plot": "Scarlett is a woman who can deal with a nation at war, Atlanta burning, the Union Army carrying off everything from her beloved Tara, the carpetbaggers who arrive after the war. Scarlett is beautiful. She has vitality. But Ashley, the man she has wanted for so long, is going to marry his placid cousin, Melanie. Mammy warns Scarlett to behave herself at the party at Twelve Oaks. There is a new man there that day, the day the Civil War begins. Rhett Butler. Scarlett does not know he is in the room when she pleads with Ashley to choose her instead of Melanie.", 
    "genres": "Drama, Romance, War", 
    "release_year": "1939", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "entire", 
                    "well-liked", 
                    "several"
                ], 
                "role": "Bumbling Dad: Gerald O'Hara who, unbeknownst to him, is the least respected person on his entire plantation. At least he managed to acquire his plantation and build it up. Respected he might not be, but he's well-liked by his neighbors and loved by his family (and even several of his slaves; his valet, Pork, is heartbroken when he dies).", 
                "id": "BumblingDad"
            }, 
            {
                "adjectives": [
                    "no-good", 
                    "few", 
                    "white", 
                    "typhoid", 
                    "later"
                ], 
                "role": "Corrupt Hick: The no-good \"rabbity\" Slattery clan that lives on a few acres of swampy land. They are looked down on even by the slaves who call them \"white trash.\" Ellen O'Hara dies of typhoid after taking care of the oldest daughter, Emmie's, illegimate baby (sired by a Yankee overseer, no less). Even worse, Emmie later has the nerve to marry her Yankee lover and tries to buy Tara.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [], 
                "role": "Handsome Devil / Handsome Lech: Rhett", 
                "id": "HandsomeDevil"
            }, 
            {
                "adjectives": [
                    "female", 
                    "other"
                ], 
                "role": "Ladykiller in Love: Rhett is one of these in regards to Scarlett, and Scarlett is a female version in regards to Ashley. It doesn't stop them from owning a brothel and marrying other men, respectively.", 
                "id": "LadyKillerInLove"
            }, 
            {
                "adjectives": [
                    "Noble", 
                    "Roguish"
                ], 
                "role": "Noble Male, Roguish Male: Ashley is the Noble Male, while Rhett is the Roguish Male.", 
                "id": "NobleMaleRoguishMale"
            }, 
            {
                "adjectives": [
                    "contrary", 
                    "vicious", 
                    "several"
                ], 
                "role": "Officer and a Gentleman: Ashley. Additionally, when Scarlett visits the Yankee garrison, she is surprised to find that, contrary to what she has been told about their vicious, cruel natures, several of the Yankee officers fit this.", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Rhett fills this trope, spoiling Bonnie rotten, he fires a nanny in the movie and a servant in the book for leaving Bonnie alone in the dark. He also has a revelation about his role in society after a discussion with Wade.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "male", 
                    "black", 
                    "Ashley/Betty", 
                    "vast", 
                    "male", 
                    "noble", 
                    "much"
                ], 
                "role": "Scarlett herself is in a male version of the trope between the Princely Young Man Ashley and Magnificent Bastard Rhett, who as an added bonus have blond and black hair, respectively. Subverted in that Scarlett only has eyes for Ashley/Betty for the vast majority of the book, who while secretly lusting after her (like most male characters in the book), is too noble to act on it, while Rhett/Veronica falls in love with her almost instantly while she spends much of the book totally uninterested (romantically) with him.", 
                "id": "PrincelyYoungMan"
            }, 
            {
                "adjectives": [
                    "gentle"
                ], 
                "role": "Scary Black Man: Big Sam, the foreman at Tara, is usually as gentle as a pussycat...until Miss Scarlett is threatened.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "prominent", 
                    "other", 
                    "male"
                ], 
                "role": "Southern Gentleman: Ashley is the most prominent example, but seems a deconstruction of the trope. A lot of other male characters qualify.", 
                "id": "SouthernGentleman"
            }, 
            {
                "adjectives": [
                    "irresistible", 
                    "irresistible"
                ], 
                "role": "The Charmer: When Rhett wants people to like him, he's all but irresistible; but usually he can't be bothered. Scarlett, too applies, she can make herself irresistible, usually to men with charms.", 
                "id": "TheCharmer"
            }, 
            {
                "adjectives": [], 
                "role": "The Dandy: Pittypat claims that Rhett is one in the book. There are the Fontaine boys prior to the war, as well.", 
                "id": "TheDandy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Daddy's Girl: Bonnie and Rhett, as well as Gerald and Scarlett.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "Distressed Damsel: Played straight and subverted. Scarlett depends on Rhett to rescue her from Atlanta, but when he abandons her outside the city to join the Confederate army she takes charge. Scarlett also feigns to be this both to manipulate male customers into patronizing her sawmill as well as to try to get some sort of response from Ashley.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "different", 
                    "usual"
                ], 
                "role": "Determined Widow: Scarlett, again. Somewhat different than the usual case in that she is the hero, and purposely using the inherent sympathy of her situation to manipulate others.", 
                "id": "DeterminedWidow"
            }, 
            {
                "adjectives": [
                    "other", 
                    "rare"
                ], 
                "role": "Femme Fatale/The Vamp: Scarlett is one or the other, depending on your interpretation. In either case, she's a rare example of a protagonist with said role.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [], 
                "role": "Gossipy Hens: The housewives of Atlanta, especially as concerns Scarlett.", 
                "id": "GossipyHens"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Grande Dame: Ellen can be considered a rare, genuine example, but Mrs. Merriwhether, Aunt Pittypat and the other matrons of Atlanta would like to be considered this.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [], 
                "role": "Granny Classic: Grandma Fontaine, especially to Scarlett.", 
                "id": "GrannyClassic"
            }, 
            {
                "adjectives": [
                    "beautiful"
                ], 
                "role": "Hello, Nurse!: While Scarlett is actively described as \"not a beautiful woman\", she has this effect on more or less every man she meets.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [
                    "clear", 
                    "moral", 
                    "sympathetic"
                ], 
                "role": "Belle Watling, the madam with a heart of gold, in Gone with the Wind, who always has clear moral insight, strangely enough, and donates generously to the cause. (Other characters of this type named Belle are probably allusions to her.) The authorized sequel Rhett Butler's People makes her even more sympathetic by revealing that she fell in love with Rhett and had his child.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "'lady"
                ], 
                "role": "Hooker with a Heart of Gold: Belle Watling, who is definitely a better human being than Scarlett, who is more the inversion, a 'lady' who can be very demure and charming but is in fact much closer to a Bitch in Sheep's Clothing.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "rid", 
                    "guilt-induced"
                ], 
                "role": "Lady Drunk: The extreme stress she is put under after the war causes Scarlett to become a younger one of these, but she manages to keep it a secret from everyone except Rhett. (And he finds out only because he happened to call on her while she was still trying to get rid of the fumes on her breath from a guilt-induced bender after Frank Kennedy's death.)", 
                "id": "LadyDrunk"
            }, 
            {
                "adjectives": [], 
                "role": "Scarlett O'Hara in Gone with the Wind starts drinking surreptitiously after living through the Civil War.", 
                "id": "LadyDrunk"
            }, 
            {
                "adjectives": [], 
                "role": "Lady in Red: Scarlett fulfills this role at Ashley's party after a scandal in polite society - invoked by Rhett, who angrily insists that she look the part of The Vamp.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [], 
                "role": "Light Feminine and Dark Feminine: Melanie is the Light Feminine, while Scarlett is the Dark Feminine.", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "full", 
                    "few", 
                    "devastated—and", 
                    "relieved"
                ], 
                "role": "Mama Bear: Most of the time Scarlett shows less motherly affection than a caterpillar. But when the Yankees try to take Wade's sword she goes into full Mama Bear mode and manages to convince the soldiers not to take it. It's one of the few times she shows that she does love her son. Other moments include when Tara is set on fire and Wade appears to have died, she's devastated—and relieved when it turns out he's okay.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "O'Haras"
                ], 
                "role": "Missing Mom: The O'Haras after the death of Ellen.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "sweet", 
                    "seductive", 
                    "indomitable", 
                    "early"
                ], 
                "role": "Ashley is torn between his kind, sweet cousin Melanie (Betty) and his seductive, indomitable childhood friend Scarlett (Veronica). Subverted in that Melanie \"wins\" (as in \"marries Ashley\") very early in the book, although this fails to discourage Scarlett in any way.", 
                "id": "Ojou"
            }, 
            {
                "adjectives": [
                    "gracious", 
                    "happy", 
                    "cheerful", 
                    "true"
                ], 
                "role": "More of a Proper Lady. Ellen is unfailingly gracious and never complains, but she also never acts happy and cheerful like a true Stepford Smiler.", 
                "id": "ProperLady"
            }, 
            {
                "adjectives": [
                    "such"
                ], 
                "role": "Mammy, as played by Hattie McDaniel, from Gone with the Wind. She does such an awesome job as Mammy that she won the Best Supporting Actress Oscar that year. What a character.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "sensible", 
                    "level-headed", 
                    "common"
                ], 
                "role": "Sassy Black Woman: Mammy (in the movie, she is arguably the most sensible and level-headed character) Even Rhett points out she's got more common sense than virtually everyone else in the house hold.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "drive", 
                    "such", 
                    "=sexy", 
                    "fresh", 
                    "dear", 
                    "much"
                ], 
                "role": "Scarlett O'Hara of Gone with the Wind is a rare Anti-Hero specimen. She displays the strength of character and drive for success associated with this trope. She also knows how to act the part of a lady when she needs to, although her manipulation, bitchiness, and decidedly unladylike antics note such as being a coquette, stuffing her face at parties, wearing evening (=sexy) dresses during daytime, throwing fierce temper tantrums, defying conventions for fresh widows, knowingly stealing her sister's dear fiancé, indepentently running a business, weaving shrewd plots, shooting a man... suggest that she doesn't deserve that title. Her character is written much like a deconstruction of a Spirited Young Lady, as she is practically everything the trope is, just way too much so. Melanie plays the Proper Lady counterpoint to Scarlett.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [], 
                "role": "Spirited Young Lady: Scarlett, though she may be a darker version of the trope.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [], 
                "role": "Spoiled Sweet: Melanie and Carreen O'Hara. Both stay sweet when they lose their fortunes although in the novel Carreen retreats into a dreamworld to cope.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [], 
                "role": "In Gone with the Wind (at least in the book. In the movie, she doesn't seem to exist), Scarlett's youngest sister, Carreen, becomes a nun after her sweetheart is killed in the Civil War.", 
                "id": "TakingTheVeil"
            }, 
            {
                "adjectives": [], 
                "role": "Taking the Veil: Carreen, in the novel, who never bounced back after the death of her mother and her fiance Brent Tarleton.", 
                "id": "TakingTheVeil"
            }, 
            {
                "adjectives": [
                    "same", 
                    "jealous", 
                    "similar"
                ], 
                "role": "Melanie Wilkes of Gone with the Wind. It's the same reason why her husband Ashley married her and why Scarlett is jealous of her and of him marrying her. Her actress Olivia de Havilland was often cast in similar roles.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "perpetual"
                ], 
                "role": "The Ingenue: Melanie is a perpetual ingenue. Scarlett at the start of the story subverts this trope.", 
                "id": "TheIngenue"
            }
        ]
    }, 
    "imdbid": "tt0031381", 
    "poster_url": "GoneWithTheWind.jpg", 
    "similar": [
        {
            "shared": [
                "DaddysGirl", 
                "SpoiledSweet", 
                "ProperLady", 
                "OfficerAndAGentleman", 
                "LightFeminineAndDarkFeminine", 
                "TheIngenue", 
                "MissingMom"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "NobleMaleRoguishMale", 
                "TheCharmer", 
                "LightFeminineAndDarkFeminine", 
                "DamselInDistress", 
                "TheIngenue"
            ], 
            "shared_count": 6, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "LadyInRed", 
                "FemmeFatale", 
                "MamaBear", 
                "PapaWolf", 
                "LadyDrunk", 
                "LightFeminineAndDarkFeminine"
            ], 
            "shared_count": 6, 
            "id": "DarkShadows", 
            "name": "Dark Shadows", 
            "poster_url": "DarkShadows.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "MamaBear", 
                "DaddysGirl", 
                "PapaWolf", 
                "LightFeminineAndDarkFeminine", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "SnowWhiteATaleOfTerror", 
            "name": "Snow White: A Tale of Terror", 
            "poster_url": "SnowWhiteATaleOfTerror.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "CorruptHick", 
                "GossipyHens", 
                "SouthernGentleman", 
                "ScaryBlackMan", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "ToKillAMockingbird", 
            "name": "To Kill a Mockingbird", 
            "poster_url": "ToKillAMockingbird.jpg"
        }
    ], 
    "id": "GoneWithTheWind", 
    "name": "Gone with the Wind"
}