{
    "plot": "Early thirty-something dentist Dr. Charlie Logan has never experienced true love, despite having had a number of girlfriends over the years. After an announcement by one of his ex-girlfriends as such at her wedding, Charlie gets a reputation as being a good luck charm. Every woman he has slept with has met and married her dream man immediately following. He is encouraged to exploit this reputation by his long time best friend, Dr. Stu Klaminsky, a sex obsessed, sex starved schlub who became a plastic surgeon just so that he could masturbate over the sight of women's breasts. Charlie doesn't want to be solely a stepping stone for women, which is how they end up treating him once he gains this reputation as a lucky charm, but rather one's true love. He believes the woman of his dreams is accident-prone Cam Wexler, who works as the penguin caretaker at the aquarium. Cam initially doesn't want to date Charlie because of his reputation as a one-night stand type of guy. Charlie in turn doesn't want to sleep with Cam as he is certain she will find her true love after they do. Cam's true love seems destined to be penguin expert Howard Blaine. To get to true happiness, Charlie feels he needs to speak to Anisha Carpenter, who he feels is the cause of his current problems. Anisha ends up helping him in a way he doesn't expect.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "main", 
                    "true", 
                    "few", 
                    "desperate", 
                    "true", 
                    "true", 
                    "negative", 
                    "side-effect"
                ], 
                "role": "Sexy Man, Instant Harem: The main character is \"cursed\" with the ability to have any woman who has sex with him find true love within a few days. The reason the word is in quotation marks is because apparently in this universe, women are so desperate for true love that they'll start throwing themselves at Chuck with abandon based solely on the Internet superstition that they'll find true love afterward. It does have the negative side-effect of sex instantly killing any relationship he's in, however. His secretary does note that its on some kind of urban legend site, and hasn't been debunked yet. As the girl who jumped Chuck in the car pointed out, its more of a \"what have I got to lose\" sort of thing.", 
                "id": "SexyManInstantHarem"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Cute Clumsy Girl: Jessica's character, Cam.", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [
                    "gaggle"
                ], 
                "role": "Fanservice Extra: The Sex Montage features a gaggle of nude breasts and butts.", 
                "id": "FanserviceExtra"
            }
        ]
    }, 
    "imdbid": "tt0452625", 
    "poster_url": "GoodLuckChuck.jpg", 
    "similar": [
        {
            "shared": [
                "FanserviceExtra", 
                "CuteClumsyGirl"
            ], 
            "shared_count": 2, 
            "id": "TheKentuckyFriedMovie", 
            "name": "The Kentucky Fried Movie", 
            "poster_url": "TheKentuckyFriedMovie.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "StarTrekIIITheSearchForSpock", 
            "name": "Star Trek III: The Search for Spock", 
            "poster_url": "StarTrekIIITheSearchForSpock.jpg"
        }, 
        {
            "shared": [
                "SexyManInstantHarem"
            ], 
            "shared_count": 1, 
            "id": "EightAndAHalf", 
            "name": "8½"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "ConanTheBarbarian2011", 
            "name": "Conan the Barbarian ", 
            "poster_url": "ConanTheBarbarian2011.jpg"
        }, 
        {
            "shared": [
                "CuteClumsyGirl"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }
    ], 
    "id": "GoodLuckChuck", 
    "name": "Good Luck Chuck"
}