{
    "plot": "Doug Glatt of Orangetown, Massachusetts is floundering in life, he having no real sense of where he fits - having a \"thing\" as he calls it. He doesn't have the book smarts to become a doctor like his adoptive father or his gay adoptive brother Ira. And he doesn't have the passion that his best friend Pat has for his self-appointed work, hosting a hockey based cable call-in show, Hot Ice. Because his fists and skull are figuratively like steel, Doug is good at the enforcement part of his job as a bouncer despite he having a naturally friendly childlike approach to dealing with people and situations. An incident involving Doug in the stands of an Orangetown Assassins minor league hockey game leads to its coach, Rollie Hortense, offering Doug a tryout with the team as its enforcer, the tryout regardless of the fact that Rollie has no idea if Doug even knows how to play ice hockey (which he doesn't). Learning just enough hockey skills, Doug makes the team. Rollie, however, quickly believes that Doug would be a bigger asset for his brother Ronnie Hortense's team, the Halifax Highlanders. Ronnie has one player, Xavier LaFlamme, who was once well on his way to a successful NHL career, until he was blown a vicious hit three years ago by aged enforcer, Ross \"the Boss\" Rhea, after which Xavier lost his hockey mojo. Doug's role would be to protect Xavier, while somehow giving Xavier the confidence to feel safe playing hockey freely again. Doug relishes this new role in his life, first with the Assassins then with the Highlanders, as he likes hockey and he stands up for what and who he believes. But Doug may have some obstacles in proving himself to those that matter. Besides the coaches, these people include his family, his fellow players, especially Xavier, and a girl named Eva, who Doug is falling for but who is already in a relationship. But Doug may also have to prove himself to Ross the Boss, who Xavier has not met on the ice since that hit.", 
    "genres": "Action, Comedy, Drama", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Dogged"
                ], 
                "role": "Dogged Nice Guy: Doug, for much of the movie.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "aware", 
                    "stupid", 
                    "stupid"
                ], 
                "role": "Dumb Muscle: Doug isn't too bright. He's painfully aware of it too. It even results in a Tear Jeaker when  his parents find out about what he does and try to convince him that he can be something better, like a doctor, and he's forced to angrily rebut their remarks by saying no, he's stupid, and he's always going to be stupid, but that hockey is something he can do well.", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [
                    "bright", 
                    "good"
                ], 
                "role": "Nice Jewish Boy: Doug is a semi-subversion. He isn't very bright, but he is a genuinely good person and means well. He's also adopted, as is his brother.", 
                "id": "NiceJewishBoy"
            }, 
            {
                "adjectives": [
                    "protective"
                ], 
                "role": "Papa Wolf: Doug is extremely dedicated to protecting his team, even Xavier. His protective instincts come from defending his gay younger brother from bullies.", 
                "id": "PapaWolf"
            }
        ]
    }, 
    "imdbid": "tt1456635", 
    "poster_url": "Goon.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "DumbMuscle"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DoggedNiceGuy"
            ], 
            "shared_count": 2, 
            "id": "Taal", 
            "name": "Taal", 
            "poster_url": "Taal.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DumbMuscle"
            ], 
            "shared_count": 2, 
            "id": "TheCroods", 
            "name": "The Croods", 
            "poster_url": "TheCroods.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DoggedNiceGuy"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DoggedNiceGuy"
            ], 
            "shared_count": 2, 
            "id": "KickAss", 
            "name": "Kick-Ass", 
            "poster_url": "KickAss.jpg"
        }
    ], 
    "id": "Goon", 
    "name": "Goon"
}