{
    "plot": "Minature green monsters tear through the small town of Kingston Falls. Hijinks ensue as a mild-mannered bank teller releases these hideous loonies after gaining a new pet and violating two of three simple rules: No water (violated), no food after midnight (violated), and no bright light. Hilarious mayhem and destruction in a town straight out of Norman Rockwell. So, when your washing machine blows up or your TV goes on the fritz, before you call the repair man, turn on all the lights and look under all the beds. 'Cause you never can tell, there just might be a gremlin in your house.", 
    "genres": "Comedy, Horror", 
    "release_year": "1984", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "pre-gremlin"
                ], 
                "role": "Action Mom: Mrs. Peltzer in a sense, as she kills three (pre-gremlin army) gremlins in one scene alone. Her weapons of choice: Blender, kitchen knife, and microwave.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "titular"
                ], 
                "role": "Mrs. Peltzer from 'Gremlins'' goes to some...extreme lengths to defend her home from the titular monsters.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "numerous", 
                    "affectionate", 
                    "old", 
                    "same", 
                    "homeless", 
                    "various"
                ], 
                "role": "Crazy Cat Lady: Mrs Deagle again. She is shown to adore her numerous cats and nurture them in a disturbingly affectionate manner. Not that the heartless old hag showed any of the same kindness to children who can be made homeless by one word from her, mind you. The fact that the cats are all named after various pieces of currency from around the world plainly shows what she REALLY cares about.", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [
                    "fiendish", 
                    "high", 
                    "full", 
                    "greedy", 
                    "old", 
                    "Dollar"
                ], 
                "role": "The fiendish Mrs. Deagle from Gremlins has no problem with cruelty to dogs (she threatens Billy's with a ride in her spin dryer at high heat for breaking a yard decoration), but when we see her home life it turns out her house is full of cats. And since she's a greedy old hag, she has given them all names like \"Kopec\" and \"Dollar Bill\".", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [
                    "female", 
                    "relative"
                ], 
                "role": "Cute Monster Girl: Greta the female gremlin. \"Cute\" being a relative term.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "male", 
                    "female", 
                    "second", 
                    "such", 
                    "gender-changing", 
                    "reproductive"
                ], 
                "role": "All the Mogwai and Gremlins seen in the Gremlins movies are (ambiguously) male save one female in the second movie, who was only such because it had gotten a hold of a gender-changing potion in a lab. Any reproductive processes not involving a splash of water are not discussed.", 
                "id": "MonogenderMonsters"
            }
        ]
    }, 
    "imdbid": "tt0087363", 
    "poster_url": "Gremlins.jpg", 
    "similar": [
        {
            "shared": [
                "MonogenderMonsters", 
                "ActionMom"
            ], 
            "shared_count": 2, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "CuteMonsterGirl", 
                "CrazyCatLady"
            ], 
            "shared_count": 2, 
            "id": "LetTheRightOneIn", 
            "name": "Let the Right One In", 
            "poster_url": "LetTheRightOneIn.jpg"
        }, 
        {
            "shared": [
                "CuteMonsterGirl", 
                "CrazyCatLady"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "CrazyCatLady"
            ], 
            "shared_count": 1, 
            "id": "PracticalMagic", 
            "name": "Practical Magic", 
            "poster_url": "PracticalMagic.jpg"
        }, 
        {
            "shared": [
                "ActionMom"
            ], 
            "shared_count": 1, 
            "id": "PokemonZoroarkMasterOfIllusions", 
            "name": "Pokémon: Zoroark: Master of Illusions"
        }
    ], 
    "id": "Gremlins", 
    "name": "Gremlins"
}