{
    "plot": "Richie and Eddie are in charge of the worst hotel in the UK, Guest House Paradiso, neighbouring a nuclear power plant. The illegal immigrant chef has fled and all the guests have gone. But when a famous Italian filmstar, Gina Carbonara, who is in hiding from a fiance she doesn't want to marry, arrives at the hotel, things get very interesting! Another family come to the hotel as it is the only one they can afford, and when Richie uses the many tunnels and airways to steal some of their rubber bikinis, then is caught by the family's dad, he tries everything to get the video back. When Eddie finds some radioactive fish and it's served to the customers, a bunch of power plant workers find out and a quaratine is on its way. Even worse, when Gina's estranged fiance arrives, all hell breaks loose! Just in time for Eddie, Richie and Gina to escape to the Carribean and spend all their new found money!", 
    "genres": "Comedy, Thriller", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "possessive", 
                    "suspected"
                ], 
                "role": "Bastard Boyfriend: Gino Bolognese. Not only is he violent, possessive, and a suspected drug runner, he also slept with all three bridesmaids the night before his and Gina Carbonara's wedding.", 
                "id": "BastardBoyfriend"
            }
        ]
    }, 
    "imdbid": "tt0202381", 
    "poster_url": "GuestHouseParadiso.jpg", 
    "similar": [
        {
            "shared": [
                "BastardBoyfriend"
            ], 
            "shared_count": 1, 
            "id": "NewJackCity", 
            "name": "New Jack City", 
            "poster_url": "NewJackCity.jpg"
        }, 
        {
            "shared": [
                "BastardBoyfriend"
            ], 
            "shared_count": 1, 
            "id": "TheLastCircus", 
            "name": "The Last Circus", 
            "poster_url": "TheLastCircus.jpg"
        }, 
        {
            "shared": [
                "BastardBoyfriend"
            ], 
            "shared_count": 1, 
            "id": "NorwegianWood", 
            "name": "Norwegian Wood", 
            "poster_url": "NorwegianWood.jpg"
        }, 
        {
            "shared": [
                "BastardBoyfriend"
            ], 
            "shared_count": 1, 
            "id": "NeverSayNeverAgain", 
            "name": "Never Say Never Again", 
            "poster_url": "NeverSayNeverAgain.jpg"
        }, 
        {
            "shared": [
                "BastardBoyfriend"
            ], 
            "shared_count": 1, 
            "id": "CantBuyMeLove", 
            "name": "Can't Buy Me Love", 
            "poster_url": "CantBuyMeLove.jpg"
        }
    ], 
    "id": "GuestHouseParadiso", 
    "name": "Guest House Paradiso"
}