{
    "plot": "Tracy Turnblad, an overweight teenager with all the right moves, is obsessed with the Corny Collins Show. Every day after school, she and her best friend Penny run home to watch the show and drool over the hot Link Larkin, much to Tracy's mother Edna's dismay. After one of the stars of the show leaves, Corny Collins holds auditions to see who will be the next person on the Corny Collins show. With all of the help of her friend Seaweed, Tracy makes it on the show, angering the evil dance queen Amber Von Tussle and her mother Velma. Tracy then decides that it's not fair that the black kids can only dance on the Corny Collins Show once a month, and with the help of Seaweed, Link, Penny, Motormouth Maybelle, her father and Edna, she's going to integrate the show.....without denting her 'do!", 
    "genres": "Comedy, Musical, Romance", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Henpecked Boyfriend: Link is henpecked by his girlfriend Amber.", 
                "id": "HenpeckedHusband"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "other", 
                    "dead"
                ], 
                "role": "Cue some of her other work, where she is the dead opposite of an Alpha Bitch.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "Avoided", 
                    "short", 
                    "overweight", 
                    "make-over", 
                    "popular", 
                    "make-over", 
                    "popular", 
                    "due", 
                    "narcissistic", 
                    "beautiful", 
                    "make-over", 
                    "thick", 
                    "local", 
                    "skinny/normal", 
                    "Fabulous"
                ], 
                "role": "Avoided in Hairspray. Tracy Turnblad is short and overweight and her make-over can only do so much. Then again, she became popular before the make-over, which is more of a perk of already being popular, by winning the crowd over due to her upbeat attitude and dance ability rather than looks. The love interest, Link Larkin, likes her because she makes him grow as a person, and because he's narcissistic enough to be beautiful enough for both of them. Tracy's mother, Edna Turnblad, is traditionally played by a man, compounding the problems. Her husband, however, doesn't even notice the make-over, as he is in love with her no matter what (and he's as thick as a 1960's bomb shelter door when it comes to noticing things).\n There were casting calls for a local production of the play in Argentina. Even thought the ad for the casting calls clearly demanded overweight teenagers for the role of Tracy, some skinny/normal girls ignored this and auditioned for the role anyway.\n With regards to Edna, in her case it's really a \"Fabulous All Along\" moment.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Big Beautiful Woman: Tracy is this in spades. Also her mother Edna and Motormouth Maybelle.", 
                "id": "BigBeautifulWoman"
            }, 
            {
                "adjectives": [
                    "song", 
                    "titled"
                ], 
                "role": "Tracy Turnblad, Edna Turnblad, and Motormouth Maybelle in Hairspray. Very evident in the latter's song titled \"Big, Blonde, and Beautiful.\"", 
                "id": "BigBeautifulWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Amber Von Tussle from Hairspray, as well as her mother.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "arrogant", 
                    "evil"
                ], 
                "role": "Blondes are Evil: Velma. Amber is arrogant, but not evil.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "Girlish"
                ], 
                "role": "Girlish Pigtails: Penny.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [
                    "Lovable", 
                    "high", 
                    "defeat", 
                    "musical", 
                    "happy", 
                    "final"
                ], 
                "role": "Lovable Alpha Bitch: Although she only seems to be like that because her mother holds very high standards to her. In the end, she accepts defeat and (in the musical at least) Tracy and the others are happy to invite her to join in the final number.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Penny Pingleton's mother Prudy treats her like this in Hairspray, forbidding her from watching \"The Corny Collins Show\" and from visiting Tracy's house.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [], 
                "role": "Sassy Black Woman: Motormouth Maybelle, the Dynamites", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [], 
                "role": "The Dynamites and Motormouth Maybelle from Hairspray. Extra points since the latter is played by Queen Latifah in the latest film.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Velma Von Tussle in Hairspray, who, among other things, tries to  switch the votes for Miss Teenage Hairspray and before that, attempt to seduce Tracy's dad to get her kicked off.", 
                "id": "StageMom"
            }, 
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Velma Von Tussle in Hairspray, especially in the later versions. Her song \"The Legend of Miss Baltimore Crabs\" details her beauty queen past.", 
                "id": "WhiteDwarfStarlet"
            }, 
            {
                "adjectives": [
                    "White-Dwarf"
                ], 
                "role": "White-Dwarf Starlet: Velma Von Tussle, who never lets anyone forget that she was once Miss Baltimore Crabs.", 
                "id": "WhiteDwarfStarlet"
            }
        ]
    }, 
    "imdbid": "tt0427327", 
    "poster_url": "Hairspray.jpg", 
    "similar": [
        {
            "shared": [
                "MyBelovedSmother", 
                "AlphaBitch", 
                "LovableAlphaBitch", 
                "SassyBlackWoman"
            ], 
            "shared_count": 4, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "WhiteDwarfStarlet", 
                "BlondesAreEvil", 
                "GirlishPigtails"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "BlondesAreEvil", 
                "AlphaBitch", 
                "LovableAlphaBitch", 
                "StageMom"
            ], 
            "shared_count": 4, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "HenpeckedHusband", 
                "MyBelovedSmother", 
                "StageMom"
            ], 
            "shared_count": 4, 
            "id": "Gypsy", 
            "name": "Gypsy", 
            "poster_url": "Gypsy.jpg"
        }, 
        {
            "shared": [
                "BlondesAreEvil", 
                "AlphaBitch", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }
    ], 
    "id": "Hairspray", 
    "name": "Hairspray"
}