{
    "plot": "Marnie, Dylan, and Sophie Piper have their first out of many adventures! On Halloween, while Marnie is arguing with her mother Gwen, the kids' grandmother Aggie comes to visit. Aggie wants to start Marnie's witch training before her 13th birthday or Marnie will lose her powers forever. But there is another reason for Aggie's visit. Something dark & evil is growing in Halloweentown & Aggie wants help to defeat it. While Aggie & Gwen are arguing, Aggie uses magic which Marnie observes. After Aggie leaves to return to Halloweentown, Marnie, Dylan and, unknown to Marnie and Dylan, Sophie follow her onto the return bus. Soon afterwards, Gwen follows the children to Halloweentown. While there, Aggie & Gwen are attacked by the dark force in a movie theater. Marnie, Dylan & Sophie race to get the ingredients to activate Merlin's Wand to stop the evil.", 
    "genres": "Adventure, Comedy, Family", 
    "release_year": "1998", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Alpha Bitch: Three in Return To Halloweentown - Scarlet, Sage, and Sapphire.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "few", 
                    "such"
                ], 
                "role": "Cute Monster Girl: There are a few such as a troll.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "witchy", 
                    "main", 
                    "interested", 
                    "skilled"
                ], 
                "role": "Halloweentown has the witchy generations of the daughter Marnie Piper, main character and interested in witchcraft, the mother Gwen Piper who tries to proctect her children from witchcraft, and the grandmother Aggie Cromwell, a skilled witch.", 
                "id": "TheHecateSisters"
            }, 
            {
                "adjectives": [
                    "fourth", 
                    "first"
                ], 
                "role": "In the fourth movie, he is interested in Scarlet Sinister not just for her looks, but also because she speaks Latin the first time he meets her.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0173886", 
    "poster_url": "Halloweentown.jpg", 
    "similar": [
        {
            "shared": [
                "TheVamp", 
                "TheHecateSisters", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "BlackSwan", 
            "name": "Black Swan", 
            "poster_url": "BlackSwan.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "CoolWorld", 
            "name": "Cool World", 
            "poster_url": "CoolWorld.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "DeathBecomesHer", 
            "name": "Death Becomes Her"
        }, 
        {
            "shared": [
                "TheHecateSisters", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "KikisDeliveryService", 
            "name": "Kiki's Delivery Service"
        }, 
        {
            "shared": [
                "TheVamp", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "CruelIntentions", 
            "name": "Cruel Intentions", 
            "poster_url": "CruelIntentions.jpg"
        }
    ], 
    "id": "Halloweentown", 
    "name": "Halloweentown"
}