{
    "plot": "A collection of seven stories from the Halo Universe created by Japan's most creative minds. First up is \"Origins\" a two part episode showing the expansive history of the Halo Universe and the history of the 100,000 year long franchise timeline, told through the eyes of Cortana. Second comes \"The Duel\" Taking place long before the Human-Covenant War, it tells the story of an Arbiter, Fal 'Chavamee, who refuses to accept the Covenant Religion. Taking a turn to the Spartan side of the story \"Homecoming\" focuses on the tragedies involving the Spartan-II recruitment in 2517, and the Spartans coming to terms with their origins. Taking a turn in tone comes \"Odd One Out\" a non-cannon parody of the Halo storyline. \"Prototype\" tells the story of a Marine who goes against his orders to destroy an advanced prototype armor and uses the suit to buy time for civilians evacuating from the planet. \"The Babysitter\" tales of the the rivalry between the Spartan-II Commandos and the Orbital Drop Shock Troopers as they're sent to Covenant-controlled world to assassinate a Covenant Prophet. And finally \"The Package\" a two-part all CGI film follows Master Chief and an elite squad of Spartan-II super soldiers as they execute a top-secret mission to retrieve a highly valuable UNSC asset on a Covenant Assault Carrier.", 
    "genres": "Animation, Action, Sci-Fi", 
    "release_year": "2010", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Kelly-087, Daisy-023 and  Cal-141.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "Hot", 
                    "straight", 
                    "short", 
                    "attractive", 
                    "early"
                ], 
                "role": "Hot Scientist — Played fully straight with  Dr. Catherine Halsey herself in the Halo Legends short The Package. You'd want to check her package out. Especially amusing considering the fact that she's supposed to be 52 at the time... and how she looks in Reach. The producers have admitted that they let her design stray from canon for a little fanservice. The Halsey in \"Homecoming\" is arguably more attractive then \"The Package\" version; apart from the Adaptation Dye-Job, it's at least justified by the fact that \"Homecoming\" Halsey is still in her early 30s.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "youthful", 
                    "commentary"
                ], 
                "role": "Ms. Fanservice: Cortana Also the reason that they made Dr. Halsey look rather youthful for her age (~52 by the events of The Package), according to the commentary.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "rampant"
                ], 
                "role": "Team Mom: A rampant AI in Odd One Out.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Kelly-087", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt1480660", 
    "poster_url": "HaloLegends.jpg", 
    "similar": [
        {
            "shared": [
                "TeamMom", 
                "TheChick", 
                "MsFanservice", 
                "HotScientist"
            ], 
            "shared_count": 4, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "HotScientist", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "HotScientist", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "Sharknado", 
            "name": "Sharknado"
        }, 
        {
            "shared": [
                "TeamMom", 
                "MsFanservice", 
                "TheChick"
            ], 
            "shared_count": 3, 
            "id": "WereTheMillers", 
            "name": "We're the Millers", 
            "poster_url": "WereTheMillers.jpg"
        }
    ], 
    "id": "HaloLegends", 
    "name": "Halo Legends"
}