{
    "plot": "\"Happy Go Lucky\" is a family comedy with the underlying theme: a little wager adds to the pleasure of life, but raising the stakes ultimately leads to destruction. A hardcore gambler from young, Hock Lee Poh is at the same time, an ardent believer of Feng Shui. Always down on his luck, he continues to indulge in gambling all the time. His eldest daughter Donna though petty and calculative, spends all her time and money on lavish nightlife and hunky social escorts - till she loses everything in the end. Fu Xin, Poh's illegitimate second daughter is born at an extremely inauspicious hour and thus labeled as the \"jinx\" of the family. Despite the nasty label on her, Fu Xin actually is a surreptitious 'Lucky Star' who always manages to avert precarious situations; turning unfavourable conditions into favourable ones, having the Midas touch in everything she does. The straight-forward, unassuming and childlike Fu Xin sacrifices a lot for the family. And in a twist of fate and luck, Fu Xin unexpectedly helps Poh to win a hefty sum of money. As the plot continues, Poh and Donna find themselves stranded along the streets of Cambodia in a failed attempt to recoup their losses at the gambling tables. Fortunately, Fu Xin arrives to their rescue after a chance encounter with Mr. Morgan, a casino magnate who takes an affinity to Fu Xin. We then see a transformation of luck and favour for the Poh family as Fu Xin and Mr. Morgan become good friends. The blossoming friendship enables the family to have a secure, stable life and brings a happy reunion for the Poh family.", 
    "genres": "Comedy, Drama", 
    "release_year": "2010", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "whole", 
                    "flirtatious", 
                    "real"
                ], 
                "role": "Manic Pixie Dream Girl: The whole film is something of a deconstruction -  Poppy doesn't realise the way her behaviour can look flirtatious to an uptight, frustrated older man, while he doesn't realise she's a real person and not his rescuing Blithe Spirit.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "free-spirited", 
                    "closed-off", 
                    "other", 
                    "rant", 
                    "selfish"
                ], 
                "role": "Played with in Happy Go Lucky. The main character, Poppy, is a free-spirited extreme optimist who starts taking driving lessons from an uptight, closed-off pessimist who develops a crush on her. Subverted in that she doesn't return the feelings, and stops the driving lessons so they won't see each other again after he lampshades this trope with a rant about how selfish it is - even if she ultimately doesn't fit the trope, no one could convince him differently.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt1600522", 
    "similar": [
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Lo", 
            "name": "Lo"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "LAStory", 
            "name": "LA Story"
        }
    ], 
    "id": "HappyGoLucky", 
    "name": "Happy Go Lucky"
}