{
    "plot": "Harry's fourth year at Hogwarts is about to start and he is enjoying the summer vacation with his friends. They get the tickets to The Quidditch World Cup Final but after the match is over, people dressed like Lord Voldemort's 'Death Eaters' set a fire to all the visitors' tents, coupled with the appearance of Voldemort's symbol, the 'Dark Mark' in the sky, which causes a frenzy across the magical community. That same year, Hogwarts is hosting 'The Triwizard Tournament', a magical tournament between three well-known schools of magic : Hogwarts, Beauxbatons and Durmstrang. The contestants have to be above the age of 17, and are chosen by a magical object called Goblet of Fire. On the night of selection, however, the Goblet spews out four names instead of the usual three, with Harry unwittingly being selected as the Fourth Champion. Since the magic cannot be reversed, Harry is forced to go with it and brave three exceedingly difficult tasks.", 
    "genres": "Adventure, Family, Fantasy", 
    "release_year": "2005", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "neat", 
                    "previous", 
                    "doesnï¿½t", 
                    "daily", 
                    "gorgeous"
                ], 
                "role": "Beautiful All Along: Hermione appearing gorgeously dressed and with neat, beautifully arranged hair in this movie has essentially none of the effect to the audience that it had in the books, since the filmmakers had already shown her prettily made-up in the previous film with no given explanation. Her own admission that cleaning up like that takes hours and doesnï¿½t want to bother with it on a daily basis is also promptly ignored, so she looks consistently gorgeous throughout all the films.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scoop: Rita Skeeter as played by Miranda Richardson. She also seems to be a bit of a Mrs. Robinson.", 
                "id": "HotScoop"
            }, 
            {
                "adjectives": [
                    "dead", 
                    "subdue"
                ], 
                "role": "Mama Bear and Papa Wolf: Among the dead that subdue Voldemort are Lily and James Potter. Not even death can keep them from protecting their son.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "In Harry Potter and the Goblet of Fire, you look at Cedric Diggory and his dad Amos and you think Ced got all his looks from his mom.", 
                "id": "TheUglyGuysHotDaughter"
            }
        ]
    }, 
    "imdbid": "tt0330373", 
    "poster_url": "HarryPotterAndTheGobletOfFire.jpg", 
    "similar": [
        {
            "shared": [
                "BeautifulAllAlong", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "WhatAGirlWants", 
            "name": "What a Girl Wants", 
            "poster_url": "WhatAGirlWants.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "TheUglyGuysHotDaughter"
            ], 
            "shared_count": 2, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "TheVirginSuicides", 
            "name": "The Virgin Suicides", 
            "poster_url": "TheVirginSuicides.jpg"
        }, 
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "HotScoop"
            ], 
            "shared_count": 2, 
            "id": "AnAmericanTail", 
            "name": "An American Tail", 
            "poster_url": "AnAmericanTail.jpg"
        }
    ], 
    "id": "HarryPotterAndTheGobletOfFire", 
    "name": "Harry Potter and the Goblet of Fire"
}