{
    "plot": "N/A", 
    "genres": "Drama", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "small", 
                    "By-the-Book", 
                    "clean-shaven"
                ], 
                "role": "Heavy Rain: Rabid Cop Carter Blake has a small beard which contrasts with By-the-Book Cop Norman Jayden's clean-shaven face.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "clean", 
                    "other", 
                    "new"
                ], 
                "role": "Heavy Rain: After  his son Jason is hit by a car in the prologue, a formerly clean shaven Ethan Mars sports a beard for the rest of the game.\n He will shave it at the end of the game  if his other son Shaun is saved and he forgave Madison. He will appear beardless in a scene of the epilogue where he is looking for a new place to stay with Madison.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [], 
                "role": "Dirty Coward: If you don't do the trials. Best example, you can refuse to do the Lizard Trial, and use your two hands to help you and Madison escape, but you end up being shot in the arm instead. The game even calls you out on it with the door leading to freedom in the Butterfly trial being labeled \"Coward\", should you choose not to do the trial.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "much", 
                    "standard", 
                    "later", 
                    "own", 
                    "open"
                ], 
                "role": "Disappeared Dad: As Shelby goes around visiting the families of the victims of the Origami Killer, the husbands of both Lauren Winters and Mrs. Susan Bowles have disappeared soon after their sons did. As much as this would seem as a standard case of Disappeared Dad, you find out later that one father actually went out as Ethan Mars did to complete the trials to save his own son, but ended up dying in the power plant in the Butterfly chapter. This is similarly implied for the rest of the fathers... except for Reza's father, the shopkeeper. He didn't dare open the box. Or he did, but didn't realize he was supposed to unfold the origami. In-Game Guide Damn It!", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "famous", 
                    "French", 
                    "own", 
                    "own"
                ], 
                "role": "Ethan Mars from Heavy Rain. He's modeled after a famous French actor◊, divorced from his wife during the bulk of the storyline and his whole character arc is essentially an exploration of what a father will do to save his son, which, depending on the player's actions can include cutting off part of his own finger, killing a man, risking his own death and eventually committing suicide (or so he's led to believe).", 
                "id": "HotDad"
            }, 
            {
                "adjectives": [
                    "willing"
                ], 
                "role": "Heavy Rain's Ethan Mars. Despite that, he is willing to save his son, Shaun.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [
                    "scary", 
                    "skull"
                ], 
                "role": "Mad Jack from Heavy Rain. He's so scary,  he has a skull in his acid bath.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Black Man: Jackson \"Mad Jack\" Neville.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Heavy Rain has Norman Jayden.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "handsome"
                ], 
                "role": "Norman Jayden from Heavy Rain is quite handsome, but spends most of the game struggling with a debilitating addiction to  triptocaine and  his overuse of the ARI. Things get even less pretty when he starts having withdrawal symptoms from trying to break himself out of the habit.", 
                "id": "TroubledButCute"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Lauren from Heavy Rain forces her way into Scott Shelby's investigation of the Origami Killer, despite the danger, to bring her son's killer to justice. If she survives and your other characters don't catch the killer, she succeeds.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "weird", 
                    "successful", 
                    "further", 
                    "optional"
                ], 
                "role": "Heavy Rain: Madison plays with this one in a weird way. Her encounters along the story tend to be overtly and unnecessarily sexualized, but they play her up to be an abuse victim (a dream sequence where she's attacked in her underwear, being assaulted by an insane rapist/murderer doctor, being forced to perform a striptease at gunpoint) and her successful action sequences are when she's defending herself from those assaults; further, there is an optional sex scene between Madison and Ethan, but the player is controlling him, and not her.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [
                    "good", 
                    "MamaBear/PapaWolf"
                ], 
                "role": "Additionally, good luck holding back MamaBear/PapaWolf rage at seeing the recordings the Origami Killer sends you.", 
                "id": "MamaBear"
            }
        ]
    }, 
    "imdbid": "tt0788090", 
    "similar": [
        {
            "shared": [
                "BeardOfSorrow", 
                "NonActionGuy", 
                "BeardOfEvil", 
                "HookerWithAHeartOfGold", 
                "DirtyCoward"
            ], 
            "shared_count": 5, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "DisappearedDad", 
                "HotDad", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "BeardOfEvil", 
                "ScaryBlackMan", 
                "MamaBear"
            ], 
            "shared_count": 4, 
            "id": "KillBill", 
            "name": "Kill Bill", 
            "poster_url": "KillBill.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "BeardOfEvil", 
                "ScaryBlackMan", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "DisappearedDad", 
                "SharpDressedMan", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "Inception", 
            "name": "Inception", 
            "poster_url": "Inception.jpg"
        }
    ], 
    "id": "HeavyRain", 
    "name": "Heavy Rain"
}