{
    "plot": "Theodore is a lonely man in the final stages of his divorce. When he's not working as a letter writer, his down time is spent playing video games and occasionally hanging out with friends. He decides to purchase the new OS1, which is advertised as the world's first artificially intelligent operating system, \"It's not just an operating system, it's a consciousness,\" the ad states. Theodore quickly finds himself drawn in with Samantha, the voice behind his OS1. As they start spending time together they grow closer and closer and eventually find themselves in love. Having fallen in love with his OS, Theodore finds himself dealing with feelings of both great joy and doubt. As an OS, Samantha has powerful intelligence that she uses to help Theodore in ways others hadn't, but how does she help him deal with his inner conflict of being in love with an OS?", 
    "genres": "Drama, Romance, Sci-Fi", 
    "release_year": "2013", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "song"
                ], 
                "role": "Broken Bird: Theodore. Early in the film, he even instructs his computer to find a \"melancholy song\" to play.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "inside", 
                    "own"
                ], 
                "role": "Theodore in Her begins the film isolated and withdrawn. He's a writer who has always been inside his own head, but completely caves in after his wife divorces him.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "ex-wife", 
                    "complicated", 
                    "real", 
                    "new", 
                    "same", 
                    "tired", 
                    "acting"
                ], 
                "role": "Her: Theodore's ex-wife accuses him of wanting her to be that way, a happy object to balance out his dour, brooding self, and suggests he's dating a computer because she's less complicated than a real woman. Samantha, his new computer/girlfriend, expresses the same opinion and tells Theodore she's tired of acting the way he wants her to act.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "straight", 
                    "peppy", 
                    "curious", 
                    "cheerful", 
                    "ex-wife", 
                    "complicated", 
                    "real", 
                    "tired", 
                    "perfect"
                ], 
                "role": "Manic Pixie Dream Girl: Lampshaded, seemingly played straight, but ultimately subverted. Samantha comes off as being very much a Dream Girl — she is peppy, curious, cheerful, and her life quite literally fixates on Theodore's. Theodore's ex-wife, Catherine, accuses him of dating an OS because she's less complicated than a real woman, but Samantha ultimately stands her ground and tells Theodore she's tired of trying to act perfect for him.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt1798709", 
    "poster_url": "Her.jpg", 
    "similar": [
        {
            "shared": [
                "BrokenBird", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "NorwegianWood", 
            "name": "Norwegian Wood", 
            "poster_url": "NorwegianWood.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Bridesmaids", 
            "name": "Bridesmaids", 
            "poster_url": "Bridesmaids.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Waitress", 
            "name": "Waitress", 
            "poster_url": "Waitress.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }
    ], 
    "id": "Her", 
    "name": "Her"
}