{
    "plot": "Hercules, son of the Greek God, Zeus, is turned into a half-god, half-mortal by evil Hades, God of the Underworld, who plans to overthrow Zeus. Hercules is raised on Earth and retains his god-like strength, but when he discovers his immortal heritage Zeus tells him that to return to Mount Olympus he must become a true hero. Hercules becomes a famous hero with the help of his friend Pegasus and his personal trainer, Phil the satyr. Hercules battles monsters, Hades and the Titans, but it is his self-sacrifice to rescue his love Meg which makes him a true hero.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Phil, Hercules' mentor.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [], 
                "role": "Phil from Hercules likes to spy on nymphs. They... don't appreciate the attention.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [
                    "Hercules:"
                ], 
                "role": "Dumb Muscle: (Purportedly) Averted with Hercules:", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [], 
                "role": "Hercules from Hercules.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "first", 
                    "second"
                ], 
                "role": "Jerk Jock: Iphitus in the first film; Polynices' General in the second. Also Herc himself in the second film, to an extent; he won't defend his wife from Anteaus but reacts when Anteaus attacks him directly.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [], 
                "role": "Kavorka Man: Ajax.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Papa Wolf: Zeus tries to be this, but it is to no avail the first try.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "Zeus from Hercules.", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "soul", 
                    "cynical"
                ], 
                "role": "Megara from Disney's Hercules. After making a Deal with the Devil and becoming a slave to Hades to save her boyfriend's soul, only to have said boyfriend dump her for another girl, she's more than a little cynical, particularly towards Hercules.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [], 
                "role": "\"Hercules and the Dream Date\" has a guest character in Galatea, Hercules' date for the Aphrodesia Dance, who's completely obsessed with him. Galatea was voiced by Jennifer Aniston, who was dating Tate Donovan at the time.", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [
                    "husky", 
                    "atypical", 
                    "general", 
                    "female"
                ], 
                "role": "Contralto of Danger: Megara has a sultry, husky voice, atypical of both Disney female Love Interests in general and female characters in the movie. She's also working for Hades (albeit unwillingly), and at one point tries to seduce Herc into revealing his weaknesses, though she ends up falling for him instead.", 
                "id": "ContraltoOfDanger"
            }, 
            {
                "adjectives": [
                    "husky", 
                    "atypical", 
                    "general", 
                    "female"
                ], 
                "role": "Megara from Hercules has a sultry, husky voice, atypical of both Disney female Love Interests in general and female characters in the movie. She's also working for Hades (albeit unwillingly), and at one point tries to seduce Herc into revealing his weaknesses, though she just ends up falling for him instead.", 
                "id": "ContraltoOfDanger"
            }, 
            {
                "adjectives": [
                    "Lampshaded:"
                ], 
                "role": "Damsel in Distress: Lampshaded:", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Iole.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "first", 
                    "later", 
                    "happy"
                ], 
                "role": "Meg in Disney's Hercules is genuinely in trouble the first time Hercules helps her out, but she later plays a Decoy Damsel to lure Hercules to a rock slide and a hydra, with help from Pain and Panic as Decoy Kids. She's not happy about having to do it, and it isn't her idea, but she did make a Deal with the Devil and cannot go against her employer, Hades.", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [
                    "Italian", 
                    "popular", 
                    "stay-at-home", 
                    "late", 
                    "'60s", 
                    "due", 
                    "ample"
                ], 
                "role": "The Italian Hercules movies were very popular with stay-at-home housewives in the late '50s and early '60s due to their ample displays of buff, shirtless male bodybuilders. As Moviebob put it:", 
                "id": "EstrogenBrigade"
            }, 
            {
                "adjectives": [], 
                "role": "Fangirl: Crowds of them. Everywhere. \"I'VE GOT HIS SWEAT BAND!\"", 
                "id": "Fangirl"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Femme Fatale: Omphale. To a lesser extent, the Amazons in the first film; they didn't want to kill Jason and his men, but were ordered to do so by their priestesses.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "purple"
                ], 
                "role": "Meg from Hercules has purple eyes and a lavender dress.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "first"
                ], 
                "role": "Megara from Hercules, anyone? To her credit, she was never really evil in the first place.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "short"
                ], 
                "role": "Sassy Black Woman: All five of the Muses; however, Thalia, the short plump one, seems sassier than most.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Thalia in Hercules.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "bizarre/brilliant", 
                    "odd", 
                    "unintentional", 
                    "first", 
                    "sarcastic"
                ], 
                "role": "The Fates appear in Disney's Hercules, though they are depicted as the Graiae. In one episode of the TV series, when Hercules and Phil travel north and meet the Norse pantheon (with a bizarre/brilliant appearance by Garrison Keillor as Odin), it is revealed that they also fill in as the Norns.\n To clarify about the Fates, they're an odd and possibly unintentional example. While they all look like Crones, they each have the personalities of the three sisters; Clotho is the Maiden (giggles like a giddy schoolgirl when Hades tries to flatter her into revealing the future and is the first to try without any hesitation), Lachesis is the Mother (scolds Clotho for trying to reveal the future and reminds her that it's against the rules) and Atropos is the Crone (the oldest looking one—and that's saying something—and usually the one to say something sarcastic).", 
                "id": "TheHecateSisters"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Cassandra and Helen.", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt0119282", 
    "poster_url": "Hercules.jpg", 
    "similar": [
        {
            "shared": [
                "ClingyJealousGirl", 
                "KavorkaMan", 
                "TomBoyAndGirlyGirl", 
                "TheHecateSisters", 
                "DamselInDistress", 
                "Hunk"
            ], 
            "shared_count": 6, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "PapaWolf", 
                "TomBoyAndGirlyGirl", 
                "SassyBlackWoman", 
                "FemmeFatale"
            ], 
            "shared_count": 5, 
            "id": "TheIncredibles", 
            "name": "The Incredibles"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "ClingyJealousGirl", 
                "JerkJock", 
                "FemmeFatale", 
                "ChivalrousPervert"
            ], 
            "shared_count": 5, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "DamselInDistress", 
                "TomBoyAndGirlyGirl", 
                "SassyBlackWoman", 
                "GracefulLadiesLikePurple"
            ], 
            "shared_count": 5, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "Hunk", 
                "DamselInDistress", 
                "BrokenBird", 
                "GracefulLadiesLikePurple"
            ], 
            "shared_count": 4, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }
    ], 
    "id": "Hercules", 
    "name": "Hercules"
}