{
    "plot": "Having been away for four months, Hildy Johnson walks into the offices of the New York City based The Morning Post, where she is a star reporter, to tell her boss, editor Walter Burns, that she is quitting. The reason for her absence was among other things to get a Reno divorce, from, of all people, Walter, who admits he was a bad husband. Hildy divorced Walter largely because she wanted more of a home life, whereas Walter saw her more as a driven hard-boiled reporter than subservient homemaker. Hildy has also come to tell Walter that she is taking the afternoon train to Albany, where she will be getting married tomorrow to staid straight-laced insurance agent, Bruce Baldwin, with whose mother they will live, at least for the first year. Walter doesn't want to lose Hildy, either as a reporter or a wife, and if he does, doesn't believe Bruce is worthy of her. Walter does whatever he can at least to delay Hildy and Bruce's trip, long enough to persuade Hildy to stay for good. His plan includes doing whatever he can to place Bruce in a bad light, while dangling a big story under her nose, namely covering what the newspaper believes is the unfair imminent execution of convicted cop killer, Earl Williams. Hildy doesn't trust Walter in dealing with her and Bruce in an above board manner, but the lure of what potentially may become the biggest story in years, which includes true love, a bumbling sheriff and a corrupt mayor, the latter's actions largely in light of an upcoming election, may prove to be too much for Hildy to resist, especially if it ends up being an exclusive. Regardless of the story outcome, Hildy will have to decide if the thrill of the chase was worth the anguish on her personal life.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1940", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Girl Friday: Hildy. Co-Trope Namer, with Robinson Crusoe", 
                "id": "GirlFriday"
            }, 
            {
                "adjectives": [
                    "close"
                ], 
                "role": "Grande Dame: Mrs. Baldwin is close to this type.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scoop: Walter and Hildy.", 
                "id": "HotScoop"
            }, 
            {
                "adjectives": [], 
                "role": "One of the Boys: Hildy.", 
                "id": "OneOfTheBoys"
            }
        ]
    }, 
    "imdbid": "tt0032599", 
    "poster_url": "HisGirlFriday.jpg", 
    "similar": [
        {
            "shared": [
                "OneOfTheBoys", 
                "HotScoop"
            ], 
            "shared_count": 2, 
            "id": "TheHudsuckerProxy", 
            "name": "The Hudsucker Proxy", 
            "poster_url": "TheHudsuckerProxy.jpg"
        }, 
        {
            "shared": [
                "GrandeDame", 
                "OneOfTheBoys"
            ], 
            "shared_count": 2, 
            "id": "EverAfter", 
            "name": "Ever After"
        }, 
        {
            "shared": [
                "HotScoop"
            ], 
            "shared_count": 1, 
            "id": "SkyCaptainAndTheWorldOfTomorrow", 
            "name": "Sky Captain and the World of Tomorrow", 
            "poster_url": "SkyCaptainAndTheWorldOfTomorrow.jpg"
        }, 
        {
            "shared": [
                "HotScoop"
            ], 
            "shared_count": 1, 
            "id": "Innerspace", 
            "name": "Innerspace", 
            "poster_url": "Innerspace.jpg"
        }, 
        {
            "shared": [
                "GrandeDame"
            ], 
            "shared_count": 1, 
            "id": "AnimalCrackers", 
            "name": "Animal Crackers", 
            "poster_url": "AnimalCrackers.jpg"
        }
    ], 
    "id": "HisGirlFriday", 
    "name": "His Girl Friday"
}