{
    "plot": "In 1979 the Monty Python comedy team return from making their film 'Monty Python's Life of Brian' in Tunisia. Premiered in America the film is pilloried by ultra-right religious groups for its depiction of Christ. In England the Popular Peoples' Church of St Sophia (whose members include a Tourette's sufferer who shouts out swear words) find a copy of the script in a dustbin and lobby the British censor for its suppression, leading to many local councils banning its screening. Death threats follow and Michael Palin - \"the nicest man in Britain\" - has his effigy burned on his front lawn. Finally crazed TV programmer Alan Dick persuades Palin and co-star John Cleese to defend the picture on a late night chat show against the Bishop of Southwark and religious commentator Malcolm Muggeridge. Thanks to Cleese's reasoning the Pythons are seen to triumph, winning over the Popular Peoples' Church. A later encounter with God will show how the film's controversy paved the way for other artistic endeavours which prompted protest. Brilliant characterisations are vitiated by a satirical 'treatment' including animated sequences and irritating attempts at surreal wit when a documentary style treatment would have sufficed. Several of the Pythons were hostile to the film, summed up in the floor manager's comment. \"Another fantasy sequence...lame\".", 
    "genres": "Comedy, Drama", 
    "release_year": "2011", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Brawn Hilda: Jones the Wife, at once Played for Laughs and yet oddly sympathetically when the acknowledgement of her masculinity (on account of the fact she is played by the Terry Jones character in drag) is made.", 
                "id": "BrawnHilda"
            }
        ]
    }, 
    "imdbid": "tt1981637", 
    "similar": [
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "RobinHoodPrinceOfThieves", 
            "name": "Robin Hood: Prince of Thieves", 
            "poster_url": "RobinHoodPrinceOfThieves.jpg"
        }, 
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "TheSinisterUrge", 
            "name": "The Sinister Urge", 
            "poster_url": "TheSinisterUrge.jpg"
        }, 
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "LaserMission", 
            "name": "Laser Mission", 
            "poster_url": "LaserMission.jpg"
        }, 
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "FiddlerOnTheRoof", 
            "name": "Fiddler on the Roof", 
            "poster_url": "FiddlerOnTheRoof.jpg"
        }
    ], 
    "id": "HolyFlyingCircus", 
    "name": "Holy Flying Circus"
}