{
    "plot": "3 backpackers are in Amsterdam where they get locked out of their youth hostel. They are invited into a man's house where he tells them of a hostel somewhere in eastern Europe where the women are all incredibly hot and have a taste for American men. When they get there, everything is too good to be true - the hostel is \"to die for\"", 
    "genres": "Horror", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Dutch", 
                    "lesbian", 
                    "ruthless"
                ], 
                "role": "Depraved Homosexual:  The Dutch Businessman. Possibly Axelle who may be lesbian or at least bi or maybe using her sexuality to manipulate Beth and maybe depraved or may just be ruthless)", 
                "id": "DepravedHomosexual"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "previous", 
                    "fair", 
                    "brutal", 
                    "garden"
                ], 
                "role": "Action Girl: Beth in Part II is more badass than any previous protagonists by a fair margin — she gives Stuart, her torturer, a brutal Groin Attack with garden shears, joins the hunting club, and beheads the woman who tricked her and her friends into going to the hostel in the end. Oh, and she becomes one of the club members...i.e. the villains of the movie.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "male", 
                    "heavy", 
                    "first", 
                    "innocent—although", 
                    "ambiguous", 
                    "virginal", 
                    "untouched", 
                    "first"
                ], 
                "role": "Subverted in Hostel.  The film's only surviving character is Paxton, who is not only male, but a heavy drinker and drug user who spends the first half of the film screwing anything with a pulse. By contrast, Josh, who dies earlier, is relatively innocent—although Josh's ambiguous sexuality may make him an example of Bury Your Gays.\n Also subverted in Hostel 2. Beth, the Final Girl who we've come to see as innocent and virginal,  turns out to be just as ruthless and bloodthirsty as her captors. She brutally castrates her \"hunter\" and strikes a deal with Sasha, the club's ringleader. In contrast Lorna, the untouched Cloud Cuckoo Lander, is the first to die and was selected specifically because she was a virgin. Her \"hunter\" had a Countess Bathory fetish.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [], 
                "role": "The Vamp: Natalya and Svetlana", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0450278", 
    "poster_url": "Hostel.jpg", 
    "similar": [
        {
            "shared": [
                "ActionGirl", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "YoureNext", 
            "name": "You're Next", 
            "poster_url": "YoureNext.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "HellraiserBloodline", 
            "name": "Hellraiser: Bloodline", 
            "poster_url": "HellraiserBloodline.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "Hausu", 
            "name": "Hausu"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "DepravedHomosexual", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }
    ], 
    "id": "Hostel", 
    "name": "Hostel"
}