{
    "plot": "In 1895, Dracula builds a resort in Transylvania, hidden from the humans, to raise his beloved daughter Mavis in a safe environment. In the present, the place is the Hotel Transylvania, where monsters bring their families to vacation far from the frightening humans. Dracula invites his friends - Frankenstein and his wife Eunice; Wayne and Wanda, the werewolves; Griffin, the invisible man; Murray, the mummy; Bigfoot, among others - to celebrate the 118th birthday of Mavis. When the party is ready to start, the 21-year-old Jonathan is walking through the forest and stumbles upon the hotel. Dracula sees Jonathan and disguises him as a monster to hide Jonathan from the guests. But Mavis also sees Jonathan and Dracula forces him to pose as a monster. Soon Mavis believes that Jonathan is the \"zing\" of her life despite the advice of her father about humans.", 
    "genres": "Animation, Comedy, Family", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "More implied in the Hotel Transylvania fic How to Zing. Martha starts out Human, but Drac turns her into a Vampire so they can be together. Her father then swears vengeance on all Vampires for what happened. Said father is Abraham Van Helsing.", 
                "id": "ArchnemesisDad"
            }, 
            {
                "adjectives": [], 
                "role": "Henpecked Husband: Frank.", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [], 
                "role": "Keet: Jonathan.", 
                "id": "Keet"
            }, 
            {
                "adjectives": [
                    "seventh"
                ], 
                "role": "Jonathan says he had six brothers growing up, making him a seventh son.", 
                "id": "MagicalSeventhSon"
            }, 
            {
                "adjectives": [], 
                "role": "Surfer Dude: Jonathan has the attitude and lingo down, plus he's shown riding scooters and surfing on flying tables.", 
                "id": "SurferDude"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Cute Monster Girl: Mavis. If it weren't for her cute little fangs, she'd look like just another perky goth.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "song", 
                    "only"
                ], 
                "role": "Daddy's Girl: Mavis for Dracula, lampshaded by the song he sings to her as a child. Now, since she wants to leave home so much, she seems to have grown out of that phase. Wayne's only daughter, Winnie, is the only one of his children to actually respect him.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "only", 
                    "overprotective", 
                    "song", 
                    "little"
                ], 
                "role": "Mavis from Hotel Transylvania is this with her father Count Dracula. She is an only child, loves her father very much, and given the circumstances of the family's Missing Mom status, Drac is extremely doting and overprotective of her. Likewise, Drac loves his daughter immensely, with nearly all of his actions in the movie being driven by his desire to see her happy and keep her safe. The song he sings to her when she's little is all about her Daddy's Girl status, and is titled \"Daddy's Girl\" to that effect.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "happy", 
                    "stay-at-home"
                ], 
                "role": "Housewife: Wanda is perfectly happy to be a stay-at-home mom and just can't stop having babies.", 
                "id": "HouseWife"
            }, 
            {
                "adjectives": [
                    "such"
                ], 
                "role": "Missing Mom: Mavis's mom was killed by humans. No wonder Dracula thinks Humans Are the Real Monsters and is such a knight templar parent.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Mavis in Hotel Transylvania, particularly when presented with the opportunity to leave her stifling castle and also whenever spending time around Jonathan.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [], 
                "role": "Perky Goth: Mavis comes off this way.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [], 
                "role": "Sassy Black Woman: The shrunken head hanging on the hotel rooms, but particularly the one on Mavis' door.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "modest"
                ], 
                "role": "Sweater Girl: While Mavis' sweater dress is very modest, it also shows off her curves.", 
                "id": "SweaterGirl"
            }, 
            {
                "adjectives": [
                    "particular", 
                    "crush"
                ], 
                "role": "Wicked Witch: Dracula employs them as maids. One particular witch seems to have a crush on him.", 
                "id": "WickedWitch"
            }
        ]
    }, 
    "imdbid": "tt0837562", 
    "poster_url": "HotelTransylvania.jpg", 
    "similar": [
        {
            "shared": [
                "CuteMonsterGirl", 
                "ArchnemesisDad", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "ClashOfTheTitans", 
            "name": "Clash of the Titans", 
            "poster_url": "ClashOfTheTitans.jpg"
        }, 
        {
            "shared": [
                "Keet", 
                "SurferDude", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "FindingNemo", 
            "name": "Finding Nemo", 
            "poster_url": "FindingNemo.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "MissingMom", 
                "ArchnemesisDad"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "SassyBlackWoman", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "CuteMonsterGirl", 
                "WickedWitch", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "ScoobyDooAndTheGhoulSchool", 
            "name": "Scooby-Doo and the Ghoul School", 
            "poster_url": "ScoobyDooAndTheGhoulSchool.jpg"
        }
    ], 
    "id": "HotelTransylvania", 
    "name": "Hotel Transylvania"
}