{
    "plot": "American teenager Elizabeth \"Daisy\" is sent by her estranged father away from New York to the countryside of England to stay with her Aunt Penn. Her distant cousin Isaac welcomes her at the airport and drives her home. She is introduced to her cousins, seventeen year-old Eddie and young Piper and to their friend Joe. However Daisy is a resentful, needy of love and aloof girl who believes that she is cursed and that bad things happen wherever she goes since her mother died in her delivery. Aunt Penn is a busy woman who is studying the war scenario in England, which is on alert due to an imminent terrorist attack, and needs to fly to Geneva. However, the next morning, a nuclear bomb explodes in London and the authorities of the United Kingdom declare a state of siege. Meanwhile Daisy and Eddie fall in love with each other, but they are separated by the military, which sends girls to one camp and men to another. Daisy and Eddie promise to meet each other again. In a country at war, Daisy and Piper flee their lodging and cross England under martial law, trying to find Eddie and Isaac.", 
    "genres": "Drama, Romance, Thriller", 
    "release_year": "2013", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "self-absorbed", 
                    "strong", 
                    "protective", 
                    "9-year-old"
                ], 
                "role": "Mama Bear: Initially self-absorbed, Daisy unexpectedly discovers a strong protective streak in herself, especially with regard to 9-year-old Piper*", 
                "id": "MamaBear"
            }
        ]
    }, 
    "imdbid": "tt1894476", 
    "poster_url": "HowILiveNow.png", 
    "similar": [
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "SweetHome", 
            "name": "Sweet Home"
        }, 
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "SouthParkBiggerLongerAndUncut", 
            "name": "South Park: Bigger, Longer & Uncut", 
            "poster_url": "SouthParkBiggerLongerAndUncut.jpg"
        }, 
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "PokemonZoroarkMasterOfIllusions", 
            "name": "Pokémon: Zoroark: Master of Illusions"
        }, 
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }
    ], 
    "id": "HowILiveNow", 
    "name": "How I Live Now"
}