{
    "plot": "Long ago up North on the Island of Berk, the young Viking, Hiccup, wants to join his town's fight against the dragons that continually raid their town. However, his macho father and village leader, Stoik the Vast, will not allow his small, clumsy, but inventive son to do so. Regardless, Hiccup ventures out into battle and downs a mysterious Night Fury dragon with his invention, but can't bring himself to kill it. Instead, Hiccup and the dragon, whom he dubs Toothless, begin a friendship that would open up both their worlds as the observant boy learns that his people have misjudged the species. But even as the two each take flight in their own way, they find that they must fight the destructive ignorance plaguing their world.", 
    "genres": "Animation, Adventure, Family", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "pinky"
                ], 
                "role": "Amazon Chaser: Hiccup is head over heels for Astrid, a girl who can kick his ass with her pinky finger.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "major", 
                    "close"
                ], 
                "role": "In How to Train Your Dragon, Hiccup has a major crush on Astrid who is introduced assisting the adults with a dragon raid. Her Gaussian Girl effect is caused by the flames she unflinchingly walks away from. This is followed by a close up of Hiccup's awestruck face.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [], 
                "role": "Badass Beard: Most prominently, Stoick. Again, Vikings.", 
                "id": "BadAssBeard"
            }, 
            {
                "adjectives": [], 
                "role": "Bash Brothers: Stoick and Gobber, buying some time while fighting the Green Death.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [], 
                "role": "Beard of Barbarism: Vikings.", 
                "id": "BeardOfBarbarism"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Stoick the Vast, and most of the other adult male Vikings, in How to Train Your Dragon.", 
                "id": "BeardOfBarbarism"
            }, 
            {
                "adjectives": [
                    "lazy", 
                    "temperamental", 
                    "direct"
                ], 
                "role": "Dumb Muscle: Gronckles may be stubborn and lazy, but they're as temperamental and direct as an angry rhino.", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [
                    "arrogant"
                ], 
                "role": "Jerk Jock: Snotlout, like the movies, is an arrogant jock but he eases up over time.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "dangerous", 
                    "entire", 
                    "unable"
                ], 
                "role": "Papa Wolf: Twice in one scene! Hiccup is in the arena with one of the biggest and most dangerous dragons—the Monstrous Nightmare. On hearing Hiccup tell the entire village that they don't have to kill dragons, Stoick the Vast erupts in fury and slams his hammer on one of the metal bars, denting it. Then when the noise startles the dragon into attacking Hiccup, Toothless hears the boy's scream of fear from miles away, and although he can't fly at this point, claws and tears his way through the forest, breaks through the metal of the arena's cage, then attacks and successfully drives off a dragon three times his size. Stoick also charges in to rescue Hiccup from the Monstrous Nightmare as well, pulling Astrid to safety but unable to rescue Hiccup before Toothless does.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "large"
                ], 
                "role": "Stout Strength: All the adult Vikings are rather large in the midsection, especially Stoick the Vast. Of the children only Fishlegs is like this. Lampshaded by Hiccup early on.", 
                "id": "StoutStrength"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "dragon-riding", 
                    "prosthetic"
                ], 
                "role": "Hiccup in How to Train Your Dragon suits himself up with dragon-riding gear, gains some confidence, and finishes out the movie looking even more hardcore with a prosthetic limb.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "due"
                ], 
                "role": "Brawn Hilda: Most, if not all Viking women apply, due to the constant raiding. Women volunteer for voyages to the dragon's nest and are seen in the fighting crowds with weapons.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "short"
                ], 
                "role": "In How to Train Your Dragon, most of the grown Viking women, even the short ones, have this sort of build. ( Hiccup finds out, for example, that his Missing Mom's Breast Plate was reforged into two helmets, just after one was given to him.)", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "other", 
                    "bright", 
                    "blue", 
                    "traditional", 
                    "shiny", 
                    "beautiful", 
                    "bladed"
                ], 
                "role": "Astrid in How to Train Your Dragon is the best fighter of her entire age group, but she's also quite girly when compared to other women in her village: she wears bright red and blue clothes and favors a headband instead of the traditional helmet, as if to show off her (almost shiny) blond hair.\n Fittingly, the dragon she rides is one of the most beautiful breeds, with glimmering blue scales...and a bladed tail that can shoot spearlike horns with frightening accuracy.", 
                "id": "GirlyBruiser"
            }, 
            {
                "adjectives": [], 
                "role": "Astrid — The Lancer", 
                "id": "GirlyBruiser"
            }, 
            {
                "adjectives": [
                    "alive"
                ], 
                "role": "It is discussed in How to Train Your Dragon that Hiccup's mother passed away before the events of the movie. In the sequel, however, she turns out to be alive.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Missing Mom: Hiccup's. It's never mentioned what happened to her. She's been confirmed to return in the sequel however.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Tomboy: Astrid and Ruffnut and every other woman on Berk too, by our standards. By Berk standards, they lean more towards Girly Bruiser.", 
                "id": "Tomboy"
            }
        ]
    }, 
    "imdbid": "tt0892769", 
    "poster_url": "HowToTrainYourDragon.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "AdrenalineMakeover", 
                "AmazonChaser", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MissingMom", 
                "BrawnHilda", 
                "BashBrothers"
            ], 
            "shared_count": 4, 
            "id": "TheBoondockSaints", 
            "name": "The Boondock Saints", 
            "poster_url": "TheBoondockSaints.jpg"
        }, 
        {
            "shared": [
                "Tomboy", 
                "AmazonChaser", 
                "JerkJock", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "LittleGiants", 
            "name": "Little Giants", 
            "poster_url": "LittleGiants.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "JerkJock", 
                "DumbMuscle"
            ], 
            "shared_count": 3, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "AmazonChaser", 
                "DumbMuscle"
            ], 
            "shared_count": 3, 
            "id": "TheCroods", 
            "name": "The Croods", 
            "poster_url": "TheCroods.jpg"
        }
    ], 
    "id": "HowToTrainYourDragon", 
    "name": "How to Train Your Dragon"
}