{
    "plot": "When a Yakuza boss named Anjo disappears with 300 million yen, his chief henchman, a sadomasochistic man named Kakihara, and the rest of his mob goons go looking for him. After capturing and torturing a rival Yakuza member looking for answers, they soon realize they have the wrong man and begin looking for the man named Jijii who tipped them off in the first place. Soon enough Kakihara and his men encounter Ichi, a psychotic, sexually-repressed young man with amazing martial arts abilities and blades that come out of his shoes. One by one Ichi takes out members of the Yakuza and all the while Kakihara intensifies his pursuit of Ichi and Ichi's controller Jijii. What will happen as the final showdown happens between the tortured and ultra-violent Ichi and the pain-craving Kakihara?", 
    "genres": "Action, Comedy, Crime", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Gayngster: Kakihara appears to be this for Boss Anjo, but he explains that he's rather just In Love with Your Carnage (the punishments Anjo gave him).", 
                "id": "Gayngster"
            }, 
            {
                "adjectives": [
                    "short-lived"
                ], 
                "role": "Kakihara and his short-lived boss in Ichi the Killer.", 
                "id": "Gayngster"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Disposable", 
                    "later", 
                    "second"
                ], 
                "role": "Disposable Sex Worker: Two of them. One is befriended by Ichi who later kills her along with her pimp. The second is raped and tortured to death by the twins during the search for Ichi.", 
                "id": "DisposableSexWorker"
            }
        ]
    }, 
    "imdbid": "tt0296042", 
    "poster_url": "IchiTheKiller.jpg", 
    "similar": [
        {
            "shared": [
                "Gayngster", 
                "DisposableSexWorker"
            ], 
            "shared_count": 2, 
            "id": "EasternPromises", 
            "name": "Eastern Promises", 
            "poster_url": "EasternPromises.jpg"
        }, 
        {
            "shared": [
                "DisposableSexWorker"
            ], 
            "shared_count": 1, 
            "id": "DarkCity", 
            "name": "Dark City"
        }, 
        {
            "shared": [
                "DisposableSexWorker"
            ], 
            "shared_count": 1, 
            "id": "TheBurning", 
            "name": "The Burning", 
            "poster_url": "TheBurning.jpg"
        }, 
        {
            "shared": [
                "DisposableSexWorker"
            ], 
            "shared_count": 1, 
            "id": "TheCurseOfTheWerewolf", 
            "name": "The Curse of the Werewolf", 
            "poster_url": "TheCurseOfTheWerewolf.jpg"
        }, 
        {
            "shared": [
                "DisposableSexWorker"
            ], 
            "shared_count": 1, 
            "id": "Chloe", 
            "name": "Chloe", 
            "poster_url": "Chloe.jpg"
        }
    ], 
    "id": "IchiTheKiller", 
    "name": "Ichi the Killer"
}