{
    "plot": "In 1672, two witches (Jennifer and her father Daniel) were burned by puritan Jonathan Wooley. In revenge, Jennifer cursed all future generations of the Wooley family, that the sons will always marry the wrong woman and be miserable. In the 20th century, a bolt of lightning frees Jennifer and her father from the tree that had kept their souls imprisoned. Jennifer assumes corporeal form and decides to make up-and-coming politician Wallace Wooley, then unhappily engaged, even more miserable by getting him to fall in love with her before his wedding. Wallace is a straight arrow, though, and Jennifer has to resort to a love potion. As we all know, love potions tend to backfire, with comedic results.", 
    "genres": "Comedy, Fantasy, Romance", 
    "release_year": "1942", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "High", 
                    "Turn/Love"
                ], 
                "role": "High Heel-Face Turn/Love Redeems: Jennifer starts helping Wally against Daniel after she drinks the potion.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Witch: Veronica Lake, at the height of her sexiness, in a lot of tight dresses. Yup.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "evil", 
                    "engaged", 
                    "live"
                ], 
                "role": "Jennifer (Veronica Lake) in I Married A Witch, is a beautiful woman. She starts out evil, wanting to seduce the engaged protagonist just out of pure malice but then falls in love with him after accidentally drinking the love potion she meant for him, triggering her High Heel-Face Turn. She and the protagonist eventually get married and live happily ever after.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [
                    "original"
                ], 
                "role": "Manic Pixie Dream Girl: Although her original intent was to screw with him and break his heart, after she drinks the potion Jennifer becomes this.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "see-through"
                ], 
                "role": "Ms. Fanservice: Veronica Lake, even more than usual. The skin-tight, nearly see-through dress she's wearing when she drinks the potion was as racy as it got in the 1940s.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0034881", 
    "poster_url": "IMarriedAWitch.jpg", 
    "similar": [
        {
            "shared": [
                "HighHeelFaceTurn", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "HotWitch"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "HotWitch", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "CrocodileDundee", 
            "name": "Crocodile Dundee", 
            "poster_url": "CrocodileDundee.jpg"
        }
    ], 
    "id": "IMarriedAWitch", 
    "name": "I Married A Witch"
}