{
    "plot": "Eons after the Gods won their mythic struggle against the Titans, a new evil threatens the land. Mad with power, King Hyperion (Mickey Rourke) has declared war against humanity. Amassing a bloodthirsty army of soldiers disfigured by his own hand, Hyperion has scorched Greece in search of the legendary Epirus Bow, a weapon of unimaginable power forged in the heavens by Ares. Only he who possesses this bow can unleash the Titans, who have been imprisoned deep within the walls of Mount Tartaros since the dawn of time and thirst for revenge. In the king's hands, the bow would rain destruction upon mankind and annihilate the Gods. But ancient law dictates the Gods must not intervene in man's conflict. They remain powerless to stop Hyperion...until a peasant named Theseus (Henry Cavill) comes forth as their only hope. Secretly chosen by Zeus, Theseus must save his people from Hyperion and his hordes. Rallying a band of fellow outsiders-including visionary priestess Phaedra (Freida Pinto) and cunning slave Stavros (Stephen Dorff)-one hero will lead the uprising, or watch his homeland fall into ruin and his Gods vanish into legend.", 
    "genres": "Action, Drama, Fantasy", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "other", 
                    "bad", 
                    "alive", 
                    "entire", 
                    "several"
                ], 
                "role": "Dirty Coward: Lysander. Granted he's serving under a king who had him castrated and he frequently gets a front row seat to Hyperion killing his other cronies for failing him. Can you blame him? Of course, he also sold out to the bad guys in hopes of staying alive, so he brought pretty much all those misfortunes on himself. To be frank, Hyperion and his entire army. Theseus lampshades this several times.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "Mr. Fanservice: Henry Cavill as Theseus, Luke Evans as Zeus, Stephen Dorff as the thief, and Kellan Lutz as Poseidon for starters. It helps that most of the male cast (gods especially) walk around shirtless for the majority of the movie.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: And how!", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "Walking Shirtless Scene: The male gods. The thief just about counts too.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Athena, naturally. The oracles are no slouches either.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Daddy's Girl: Zeus and Athena.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Phaedra (Freida Pinto, who strips naked so that we see her bare butt take up half the screen). Unfortunately, this is only a very convincing Body Double. However, Athena appears as a living, topless stone statue.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Phaedra.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt1253864", 
    "poster_url": "Immortals.jpg", 
    "similar": [
        {
            "shared": [
                "ActionGirl", 
                "ShirtlessScene", 
                "MsFanservice", 
                "MrFanservice", 
                "TheChick"
            ], 
            "shared_count": 5, 
            "id": "GIJoeRetaliation", 
            "name": "G.I. Joe: Retaliation", 
            "poster_url": "GIJoeRetaliation.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "WalkingShirtlessScene", 
                "ShirtlessScene", 
                "MrFanservice", 
                "TheChick"
            ], 
            "shared_count": 5, 
            "id": "Predator", 
            "name": "Predator", 
            "poster_url": "Predator.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "ShirtlessScene", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MsFanservice", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MrFanservice", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }
    ], 
    "id": "Immortals", 
    "name": "Immortals"
}