{
    "plot": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible-inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.", 
    "genres": "Action, Mystery, Sci-Fi", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Inception: Cobb, although it may qualify more as a Stubble of Sorrow.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [], 
                "role": "Crusading Widower: Cobb, though rather than revenge he wants to reunite with his children.", 
                "id": "CrusadingWidower"
            }, 
            {
                "adjectives": [
                    "capable", 
                    "high", 
                    "first", 
                    "second"
                ], 
                "role": "With the exception of Ariadne, Arthur in Inception seems to be the least capable member when it comes to fighting. He's almost always dressed in a slick suit or his Waistcoat of Style with his hair combed back and seems to be primarily Cobb's smart assistant who manages the high tech equipment. However, in the first dream level he dreams up one of the biggest guns and in the second level he completely owns gravity, making Neo look like a cheap carnival artist.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "original", 
                    "own"
                ], 
                "role": "Inception: Nash (Cobb's original architect) sells out Cobb and Arthur to  Saito to save his own skin. But said person would then leave Nash to the mercy of Cobol Engineering who would inevitably hunt him down and kill him when they find him.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [], 
                "role": "Cobb from Inception is one himself, though not by choice.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "male", 
                    "particular"
                ], 
                "role": "Mr. Fanservice: At least half of the male cast counts, especially the guys in the inception crew. General consensus is that Arthur and Eames are particular favorites (helped by their choice of wardrobe and their actors).", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "three-piece", 
                    "sharp"
                ], 
                "role": "Everyone in Inception, especially (and spectacularly) Joseph Gordon-Levitt's character, Arthur, who wore his three-piece suits sharp enough to kill. Yes, even Ariadne and Mal. Meow.\n This tends to crop up in Christopher Nolan's movies in general. And Nolan himself.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "nice"
                ], 
                "role": "Arthur in Inception (pictured above) kicks ass and takes names in a very nice waistcoat. Note that Joseph Gordon-Levitt wears this kind of outfit normally!", 
                "id": "WaistcoatOfStyle"
            }, 
            {
                "adjectives": [], 
                "role": "Waistcoat of Style: Arthur.", 
                "id": "WaistcoatOfStyle"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "dead"
                ], 
                "role": "Mal appears on the posters labeled as the Femme Fatale. The implication is that she's part of some rival organization working counter to our antiheroes. In a sense, she is one of our heroes. Also, she's dead.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "The shade of Mal in Inception. She killed or tried to kill someone in about every other scene she was in, but she still gave the hero pause when he was faced with stopping her.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [], 
                "role": "The Ophelia: Mal's madness starts off Cobb's character arc.", 
                "id": "TheOphelia"
            }, 
            {
                "adjectives": [
                    "black"
                ], 
                "role": "Mal of Inception is only in black for the opening sequence, but it wholly defines her character as a recurring obstacle to Cobb's extraction work in the rest of the movie.", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in Black: Mal, being \"The Shade.\"", 
                "id": "WomanInBlack"
            }
        ]
    }, 
    "imdbid": "tt1375666", 
    "poster_url": "Inception.jpg", 
    "similar": [
        {
            "shared": [
                "BeardOfSorrow", 
                "WomanInBlack", 
                "MrFanservice", 
                "FemmeFatale", 
                "DirtyCoward"
            ], 
            "shared_count": 5, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "CulturedBadass", 
                "DirtyCoward", 
                "WomanInBlack", 
                "DisappearedDad"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "CulturedBadass", 
                "WomanInBlack", 
                "SharpDressedMan"
            ], 
            "shared_count": 4, 
            "id": "XMen", 
            "name": "X-Men", 
            "poster_url": "XMen.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CrusadingWidower", 
                "MrFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "MrFanservice", 
                "FemmeFatale", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }
    ], 
    "id": "Inception", 
    "name": "Inception"
}