{
    "plot": "In Nazi-occupied France, young Jewish refugee Shosanna Dreyfus witnesses the slaughter of her family by Colonel Hans Landa. Narrowly escaping with her life, she plots her revenge several years later when German war hero Fredrick Zoller takes a rapid interest in her and arranges an illustrious movie premiere at the theater she now runs. With the promise of every major Nazi officer in attendance, the event catches the attention of the \"Basterds\", a group of Jewish-American guerilla soldiers led by the ruthless Lt. Aldo Raine. As the relentless executioners advance and the conspiring young girl's plans are set in motion, their paths will cross for a fateful evening that will shake the very annals of history.", 
    "genres": "Adventure, Drama, War", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Mustache: Aldo has one.", 
                "id": "BadAssMustache"
            }, 
            {
                "adjectives": [], 
                "role": "Lt. Aldo Raine in Inglourious Basterds.", 
                "id": "BadAssMustache"
            }, 
            {
                "adjectives": [
                    "Dogged"
                ], 
                "role": "Dogged Nice Guy: Zoller. Until he suddenly stops being nice. See Kick the Dog.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "romantic", 
                    "few", 
                    "Jewish", 
                    "black", 
                    "second", 
                    "interested", 
                    "nice", 
                    "nice"
                ], 
                "role": "Subverted by Private Zoller in Inglourious Basterds. He acts exactly like a romantic comedy protagonist, as this trope demands, but, of course, there are a few problems. Not least of all is the fact that, well, Shoshanna's (secretly) Jewish, she's already dating a black man Marcel, and he's a freakin' Nazi! To squick us out even more, he hero-worships the man who slaughtered her family; both the audience and Shoshanna know this from the second scene we see him in. When she finally manages to get through to him that there's no way in hell that she'll ever be interested in him, he stops being so nice... Also, he uses his strong-arm Nazi position to force her on dates with him and to position himself at the theater she works in. Very very not nice.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "other", 
                    "male"
                ], 
                "role": "Mr. Fanservice: Donny Donowitz and every other male.", 
                "id": "MrFanservice"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "female", 
                    "male"
                ], 
                "role": "Brawn Hilda: The female soldier, Beethoven, in the tavern demonstrates her willingness to kick the asses of her male compatriots.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "Final", 
                    "different", 
                    "last"
                ], 
                "role": "Final Girl: At different points, both Shosanna and von Hammersmark take their turns in this role, although neither survives to be the last to kill the killers. Then again, arguably they each do, as both of their plans come together to murder all the Nazis in the theater, including Hitler and Goebbels.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "understandable"
                ], 
                "role": "Ice Queen: Shosanna is this Up to Eleven with Frederick, for very understandable reasons.", 
                "id": "IceQueen"
            }, 
            {
                "adjectives": [
                    "climactic"
                ], 
                "role": "Lady in Red: Shosanna on the climactic night.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [], 
                "role": "Lipstick and Load Montage: Shosanna before the premiere.", 
                "id": "LipstickAndLoadMontage"
            }, 
            {
                "adjectives": [], 
                "role": "Shoshannah before the premiere in Inglourious Basterds, including putting her rouge on like warpaint, followed by loading a gun, and then fixing her hat.", 
                "id": "LipstickAndLoadMontage"
            }, 
            {
                "adjectives": [
                    "red", 
                    "other"
                ], 
                "role": "In Inglourious Basterds Shosanna is wearing a red dress when she and Zoller shot each other.", 
                "id": "LittleDeadRidingHood"
            }, 
            {
                "adjectives": [
                    "sexual", 
                    "same", 
                    "German"
                ], 
                "role": "Bridget von Hammersmark from Inglourious Basterds may qualify. She relies more on her fame from being a movie star than her sexual charm, though. In fact, Tarantino may have been hinting that he did intend for her to be seen as this kind of character; in the same scene, a group of German soldiers (whom she had been sitting with earlier) are playing a kind of celebrity guessing game, and Mata Hari herself is one of the answers.", 
                "id": "MataHari"
            }
        ]
    }, 
    "imdbid": "tt0361748", 
    "poster_url": "InglouriousBasterds.jpg", 
    "similar": [
        {
            "shared": [
                "LadyInRed", 
                "BadAssMustache", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "LadyInRed", 
                "DoggedNiceGuy", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "BadAssMustache", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "LegendsOfTheFall", 
            "name": "Legends Of The Fall"
        }, 
        {
            "shared": [
                "LadyInRed", 
                "LittleDeadRidingHood"
            ], 
            "shared_count": 2, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "LipstickAndLoadMontage", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "InglouriousBasterds", 
    "name": "Inglourious Basterds"
}