{
    "plot": "Tuck Pendleton is a cocky pilot, who is taking part in a miniaturization experiment. When some bad guys break into the lab to steal the technology, one of the scientists takes a syringe which contains the miniaturized Tuck and vessel. Now in the vessel is part of the material needed to restore him. But the other part which is the lab is stolen. The scientist's shot but before dying he injects Tuck into Jack Putter, a hypochondriac, who feels that something is wrong with him all the time. When Tuck links himself to Jack's systems, he discovers that something happened. So they go back to the lab, and discover what happened. Now they are told that unless they retrieve the material that was stolen they won't be able to restore Tuck before his oxygen is depleted. Now the government rep decides that the only thing that matters that as long as they have the other half of the material, it is useless to the thieves. So Tuck eggs Jack to go out and find the thieves. They enlist the aid of Tuck's old girlfriend, Lydia, who is a reporter. And it's fortunate for them that she has a lead that pans out.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "1987", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "literal", 
                    "adrenal"
                ], 
                "role": "Adrenaline Makeover: Jack, again. A rare male example, and in the most literal sense possible. Tuck literally stimulates Jack's adrenal gland!", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scientist / Third-Person Seductress: Margret Canker, and how.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scoop: Lydia", 
                "id": "HotScoop"
            }, 
            {
                "adjectives": [
                    "ultimate", 
                    "heart-attack", 
                    "heart-attack"
                ], 
                "role": "Ill Boy: Jack believes he is one of this. As it happens, he's the ultimate hypochondriac, to the point he might really give himself a heart-attack by stressing out over having a heart-attack.", 
                "id": "IllGirl"
            }
        ]
    }, 
    "imdbid": "tt0093260", 
    "poster_url": "Innerspace.jpg", 
    "similar": [
        {
            "shared": [
                "HotScientist", 
                "HotScoop"
            ], 
            "shared_count": 2, 
            "id": "MarsAttacks", 
            "name": "Mars Attacks!", 
            "poster_url": "MarsAttacks.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "TheSaint", 
            "name": "The Saint", 
            "poster_url": "TheSaint.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "HotScientist"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "HotScoop"
            ], 
            "shared_count": 1, 
            "id": "SkyCaptainAndTheWorldOfTomorrow", 
            "name": "Sky Captain and the World of Tomorrow", 
            "poster_url": "SkyCaptainAndTheWorldOfTomorrow.jpg"
        }
    ], 
    "id": "Innerspace", 
    "name": "Innerspace"
}