{
    "plot": "Detective Virgil Tibbs is caught up in the racial tension of the US South when he is arrested after the murder of a prominent businessman. Tibbs was simply waiting for his next train at the station in Sparta, Mississippi and the confusion is soon resolved but when local police chief Gillespie learns that Tibbs is the Philadelphia PD's number one homicide expert, he reluctantly asks for his assistance. The murdered man, Mr. Colbert, had come to Sparta from the North to build a new factory and his wife and business associates immediately point the finger at Endicott, the most powerful man in the county and the one who had the most to lose if a major new employer comes to the area. Tibbs' life is clearly in danger but he perseveres in a highly charged and racially explosive environment until the killer is found.", 
    "genres": "Crime, Drama, Mystery", 
    "release_year": "1967", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Momma's Boy: The reason Tibbs was in Sparta in the first place was that he was on his way back from visiting his mother.", 
                "id": "MommasBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "young", 
                    "local", 
                    "entire", 
                    "happy", 
                    "other", 
                    "other", 
                    "young", 
                    "angry"
                ], 
                "role": "An episode of In the Heat of the Night showed a young woman entering a local beauty pageant. Her Rich Bitch mother was so determined that she win that she arranged for someone to drug the girl's chief rival, take nude pictures of her, then threaten to leak the photos to the press unless the girl dropped out of the pageant. The girl was so devastated and traumatized by the entire thing that she killed herself. To make matters worse, the two girls were friends and would have been genuinely happy for each other had the other won. The young woman is so angry and disgusted by her mother's actions that when she does win, she storms off the stage and flings her crown and sash at her mother, snarling, \"You wanted it so badly, here it is!\", and storms out of the auditorium and presumably out of her mother's life.", 
                "id": "StageMom"
            }, 
            {
                "adjectives": [
                    "local", 
                    "pageant"
                ], 
                "role": "Stage Mom: The aforementioned \"Fairest of Them All\" features one of these so determined that her daughter win a local pageant that she arranges for someone to drug the girl's chief rival, take nude pictures of her, then threaten to leak the photos to the press unless the girl drops out of the pageant.", 
                "id": "StageMom"
            }
        ]
    }, 
    "imdbid": "tt0061811", 
    "poster_url": "InTheHeatOfTheNight.jpg", 
    "similar": [
        {
            "shared": [
                "MommasBoy"
            ], 
            "shared_count": 1, 
            "id": "PeytonPlace", 
            "name": "Peyton Place", 
            "poster_url": "PeytonPlace.jpg"
        }, 
        {
            "shared": [
                "MommasBoy"
            ], 
            "shared_count": 1, 
            "id": "NorthByNorthwest", 
            "name": "North by Northwest", 
            "poster_url": "NorthByNorthwest.jpg"
        }, 
        {
            "shared": [
                "MommasBoy"
            ], 
            "shared_count": 1, 
            "id": "FridayThe13thPartVANewBeginning", 
            "name": "Friday the 13th Part V: A New Beginning"
        }, 
        {
            "shared": [
                "MommasBoy"
            ], 
            "shared_count": 1, 
            "id": "MysteryMen", 
            "name": "Mystery Men", 
            "poster_url": "MysteryMen.jpg"
        }, 
        {
            "shared": [
                "MommasBoy"
            ], 
            "shared_count": 1, 
            "id": "ThinkLikeAMan", 
            "name": "Think Like A Man", 
            "poster_url": "ThinkLikeAMan.jpg"
        }
    ], 
    "id": "InTheHeatOfTheNight", 
    "name": "In the Heat of the Night"
}