{
    "plot": "The US President and UK Prime Minister fancy a war. But not everyone agrees that war is a good thing. The US General Miller doesn't think so and neither does the British Secretary of State for International Development, Simon Foster. But, after Simon accidentally backs military action on TV, he suddenly has a lot of friends in Washington, DC. If Simon can get in with the right DC people, if his entourage of one can sleep with the right intern, and if they can both stop the Prime Minister's chief spin-doctor Malcolm Tucker rigging the vote at the UN, they can halt the war. If they don't... well, they can always sack their Director of Communications Judy, who they never liked anyway and who's back home dealing with voters with blocked drains and a man who's angry about a collapsing wall.", 
    "genres": "Comedy", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "many", 
                    "political", 
                    "thinly-veiled", 
                    "physical", 
                    "moral"
                ], 
                "role": "Dirty Coward: So very many, from Toby giving PWIP PIP to his ex-girlfriend so he doesn't have to leak it himself, to Michael Rodgers following Jamie's orders so he can save his political career. The Doves all know how they can stop the war, but would rather go along with it and save their careers. \"I'm on the verge of taking a stand.\" Notably highlighted in a scene where Toby, Simon and Judy are on their way to the UN, and Simon is hesitantly floating the notion that maybe it would be much braver to change his publicly expressed views and come down in support the war. Both Simon and Toby pointedly ignore Judy when she bluntly points out that no, it wouldn't be. Simon Foster's actions here are a thinly-veiled reference to Clare Short MP. General Miller may have physical courage, but his decision  not to resign (after  Karen has already done so) shows a total lack of moral backbone.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "likeable", 
                    "pasty-faced"
                ], 
                "role": "Kavorka Man: Toby Wright somehow manages to sleep with Michael's aide Suzy and with Liza Weld despite being one of the film's least likeable characters, and despite looking like a gangly pasty-faced 12-year-old. Of course this just refers to the character, and certainly not the actor who plays him◊.", 
                "id": "KavorkaMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Blonde Republican Sex Kitten: Liza Weld. Not that her party are the Republicans, of course.", 
                "id": "BlondeRepublicanSexKitten"
            }
        ]
    }, 
    "imdbid": "tt1226774", 
    "poster_url": "InTheLoop.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan", 
                "BlondeRepublicanSexKitten"
            ], 
            "shared_count": 2, 
            "id": "LoveActually", 
            "name": "Love Actually", 
            "poster_url": "LoveActually.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "TheCommitments", 
            "name": "The Commitments", 
            "poster_url": "TheCommitments.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "ISpitOnYourGrave", 
            "name": "I Spit on Your Grave", 
            "poster_url": "ISpitOnYourGrave.jpg"
        }
    ], 
    "id": "InTheLoop", 
    "name": "In the Loop"
}