{
    "plot": "Tony Stark. Genius, billionaire, playboy, philanthropist. Son of legendary inventor and weapons contractor Howard Stark. When Tony Stark is assigned to give a weapons presentation to an Iraqi unit led by Lt. Col. James Rhodes, he's given a ride on enemy lines. That ride ends badly when Stark's Humvee that he's riding in is attacked by enemy combatants. He survives - barely - with a chest full of shrapnel and a car battery attached to his heart. In order to survive he comes up with a way to miniaturize the battery and figures out that the battery can power something else. Thus Iron Man is born. He uses the primitive device to escape from the cave in Iraq. Once back home, he then begins work on perfecting the Iron Man suit. But the man who was put in charge of Stark Industries has plans of his own to take over Tony's technology for other matters.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Iron Man: Jeff Bridges as Obadiah Stane.", 
                "id": "BeardOfEvil"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "much", 
                    "own"
                ], 
                "role": "The version of Pepper Potts portrayed by Gwyneth Paltrow in the Iron Man movies very much applies. In Iron Man 2, Tony realizes she already basically runs Stark Industries so he makes her CEO, with her own Girl Friday, Natalie Rushman.", 
                "id": "GirlFriday"
            }, 
            {
                "adjectives": [
                    "main", 
                    "third", 
                    "assertive", 
                    "competent", 
                    "straight", 
                    "male", 
                    "high", 
                    "initiative"
                ], 
                "role": "Iron Man:\n Pepper Potts in Iron Man 2 is the main character's love interest.  She also becomes CEO of Stark Industries, but only because Tony gives her the position. At the end of the film, she says she's going to quit, but as of the third Iron Man movie, she still is.\n In Iron Man 3, she is the one who defeats the Big Bad. However, she does this because the Big Bad (a man) gave her superpowers, and the tools she uses were made by Tony.\n Averted, though, with Christine Everhart, who is a highly assertive journalist and appears to answer to nobody.\n The highly competent Natalie Rushman could be played straight or an aversion. She follows the orders of a male party, but appears to have a high degree of initiative and does not lose agency after her relationship with him is revealed.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "partial", 
                    "personal", 
                    "menial", 
                    "fresh", 
                    "one-night", 
                    "one-night", 
                    "various", 
                    "much", 
                    "various", 
                    "few", 
                    "qualified"
                ], 
                "role": "Pepper Potts of Iron Man is a partial example. She is Tony Stark's personal assistant and is introduced as doing all of his menial tasks (including providing fresh clothes and a transportation for his latest one-night stand), and said one-night stand treats her condescendingly. Tony also puts quite a bit of stress on her through his various antics and piles on the work. However as the movie goes on, it's shown that Tony trusts Pepper very much and has her handle everything in his life, including business plans, tinkering with his arc reactor, and going into Obediah Stan's computer to look for various hidden files. There are also a few moments where Tony expresses appreciation for her talents, and fully pulls her from this trope in the sequel, when he considers herself the most qualified person to take over as CEO of Stark Industries, when he's getting his affairs in order.", 
                "id": "PluckyOfficeGirl"
            }, 
            {
                "adjectives": [
                    "several", 
                    "usual"
                ], 
                "role": "Pepper Potts as played by Gwyneth Paltrow in Iron Man, though she appears to be several levels of responsibility (and pay grades) higher than usual for the trope.", 
                "id": "SexySecretary"
            }
        ]
    }, 
    "imdbid": "tt0371746", 
    "poster_url": "IronMan.jpg", 
    "similar": [
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "BeardOfEvil"
            ], 
            "shared_count": 2, 
            "id": "Exam", 
            "name": "Exam", 
            "poster_url": "Exam.jpg"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "BeardOfEvil"
            ], 
            "shared_count": 2, 
            "id": "TransformersDarkOfTheMoon", 
            "name": "Transformers: Dark of the Moon", 
            "poster_url": "TransformersDarkOfTheMoon.jpg"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "BeardOfEvil"
            ], 
            "shared_count": 2, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "BeardOfEvil"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "SexySecretary", 
                "PluckyOfficeGirl"
            ], 
            "shared_count": 2, 
            "id": "AmericanPsycho", 
            "name": "American Psycho", 
            "poster_url": "AmericanPsycho.jpg"
        }
    ], 
    "id": "IronMan", 
    "name": "Iron Man"
}