{
    "plot": "Writer Jennifer Hills (Butler) takes a retreat from the city to a charming cabin in the woods to start on her next book. But Jennifer's presence in the small town attracts the attention of a few morally depraved locals who set out one night to teach this city girl a lesson. They break into her cabin to scare her. However, what starts out as terrifying acts of humiliation and intimidation, quickly and uncontrollably escalates into a night of physical abuse and torturous assault. But before they can kill her, Jennifer sacrifices her broken and beaten body to a raging river that washes her away. As time passes, the men slowly stop searching for her body and try to go back to life as usual. But that isn't about to happen. Against all odds, Jennifer Hills survived her ordeal. Now, with hell bent vengeance, Jennifer's sole purpose is to turn the tables on these animals and to inflict upon them every horrifying and torturous moment they carried out on her... only much, much worse.", 
    "genres": "Crime, Horror, Thriller", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Dirty Coward: Johnny pisses himself during Jennifer's revenge. She reacts with extreme disgust, commenting even the other men didn't do this.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [], 
                "role": "I Spit on Your Grave: Johnny in the remake. He pees himself when faced with Jennifer 's revenge. She reacts with extreme disgust, commenting even the others didn't do that.", 
                "id": "DirtyCoward"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Femme Fatale: Jennifer pulls this on Matthew and Johnny.", 
                "id": "FemmeFatale"
            }
        ]
    }, 
    "imdbid": "tt1242432", 
    "poster_url": "ISpitOnYourGrave.jpg", 
    "similar": [
        {
            "shared": [
                "FemmeFatale", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "MillersCrossing", 
            "name": "Miller's Crossing", 
            "poster_url": "MillersCrossing.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "DickTracy", 
            "name": "Dick Tracy", 
            "poster_url": "DickTracy.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "ResidentEvil", 
            "name": "Resident Evil", 
            "poster_url": "ResidentEvil.jpg"
        }
    ], 
    "id": "ISpitOnYourGrave", 
    "name": "I Spit on Your Grave"
}