{
    "plot": "One of several remaining members of its race, an alien from Venus is guided to Earth by disgruntled scientist Tom Anderson, who tells it which humans it should attach mind control devices to. Among them is his old friend, fellow scientist Paul Nelson. Nelson, after killing a flying bat-thing which carries the device, finally persuades the paranoid Anderson that he's been wrong to ally himself with an alien bent on world domination. They hurriedly leave when they discover Tom's wife has picked up a rifle and gone to the alien's cave to try to kill it.", 
    "genres": "Horror, Sci-Fi, Thriller", 
    "release_year": "1956", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "female", 
                    "tough", 
                    "good", 
                    "memorable", 
                    "gon", 
                    "first", 
                    "believable"
                ], 
                "role": "Action Girl: Beverly Garland. Corman was a filmmaker who did not believe in the Neutral Female - he had female protagonists who were tough, intelligent and resourceful. A good example is when Beverly Garland's character Claire grabs a rifle after telling the Big Bad she's going to slaughter it when her idiot husband is mesmerized by the alien once too often, and gives it a memorable \"The Reason You Suck\" Speech, then growls: \"You think you're gonna make a slave of the world... I'll see you in Hell first!\" Keep in mind, Garland was delivering this to a walking carrot and made it believable.", 
                "id": "ActionGirl"
            }
        ]
    }, 
    "imdbid": "tt0049370", 
    "poster_url": "ItConqueredTheWorld.jpg", 
    "similar": [
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "ToTheLimit", 
            "name": "To The Limit", 
            "poster_url": "ToTheLimit.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "TheIcePirates", 
            "name": "The Ice Pirates", 
            "poster_url": "TheIcePirates.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "TheExtraordinaryAdventuresOfAdeleBlancSec", 
            "name": "The Extraordinary Adventures of Adèle Blanc-Sec"
        }
    ], 
    "id": "ItConqueredTheWorld", 
    "name": "It Conquered the World"
}