{
    "plot": "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his wings. He shows George what things would have been like if he had never been born. In a nightmarish vision in which the Potter-controlled town is sunk in sex and sin, those George loves are either dead, ruined, or miserable. He realizes that he has touched many people in a positive way and that his life has truly been a wonderful one.", 
    "genres": "Drama, Family, Fantasy", 
    "release_year": "1946", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Chivalrous"
                ], 
                "role": "Chivalrous Pervert: George shows signs of this. \"Maybe I can sell tickets.\"", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "homeless"
                ], 
                "role": "Hobos: As George wasn't there to stop him from mixing up a prescription, Pottersville's Mr. Gower is a homeless ex-con.", 
                "id": "Hobos"
            }, 
            {
                "adjectives": [
                    "straight", 
                    "big", 
                    "small", 
                    "honest"
                ], 
                "role": "In It's a Wonderful Life, this trope is played straight (Mr. Potter, a Corrupt Corporate Executive running a big bank note By the standards of the day, it was big. Probably today it would have been bought out five times by consecutively bigger banks to become part of JP Morgan Chase or something.) and averted (George Bailey, who runs a small, honest savings & loan business trying to help people achieve the American Dream).", 
                "id": "MorallyBankruptBanker"
            }, 
            {
                "adjectives": [
                    "Bankrupt", 
                    "straight"
                ], 
                "role": "Morally Bankrupt Banker: Averted and played straight.", 
                "id": "MorallyBankruptBanker"
            }, 
            {
                "adjectives": [
                    "main", 
                    "genuine"
                ], 
                "role": "It's a Wonderful Life's main character is a slightly darker take on this: he's genuine, but of course, he's just lost his job.", 
                "id": "StandardFiftiesFather"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Daddy's Girl: Zuzu seems to be this.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Decoy Damsel: Inverted with Clarence, who screams like a girl after intentionally jumping in the river.", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [], 
                "role": "Close-ups of Donna Reed are slightly blurred in It's a Wonderful Life.", 
                "id": "GaussianGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Hello, Nurse!: Violet Bick.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [], 
                "role": "Hooker with a Heart of Gold: Violet", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [], 
                "role": "Annie in It's a Wonderful Life. Sure, she snarks, especially with the younger Baileys, but it's clearly based on affection (which is equally clearly reciprocated).", 
                "id": "KindlyHousekeeper"
            }, 
            {
                "adjectives": [
                    "bitter", 
                    "unhappy"
                ], 
                "role": "Maiden Aunt: When George gets the chance to find out how the world would have turned out if he'd never been born, he finds that his wife Mary had become a bitter, unhappy Maiden Aunt.", 
                "id": "MaidenAunt"
            }, 
            {
                "adjectives": [], 
                "role": "It's a Wonderful Life: Mary Hatch Bailey in the Pottersville version of the world without George. The intent was to show how worse off she was, but still, it's Donna Reed in glasses.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "Possible", 
                    "shy"
                ], 
                "role": "Possible early example: Annie the maid in It's a Wonderful Life, who certainly wasn't shy about speaking her mind. \"I heard it; it's about time one'a you lunkheads SAID it!\"", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Screaming Woman: Mary as an old maid in Pottersville. She even faints in the arms of some burly men!", 
                "id": "ScreamingWoman"
            }
        ]
    }, 
    "imdbid": "tt0038650", 
    "poster_url": "ItsAWonderfulLife.jpg", 
    "similar": [
        {
            "shared": [
                "DaddysGirl", 
                "HookerWithAHeartOfGold", 
                "SassyBlackWoman", 
                "HelloNurse"
            ], 
            "shared_count": 4, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "SassyBlackWoman", 
                "DecoyDamsel", 
                "ChivalrousPervert"
            ], 
            "shared_count": 3, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "MorallyBankruptBanker", 
                "HookerWithAHeartOfGold", 
                "ChivalrousPervert"
            ], 
            "shared_count": 3, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "MaidenAunt", 
                "HelloNurse"
            ], 
            "shared_count": 3, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "MorallyBankruptBanker", 
                "Meganekko"
            ], 
            "shared_count": 3, 
            "id": "DespicableMe", 
            "name": "Despicable Me", 
            "poster_url": "DespicableMe.jpg"
        }
    ], 
    "id": "ItsAWonderfulLife", 
    "name": "It's a Wonderful Life"
}