{
    "plot": "Depressed after the passing of his father, Dharamraj; as well as his gorgeous girlfriend ditching him, Mumbai-based businessman Aditya Kashyap takes a BEST bus, goes to Chatrapati Shivaji Train Terminus, and boards a train. This is where he meets Geet Kaur Dhillon, who is returning home to Bhatinda, and who pays for his ticket. At Bar Nagar, he decides to leave, but she follows him, missing her train. They manage to get a ride to Ratlam, miss the train again, but eventually make it to Bhatinda. Once there, he gets to meet her family; her pretty sister, Roop; as well as her to-be betrothed, Manjeet Singh Mann. Before the engagement could be finalized, she manages to convince her family that she wants to marry Aditya, and they welcome him with open arms. Before he could take stock of these new developments, she elopes with him - not to get married - but to re-locate to Manali - where her true love, Anshuman, is waiting, and who she hopes to get married to.", 
    "genres": "Comedy, Romance", 
    "release_year": "2007", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "establish", 
                    "positive"
                ], 
                "role": "Manic Pixie Dream Girl: Geet's character helps Aditya get over his problems and establish a positive attitude.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt1093370", 
    "poster_url": "JabWeMet.jpg", 
    "similar": [
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Lo", 
            "name": "Lo"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "LAStory", 
            "name": "LA Story"
        }
    ], 
    "id": "JabWeMet", 
    "name": "Jab We Met"
}