{
    "plot": "Sent to the market by his uncle to sell their horse and buy thatch for their roof, Jack meets the beautiful Princess Isabelle whom he rescues her from ruffians. He returns home only with a handful of beans given to him by a monk who claimed they were sacred but that does little to impress his uncle who tosses them away. In the night the Princess arrives having run off to keep from marrying Roderick who is clearly only interested in becoming king. Soon the beans take root with a giant stalk carrying away the princess and Jack's house. He soon sets off on an adventure with the king's guards to rescue the princess only to find that a mythical land filled with giants really exists.", 
    "genres": "Adventure, Fantasy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "decent", 
                    "serious", 
                    "good", 
                    "alongside", 
                    "common", 
                    "remarkable", 
                    "clear"
                ], 
                "role": "The Good King: The king is a pretty decent guy. Aside from one serious blind spot early on, he's a good leader who handles himself well, deals with his subjects fairly, and isn't above hard labor right alongside the common soldiers when necessary. He also shows remarkable restraint when dealing with Jack, refraining from trying to intimidate him once it's clear there's some chemistry between him and the Princess. Not to mention he insists on fighting alongside the guards when the Giants attack, and gives Elmont a \"Hell no!\" when asked to leave.", 
                "id": "TheGoodKing"
            }, 
            {
                "adjectives": [
                    "decent", 
                    "serious", 
                    "good", 
                    "alongside", 
                    "common", 
                    "remarkable", 
                    "clear"
                ], 
                "role": "The king from Jack the Giant Slayer is a pretty decent guy. Aside from one serious blind spot early on, he's a good leader who handles himself well, deals with his subjects fairly, and isn't above hard labor right alongside the common soldiers when necessary. He also shows remarkable restraint when dealing with Jack, refraining from trying to intimidate him once it's clear there's some chemistry between him and the Princess. Not to mention he insists on fighting alongside the guards when the Giants attack, and gives Elmont a \"Hell no!\" when asked to leave.", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Isabelle getting captured by the giants is what sets the plot in motion. See Faux Action Girl below.", 
                "id": "DamselInDistress"
            }
        ]
    }, 
    "imdbid": "tt1351685", 
    "poster_url": "JackTheGiantSlayer.jpg", 
    "similar": [
        {
            "shared": [
                "DamselInDistress", 
                "TheGoodKing"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "TheGoodKing"
            ], 
            "shared_count": 2, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "TheGoodKing"
            ], 
            "shared_count": 2, 
            "id": "Brave", 
            "name": "Brave", 
            "poster_url": "Brave.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "TheGoodKing"
            ], 
            "shared_count": 2, 
            "id": "ThePrincessBride", 
            "name": "The Princess Bride", 
            "poster_url": "ThePrincessBride.png"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "TheGoodKing"
            ], 
            "shared_count": 2, 
            "id": "MirrorMirror", 
            "name": "Mirror, Mirror"
        }
    ], 
    "id": "JackTheGiantSlayer", 
    "name": "Jack the Giant Slayer"
}