{
    "plot": "Anthony \"Swoff\" Swofford, a Camus-reading kid from Sacramento, enlists in the Marines in the late 1980s. He malingers during boot camp, but makes it through as a sniper, paired with the usually-reliable Troy. The Gulf War breaks out, and his unit goes to Saudi Arabia for Desert Shield. After 175 days of boredom, adrenaline, heat, worry about his girlfriend finding someone else, losing it and nearly killing a mate, demotion, latrine cleaning, faulty gas masks, and desert football, Desert Storm begins. In less than five days, it's over, but not before Swoff sees burned bodies, flaming oil derricks, an oil-drenched horse, and maybe a chance at killing. Where does all the testosterone go?", 
    "genres": "Drama, War", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "smart-ass", 
                    "touch", 
                    "touch", 
                    "vicious", 
                    "sadistic", 
                    "unfair"
                ], 
                "role": "Drill Sergeant Nasty: Drill Instructor Fitch reacts to a smart-ass response by smashing Swofford's head into a chalkboard. In the novel, Fitch was cruel even by Marine standardsnote Back then, Drill Instructors were allowed to touch their recruits. By \"touch\", we mean \"beat the shit out of\". - he was eventually busted by a passing Officer seeing him go too far. Swofford regrets participating in helping Fitch get busted, as he felt, however vicious and sadistic he was, it was unfair.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "competent", 
                    "harsh", 
                    "first", 
                    "chalkboard", 
                    "sergeant", 
                    "last"
                ], 
                "role": "Jarhead features Staff Sergeant Sykes, the Marine who whips Swoff's squad into shape after he decides he wants to join a group of snipers. He's actually a very competent soldier, more of a Sergeant Rock, but is not afraid of dishing out extremely harsh punishments, and so qualifies. A better example would be Swoff's first drill sergeant, D.I. Fitch, shown briefly in the beginning of the movie, who smashes his head into a chalkboard when he talks back.\n In Fitch's case, it might be because — if he is in fact a sergeant — he's an NCO being addressed as sir. They hate that.\n In the USMC, Drill Instructors are addressed as \"sir\" until the last week of training.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "entire"
                ], 
                "role": "Gay Bravado: Jarhead has an entire mock-orgy, just out of view of a TV camera.", 
                "id": "GayBravado"
            }, 
            {
                "adjectives": [
                    "entire"
                ], 
                "role": "Jarhead has an entire mock-orgy, just out of view of a TV camera nonetheless.", 
                "id": "GayBravado"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice: Gyllenhall, who even appears during a Christmas party wearing only two Santa hats. Guess where they're placed.", 
                "id": "MrFanservice"
            }
        ]
    }, 
    "imdbid": "tt0418763", 
    "poster_url": "Jarhead.jpg", 
    "similar": [
        {
            "shared": [
                "MrFanservice", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MrFanservice", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "MrFanservice", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 2, 
            "id": "Cars", 
            "name": "Cars", 
            "poster_url": "Cars.jpg"
        }, 
        {
            "shared": [
                "MrFanservice", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 2, 
            "id": "GreenLantern", 
            "name": "Green Lantern", 
            "poster_url": "GreenLantern.jpg"
        }, 
        {
            "shared": [
                "DrillSergeantNasty"
            ], 
            "shared_count": 1, 
            "id": "TheBarberOfSiberia", 
            "name": "The Barber of Siberia", 
            "poster_url": "TheBarberOfSiberia.jpg"
        }
    ], 
    "id": "Jarhead", 
    "name": "Jarhead"
}