{
    "plot": "It's a hot summer on Amity Island, a small community whose main business is its beaches. When new Sheriff Martin Brody discovers the remains of a shark attack victim, his first inclination is to close the beaches to swimmers. This doesn't sit well with Mayor Larry Vaughn and several of the local businessmen. Brody backs down to his regret as that weekend a young boy is killed by the predator. The dead boy's mother puts out a bounty on the shark and Amity is soon swamped with amateur hunters and fisherman hoping to cash in on the reward. A local fisherman with much experience hunting sharks, Quint, offers to hunt down the creature for a hefty fee. Soon Quint, Brody and Matt Hooper from the Oceanographic Institute are at sea hunting the Great White shark. As Brody succinctly surmises after their first encounter with the creature, they're going to need a bigger boat.", 
    "genres": "Drama, Thriller", 
    "release_year": "1975", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Father Neptune: Quint.", 
                "id": "FatherNeptune"
            }, 
            {
                "adjectives": [], 
                "role": "Sam Quint from Jaws certainly counts.", 
                "id": "FatherNeptune"
            }, 
            {
                "adjectives": [
                    "actual"
                ], 
                "role": "Great White Hunter: Quint — with bonus points for hunting an actual Great White.", 
                "id": "GreatWhiteHunter"
            }, 
            {
                "adjectives": [
                    "white", 
                    "past", 
                    "psychotic", 
                    "Moby-Dick"
                ], 
                "role": "Robert Shaw's character Sam Quint in Jaws. He's a Great White Hunter who hunts great white sharks. But he's also haunted by his past experiences with sharks, and has become a merciless shark-hater and borderline psychotic, not unlike Captain Ahab in Moby-Dick.", 
                "id": "GreatWhiteHunter"
            }
        ]
    }, 
    "imdbid": "tt0073195", 
    "poster_url": "Jaws.jpg", 
    "similar": [
        {
            "shared": [
                "GreatWhiteHunter"
            ], 
            "shared_count": 1, 
            "id": "TheExtraordinaryAdventuresOfAdeleBlancSec", 
            "name": "The Extraordinary Adventures of Adèle Blanc-Sec"
        }, 
        {
            "shared": [
                "GreatWhiteHunter"
            ], 
            "shared_count": 1, 
            "id": "AnimalCrackers", 
            "name": "Animal Crackers", 
            "poster_url": "AnimalCrackers.jpg"
        }, 
        {
            "shared": [
                "FatherNeptune"
            ], 
            "shared_count": 1, 
            "id": "Popeye", 
            "name": "Popeye", 
            "poster_url": "Popeye.jpg"
        }, 
        {
            "shared": [
                "GreatWhiteHunter"
            ], 
            "shared_count": 1, 
            "id": "TheGrey", 
            "name": "The Grey", 
            "poster_url": "TheGrey.jpg"
        }, 
        {
            "shared": [
                "FatherNeptune"
            ], 
            "shared_count": 1, 
            "id": "Lincoln", 
            "name": "Lincoln", 
            "poster_url": "Lincoln.jpg"
        }
    ], 
    "id": "Jaws", 
    "name": "Jaws"
}