{
    "plot": "The small island resort town of Amity is trying to bounce back from the financial troubles that suffered after becoming known as the site of shark attacks four years earlier. Mayor Larry Vaughn is welcoming developer Len Peterson and his new resort to Amity. Two scuba divers are exploring the area where the Orca sank after police chief Martin Brody killed a huge shark four years ago. A shark shows up and devoured the two divers, but not before one of the divers takes a close-up picture of the shark's eye, and sometime later, while a mother is driving a boat that's pulling her water-skiing teenage daughter, the shark devours the daughter and causes the mother to accidentally blow up the boat, then a killer whale is found on the shore with a huge bites on it. After Brody sees this, he knows there's another huge great white shark in Amity's waters, but Vaughn and Peterson explain these attacks away as non-shark accidents, because the thought of another shark in Amity's waters would drive tourists away from the new resort and cause the new resort to lose money. It looks like Vaughn is still a mayor who puts money ahead of people's lives. Brody tips his gun's hollow point bullets with cyanide and melted candle wax and tells his sons Michael and Sean to stay away from the beaches and told them to not go sailing with Mike's friends, who include Vaughn's son Larry Vaughn Jr. Everyone thinks Brody's fears are shark trauma-induced paranoia. Brody even tries to call his friend Matt Hooper, who is doing research on a boat in the Antarctic Circle, and Matt will be in the Antarctic Circle for a few more months. While keeping an eye on the waters from the beach's shark tower, Brody sees a huge dark spot in the water and rings the tower's alarm bell, but it turns out to be a school of bluefish. Vaughn fires Brody for causing this panic at the beach and scaring tourists and their money away, and even though they were told not to, Michael and Sean go out sailing with Junior Vaughn and their friends, unaware that the shark is trailing them. Brody knows it's up to him to find them before its too late.", 
    "genres": "Horror, Thriller", 
    "release_year": "1978", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Hysterical", 
                    "female", 
                    "hysterical", 
                    "panic", 
                    "practical", 
                    "goal-oriented", 
                    "same", 
                    "much", 
                    "due", 
                    "traumatic"
                ], 
                "role": "Hysterical Woman: After the shark attacks them, one of the female teenagers, Jackie, eventually goes hysterical, screaming like crazy and having a panic attack when their rafts get stuck at the bottom. Another teen tries to shut her up by shaking her violently, but is told by his friends that this won't help. Not all the women are like this, but it stands out because by contrast the guys are all portrayed as practical and goal-oriented, and none of them breaks down to the same degree. Even the much younger Sean holds it together better than her, who by all accounts has far more right to be freaked out due to being a kid. In her defense, she is in the middle of an extremely traumatic and terrifying experience, as well as having seen friends die in front of her.", 
                "id": "HystericalWoman"
            }, 
            {
                "adjectives": [
                    "female", 
                    "hysterical", 
                    "panic", 
                    "practical", 
                    "goal-oriented", 
                    "same", 
                    "much", 
                    "due", 
                    "kid"
                ], 
                "role": "Jaws 2. After the shark attacks them, one of the female teenagers eventually goes hysterical, screaming like crazy and having a panic attack when their rafts get stuck at the bottom. Another one tries to shut her up by shaking her violently, but is told by his friends that this won't help. Not all the women are like this, but it stands out because by contrast the guys are all portrayed as practical and goal-oriented, and none of them breaks down to the same degree. Even the much younger Michael holds it together better than her, who by all accounts has far more right to be freaked out due to being a kid.", 
                "id": "HystericalWoman"
            }
        ]
    }, 
    "imdbid": "tt0077766", 
    "poster_url": "Jaws2.jpg", 
    "similar": [
        {
            "shared": [
                "HystericalWoman"
            ], 
            "shared_count": 1, 
            "id": "TheFog", 
            "name": "The Fog", 
            "poster_url": "TheFog.jpg"
        }, 
        {
            "shared": [
                "HystericalWoman"
            ], 
            "shared_count": 1, 
            "id": "QueenOfOuterSpace", 
            "name": "Queen Of Outer Space", 
            "poster_url": "QueenOfOuterSpace.jpg"
        }, 
        {
            "shared": [
                "HystericalWoman"
            ], 
            "shared_count": 1, 
            "id": "DrumsAlongTheMohawk", 
            "name": "Drums Along The Mohawk", 
            "poster_url": "DrumsAlongTheMohawk.jpg"
        }, 
        {
            "shared": [
                "HystericalWoman"
            ], 
            "shared_count": 1, 
            "id": "BattleOfBritain", 
            "name": "Battle of Britain", 
            "poster_url": "BattleOfBritain.jpg"
        }, 
        {
            "shared": [
                "HystericalWoman"
            ], 
            "shared_count": 1, 
            "id": "ObserveAndReport", 
            "name": "Observe and Report", 
            "poster_url": "ObserveAndReport.jpg"
        }
    ], 
    "id": "Jaws2", 
    "name": "Jaws 2"
}