{
    "plot": "Nerdy, reserved bookworm Needy Lesnicki, and arrogant, conceited cheerleader Jennifer Check are best friends, though they share little in common. They share even less in common when Jennifer mysteriously gains an appetite for human blood after a disastrous fire at a local bar. As Needy's male classmates are steadily killed in gruesome attacks, the young girl must uncover the truth behind her friend's transformation and find a way to stop the bloodthirsty rampage before it reaches her own boyfriend Chip.", 
    "genres": "Comedy, Horror", 
    "release_year": "2009", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Adrenaline Makeover", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "safe"
                ], 
                "role": "Alpha Bitch: Jennifer was like this even before she turned into a demon. Needy just seems to be somewhat safe from her more overt jerkass tendencies.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "Bait-and-Switch", 
                    "male", 
                    "romantic/sexual", 
                    "outright", 
                    "male", 
                    "social"
                ], 
                "role": "Bait-and-Switch Lesbians: The earliest trailers showed Jennifer and Needy in intimate situations and despite their making out in the movie, both of them have male romantic/sexual interests. However, there is enough Les Yay in the movie for someone to reasonably assume that the two girls were at least bisexual. The argument could even be made for Jennifer being an outright lesbian, since all of her male interests were either the result of jockeying for social position, or trying to keep Needy for herself. In fact, after a scene of Needy gazing a little too blissfully another girl says to her point blank: \"You are totally LesbiGay.\"", 
                "id": "BaitAndSwitchLesbians"
            }, 
            {
                "adjectives": [
                    "actual", 
                    "straight", 
                    "literal", 
                    "possible", 
                    "true", 
                    "possible", 
                    "social-jockeying", 
                    "bisexual", 
                    "closeted", 
                    "intimate", 
                    "possessive"
                ], 
                "role": "The trailers for Jennifers Body tended to focus heavily on the Les Yay kiss between Jennifer and Needy. In the actual movie, Needy is completely straight and Jennifer is a literal man eater. It is possible that the kiss was shoehorned into the film explicitly for trailer material. That said, Jennifer's true orientation is left ambiguous. It's possible that she dates a lot of men simply because of social-jockeying and indeed, some of her lines hint that she's bisexual or a closeted lesbian. Given that she frequently interrupts intimate moments between Needy and Chip and is incredibly possessive towards her, there is a lot of evidence to support the latter theory.", 
                "id": "BaitAndSwitchLesbians"
            }, 
            {
                "adjectives": [], 
                "role": "Catholic School Girls Rule: See the poster.", 
                "id": "CatholicSchoolGirlsRule"
            }, 
            {
                "adjectives": [], 
                "role": "The posters for Jennifers Body featured Megan Fox in Catholic schoolgirl outfit, although she doesn't wear that costume anywhere in the film.", 
                "id": "CatholicSchoolGirlsRule"
            }, 
            {
                "adjectives": [
                    "big"
                ], 
                "role": "Fille Fatale: Take a big guess at who.", 
                "id": "FilleFatale"
            }, 
            {
                "adjectives": [], 
                "role": "Godiva Hair: Jennifer, before she eats Jonas.", 
                "id": "GodivaHair"
            }, 
            {
                "adjectives": [], 
                "role": "Megan Fox in Jennifers Body.", 
                "id": "GodivaHair"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Bear: Needy's mother invokes this.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Jennifers Body: Needy (Amanda Seyfried).", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "kiss"
                ], 
                "role": "Jennifer from Jennifers Body (2009) can be interpreted as being romantically attracted to her best friend Needy. When she becomes possessed by a demon and starts eating people, she specifically targets boys who Needy likes or loves. More to the point, she and Needy do kiss at one point.", 
                "id": "PsychoLesbian"
            }, 
            {
                "adjectives": [
                    "skanky"
                ], 
                "role": "The Cheerleader: Vapid, skanky and bullying... and that's before she gets possessed.", 
                "id": "TheCheerleader"
            }, 
            {
                "adjectives": [
                    "eponymous", 
                    "vapid", 
                    "skanky"
                ], 
                "role": "The eponymous cheerleader in Jennifers Body is vapid, rude and skanky... and that's even before she gets posessed by a demon.", 
                "id": "TheCheerleader"
            }, 
            {
                "adjectives": [], 
                "role": "Jennifers Body.", 
                "id": "UncannyValleyGirl"
            }
        ]
    }, 
    "imdbid": "tt1131734", 
    "poster_url": "JennifersBody.jpg", 
    "similar": [
        {
            "shared": [
                "FilleFatale", 
                "CatholicSchoolGirlsRule", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "Election", 
            "name": "Election", 
            "poster_url": "Election.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "UncannyValleyGirl", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "TheFaculty", 
            "name": "The Faculty", 
            "poster_url": "TheFaculty.jpg"
        }, 
        {
            "shared": [
                "CatholicSchoolGirlsRule", 
                "AlphaBitch", 
                "Meganekko"
            ], 
            "shared_count": 3, 
            "id": "SickGirl", 
            "name": "Sick Girl", 
            "poster_url": "SickGirl.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "AlphaBitch", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "TheCheerleader", 
                "Meganekko", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }
    ], 
    "id": "JennifersBody", 
    "name": "Jennifer's Body"
}