{
    "plot": "Jesus Camp follows several young children as they prepare to attend a summer camp where the kids will get their daily dose of evangelical Christianity. Becky Fischer works at the camp, which is named Kids on Fire. Through interviews with Fischer, the children, and others, Jesus Camp illustrates the unswerving belief of the faithful. A housewife and homeschooling mother tells her son that creationism has all the answers. Footage from inside the camp shows young children weeping and wailing as they promise to stop their sinning. Child after child is driven to tears. Juxtapose these scenes with clips from a more moderate Christian radio host (who is appalled by such tactics), and Jesus Camp seems to pose a clear question: are these children being brainwashed?", 
    "genres": "Documentary, Drama", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "personal"
                ], 
                "role": "Armoured Closet Gay: A scandal that transpired after the film's release revealed that pastor Ted Haggard's condemnation of homosexuality apparently had quite a bit of this in the subtext. Haggard condemned the film and told his followers not to watch it, garnering a personal response from the film's directors on its official website.", 
                "id": "ArmouredClosetGay"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "adorable"
                ], 
                "role": "The Cutie: A lot of the kids are absolutely adorable when they're allowed to just be themselves.", 
                "id": "TheCutie"
            }
        ]
    }, 
    "imdbid": "tt0486358", 
    "poster_url": "JesusCamp.jpg", 
    "similar": [
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "FourLions", 
            "name": "Four Lions", 
            "poster_url": "FourLions.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "ThePunisher", 
            "name": "The Punisher", 
            "poster_url": "ThePunisher.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "SmallSoldiers", 
            "name": "Small Soldiers", 
            "poster_url": "SmallSoldiers.jpg"
        }
    ], 
    "id": "JesusCamp", 
    "name": "Jesus Camp"
}