{
    "plot": "Antoine Brisebard, a famous comedy playwright, is struggling with financial difficulties and is preparing to sell his country villa to an English couple. What no one knows, however, is that Brisebard is actually a victim of blackmail since his wife Sylvie, a famous actress, is the daughter of a notorious robber-murderer. His extortionist is a malevolent criminal only known as Jo, who visits him often to pick up his hush money. But faced with certain ruin, Brisebard is preparing to do away with Jo once and for all, planning his deed under the guise of him trying to write the script for a crime play and consulting his friend, attorney Colas, for ideas of how to efficiently get rid of the body. He finally takes up the offer of one Tonelotti to erect a garden pavillon, whose foundation would provide the ideal hiding place for the corpse. On the night Jo is scheduled to arrive for his next payment, Brisebard awaits the arrival with a gun but is not able to pull the trigger, drops the gun to the floor which results in a shot accidentally killing Jo. But it is only then that things turn really difficult: police inspector Ducros, who has found out about Jo's operation and Brisebard's involvement in it, starts noseying around, telling Brisebard that Jo had already been murdered at the time he was supposed to come to the villa (the man Brisebard shot is eventually revealed as Riri, a criminal associate of Jo's); the pavillon foundation proves to be too shoddy, forcing Brisebard to hide the body elsewhere; a lot of unwanted houseguests keep coming and going; and finally, Riri's body stubbornly refuses to remain hidden. Even with the help of his wife, to whom he finally tells everything, the task of getting rid of the body becomes an outright daunting - and nerve-wracking - one.", 
    "genres": "Comedy", 
    "release_year": "1971", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Lady Drunk: Mrs Grunder", 
                "id": "LadyDrunk"
            }
        ]
    }, 
    "imdbid": "tt0067274", 
    "similar": [
        {
            "shared": [
                "LadyDrunk"
            ], 
            "shared_count": 1, 
            "id": "AuntieMame", 
            "name": "Auntie Mame", 
            "poster_url": "AuntieMame.jpg"
        }, 
        {
            "shared": [
                "LadyDrunk"
            ], 
            "shared_count": 1, 
            "id": "WhosAfraidOfVirginiaWoolf", 
            "name": "Who's Afraid of Virginia Woolf?", 
            "poster_url": "WhosAfraidOfVirginiaWoolf.jpg"
        }, 
        {
            "shared": [
                "LadyDrunk"
            ], 
            "shared_count": 1, 
            "id": "BulletsOverBroadway", 
            "name": "Bullets Over Broadway", 
            "poster_url": "BulletsOverBroadway.jpg"
        }, 
        {
            "shared": [
                "LadyDrunk"
            ], 
            "shared_count": 1, 
            "id": "Burlesque", 
            "name": "Burlesque", 
            "poster_url": "Burlesque.jpg"
        }, 
        {
            "shared": [
                "LadyDrunk"
            ], 
            "shared_count": 1, 
            "id": "Detention", 
            "name": "Detention", 
            "poster_url": "Detention.jpg"
        }
    ], 
    "id": "Jo", 
    "name": "Jo"
}