{
    "plot": "Jodhaa Akbar is a sixteenth century love story about a marriage of alliance that gave birth to true love between a great Mughal Emperor, Akbar and a Rajput princess, Jodhaa. Politically, success knew no bounds for Emperor Akbar, After having secured the Hindu Kush, he furthered his realm by conquest until his empire extended from Afghanistan to the Bay of Bengal, and from the Himalayas to the Godhavari River. Through a shrewd blend of tolerance, generosity and force, Akbar won the allegiance of the Rajputs, the most belligerent Hindus. But little did Akbar know that when he married Jodhaa, a fiery Rajput princess, in order to further strengthen his relations with the Rajputs, he would in turn be embarking upon a new journey - the journey of true love. The daughter of King Bharmal of Amer, Jodhaa resented being reduced to a mere political pawn in this marriage of alliance, and Akbar's biggest challenge now did not merely lie in winning battles, but in winning the love of Jodhaa - a love hidden deep below resentment and extreme prejudice. Jodhaa Akbar is their untold love story.", 
    "genres": "Action, Adventure, Biography", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "only", 
                    "next"
                ], 
                "role": "Mr. Fanservice: Hrithik Roshan, pretty much the only man in Bollywood handsome enough to stand next to Aishwarya Rai without invoking Ugly Guy, Hot Wife.", 
                "id": "MrFanservice"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "accurate"
                ], 
                "role": "Action Girl : Jodhaa. Not considered historically accurate, but who cares?", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "religious"
                ], 
                "role": "Jodhaa in Jodhaa Akbar definitely fits the bill. She's a beautiful Rajput princess who's not only an Action Girl who can hold her own in a sword fight against the Mughal emperor of Hindustan, but she also refuses to marry him (and after she marries him, show him outward affection) until he shows her and the rest of India religious tolerance.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "Rebellious", 
                    "told"
                ], 
                "role": "Rebellious Princess: Slightly subverted with Jodhaa. She does what she's told, but negotiates to get what she wants from Akbar.", 
                "id": "RebelliousPrincess"
            }
        ]
    }, 
    "imdbid": "tt0449994", 
    "poster_url": "JodhaaAkbar.jpg", 
    "similar": [
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Fantaghiro", 
            "name": "Fantaghiro"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "TheIcePirates", 
            "name": "The Ice Pirates", 
            "poster_url": "TheIcePirates.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "JodhaaAkbar", 
    "name": "Jodhaa Akbar"
}