{
    "plot": "In 2021, the whole world is connected by the gigantic Internet, and almost a half of the population is suffering from the Nerve Attenuation Syndrome (NAS).Johnny with an inplanted memory chip in his brain was ordered to transport the over loaded information from Beijing to Newark. While Pharmakom Industries supported by yakuza tries to capture him to get the informaiton back, the Low-tech group led by J-Bone tries to break the missing code to download the cure of NAS which Johnny carries.", 
    "genres": "Action, Crime, Sci-Fi", 
    "release_year": "1995", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "short", 
                    "Bad", 
                    "neurodegenerative", 
                    "original", 
                    "female", 
                    "ballistic", 
                    "only"
                ], 
                "role": "Action Girl: Jane, though her counterpart Molly Millions in the short story is far more Bad Ass. Molly is a cybernetically enhanced razorgirl, while Jane suffers from a neurodegenerative disease. Johnny is also much tougher in the film than in the original story, requiring less protection from Jane. There’s also a female Yakuza soldier who goes ballistic with a rocket launcher during the assault on Heaven. The lone female in the group of PharmaKom defectors that gets the data to Johnny is the only one (apart from Johnny) to put up any kind of a fight when Shinji and his mooks arrive to gun them all down.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Bodyguard Babes: Jane, hired bodyguard for Johnny. Ralfi has two \"babes\" for protection, as well.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [
                    "short"
                ], 
                "role": "Molly, a \"razorgirl\", in the short story Johnny Mnemonic. (In the film, she was replaced with the Captain Ersatz Jane because the rights to the character of Molly were tied up with the Neuromancer film which was never produced.)", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [
                    "Happened", 
                    "Molly/Jane", 
                    "short"
                ], 
                "role": "Chickification: Happened to Molly/Jane in between the short story and the movie.", 
                "id": "Chickification"
            }
        ]
    }, 
    "imdbid": "tt0113481", 
    "poster_url": "JohnnyMnemonic.jpg", 
    "similar": [
        {
            "shared": [
                "Chickification", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "BodyguardBabes", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "Chickification", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "BodyguardBabes", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "EnterTheDragon", 
            "name": "Enter the Dragon"
        }, 
        {
            "shared": [
                "Chickification", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "OnceUponAForest", 
            "name": "Once Upon a Forest", 
            "poster_url": "OnceUponAForest.jpg"
        }
    ], 
    "id": "JohnnyMnemonic", 
    "name": "Johnny Mnemonic"
}