{
    "plot": "For years, the record industries have inserted subliminal messages into music so that they can turn teenagers into brain dead zombies who do nothing but buy, buy, buy. And whenever the musician or band finds out the truth, the record company silences them to keep the truth from coming out. When the hot boy band DuJour discovers this, their manager, Wyatt Frame, under his evil, corrupt boss, Fiona, has the plane they are flying in crashed and him looking for a new band to use for their evil schemes. Enter Josie, the ditsy Melody, and the tough Valerie, from Josie and the Pussycats, a small band who wants to make it to the big time. When they are discovered by Wyatt, they give in and become big rock stars. But will they find out that they are just pawns for the record industry or will fame take them over?", 
    "genres": "Comedy, Music", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Boy Band: Dujour is a parody of boy bands.", 
                "id": "BoyBand"
            }, 
            {
                "adjectives": [
                    "many", 
                    "music", 
                    "big", 
                    "dude", 
                    "evil", 
                    "own"
                ], 
                "role": "The Josie and the Pussycats movie featured a boy band called Dujour. To make fun of the effeminate nature of many boy bands, their hit single was called \"Backdoor Lover\". When they find out that their record label is putting Subliminal Advertising into their music, their manager (who isn't a big burly dude, but is instead an evil Alan Cumming) tries to have them killed by causing their plane to crash. They survive, having managed to safely land the plane on their own... only to find that they had landed in the parking lot of an arena hosting a Metallica concert.", 
                "id": "BoyBand"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "divaish", 
                    "subliminal", 
                    "music", 
                    "White-Ass", 
                    "former"
                ], 
                "role": "Beautiful All Along: Inverted. The divaish record executve Fiona turns out to be Lisa Snyder, a nerdy girl with buck teeth who speaks with a lisp, and tries to put subliminal messages into her label's music to get everybody to like her. Meanwhile, Wyatt Frame, the suave Brit, turns out to be \"White-Ass Wally,\" an albino American with a beer gut — and one of Fiona/Lisa's former classmates. They cover up their looks using makeup, veneers and fake accents.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Evil Diva: Fiona. Subverted in that she doesn't actually make or perform the music, but is rather the CEO of a record company. The band is also unwittingly turned into these as a result of her actions.", 
                "id": "EvilDiva"
            }, 
            {
                "adjectives": [
                    "titular", 
                    "subliminal", 
                    "bitchy", 
                    "own", 
                    "evil", 
                    "diva-ish", 
                    "responsible", 
                    "subliminal", 
                    "music", 
                    "brutal", 
                    "high", 
                    "bad"
                ], 
                "role": "The titular characters in the Josie and the Pussycats movie become like this, albeit unwittingly. Josie herself winds up getting brainwashed with subliminal messages in order to turn her into a bitchy diva who will break up the band and pursue a solo career (the record company was getting annoyed with Melody and Valerie, and felt that Josie could sell more records on her own). A more conventionally evil example would be Fiona, the diva-ish CEO of MegaRecords, who, while not a singer herself, was the one responsible for putting subliminal messages into her label's music in order to sell consumer products to teenagers. Her real goal, however, was to use the messages to get people to like her and look up to her as a fashion idol, having never gotten over the brutal humiliation she suffered in high school for her bad teeth and her lisp.", 
                "id": "EvilDiva"
            }
        ]
    }, 
    "imdbid": "tt0236348", 
    "poster_url": "JosieAndThePussycats.jpg", 
    "similar": [
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "KuchKuchHotaHai", 
            "name": "Kuch Kuch Hota Hai", 
            "poster_url": "KuchKuchHotaHai.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "CaptainEO", 
            "name": "Captain EO", 
            "poster_url": "CaptainEO.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "HowToMarryAMillionaire", 
            "name": "How to Marry a Millionaire", 
            "poster_url": "HowToMarryAMillionaire.jpg"
        }
    ], 
    "id": "JosieAndThePussycats", 
    "name": "Josie and the Pussycats"
}