{
    "plot": "Huge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go to plan? Especially when one of the parks' own workers attempts to steal the dinosaur embryos, and has to shut down critical security systems in the process. It's now a race for survival with dangerous creatures roaming all over the island.", 
    "genres": "Adventure, Sci-Fi, Thriller", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "open", 
                    "own", 
                    "opposite"
                ], 
                "role": "Dirty Coward:  Ed Regis, who abandons the Hammond children in a car with the door open to save his own ass when the T. rex shows up  and gets eaten for his trouble. Donald Gennaro takes on the role in the movie, despite having been very much the opposite in the book.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "nearby", 
                    "ignominious", 
                    "T-Rex"
                ], 
                "role": "The film version hands this role off to Donald Gennaro, the lawyer sent to inspect the title park, who hides in a nearby outhouse after ditching the kids, only to suffer the ignominious honor of being nommed on the can when the T-Rex knocks the outhouse building down and finds him.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "close", 
                    "straight", 
                    "modern", 
                    "'tude", 
                    "close", 
                    "anti-heroic", 
                    "romantic", 
                    "cynical", 
                    "hard", 
                    "hamstrung", 
                    "gas-powered", 
                    "reasonable", 
                    "acid", 
                    "large", 
                    "gas-powered", 
                    "electric", 
                    "total"
                ], 
                "role": "Muldoon in Jurassic Park is about as close as you'll get to this trope being played straight in the modern day. He was technically a game warden, though, but the look and the 'tude were there; close enough. Muldoon was really something of a subversion in that he leaned more toward the anti-heroic end of the scale. He is not portrayed in a particularly romantic manner, and is in fact an embittered, highly cynical man who hates animals and wishes he could kill them all - and considering what happens throughout the course of the film, it's hard to blame him.\n In the novel, he's actually consistently right, just constantly hamstrung by Hammond. He wanted multiple gas-powered jeeps, wanted to kill and dissect one of each kind of dinosaur so they could be made safe for the tourists - a reasonable request, considering the dilophosauri could spit acid, and requested a large amount of high-caliber weaponry. He got two gas-powered jeeps (the rest were electric), one of which Nedry stole, was not allowed to harm the animals, and was denied the weaponry that might have saved lives on the island. Luckily,  he's a total badass anyway, and Hammond gets eaten by a bunch of Compys.", 
                "id": "GreatWhiteHunter"
            }, 
            {
                "adjectives": [
                    "close", 
                    "straight", 
                    "modern", 
                    "'tude", 
                    "close", 
                    "anti-heroic", 
                    "romantic", 
                    "cynical", 
                    "hard", 
                    "hamstrung", 
                    "gas-powered", 
                    "reasonable", 
                    "acid", 
                    "large", 
                    "gas-powered", 
                    "electric", 
                    "total"
                ], 
                "role": "Jurassic Park:\n Muldoon in Jurassic Park is about as close as you'll get to this trope being played straight in the modern day. He was technically a game warden, though, but the look and the 'tude were there; close enough. Muldoon was really something of a subversion in that he leaned more toward the anti-heroic end of the scale. He is not portrayed in a particularly romantic manner, and is in fact an embittered, highly cynical man who hates animals and wishes he could kill them all - and considering what happens throughout the course of the film, it's hard to blame him.\n In the novel, he's actually consistently right, just constantly hamstrung by Hammond. He wanted multiple gas-powered jeeps, wanted to kill and dissect one of each kind of dinosaur so they could be made safe for the tourists - a reasonable request, considering the dilophosauri could spit acid, and requested a large amount of high-caliber weaponry. He got two gas-powered jeeps (the rest were electric), one of which Nedry stole, was not allowed to harm the animals, and was denied the weaponry that might have saved lives on the island. Luckily,  he's a total badass anyway, and Hammond gets eaten by a bunch of Compys.\n Roland Tembo in The Lost World: Jurassic Park is even closer, and has made his goal to turn over captured dinos to the Big Bad in exchange for getting to hunt a bull male T-rex.", 
                "id": "GreatWhiteHunter"
            }, 
            {
                "adjectives": [
                    "first", 
                    "close", 
                    "sweaty", 
                    "white"
                ], 
                "role": "John Hammond from the first Jurassic Park film edges very close to being a Fat, Sweaty Southerner in a White Suit, but is redeemed by the fact that he's neither sweaty nor a Southerner. However, the white cane and sun hat are all there.", 
                "id": "ManInWhite"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "only", 
                    "cast", 
                    "physical", 
                    "able"
                ], 
                "role": "Action Girl: Ellie Sattler in the movie. She is the only member of the cast to survive a physical fight with Velociraptors, being able to hit them with slamming doors, to outrun them, and to kick them in the groin.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "hot"
                ], 
                "role": "Jurassic Park: Dr. Ellie Sattler (Laura Dern), already hot, gets just a little bit hotter in the movie's scene in the park's tourist museum and dinosaur egg laboratory when she puts on a pair of glasses.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [], 
                "role": "In Jurassic Park, this role is played by Tim. While Lex turns the power back on and Grant and Ellie try to keep a raptor out, he stands ineffectively behind his sister shouting encouragement instead of, say, passing Ellie the gun she's trying to reach with her foot so she can shoot the raptor before it devours them all. Justified in that he's nine and also had his back to Ellie at that point.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Donald Gennaro", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0107290", 
    "poster_url": "JurassicPark.jpg", 
    "similar": [
        {
            "shared": [
                "NeutralFemale", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "Meganekko", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "Meganekko", 
                "ManInWhite", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TheChick", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "Immortals", 
            "name": "Immortals", 
            "poster_url": "Immortals.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "IAmNumberFour", 
            "name": "I Am Number Four", 
            "poster_url": "IAmNumberFour.jpg"
        }
    ], 
    "id": "JurassicPark", 
    "name": "Jurassic Park"
}