{
    "plot": "Naina {Preity Zinta} is a young woman, slightly ticked off for reasons more than one. His father committed suicide when she needed him the most, leaving Jennifer{Jaya bachchan}, his wife all alone. Lajjo{Sushma Seth}, Jennifer's mother-in-law blames Jennifer for the same. furthermore, Jennifer is unhappy because Lajjo refuses to accept Gia, a 6-year old girl whom Jennifer adopted. Even the restaurant Jennifer is running is not going great guns. in short, nothing is well on the Kapur family front. the only factors that redeem Naina's existence are his toiling and tolerant mother Jennifer, and her bumbling stumbling MBA classmate Rohit {Saif Ali Khan}. Meanwhile, Aman{Shah Rukh Khan}, a happy-go-lucky guy arrives in Naina's neighbourhood and soon changes everything around, thanks to his contagious joviality and jest for life. He proves to be the messiah for the Kapur family in every sort. Naina is not a happy camper initially but could remain unaffected by his charisma for long, and falls in love with him. On the contrary, some platonic moments arouse Rohit's fondness for Naina a bit more and he's in love too. But when Naina thinks of confessing her love to Aman, she realises that Aman is a married man. its only later when we find out that Aman lies because he is a heart patient and has a limited life to live. But since Aman loves Naina too, he wants some one's love to embrace Naina after him for which he finds Rohit suitable. Rohit who took no time to move after some pain, is somehow coaxed by Aman to re-think about his relation with Naina. Aman plans a strategic set of efforts and brings Rohit and Naina close. But when Naina finds out the truth, what follows is a complex string of pangs of helpless love. Aman meets his decided fate, but not before changing Naina's life forever.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "late"
                ], 
                "role": "Disappeared Dad: the late Mr. Kapur.", 
                "id": "DisappearedDad"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Evil Matriarch: Lajjo for much of the film.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "Manic Pixie Dream Girl: Genders inverted; Aman is this to Naina.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt0347304", 
    "poster_url": "KalHoNaaHo.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "EvilMatriarch"
            ], 
            "shared_count": 2, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "MaidInManhattan", 
            "name": "Maid In Manhattan", 
            "poster_url": "MaidInManhattan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EvilMatriarch"
            ], 
            "shared_count": 2, 
            "id": "TheBaby", 
            "name": "The Baby"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EvilMatriarch"
            ], 
            "shared_count": 2, 
            "id": "ThrowMommaFromTheTrain", 
            "name": "Throw Momma from the Train", 
            "poster_url": "ThrowMommaFromTheTrain.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "RubySparks", 
            "name": "Ruby Sparks", 
            "poster_url": "RubySparks.jpg"
        }
    ], 
    "id": "KalHoNaaHo", 
    "name": "Kal Ho Naa Ho"
}