{
    "plot": "As do most of the various KAMEN (MASKED) RIDER television series, RIDER ZO concerns itself with a human being who is transformed into a cyborg hero and subsequently challenges a ruthless and powerful menace (frequently an alien organization using a series of bizarre creatures to enforce their will) which rises to threaten the Earth. The transition into a Rider is frequently the result of the evil entities' attempts at creating an unbeatable warrior, though in some of the previous projects, some riders have acted to create other Riders, and at least one individual deliberately became a Rider in order to exact revenge. In this case, the selected human is researcher Asou Masaru. Slightly unbalanced scientist Dr. Mochizuki is experimenting on the creation of a mysterious and vaguely threatening organism. Along the way, he pauses to create a human/locust cyborg. Alarmed at his new form, ZO retreats to a nearby forest and hides away. In the meantime, Dr. Mochizuki has finished his work and the organism is set loose on an unprepared world. ZO returns to defend the deranged scientist's young son and the world in a series of battles.", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Absent-Minded", 
                    "ready", 
                    "Bunny-Ears"
                ], 
                "role": "Absent-Minded Professor: Hiroshi's grandfather. (The adaptations expand his role a little, and a Deleted Scene, where he shows up ready to protect Hiroshi with a lightning gun-rod and meets ZO, would've given him more of a Bunny-Ears Lawyer feel.)", 
                "id": "AbsentMindedProfessor"
            }
        ]
    }, 
    "imdbid": "tt0099917", 
    "similar": [
        {
            "shared": [
                "AbsentMindedProfessor"
            ], 
            "shared_count": 1, 
            "id": "Stargate", 
            "name": "Stargate", 
            "poster_url": "Stargate.jpg"
        }, 
        {
            "shared": [
                "AbsentMindedProfessor"
            ], 
            "shared_count": 1, 
            "id": "TheExtraordinaryAdventuresOfAdeleBlancSec", 
            "name": "The Extraordinary Adventures of Adèle Blanc-Sec"
        }, 
        {
            "shared": [
                "AbsentMindedProfessor"
            ], 
            "shared_count": 1, 
            "id": "TheSatanBug", 
            "name": "The Satan Bug", 
            "poster_url": "TheSatanBug.jpg"
        }, 
        {
            "shared": [
                "AbsentMindedProfessor"
            ], 
            "shared_count": 1, 
            "id": "IndependenceDay", 
            "name": "Independence Day", 
            "poster_url": "IndependenceDay.jpg"
        }, 
        {
            "shared": [
                "AbsentMindedProfessor"
            ], 
            "shared_count": 1, 
            "id": "Epic", 
            "name": "Epic"
        }
    ], 
    "id": "KamenRiderZO", 
    "name": "Kamen Rider ZO"
}