{
    "plot": "This series debuted 2 Kamen Riders. Kamen Rider 1, and Kamen Rider 2. This 98 episode series depicted Hongou Hayato's battles against Shocker, and Rider 1 and 2 had allies, specifically, FBI Agent Take, played by Sonny Chiba's brother, Jirou.", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "1971–", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "main", 
                    "secondary", 
                    "much", 
                    "own", 
                    "few", 
                    "own"
                ], 
                "role": "In any Kamen Rider series, expect the main Rider and the secondary Rider to eventually become this. More prominent in the Heisei shows, where it's pretty much the norm for any given show to have at least two riders of its own, but the Showa era had a few of its own like the Double Riders when they were onscreen together, and V3 and Riderman when the latter figured out he should be fighting all of Destron and not just the one guy he had a grudge against.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "personal", 
                    "empty", 
                    "common", 
                    "much", 
                    "quirky", 
                    "likeable", 
                    "arrogant", 
                    "white"
                ], 
                "role": "Kamen Rider:\n Sano Mitsuru from Kamen Rider Ryuki was thrown out and forced to get a day job. His rich father hoped it would build Mitsuru some character. It didn't.\n Kamishiro Tsurugi from Kamen Rider Kabuto. His personal motto is, \"I am the man who will replace God and slash with a sword\". He eventually discovers that his family coffers are more empty than he had ever imagined (as in, completely) and resolves to restore his family wealth whilst learning about the joys of \"the common people\", becoming much more quirky and likeable in the process.\n Sieg from Kamen Rider Den-O, an arrogant Imagin who claims that \"the world revolves for [his] sake\" and initially sees the DenLiner crew as his servants. Hana punches some sense into him, though, and he warms up to the others a lot quicker. Bonus points for his predominantly white color scheme.", 
                "id": "PrincelyYoungMan"
            }, 
            {
                "adjectives": [
                    "personal", 
                    "empty", 
                    "common", 
                    "much", 
                    "quirky", 
                    "likeable", 
                    "arrogant", 
                    "white"
                ], 
                "role": "Kamen Rider:\n Mitsuru Sanofrom Kamen Rider Ryuki was thrown out and forced to get a day job. His rich father hoped it would build Mitsuru some character. It didn't.\n Tsurugi Kamishiro from Kamen Rider Kabuto. If you're wondering which kind of Sheltered Aristocrathe is, consider that his personal motto is, \"I am the man who will replace God and slash with a sword\". He eventually discovers that his family coffers are more empty than he had ever imagined (as in, completely) and resolves to restore his family wealth whilst learning about the joys of \"the common people\", becoming much more quirky and likeable in the process.\n Sieg from Kamen Rider Den-O, an arrogant Imagin who claims that \"the world revolves for [his] sake\" and initially sees the DenLiner crew as his servants. Hana punches some sense into him, though, and he warms up to the others a lot quicker. Bonus points for his predominantly white color scheme.", 
                "id": "ShelteredAristocrat"
            }, 
            {
                "adjectives": [], 
                "role": "Kamen Rider:\n Urataros from Kamen Rider Den-O.\n Otoya Kurenai in Kamen Rider Kiva.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Yuriko/Tackle", 
                    "original", 
                    "first", 
                    "Miho/Femme", 
                    "Several", 
                    "only", 
                    "long-term", 
                    "original", 
                    "Natsumi/Larc", 
                    "Manipulative", 
                    "heavy", 
                    "other", 
                    "full", 
                    "brief", 
                    "long-term", 
                    "true", 
                    "bad", 
                    "male", 
                    "final", 
                    "whole", 
                    "past", 
                    "full-fledged", 
                    "dead", 
                    "much", 
                    "effective", 
                    "original", 
                    "movie-only", 
                    "female", 
                    "female", 
                    "mysterious", 
                    "same", 
                    "old", 
                    "restored", 
                    "primordial", 
                    "bad", 
                    "main", 
                    "main", 
                    "pure", 
                    "first", 
                    "much", 
                    "other"
                ], 
                "role": "In Kamen Rider, a recurring feature of the Kamen Rider franchise is that women who become Riders are doomed to die, usually for cheap drama. Examples (and aversions):\n Stronger: Yuriko/Tackle, the original Disposable Rider Woman. Not considered a Kamen Rider, which remains something of a sticking point among the fandom.\n Agito: The first Agito was Shouichi's sister, who died pre-series.\n Ryuki: Miho/Femme only appears in the movie Episode Final, where she dies quietly after a battle and is subsequently forgotten.\n Faiz: Several women borrow a Rider Gear (only to be immediately knocked out of morph) but the only woman to have one long-term, the original Delta, operated mostly offscreen, only to die just before what would have been her first onscreen battle. Harsh.\n Blade: Natsumi/Larc only appears in the movie Missing Ace and is killed, but in fairness so are her teammates.\n Hibiki: Shuki is a Manipulative Bitch and antagonist, so naturally she dies. (Mind you, this was part of the heavy Re Tool to make the series - based on a Shotaro Ishinomori Toku story that wasn't intended to be a KR series - in line with what The Powers That Be thought a KR series should be like. Neither this nor any of the other changes went over well.) Akira doesn't become a full Oni, but transforms once (we don't see her Rider form well) and survives the series.\n Kiva: Yuri, who uses Ixa a time or three in 1986, dies off-camera but it doesn't seem to have anything to do with being a Rider. Her daughter Megumi, who uses Ixa on two brief occasions in 2008, survives the series and moves on to get married in the ending. Neither is the long-term owner of the Ixa armor; like Faiz, borrowing it from its true male owners is often a bad idea, but this time, there's exceptions: The Movie (Megumi still just gets beaten up, but Yuri gets to use it well), and the time the male users defeated Rook but allowed the girls to have the final blow.\n Decade: Natsumi becomes a Rider in the Grand Finale movie and survives the whole seriesnote Okay, so technically she did die, well before she became a Rider, but The Hero Tsukasa sacrificed a portion of his life to bring her Back from the Dead. Fans have joked that she gets to survive because she's already satisfied the death requirement. The series also gives better treatment to some past Riders, allowing Larc (renamed Haruka) to live and upgrading Akira to a full-fledged Rider, Kamen Rider Amaki. Tackle's back, and is still dead (it's complicated) but she's a much more effective fighter than the original Faux Action Girl.\n Fourze actively subverts it. When a movie-only female Rider named after Tackle arrives, wondering whether she'd survive or not was quite the source of drama; introducing and then killing a female Rider in the movie had happened often, but with Decade, a female Rider who survives was no longer a contradiction in terms. Will the mysterious Kamen Rider Nadeshiko make it?  No, it's the same old story. She's restored to the primordial ooze she was made from, to be used by the bad guy as a power source and a reason to make the main Rider cry by the plot. Then again, when the main villain is defeated, she survives as pure energy and returns to space.\n Wizard is the first season that indisputably subverts this trope with Kamen Rider Mage. Not only that, she's given much more development compared to the other two Mages, and established herself as the show's Tertiary Rider.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "female", 
                    "close", 
                    "plot-centric", 
                    "such", 
                    "responsible"
                ], 
                "role": "Almost all female leads in Kamen Rider are a sister, close friend or love interest of the hero. If not, they'll have something to do with a plot-centric male figure, such as Akiko in Kamen Rider Double (the daughter of the hero's mentor) or Yui in Kamen Rider Ryuki (the sister of the man responsible for the Rider War.)", 
                "id": "NeverASelfMadeWoman"
            }
        ]
    }, 
    "imdbid": "tt0156214", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "NeverASelfMadeWoman", 
                "BashBrothers"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "PrincelyYoungMan", 
                "ShelteredAristocrat"
            ], 
            "shared_count": 3, 
            "id": "KamenRiderDenO", 
            "name": "Kamen Rider Den-O"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }
    ], 
    "id": "KamenRider", 
    "name": "Kamen Rider"
}