{
    "plot": "Spencer Aimes is just your average, undercover, government-hired super-assassin accustomed to a life of exotic European locales, flashy sports cars and even flashier women. But when he meets Jen Kornfeldt, a beautiful, fun-loving computer tech recovering from a bad break-up, he finds true love...and happily trades international intrigue for domestic bliss. Three years later, Spencer and Jen are still enjoying a picture-perfect marriage - that is, until the morning after Spencer's 30th birthday. That's when Spencer and Jen learn he's the target of a multi-million dollar hit. Even worse, the hired killers have been stalking the happy couple for years, and could be anyone: friends, neighbors, the grocery store clerk, even that crabby old guy shuffling across the street. Now Spencer and Jen are on the run for their lives. As their suburban paradise turns into a paranoid game of dodge-the-bullet, they must find out who wants Spencer dead and why, all the while trying to save their marriage, manage his in-laws, keep up neighborly appearances ... and just plain survive.", 
    "genres": "Action, Comedy, Romance", 
    "release_year": "2010", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Jen evolves into this, in a wholesome, 1950s, trust circle kind of way.", 
                "id": "ActionGirl"
            }
        ]
    }, 
    "imdbid": "tt1103153", 
    "poster_url": "Killers.jpg", 
    "similar": [
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "ToTheLimit", 
            "name": "To The Limit", 
            "poster_url": "ToTheLimit.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "TheIcePirates", 
            "name": "The Ice Pirates", 
            "poster_url": "TheIcePirates.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "TheExtraordinaryAdventuresOfAdeleBlancSec", 
            "name": "The Extraordinary Adventures of Adèle Blanc-Sec"
        }
    ], 
    "id": "Killers", 
    "name": "Killers"
}