{
    "plot": "The lead character, called 'The Bride,' was a member of the Deadly Viper Assassination Squad, led by her lover 'Bill.' Upon realizing she was pregnant with Bill's child, 'The Bride' decided to escape her life as a killer. She fled to Texas, met a young man, who, on the day of their wedding rehearsal was gunned down by an angry and jealous Bill (with the assistance of the Deadly Viper Assassination Squad). Four years later, 'The Bride' wakes from a coma, and discovers her baby is gone. She, then, decides to seek revenge upon the five people who destroyed her life and killed her baby. The saga of Kill Bill Volume I begins.", 
    "genres": "Action, Crime", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Parodied in Kill Bill Vol 2, with Pai Mei.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Bill in Kill Bill.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "nihilistic", 
                    "murderous"
                ], 
                "role": "This is the basis of Kill Bill, demonstrating that women get a shot at nihilistic murderous despair at least once in a while.", 
                "id": "CrusadingWidower"
            }, 
            {
                "adjectives": [], 
                "role": "Drill Sergeant Nasty: Pai Mei.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "few", 
                    "hard", 
                    "extra-strong"
                ], 
                "role": "In Kill Bill, Pai Mei harbors quite a few prejudices, including a dislike of women, although he seems to hate everyone until they prove themselves. It's hard to tell if he really harbors an extra-strong dislike of women, or simply insults The Bride's femininity by happenstance because he'll basically insult any attribute of any student of his.", 
                "id": "HeManWomanHater"
            }, 
            {
                "adjectives": [
                    "little", 
                    "common"
                ], 
                "role": "Non-Action Guy: Unlike the rest of his associates, Budd appears to have little to no fighting abilities. He makes up for it with common sense.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Black Woman: Vernita Green, a.k.a Copperhead.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "major", 
                    "other"
                ], 
                "role": "Action Girl: Every major female character other than Sofie Fatale, Nikki Green and B.B. Action Mom: Vernita and the Bride become this after the incident in the church.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Action Mom: Vernita and the Bride become this after the incident in the church.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "able"
                ], 
                "role": "Although she tries and fails to embrace the housewife role, Beatrix from Kill Bill could fit this trope, especially since in the end it is implied that even though she is reunited with her daughter, she's probably not going to be able to go forever without kicking ass.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Amazon Brigade: The Deadly Vipers are predominantly female, and even then Bill rarely dirties his hands during conflict and Budd is far less skilled than any of them.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "In Kill Bill, 4/5 of the Deadly Viper Assassination Squad is female, 4/6 if you count Bill.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [], 
                "role": "The Bride from Kill Bill - although no stunning reveal, just stalking. Still hot and creepy though.", 
                "id": "BikerBabe"
            }, 
            {
                "adjectives": [], 
                "role": "Blondes are Evil: Elle Driver. Averted with the Bride.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "female", 
                    "female", 
                    "yellow"
                ], 
                "role": "The non-fiction book Gomorrah mentioned that female Camorra gang bosses use female bodyguards. They often dress in yellow jumpsuits in homage to Uma Thurman's outfit in Kill Bill.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [
                    "Asian"
                ], 
                "role": "Kill Bill : Chiaki Kurayama as Gogo Yubari really was the perfect naughty Asian schoolgirl. It's a shame she had to get stabbed in the brain with two nails.", 
                "id": "CatholicSchoolGirlsRule"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Dark Action Girl: Pretty much every one of the female assassins.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "O-Ren"
                ], 
                "role": "O-Ren Ishii, Elle Driver, Gogo Yubari, Vernita Green, and Karen Kim from Kill Bill.\n The Bride as well.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Girl with Psycho Weapon: Gogo Yubari", 
                "id": "GirlWithPsychoWeapon"
            }, 
            {
                "adjectives": [], 
                "role": "Hello, Nurse!: Elle.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [], 
                "role": "Gogo Yubari in her school uniform, despite being a girl with a psycho weapon, or two.", 
                "id": "Joshikousei"
            }, 
            {
                "adjectives": [
                    "O-Ren"
                ], 
                "role": "Gogo, O-Ren Ishii's henchwoman in Kill Bill.", 
                "id": "Joshikousei"
            }, 
            {
                "adjectives": [
                    "O-Ren"
                ], 
                "role": "Lady of War: O-Ren Ishii, also a Woman in White.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "O-Ren", 
                    "notable"
                ], 
                "role": "Pictured above is O-Ren Ishii from Kill Bill, Head of the Yakuza and avenger of her parents murder at age 11. She keeps that stone cold expression throughout the movie, whether it's decapitating one of her subordinates for insulting her heritage or fighting the revenge seeking protagonist to the death. She is the Expy of Lady Snowblood another notable Lady of War.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "Japanese", 
                    "spiky", 
                    "pre-teen", 
                    "top"
                ], 
                "role": "Kill Bill:\n Gogo Yubari. A cute Japanese girl who wears a girly school uniform. But she's also deadly as hell. And she can do wonders with her weapon of choice — a spiky sphere on chain.\n O-Ren Ishii, when she was young. She manages to avenge her parents when she's a pre-teen and she quickly becomes one of the top female assassin in the world.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [
                    "necessary"
                ], 
                "role": "Mama Bear: The reason why the Bride left her assassin order was to raise her soon-to-be-born baby away from bloodshed. Guess what she did when she couldn't fulfil it... \"Guessing won't be necessary.\"", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Elle Driver in Kill Bill wears one of these outfits when she goes to assassinate The Bride.", 
                "id": "NaughtyNurseOutfit"
            }, 
            {
                "adjectives": [
                    "pregnant"
                ], 
                "role": "Kill Bill: The Bride, although she'd literally just found out she was pregnant (test still in hand). Also, she and her attacker decided to just walk away instead of fight. Otherwise an aversion, which led to the plot occurring.", 
                "id": "PregnantBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in Black: Sofie Fatale. More like \"Woman dressed as a villain on Star Trek.\"", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [
                    "white", 
                    "full"
                ], 
                "role": "Woman in White: O-Ren. The Bride, of course, when she's in the dress. And then at the end of Volume 2, we see her in white again, bringing the story full circle.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "first", 
                    "final"
                ], 
                "role": "Inversion: The Bride in Kill Bill could be seen as an example, but in fact the act that set her on her Roaring Rampage of Revenge in the first place fits the trope much better, and the El Paso wedding massacre was the work of a scorned man. As Bill would tell the Bride in their final confrontation, \"there are consequences to breaking the heart of a murdering bastard.\"", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0266697", 
    "poster_url": "KillBill.jpg", 
    "similar": [
        {
            "shared": [
                "CrazyJealousGuy", 
                "DarkActionGirl", 
                "LittleMissBadass", 
                "WomanInBlack", 
                "ActionMom", 
                "BodyguardBabes", 
                "LadyOfWar"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "MamaBear", 
                "PregnantBadass", 
                "AmazonBrigade", 
                "LittleMissBadass", 
                "LadyOfWar", 
                "BodyguardBabes", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "Dune", 
            "name": "Dune", 
            "poster_url": "Dune.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "MamaBear", 
                "AmazonBrigade", 
                "WomanInWhite", 
                "WomanInBlack", 
                "HelloNurse", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "SuckerPunch", 
            "name": "Sucker Punch", 
            "poster_url": "SuckerPunch.jpg"
        }, 
        {
            "shared": [
                "DarkActionGirl", 
                "BeardOfEvil", 
                "WomanInBlack", 
                "LadyOfWar", 
                "WomanScorned", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "MamaBear", 
                "BlondesAreEvil", 
                "WomanInWhite", 
                "WomanInBlack", 
                "LadyOfWar", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "KillBill", 
    "name": "Kill Bill"
}