{
    "plot": "It is the time of the Crusades during the Middle Ages - the world shaping 200-year collision between Europe and the East. A blacksmith named Balian has lost his family and nearly his faith. The religious wars raging in the far-off Holy Land seem remote to him, yet he is pulled into that immense drama. Amid the pageantry and intrigues of medieval Jerusalem he falls in love, grows into a leader, and ultimately uses all his courage and skill to defend the city against staggering odds. Destiny comes seeking Balian in the form of a great knight, Godfrey of Ibelin, a Crusader briefly home to France from fighting in the East. Revealing himself as Balian's father, Godfrey shows him the true meaning of knighthood and takes him on a journey across continents to the fabled Holy City. In Jerusalem at that moment--between the Second and Third Crusades--a fragile peace prevails, through the efforts of its enlightened Christian king, Baldwin IV, aided by his advisor Tiberias, and the military restraint of the legendary Muslim leader Saladin. But Baldwin's days are numbered, and strains of fanaticism, greed, and jealousy among the Crusaders threaten to shatter the truce. King Baldwin's vision of peace--a kingdom of heaven--is shared by a handful of knights, including Godfrey of Ibelin, who swear to uphold it with their lives and honor. As Godfrey passes his sword to his son, he also passes on that sacred oath: to protect the helpless, safeguard the peace, and work toward harmony between religions and cultures, so that a kingdom of heaven can flourish on earth. Balian takes the sword and steps into history.", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Balian"
                ], 
                "role": "Badass Mustache: Balian.", 
                "id": "BadAssMustache"
            }, 
            {
                "adjectives": [
                    "full"
                ], 
                "role": "Beard of Evil: Reynauld and Guy both sport full beards.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "Balian", 
                    "big"
                ], 
                "role": "Knight in Shining Armor: Balian big time. Also his crew.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [], 
                "role": "Man in White: King Baldwin.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [
                    "fair", 
                    "attractive", 
                    "male", 
                    "young", 
                    "old", 
                    "shoe-in"
                ], 
                "role": "Mr. Fanservice: While there are a fair number of fairly attractive male examples from the mostly male cast who run the gambit of young to old, Balian who appears shirtless in at least one scene is a shoe-in as an example because after all he is Legolas and Will Turner.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "The Wise Prince: King Baldwin IV.", 
                "id": "TheWisePrince"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "due"
                ], 
                "role": "Ill Boy: King Baldwin, whose face is disfigured due to leprosy. His nephew, as well.", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Sybilla in Kingdom of Heaven.", 
                "id": "TheHighQueen"
            }, 
            {
                "adjectives": [], 
                "role": "The Woman Wearing the Queenly Mask: Queen Sybilla.", 
                "id": "TheWomanWearingTheQueenlyMask"
            }
        ]
    }, 
    "imdbid": "tt0320661", 
    "poster_url": "KingdomOfHeaven.jpg", 
    "similar": [
        {
            "shared": [
                "BadAssMustache", 
                "MrFanservice", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "TheWomanWearingTheQueenlyMask", 
                "TheWisePrince", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "PrincessMononoke", 
            "name": "Princess Mononoke", 
            "poster_url": "PrincessMononoke.jpg"
        }, 
        {
            "shared": [
                "TheWisePrince", 
                "MrFanservice", 
                "TheHighQueen"
            ], 
            "shared_count": 3, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "TheWomanWearingTheQueenlyMask", 
                "TheHighQueen"
            ], 
            "shared_count": 2, 
            "id": "CatherineTheGreat", 
            "name": "Catherine The Great", 
            "poster_url": "CatherineTheGreat.jpg"
        }, 
        {
            "shared": [
                "MrFanservice", 
                "TheHighQueen"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "KingdomOfHeaven", 
    "name": "Kingdom of Heaven"
}