{
    "plot": "A petty thief posing as an actor is brought to Los Angeles for an unlikely audition and finds himself in the middle of a murder investigation along with his high school dream girl and a detective who's been training him for his upcoming role...", 
    "genres": "Action, Comedy, Crime", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Chivalrous", 
                    "serious", 
                    "uncomfortable", 
                    "easy", 
                    "become", 
                    "blasé"
                ], 
                "role": "Chivalrous Pervert: Harry has a serious case of this - no problem hitting on, looking at, or sleeping with women, but he has deep issues with any unsolicited contact and is uncomfortable with \"easy\" Hollywood girls. Early on in the movie he gets beat up preventing a guy from groping a sleeping Harmony at a party, only to hit on her hours after, and then sleep with her friend. Later, he touches her breast to get a spider, and when says she didn't mind if he had copped a feel, he freaks out and says there's something wrong with her and the guys she hangs out with if she's become that blasé about being groped. He adamantly refuses \"pity sex\".", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "Dogged"
                ], 
                "role": "Dogged Nice Guy: Harry. Really.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "other", 
                    "several", 
                    "such"
                ], 
                "role": "Straight Gay: \"Gay\" Perry, who is a badass and generally avoids gay stereotypes. On the other hand, he has several Camp Gay moments, such as having \"I Will Survive\" as a ringtone.", 
                "id": "StraightGay"
            }, 
            {
                "adjectives": [
                    "electrical", 
                    "first"
                ], 
                "role": "Kiss Kiss Bang Bang: Harry wakes up in the hospital after a shocking ordeal involving electrical torture (to the groin) lots of shooting, a car chase, and a fall from an overpass. The first thing Harmony asks him if hes alright down there.", 
                "id": "TestesTest"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "sexual", 
                    "well-meaning"
                ], 
                "role": "Femme Fatale: Subverted by Harmony: she's coded this way, being alluring, sexual and a heap of trouble for Harry, but she's just a well-meaning screw-up like him.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "good", 
                    "only", 
                    "same", 
                    "Long"
                ], 
                "role": "In Kiss Kiss Bang Bang, Perry hides a gun down there with a fairly good justification - he knows it's the only place he'll never be searched.\n Another male character uses the same justification in The Long Kiss Goodnight.", 
                "id": "Ptitleba4e2b2g"
            }
        ]
    }, 
    "imdbid": "tt0373469", 
    "poster_url": "KissKissBangBang.jpg", 
    "similar": [
        {
            "shared": [
                "DoggedNiceGuy", 
                "StraightGay", 
                "TestesTest", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 4, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "FemmeFatale", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "FemmeFatale", 
                "ChivalrousPervert"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 2, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale", 
                "ChivalrousPervert"
            ], 
            "shared_count": 2, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }
    ], 
    "id": "KissKissBangBang", 
    "name": "Kiss Kiss Bang Bang"
}