{
    "plot": "Well off Andrzej and Krystyna's marriage is at a stage where familiarity breeds contempt, that contempt which is outwardly shown only behind closed doors and only when an incident of some sort sets off one or the other. While driving through the countryside on a Sunday on their way to the lake to embark on an overnight sailing excursion, they almost run over a young male hitchhiker. Despite the antagonism between Andrzej and the hitchhiker, Andrzej offers him a ride as far as the marina. By the time they reach the lake, their antagonism has dissipated enough that Andrzej asks if he would like to join them on their sailing trip. The hitchhiker accepts despite knowing nothing about sailing. As the sailing trip progresses, the antagonism between the two men begins to increase again, fueled on both sides as each strives to be the alpha male. Andrzej needs to show his superiority, while the hitchhiker needs to show that his young age and inexperience, not only with sailing but with life in general, do not make him any less of a man in comparison. Later incidents demonstrate that their relationship may have been different if Krystyna was not in the picture. The hitchhiker's pocket knife, seemingly his most prized possession on his person, becomes a symbol of that power struggle between the two men. If the three emerge from their sailing trip alive, they may be forever changed by their encounter.", 
    "genres": "Drama", 
    "release_year": "1962", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "boat", 
                    "attractive"
                ], 
                "role": "Beautiful All Along: Krystyna is made up to be somewhat plain when she is introduced. When they get on the boat she dons a bikini, and is revealed as exceptionally attractive.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "first", 
                    "Polish"
                ], 
                "role": "Ms. Fanservice: Jolanta Umecka's nude scene was the first in the history of Polish film.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0056291", 
    "poster_url": "KnifeInTheWater.jpg", 
    "similar": [
        {
            "shared": [
                "BeautifulAllAlong", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "AlphaAndOmega", 
            "name": "Alpha and Omega", 
            "poster_url": "AlphaAndOmega.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "KuchKuchHotaHai", 
            "name": "Kuch Kuch Hota Hai", 
            "poster_url": "KuchKuchHotaHai.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "RazorBladeSmile", 
            "name": "Razor Blade Smile", 
            "poster_url": "RazorBladeSmile.jpg"
        }
    ], 
    "id": "KnifeInTheWater", 
    "name": "Knife In The Water"
}