{
    "plot": "In the Valley of Peace, Po Ping is revelling in his fulfilled dreams as he serves as the fabled Dragon Warrior protecting his home with his heroes now his closest friends. However, Po and company learn that the murderous Lord Shen of Gongman City is threatening the land with a fearsome new weapon that could mean the end of kung fu. They attempt to stop him, but the panda is burdened with crippling memory flashbacks linked to this villain. Now with China in the balance, Po must learn about his past and find true inner peace against all opposition.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Boss Wolf from Kung Fu Panda 2.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "literal", 
                    "literal"
                ], 
                "role": "The Wolf Boss, possibly a literal example since he was a wolf who refused to fire on his wolf underlings despite Shen's orders. The wolf might even be A Father to His Men in a literal sense too, given that leaders of wolf packs tend to be the daddy to the lot of them.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "actual", 
                    "impressive"
                ], 
                "role": "Lord Shen from Kung Fu Panda 2. Despite being an actual peacock, his skills with steel claws and razor feathers makes him impressive to watch.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [
                    "Paper-Thin", 
                    "kite"
                ], 
                "role": "Disguised in Drag: Po, during the Stealth Mode sequence, pretends to be a woman briefly. Doubles as Paper-Thin Disguise, since it consists of only a kite, two watermelons, and a fan.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [
                    "biological", 
                    "first", 
                    "collective", 
                    "literal", 
                    "literal"
                ], 
                "role": "Papa Wolf: Po's biological dad, as it's shown that he directly confronted the wolves that were massacring his village. Maybe Po's badassery is In the Blood... Shifu as well. His first instinct when Po gets shot is to travel to Gongmen City at breakneck speed in order to pull a Big Damn Heroes and kick the collective asses of those responsible. Granted that he's only the victim's father figure, but it's still badass.  The Wolf Boss, possibly a literal example since he was a wolf who refused to fire on his wolf underlings despite Shen's orders. The wolf might even be A Father to His Men in a literal sense too, given that leaders of wolf packs tend to be the daddy to the lot of them.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "white", 
                    "graceful", 
                    "elegant", 
                    "other", 
                    "kung-fu"
                ], 
                "role": "Kung Fu Panda 2, the Big Bad Lord Shen. First clue is that he's a white peacock. He's smug, calculating, looks down on everyone, and when he fights his movements are noticeably more graceful and elegant than the other kung-fu fighters.", 
                "id": "TheFightingNarcissist"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Tigress and Viper.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Tigress in Kung Fu Panda 2 to Po, if you want to disregard the hints that she may be falling in love with him.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "elderly"
                ], 
                "role": "The Soothesayer from Kung Fu Panda 2 is an elderly female goat with a beard.", 
                "id": "GirlsWithMoustaches"
            }, 
            {
                "adjectives": [
                    "biological", 
                    "likely"
                ], 
                "role": "It's finally revealed in Kung Fu Panda 2 that both of Po's biological parents were seemingly killed by Lord Shen during his attempted genocide of the panda species. The Sequel Hook at the end shows that  Po's dad survived, but it's implied that his mother pulled a Heroic Sacrifice to save Po and is most likely dead.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Missing Mom: Well, at least we know what happened now. Sort of.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt1302011", 
    "poster_url": "KungFuPanda2.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "DisguisedInDrag", 
                "MissingMom", 
                "AgentPeacock"
            ], 
            "shared_count": 4, 
            "id": "TheBoondockSaints", 
            "name": "The Boondock Saints", 
            "poster_url": "TheBoondockSaints.jpg"
        }, 
        {
            "shared": [
                "MissingMom", 
                "TheFightingNarcissist", 
                "DisguisedInDrag", 
                "AFatherToHisMen"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "BatmanMysteryOfTheBatwoman", 
            "name": "Batman: Mystery of the Batwoman", 
            "poster_url": "BatmanMysteryOfTheBatwoman.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }
    ], 
    "id": "KungFuPanda2", 
    "name": "Kung Fu Panda 2"
}