{
    "plot": "It's the story about a lazy, irreverent slacker panda, named Po, who is the biggest fan of Kung Fu around...which doesn't exactly come in handy while working every day in his family's noodle shop. Unexpectedly chosen to fulfill an ancient prophecy, Po's dreams become reality when he joins the world of Kung Fu and studies alongside his idols, the legendary Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- under the leadership of their guru, Master Shifu. But before they know it, the vengeful and treacherous snow leopard Tai Lung is headed their way, and it's up to Po to defend everyone from the oncoming threat. Can he turn his dreams of becoming a Kung Fu master into reality? Po puts his heart - and his girth - into the task, and the unlikely hero ultimately finds that his greatest weaknesses turn out to be his greatest strengths.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "martial"
                ], 
                "role": "Kung Fu Panda: Po intensely admires Tigress' martial arts skill as an Ascended Fanboy.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "whoop-ass"
                ], 
                "role": "Badass Grandpa: Anyone who can name a more whoop-ass ancient turtle than Oogway may raise their hand. Seeing how Shifu also kicks a fair amount of ass despite his age, he qualifies too.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "old", 
                    "dangerous", 
                    "martial", 
                    "sentimental"
                ], 
                "role": "Master Oogway in Kung Fu Panda was quite old when he beat one of the most dangerous known martial artists. Master Shifu probably could have replicated the success 20 years later if not for his sentimental attachment to said artist.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Mr Ping of Kung Fu Panda. He has no kung fu skills whatsoever, and devotes almost all his time to manning his noodle store.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Commander Vachir from Kung Fu Panda.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "white"
                ], 
                "role": "Scary Black Man: Michael Clarke Duncan makes Vachir sound like one, yet ironically, he appears to be a white rhino.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "major", 
                    "fat", 
                    "nerve"
                ], 
                "role": "Po, the panda protagonist of Kung Fu Panda. This is actually a major advantage, since his fat protects him from nerve strikes.", 
                "id": "StoutStrength"
            }, 
            {
                "adjectives": [], 
                "role": "Walking Shirtless Scene: Po and Tai Lung.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Tigress and Viper.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "male", 
                    "human-like", 
                    "female", 
                    "muscular", 
                    "human-like"
                ], 
                "role": "Inverted in Kung Fu Panda in that Tai Lung (a male snow leopard) has a body that looks more human-like than that of Master Tigress [a female tiger]. His body is muscular and looks more human-like so as to contrast with her sleeker, leaner body.", 
                "id": "HumanoidFemaleAnimal"
            }, 
            {
                "adjectives": [
                    "eponymous", 
                    "main", 
                    "special"
                ], 
                "role": "In Kung Fu Panda we see the eponymous panda and his father, and no mother. And we don't even get to know what happened to her! According to The Art of Kung Fu Panda, the directors originally intended to put Po's mother into the story, but decided in the end that it distracted from the main story and wasn't very interesting. The fact they didn't want to make Po seem special for having a goose father, and that they wanted to play silly buggers with the audience about the Oblivious Adoption may also have had something to do with it.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "adoptive"
                ], 
                "role": "Missing Mom: Po's adoptive father doesn't seem to be married.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "skilled"
                ], 
                "role": "Viper from Kung Fu Panda is, well, a viper, but she certainly qualifies. Kind to everyone, lovely, feminine, but also a skilled kung fu artist.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [], 
                "role": "Master Crane from Kung Fu Panda is described as the \"Mother Hen\", despite being male. And voiced by David Cross.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [
                    "sweet"
                ], 
                "role": "The Chick: Viper; sweet tempered and wears flowers on her head.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0441773", 
    "poster_url": "KungFuPanda.jpg", 
    "similar": [
        {
            "shared": [
                "NonActionGuy", 
                "AmazonChaser", 
                "CoolOldGuy", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "TeamMom", 
                "AmazonChaser", 
                "TheChick"
            ], 
            "shared_count": 4, 
            "id": "TheCroods", 
            "name": "The Croods", 
            "poster_url": "TheCroods.jpg"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "TeamMom", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "CoolOldGuy", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Ben10", 
            "name": "Ben 10"
        }, 
        {
            "shared": [
                "TheChick", 
                "CoolOldGuy", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "OnceUponAForest", 
            "name": "Once Upon a Forest", 
            "poster_url": "OnceUponAForest.jpg"
        }
    ], 
    "id": "KungFuPanda", 
    "name": "Kung Fu Panda"
}