{
    "plot": "Young Sarah is left home alone by her parents and she has to babysit her little brother Toby. But the baby keeps crying and Sarah, while telling him a story to make him sleep, inadvertently conjures from a fantasy world the Goblin King who steals the child and brings him to his castle in the middle of a labyrinth. Sarah has to rescue him before midnight, or the baby will became a goblin...", 
    "genres": "Adventure, Family, Fantasy", 
    "release_year": "1986", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Agent Peacock: Jareth.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [
                    "swishy", 
                    "magical"
                ], 
                "role": "Jareth: From Labyrinth... extremely camp and rather swishy...and yet King of the Goblins with insane magical powers. My god, the costume changes.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [
                    "Bishōnen", 
                    "bad", 
                    "comic", 
                    "true", 
                    "many", 
                    "disappointed"
                ], 
                "role": "Bishōnen: The creator of Return to Labyrinth actually referred to Jareth as one. Too bad the comic's art beyond the cover didn't follow true to that word; there were many a disappointed fan after opening the book...", 
                "id": "Bishonen"
            }, 
            {
                "adjectives": [], 
                "role": "This is one way to interpret Labyrinth's Jareth's behavior. Well, mostly when he threatened Hoggle whom he thought was a rival for Sarah's affections.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice/Perverse Sexual Lust: Pretty much everyone on the internet ever wants to get into Jareth's tights.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Senior Sleep Cycle: The Wise Man falls asleep mid-sentence, much to the chagrin of his talking hat.", 
                "id": "SeniorSleepCycle"
            }, 
            {
                "adjectives": [
                    "old"
                ], 
                "role": "The wise old man in Labyrinth, much to the chagrin of his hat.", 
                "id": "SeniorSleepCycle"
            }, 
            {
                "adjectives": [
                    "spoiled"
                ], 
                "role": "The Evil Prince: Though he bears the title of king, Jareth acts more like a spoiled prince who'd rather be doing anything but actually ruling the goblins.", 
                "id": "TheEvilPrince"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "complete", 
                    "spoiled", 
                    "roomful", 
                    "unavailable", 
                    "obvious", 
                    "perspective", 
                    "real"
                ], 
                "role": "Sarah from Labyrinth begins the film acting like a complete spoiled brat who blames every problem she has on her stepmother and half brother. The events of the film mature her.\n Also a subtle deconstruction. She's a spoiled brat with a roomful of toys and pitches fits, but her parents are emotionally unavailable at best and passive-aggressively snide at worst; her outbursts are obvious cries for attention. The movie ends  with Sarah learning to turn inward for comfort, without losing perspective in the real world.", 
                "id": "BrattyTeenageDaughter"
            }, 
            {
                "adjectives": [
                    "diminutive", 
                    "monstrous", 
                    "tight"
                ], 
                "role": "A rare male example comes up in Labyrinth. All the goblins are diminutive, monstrous creatures with wart infested skin and bizarre bone structures... except for their king, Jareth, who just looks like David Bowie with make up on (and and very very tight pants).", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Daddy's Girl", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "dynamic", 
                    "half-brother"
                ], 
                "role": "In Labyrinth, this dynamic drives Sarah's relationship with her stepmother and half-brother.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Girls Love Stuffed Animals", 
                "id": "GirlsLoveStuffedAnimals"
            }, 
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Sarah of Labyrinth has lots of them, but later realizes It's All Junk.", 
                "id": "GirlsLoveStuffedAnimals"
            }, 
            {
                "adjectives": [
                    "real", 
                    "new", 
                    "snappish", 
                    "insensitive", 
                    "acceptable", 
                    "few", 
                    "different", 
                    "particular", 
                    "fair"
                ], 
                "role": "Subverted in Labyrinth, where the stepmother complains that Sarah treats her like this figure. Sarah's Character Development in the movie reveals the real problem is Sarah's jealousy toward her stepmother and new half-brother. Her stepmother isn't exactly a saint either, though; she spends her one scene being snappish and insensitive, implying it's acceptable to take Sarah for granted because, being a loner and a bit of a geek, she doesn't date. Sarah's Character Development can be read a few different ways, in particular the idea that what she learns isn't that she needs to get over her baseless jealousy (which, based on the way her stepmother acts, may be justified) but that life isn't fair, and maturity means not pitching a fit over it.", 
                "id": "WickedStepmother"
            }, 
            {
                "adjectives": [], 
                "role": "Wicked Stepmother: The stepmother invokes this, saying Sarah insists on treating her like one.", 
                "id": "WickedStepmother"
            }, 
            {
                "adjectives": [], 
                "role": "Mizumi, the Queen of Moraine, in Return to Labyrinth.", 
                "id": "WinterRoyalLady"
            }
        ]
    }, 
    "imdbid": "tt0091369", 
    "poster_url": "Labyrinth.jpg", 
    "similar": [
        {
            "shared": [
                "TheEvilPrince", 
                "CrazyJealousGuy", 
                "MrFanservice", 
                "DaddysGirl"
            ], 
            "shared_count": 4, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "MrFanservice", 
                "BrattyTeenageDaughter"
            ], 
            "shared_count": 3, 
            "id": "BendItLikeBeckham", 
            "name": "Bend It Like Beckham", 
            "poster_url": "BendItLikeBeckham.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "WickedStepmother", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "MrFanservice", 
                "BrattyTeenageDaughter"
            ], 
            "shared_count": 2, 
            "id": "TheCroods", 
            "name": "The Croods", 
            "poster_url": "TheCroods.jpg"
        }
    ], 
    "id": "Labyrinth", 
    "name": "Labyrinth"
}