{
    "plot": "Yuki's family is nearly wiped out before she is born due to the machinations of a band of criminals. These criminals kidnap and brutalize her mother but leave her alive. Later her mother ends up in prison with only revenge to keep her alive. She creates an instrument for this revenge by purposefully getting pregnant. Though she dies in childbirth, she makes sure that the child will be raised as an assassin to kill the criminals who destroyed her family. Young Yuki never knows the love of a family but only killing and revenge.", 
    "genres": "Action, Drama, Thriller", 
    "release_year": "1973", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "whole", 
                    "small"
                ], 
                "role": "Bigger Is Better In Bed: Blackmailer Genjiro subverts this. Amusingly enough, that was the whole reason why he blackmailed people. He wanted to raise up his funds to move to England, since the women in Japan were too small for him to fit it in.", 
                "id": "BiggerIsBetterInBed"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Dark Action Girl: Oyuki could be classed as one.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "happy"
                ], 
                "role": "Even the Girls Want Her: Oyuki gets more than her fair share of indecent proposals from women, and she's quite happy to oblige.", 
                "id": "EvenTheGirlsWantHer"
            }, 
            {
                "adjectives": [
                    "first", 
                    "real", 
                    "deserve", 
                    "free"
                ], 
                "role": "At first she seems to be a Femme Fatale, but if you look closely she is a real Vamp. Ok most people she kills deserve their demise, but she went too far when she  forced a chauffeur to rape his employer's daughter, then killed the girl in order to blackmail the hapless man into becoming an accomplice to another murder. Although she promised to let him go free, she kills him anyway.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [], 
                "role": "Ill Girl: One of Oyuki's plots involves seducing one.", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Lady of War: Oyuki", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "lesbian", 
                    "current", 
                    "only", 
                    "disastrous"
                ], 
                "role": "Lipstick Lesbian: At one point, a lesbian character tells Oyuki: \"I knew you were one of us.\" And indeed she is: Oyuki has sex with at least four women over the course of the story, of whom only one had anything to do with her current assignment. And the only sex a guy ever has with Oyuki (excluding universally disastrous rape attempts) is intercrural. This may have something to do with her mother's Back Story.", 
                "id": "LipstickLesbian"
            }, 
            {
                "adjectives": [], 
                "role": "Never Mess with Granny: Auntie Kiku of Tajire.", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Psycho Lesbian: Quite a few, resulting in Girl on Girl Is Hot scenes.", 
                "id": "PsychoLesbian"
            }, 
            {
                "adjectives": [
                    "O-Ren"
                ], 
                "role": "Lady Snowblood, who inspired Kill Bill's O-Ren Ishii.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0158714", 
    "poster_url": "LadySnowblood.jpg", 
    "similar": [
        {
            "shared": [
                "LadyOfWar", 
                "PsychoLesbian", 
                "WomanInWhite", 
                "DarkActionGirl", 
                "EvenTheGirlsWantHer"
            ], 
            "shared_count": 5, 
            "id": "LegendOfTheSeeker", 
            "name": "Legend of the Seeker"
        }, 
        {
            "shared": [
                "LadyOfWar", 
                "NeverMessWithGranny", 
                "FemmeFatale", 
                "WomanInWhite"
            ], 
            "shared_count": 4, 
            "id": "Red", 
            "name": "Red", 
            "poster_url": "Red.jpg"
        }, 
        {
            "shared": [
                "LadyOfWar", 
                "DarkActionGirl", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "LadyOfWar", 
                "DarkActionGirl", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "LipstickLesbian", 
                "FemmeFatale", 
                "EvenTheGirlsWantHer"
            ], 
            "shared_count": 3, 
            "id": "Bound", 
            "name": "Bound", 
            "poster_url": "Bound.jpg"
        }
    ], 
    "id": "LadySnowblood", 
    "name": "Lady Snowblood"
}