{
    "plot": "Until he was downsized, affable, amiable Larry Crowne (Hanks) was a superstar team leader at the big-box company where he's worked since his time in the Navy. Underwater on his mortgage and unclear on what to do with his suddenly free days, Larry heads to his local college to start over. There he becomes part of a colorful community of outcasts, also-rans and the overlooked all trying to find a better future for themselves...often moving around town in a herd of scooters. In his public-speaking class, Larry develops an unexpected crush on his teacher Mercedes Tainot (Roberts), who has lost as much passion for teaching as she has for her husband. The simple guy who has every reason to think his life has stalled will come to learn an unexpected lesson: when you think everything worth having has passed you by, you just might discover your reason to live.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2011", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "romantic"
                ], 
                "role": "Larry Crowne: Talia (Gugu Mbatha-Raw) personifies this trope to the point where Mercedes Tainot (Julia Roberts) even refers to her as a pixie. The only area where she breaks the stereotype is that she has no romantic interest in Larry (Tom Hanks) and her efforts are aimed at getting him together with Mercedes.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "astute"
                ], 
                "role": "Manic Pixie Dream Girl: A subversion. Talia initially seems to be set up for this role, but she never becomes Larry's love interest. In fact, she turns out to be a pretty astute entrepreneur, who respects Larry's grasp of economics. Lampshaded by Mercedes and Dell, who keep expecting this trope to manifest.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt1583420", 
    "poster_url": "LarryCrowne.jpg", 
    "similar": [
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Lo", 
            "name": "Lo"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "LAStory", 
            "name": "LA Story"
        }
    ], 
    "id": "LarryCrowne", 
    "name": "Larry Crowne"
}