{
    "plot": "Young Danny Madigan is a big fan of Jack Slater, a larger-than-life action hero played by Arnold Schwarzenegger. When his best friend, Nick the projectionist, gives him a magic ticket to the new Jack Slater film, Danny is transported into Slater's world, where the good guys always win. One of Slater's enemies, Benedict the hitman, gets hold of the ticket and ends up in Danny's world, where he realises that if he can kill Schwarzenegger, Slater will be no more. Slater and Danny must travel back and stop him.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Beard of Evil: Benedict", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Benedict from Last Action Hero.", 
                "id": "CulturedBadass"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "later", 
                    "social", 
                    "possible", 
                    "top", 
                    "possible"
                ], 
                "role": "Action Girl: Deconstructed. Slater tells Danny that he wishes his daughter, Whitney, was more normal. He later tells Danny that she has no friends or social life, and spends all her spare time with her guns. Also a possible subversion, given that Whitney hardly does anything, despite her actress receiving top billing alongside Schwarzeneggar (in Jack Slater IV, that is). It's possible that Danny stepping in meant he took over her role as Slater's sidekick.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "thrown", 
                    "thy", 
                    "fair", 
                    "fair", 
                    "entire", 
                    "full"
                ], 
                "role": "Adrenaline Makeover / Anachronism Stew: Played for laughs during the Arnold as Hamlet dream sequence. It starts off with Hamlet killing people with thrown skulls and swords before responding to the line \"Stay thy hand, fair prince\" with a \"Who says I'm fair?\" and slaughtering an entire castle full of guards with a submachine gun before blowing the castle up.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Parodied like everything else in this film. Slater's daughter is attacked by a bunch of thugs and screams in terror..... while actually being the one kicking their asses. At one point she breaks one of their necks right before letting out another scream.", 
                "id": "DamselInDistress"
            }
        ]
    }, 
    "imdbid": "tt0107362", 
    "poster_url": "LastActionHero.jpg", 
    "similar": [
        {
            "shared": [
                "CulturedBadass", 
                "DamselInDistress", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover", 
                "BeardOfEvil", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "AdrenalineMakeover", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "HouseOfFlyingDaggers", 
            "name": "House of Flying Daggers", 
            "poster_url": "HouseOfFlyingDaggers.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }
    ], 
    "id": "LastActionHero", 
    "name": "Last Action Hero"
}