{
    "plot": "A successful cocaine dealer, who has earned a respected place among England's Mafia elite, plans an early retirement from the business. However, big boss Jimmy Price hands down a tough assignment: find Charlotte Ryder, the missing rich princess daughter of Jimmy's old pal Edward, a powerful construction business player and gossip papers socialite. Complicating matters are two million pounds' worth of Grade A ecstasy, a brutal neo-Nazi sect and a whole series of double crossings. The title \"LAYER CAKE\" refers to the layers or levels anyone in business goes through in rising to the top. What is revealed is a modern underworld where the rules have changed. There are no 'codes', or 'families' and respect lasts as long as a line. Not knowing who he can trust, he has to use all his 'savvy', 'telling' and skills which make him one of the best, to escape his own. The ultimate last job, a love interest called Tammy, and an international drug ring threaten to draw him back into the 'cake mix'. But, time is running out and the penalty will endure a lifetime..", 
    "genres": "Crime, Drama, Thriller", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Crazy Jealous Guy:  Sidney", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "odd"
                ], 
                "role": "Gayngster: Crazy Larry, who was also a Depraved Homosexual, who raped straight men and strangled the odd rent-boy.  Gene killed him with the rare gun mentioned below, as a sort of Mercy Kill because Larry was over the edge.", 
                "id": "Gayngster"
            }, 
            {
                "adjectives": [
                    "main", 
                    "soft", 
                    "straight"
                ], 
                "role": "Scary Black Man: Averted by the two main black characters, Morty and Trevor, who are very soft spoken and seem perpetually calm. Eventually played straight when the idiot who landed Morty in jail for ten years wanders in the restaurant and asks him for money. Carnage ensues.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed", 
                    "good", 
                    "nice"
                ], 
                "role": "Sharp-Dressed Man: XXXX sure looks good in a nice suit.", 
                "id": "SharpDressedMan"
            }
        ]
    }, 
    "imdbid": "tt0375912", 
    "poster_url": "LayerCake.jpg", 
    "similar": [
        {
            "shared": [
                "SharpDressedMan", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheWiz", 
            "name": "The Wiz", 
            "poster_url": "TheWiz.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "Super", 
            "name": "Super", 
            "poster_url": "Super.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "Gayngster"
            ], 
            "shared_count": 2, 
            "id": "Performance", 
            "name": "Performance", 
            "poster_url": "Performance.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "HorribleBosses", 
            "name": "Horrible Bosses", 
            "poster_url": "HorribleBosses.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }
    ], 
    "id": "LayerCake", 
    "name": "Layer Cake"
}