{
    "plot": "The Cleavers are the 1950's 'All-American Family' in this 'feel-good' family sitcom. Parents Ward and June, and older brother Wally, try to keep Theodore ('the Beaver') out of trouble. However, Beaver continues to end up in one kind of jam or another. Unlike real life, these situations are always easily resolved to the satisfaction of all involved and the Beaver gets off with a few stern moralistic words of parental advice. Instigator and troublemaker Eddie Haskell is an older kid who always manages to avoid being caught.", 
    "genres": "Comedy, Family", 
    "release_year": "1957–1963", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "irresistible"
                ], 
                "role": "Chick Magnet: Wally is pretty laid back about girls, but they aren't laid back about him. Eddie Haskell claims to be irresistible to girls, although you never see any of them.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [], 
                "role": "Leave It to Beaver: Wally Cleaver was never too concerned about girls, but the girls all seemed to consider him the hottest catch in school.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [], 
                "role": "Dad the Veteran: In one episode Ward Cleaver mentions being in the Army Air Corps during World War II.", 
                "id": "DadTheVeteran"
            }, 
            {
                "adjectives": [
                    "High"
                ], 
                "role": "High School Hustler: The obsequious-to-adults but Jerk Ass-to-younger-brothers Eddie Haskell.", 
                "id": "HighSchoolHustler"
            }, 
            {
                "adjectives": [
                    "original", 
                    "afraid", 
                    "late", 
                    "wrong", 
                    "correct"
                ], 
                "role": "Standard '50s Father: Ward Cleaver was the original Trope Namer, back when Standard '50s Father was called Mister Cleaver. Even though Ward was truly a \"father knows best\" archetype, a couple of episodes did point out that he wasn't without his faults. One episode had Ward really come down hard on Wally and Beaver … too hard, and when the boys ran into trouble, they were afraid to come to him for advice; Ward realizes that he acted out of haste. In another episode, when Wally and Beaver are late a couple of times delivering newspapers, the parents try to pick up the slack by delivering for them – except they delivered the wrong papers … not knowing that Wally and Beaver already had completed that day's delivery run with the correct ones, and they cause their sons to get fired.", 
                "id": "StandardFiftiesFather"
            }, 
            {
                "adjectives": [
                    "former"
                ], 
                "role": "Ward Cleaver, the paterfamilias of the Cleaver clan in Leave It to Beaver and former Trope Namer.", 
                "id": "StandardFiftiesFather"
            }, 
            {
                "adjectives": [
                    "All-American"
                ], 
                "role": "The All-American Boy: Beaver. This is why Mathers got the job; they knew they had the right boy when, during his casting call, he expressed concern over missing his Boy Scout meeting.", 
                "id": "TheAllAmericanBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "classic/stereotypical", 
                    "and/or", 
                    "sexy", 
                    "hollow", 
                    "later", 
                    "high-collared"
                ], 
                "role": "Housewife: June Cleaver is the classic/stereotypical embodiment of the '50s version of the trope. She got to wear slacks in a couple early episodes, but this was eventually nixed by the producers, who felt it too unladylike and/or too sexy for the character. In reference to the pearls and heels while doing housework, Barbara Billingsley (may she RIP) stated that she didn't always wear them. She had a hollow in her neck that showed up quite visibly on camera. Even in later appearances/interviews, she can be seen with either a high-collared blouse or a pearl necklace covering it. Same with the heels. She said she sometimes wore flats, but as Dow and Mathers grew, she thought it would be best to maintain a bit of height over them.", 
                "id": "HouseWife"
            }, 
            {
                "adjectives": [
                    "formal", 
                    "other", 
                    "sneaky", 
                    "sweet", 
                    "able", 
                    "rid"
                ], 
                "role": "An example of this Trope appeared as far back as Leave It to Beaver, believe it or not. Wally's school was having a formal dance with another school where the boys were matched with girls from the other school (and vice-versa) as dance partners by lottery, and one of Wally's rather sneaky friends - who had obtained the rival school's yearbook - offered to trade with him. At first it seemed like a bargain, because the girl was sweet and a knockout; however, she was very tall. (A handicap for dancing.) Fortunately, the girl was able to switch from heels to flats and get rid of a corset in order to match his size better.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "late"
                ], 
                "role": "Women Drivers: Referenced but not actually used when June learns to drive relatively late in life.", 
                "id": "WomenDrivers"
            }
        ]
    }, 
    "imdbid": "tt0050032", 
    "similar": [
        {
            "shared": [
                "StandardFiftiesFather", 
                "HouseWife"
            ], 
            "shared_count": 2, 
            "id": "TheWoman", 
            "name": "The Woman", 
            "poster_url": "TheWoman.jpg"
        }, 
        {
            "shared": [
                "StatuesqueStunner", 
                "WomenDrivers"
            ], 
            "shared_count": 2, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }, 
        {
            "shared": [
                "ChickMagnet", 
                "StatuesqueStunner"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "ChickMagnet", 
                "WomenDrivers"
            ], 
            "shared_count": 2, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "ChickMagnet"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "LeaveItToBeaver", 
    "name": "Leave It to Beaver"
}