{
    "plot": "A demon who seeks to create eternal night by destroying the last of the unicorns and marrying a fairy princess is opposed by the forest boy Jack and his elven allies in this magical fantasy. Two different versions of this picture feature soundtracks by either Tangerine Dream or Jerry Goldsmith.", 
    "genres": "Adventure, Fantasy, Romance", 
    "release_year": "1985", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "many", 
                    "attractive"
                ], 
                "role": "Subverted in Legend for many fans, who consider Mia Sara more attractive as \"Dark Lili\" than \"Princess Lili\". (Her costume certainly didn't hurt.)", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Lily.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "complete", 
                    "giant"
                ], 
                "role": "Distracted by the Luxury: Whilst running around Darkness's lair in a complete panic, Lily is briefly lulled into calm by the sight of a giant diamond necklace.", 
                "id": "DistractedByTheLuxury"
            }, 
            {
                "adjectives": [
                    "mortal", 
                    "huge"
                ], 
                "role": "Lily in Legend can be distracted from mortal peril by a huge, glittery diamond studded necklace.", 
                "id": "DistractedByTheLuxury"
            }, 
            {
                "adjectives": [
                    "first", 
                    "naïve", 
                    "white", 
                    "low-cut", 
                    "own", 
                    "terrible"
                ], 
                "role": "Lili is both of these over the course of Legend, first as an innocent and naïve virgin in a white dress, then as a sexy and cunning Manipulative Bitch in an extremely low-cut black gown.  It's all an act, however. She's actually a Fake Defector trying to fix her own, terrible, mistake.", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "quintessential", 
                    "classic", 
                    "close", 
                    "free", 
                    "captured"
                ], 
                "role": "Princess Classic: Princess Lili starts out as a quintessential princess classic, only to go through a Break the Cutie process, accumulating in an intense case of Corrupt the Cutie, only for this to be revealed as a ruse she put on in order to trick Darkness into letting her get close enough to free a captured unicorn.", 
                "id": "PrincessClassic"
            }, 
            {
                "adjectives": [
                    "quintessential", 
                    "close", 
                    "free", 
                    "captured"
                ], 
                "role": "Princess Lili from Legend starts out as a quintessential Princess Classic, only to go through a Break the Cutie process, accumulating in an intense case of Corrupt the Cutie, only for this to be revealed as a ruse she put on in order to trick Darkness into letting her get close enough to free a captured unicorn.", 
                "id": "PrincessClassic"
            }, 
            {
                "adjectives": [
                    "poor"
                ], 
                "role": "In Legend, it's implied that Lily frequently sneaks off into the woods to visit friends, one of whom even comments that she should be back at the palace and not hanging out with poor folks like them.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "Rebellious", 
                    "certain", 
                    "implied", 
                    "poor"
                ], 
                "role": "Rebellious Princess: Lily is this to a certain extent. It's implied that she frequently sneaks off into the woods to visit friends, one of whom even comments that she should be back at the palace and not hanging out with poor folks like them.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Woman Scorned: Oona, although she shows her quality by not allowing it to dissuade her from doing her part to stop Darkness.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0089469", 
    "poster_url": "Legend.jpg", 
    "similar": [
        {
            "shared": [
                "LightFeminineAndDarkFeminine", 
                "DamselInDistress", 
                "RebelliousPrincess"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "PrincessClassic", 
                "WomanScorned"
            ], 
            "shared_count": 2, 
            "id": "Krull", 
            "name": "Krull"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "RebelliousPrincess"
            ], 
            "shared_count": 2, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "PrincessClassic"
            ], 
            "shared_count": 2, 
            "id": "TheSwanPrincess", 
            "name": "The Swan Princess", 
            "poster_url": "TheSwanPrincess.jpg"
        }, 
        {
            "shared": [
                "RebelliousPrincess", 
                "PrincessClassic"
            ], 
            "shared_count": 2, 
            "id": "BarbieAndTheMagicOfPegasus", 
            "name": "Barbie And The Magic Of Pegasus", 
            "poster_url": "BarbieAndTheMagicOfPegasus.jpg"
        }
    ], 
    "id": "Legend", 
    "name": "Legend"
}