{
    "plot": "\"Lemonade Mouth\" tells kids and tweens that building your confidence rocks and finding your destiny rules. The story follows five disparate high school students - Olivia (Bridgit Mendler), Mo (Naomi Scott), Charlie (Blake Michael), Stella (Hayley Kiyoko), and Wen (Adam Hicks) who meet in detention. They realize they are destined to rock, and ultimately form a band that becomes a champion for students sidelined by the high school elite.", 
    "genres": "Family, Musical", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Bishōnen"
                ], 
                "role": "Bishōnen: Scott, and hinted at with Charlie.", 
                "id": "Bishonen"
            }, 
            {
                "adjectives": [], 
                "role": "Non-Action Guy: Wen lampshades this in the altercation with Ray: \"I'm a lover, not a fighter!\"", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [
                    "Overprotective"
                ], 
                "role": "Overprotective Dad: Mo's dad, almost to Papa Wolf levels.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "normal", 
                    "cast"
                ], 
                "role": "Troubled, but Cute: Charlie has the look, but not the personality. He comes off as the most normal member of the cast.", 
                "id": "TroubledButCute"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Adrenaline Makeover: The outfits that Mo wears on stage with Lemonade Mouth are not something you'd arguably see her wearing anywhere else.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [], 
                "role": "Alpha Brat: Ray. Big Time.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "Asian", 
                    "visionary", 
                    "music", 
                    "later", 
                    "same", 
                    "traditional", 
                    "intellectual", 
                    "advanced", 
                    "visible", 
                    "advanced", 
                    "natural", 
                    "talent/gifted"
                ], 
                "role": "Asian Airhead: Blown all the way to hell and back by Stella, who is visionary, leader and driving force of not only Lemonade Mouth, but in the effort to give the students a voice, and the one who gets Mel to build the music hall for the school. Played straight and entirely subverted at once in the book:  it's revealed that Stella only scored an IQ of 84 and was later diagnosed with a number of learning disabilities. She still acts exactly the same as she does in the movie - and in fact this is what drives her to act with vision and leadership. Also played with in the film: while the rest of her family have more traditional intellectual gifts and her brothers are child geniuses, Stella's advanced and very visible leadership ability is now considered an advanced natural talent/gifted ability.", 
                "id": "AsianAirhead"
            }, 
            {
                "adjectives": [], 
                "role": "Blondes are Evil: Disneyfied so that it's Lighter and Softer, but Jules comes across as this (as well as the Alpha Bitch).", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Mo, when she's on stage.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Soap Box Sadie: Stella lives and breaths this trope.", 
                "id": "SoapBoxSadie"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick - Mo would be, if she didn't play bass and acted more like The Smart Guy. Unfortunately, she isn't enough of The Smart Guy to satisfy her parents.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt1648204", 
    "poster_url": "LemonadeMouth.jpg", 
    "similar": [
        {
            "shared": [
                "TroubledButCute", 
                "OverprotectiveDad", 
                "MsFanservice"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "TroubledButCute", 
                "BlondesAreEvil", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "BlondesAreEvil", 
                "MsFanservice", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "CoolWorld", 
            "name": "Cool World", 
            "poster_url": "CoolWorld.jpg"
        }, 
        {
            "shared": [
                "TroubledButCute", 
                "TheChick", 
                "MsFanservice"
            ], 
            "shared_count": 3, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "BlondesAreEvil", 
                "MsFanservice"
            ], 
            "shared_count": 3, 
            "id": "SleepyHollow", 
            "name": "Sleepy Hollow", 
            "poster_url": "SleepyHollow.jpg"
        }
    ], 
    "id": "LemonadeMouth", 
    "name": "Lemonade Mouth"
}