{
    "plot": "Straight shooting Lemonade Joe cleans up Stetson City, in this musical parody of early Westerns, after shooting the pants off villain Old Pistol. Joe's endorsement of Kolaloka (Crazy Cola) lemonade as the refresher that assures deadly aim, convinces the Arizona sin-town to abstain from alcohol. Based on the 1963 Czech stage production. But Trigger Whiskey maker Duke Badman's brother the devious gunslinger Hogofogo, comes to save his sibling's saloon from Joe's allies, father and daughter temperance revivalists, the Goodmans.", 
    "genres": "Adventure, Comedy, Musical", 
    "release_year": "1964", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "private", 
                    "private"
                ], 
                "role": "Knight Errant: Thanks to Joe, a Double Subversion. At first we think Joe's a defender of the law; then we think he works in private business; then we realize that private businesses CONTROL the laws!", 
                "id": "KnightErrant"
            }, 
            {
                "adjectives": [
                    "such", 
                    "naive"
                ], 
                "role": "Pretty Boy: Joe. Doug is shocked, shocked! that Tornado Lou, a lioness of a woman, a storm of a woman, a fate of a woman would fall for such a pretty naive boy.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "All-American", 
                    "hard-working", 
                    "responsible", 
                    "great", 
                    "rich"
                ], 
                "role": "The All-American Boy: Joe. Not only is he a gunman who protects the law and sings and plays the piano... ...He's also very hard-working and responsible as he represents Kolalok&Son Company and has great talent for advertising. He's also very rich, because he's \"&son\".", 
                "id": "TheAllAmericanBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "large", 
                    "big", 
                    "other"
                ], 
                "role": "Big Beautiful Woman: Grimpo is a large man himself, and his girlfriend among the saloon girls is big as well. He is shown kissing her hands and fingers affectionately, and she has other admirers beside Grimpo.", 
                "id": "BigBeautifulWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Winnifred Goodman.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Femme Fatale: Tornado Lou, all over the place.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "Gold/Soiled"
                ], 
                "role": "Hooker with a Heart of Gold/Soiled Dove: Tornado Lou.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "sweet", 
                    "naïve", 
                    "white", 
                    "dark-haired", 
                    "different"
                ], 
                "role": "In Lemonade Joe, Or Horse Opera, Winifred Goodman and Tornado Lou both love the Ideal Hero Joe. Wini is a sweet and naïve Ingenue with blond hair who dresses in white and is usually seen helping her Preacher Man father or visiting her mother's grave, while Tornado Lou is a dark-haired Soiled Dove and a Chanteuse who wears dark and skimpy outfits and works in a saloon but dreams of becoming a different, better person.", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "sweet", 
                    "naïve", 
                    "white", 
                    "dark-haired", 
                    "different", 
                    "song", 
                    "dark"
                ], 
                "role": "Light Feminine and Dark Feminine: Winifred Goodman and Tornado Lou both love the Ideal Hero Joe. Wini is a sweet and naïve Ingenue with blond hair who dresses in white and is usually seen helping her father or visiting her mother's grave, while Tornado Lou is a dark-haired Soiled Dove and a Chanteuse who wears dark and skimpy outfits and works in a saloon but dreams of becoming a different, better person. Lou even has a song about it: \"My soul is as dark as a tub of tar...\"", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "sexy"
                ], 
                "role": "Ms. Fanservice: The saloon girls in their skimpy outfits are very sexy, especially during their dance number on the bar counter.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "true", 
                    "tough", 
                    "good"
                ], 
                "role": "The Chanteuse: Tornado Lou sings at the saloon. Her singing about her dream of finding true love moves tough guns-lingers to tears. Yes, she's that good.", 
                "id": "TheChanteuse"
            }, 
            {
                "adjectives": [
                    "gorgeous", 
                    "cheerful"
                ], 
                "role": "Tornado Lou from Lemonade Joe, a gorgeous Soiled Dove who dreams of becoming a better woman. She has two melancholy songs, one of which moves all gunmen in the Whisky Saloon to tears, and one extremely cheerful number which is accompanied by a dance routine from a posse of Ms. Fanservice girls in skimpy outfits.", 
                "id": "TheChanteuse"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Tornado Lou, when conspiring with Pistol and his minions, plays this role with tomboy gusto.", 
                "id": "TheChick"
            }, 
            {
                "adjectives": [
                    "sweet", 
                    "naive", 
                    "all-american", 
                    "virginal"
                ], 
                "role": "The Ingenue: Winnifred is a sweet, naive and all-american wholesome virginal girl.", 
                "id": "TheIngenue"
            }
        ]
    }, 
    "imdbid": "tt0058275", 
    "poster_url": "LemonadeJoe.jpg", 
    "similar": [
        {
            "shared": [
                "HookerWithAHeartOfGold", 
                "PrettyBoy", 
                "TheChick", 
                "MsFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 5, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "LightFeminineAndDarkFeminine", 
                "DamselInDistress", 
                "HookerWithAHeartOfGold", 
                "TheIngenue", 
                "FemmeFatale"
            ], 
            "shared_count": 5, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold", 
                "DamselInDistress", 
                "MsFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 4, 
            "id": "Bunraku", 
            "name": "Bunraku", 
            "poster_url": "Bunraku.jpg"
        }, 
        {
            "shared": [
                "LightFeminineAndDarkFeminine", 
                "DamselInDistress", 
                "MsFanservice", 
                "FemmeFatale"
            ], 
            "shared_count": 4, 
            "id": "BatmanForever", 
            "name": "Batman Forever", 
            "poster_url": "BatmanForever.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "TheChick", 
                "MsFanservice", 
                "TheIngenue"
            ], 
            "shared_count": 4, 
            "id": "SuckerPunch", 
            "name": "Sucker Punch", 
            "poster_url": "SuckerPunch.jpg"
        }
    ], 
    "id": "LemonadeJoe", 
    "name": "Lemonade Joe"
}