{
    "plot": "Leroy (16) is an Afro-German boy who, not only notoriously unlucky, must also battle with an identity crisis born of the fact that he is both a highly cultured, well-mannered German AND black, thus belonging to two minorities. Leroy has a girlfriend, Eva, whose brothers happen to be Neo-Nazi skinheads, Leroy's natural enemies. After some time, and against all odds, Leroy and Eva's brothers have managed to become friends, and one day they ask Leroy to join them, afro and all. Leroy declines and sets off on a long walk through Berlin with his Greek friend Dimitrios. Whilst distributing supermarket leaflets across a dirty, overcrowded city pulsing to a 70s soul-groove, Leroy and \"Dimmi\" discuss the sorer spots of the German condition human: white foreigners and black Germans, the problem Germans have saying the word \"Jew\", colored people on tanning beds and Hitler's plan to convert the colors of all German traffic lights to black, red and gold. When Leroy and Dimmi almost get beaten up by hostile skinheads, Eva bravely saves the day and then it dawns on Leroy how he can eradicate fascism from its very core.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "prime", 
                    "former"
                ], 
                "role": "Evil Roy: Leroy is the prime epitome of this trope, as Jumba was forced to create him, under orders from his former science partner Doctor Hamsterviel.", 
                "id": "EvilRoy"
            }
        ]
    }, 
    "imdbid": "tt0898323", 
    "poster_url": "LeroyAndStitch.jpg", 
    "similar": [
        {
            "shared": [
                "EvilRoy"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }, 
        {
            "shared": [
                "EvilRoy"
            ], 
            "shared_count": 1, 
            "id": "CrocodileDundee", 
            "name": "Crocodile Dundee", 
            "poster_url": "CrocodileDundee.jpg"
        }, 
        {
            "shared": [
                "EvilRoy"
            ], 
            "shared_count": 1, 
            "id": "EvilRoySlade", 
            "name": "Evil Roy Slade", 
            "poster_url": "EvilRoySlade.jpg"
        }, 
        {
            "shared": [
                "EvilRoy"
            ], 
            "shared_count": 1, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "EvilRoy"
            ], 
            "shared_count": 1, 
            "id": "StuartLittle", 
            "name": "Stuart Little", 
            "poster_url": "StuartLittle.jpg"
        }
    ], 
    "id": "LeroyAndStitch", 
    "name": "Leroy & Stitch"
}