{
    "plot": "Jean Valjean, known as Prisoner 24601, is released from prison and breaks parole to create a new life for himself while evading the grip of the persistent Inspector Javert. Set in post-revolutionary France, the story reaches resolution against the background of the June Rebellion.", 
    "genres": "Drama, Musical, Romance", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Jean", 
                    "Valjean"
                ], 
                "role": "Badass Grandpa: Jean Valjean.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "street-child"
                ], 
                "role": "Les Misérables features minor character Gavroche, a street-child who participates in the student uprising, collecting ammunition from the bodies of fallen enemy soldiers and survives being shot once to throw his bag of bullets over to his friends before falling to another shot.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "Break-o'Day", 
                    "sympathetic"
                ], 
                "role": "Thenardier and his wife of Les Misérables are described as the worst sort of scoundrels, to the extent that the Break-o'Day Boys (thieves and murderers, but not hypocrites!) are more sympathetic than them.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "many", 
                    "active", 
                    "due", 
                    "physical"
                ], 
                "role": "Dirty Old Man: Marius' grandfather, Monsieur Gillenormand, was a rake in his youth many decades ago, and still maintains an interest in skirt-chasing. He's no longer an active rake, due to lack of finances, not (supposedly) because of lack of physical capability.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Disappeared Dad: Cosette's father left her mother when Cosette was little. She doesn't remember him, and for most of the book, she thinks that Jean Valjean is her father.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "two-year-old", 
                    "pregnant"
                ], 
                "role": "In Les Misérables, Fantine's boyfriend Tholomyès abandoned her and their two-year-old daughter Cosette. His three friends are paired up with Fantine' three friends, and men abandon their women as a joke of sorts; Fantine either doesn't have a chance to tell him or finds out just afterwards that she's pregnant.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Dude Looks Like a Lady: Enjolras is often described as looking like a woman.", 
                "id": "DudeLooksLikeALady"
            }, 
            {
                "adjectives": [
                    "main", 
                    "typical", 
                    "actual", 
                    "Valjean", 
                    "actual", 
                    "workers/manual"
                ], 
                "role": "In Les Misérables, the main character is referred to as a galley slave (\"bagnard\"), as was typical at the time, even though by that point the prisoners were no longer allowed to serve as actual galley slaves. However some translations seem to be slightly confused by this and have Valjean as an actual galley slave, as do some of the films. Valjean and those like him were more like enslaved dock workers/manual laborers.", 
                "id": "GalleySlave"
            }, 
            {
                "adjectives": [
                    "English", 
                    "French", 
                    "accurate"
                ], 
                "role": "The \"bagne\" in which Valjean was imprisoned has created a lot of problems in English translation/adaptation, as it literally means \"galleys\", giving the misleading impression that Valjean was a Galley Slave during his imprisonment (the French name derives from the fact that the Bagne replaced the use of prisoners as galley slaves). To avoid the confusion, the 2013 translation by Christine Donougher uses the term \"prison hulks\" instead, which is also historically accurate, as prisoners continued to be \"housed\" in ships even after they were no longer used as rowers.", 
                "id": "GalleySlave"
            }, 
            {
                "adjectives": [
                    "Jean", 
                    "Valjean", 
                    "Thénardier"
                ], 
                "role": "Jean Valjean slits his wrists in Les Misérables just to prove how hardcore he really is. He also brands himself with a fire poker to prove that Thénardier's gang can't torture him for information.", 
                "id": "MachoMasochism"
            }, 
            {
                "adjectives": [
                    "Jean", 
                    "Valjean", 
                    "real"
                ], 
                "role": "Jean Valjean in Les Misérables, even though he isn't Cosette's real father. At first this is partly from self-preservation, as he believes Marius (who has been exchanging glances with Cosette) is an agent of the police, but once he finds out that they have been secretly meeting he wishes Marius dead.  Then inverted as he designates him as his successor in taking care of Cosette and saves him from the Barricade.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "Overprotective", 
                    "Valjean"
                ], 
                "role": "Overprotective Dad: Valjean to Cosette.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "girlish"
                ], 
                "role": "Pretty Boy: Enjolras. It is stated that he has girlish, pretty features. Also, Montparnasse.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "nice", 
                    "bishonen-level"
                ], 
                "role": "Montparnasse. Part of Thenardier's gang, he kills for nice clothing and sounds practically bishonen-level pretty.", 
                "id": "TheDandy"
            }, 
            {
                "adjectives": [], 
                "role": "The Dandy: Montparnasse. Felix Tholomyes. Courfeyrac and Bahorel. Theodule wears a corset, which was at the height of fashion for dandies at this period.", 
                "id": "TheDandy"
            }, 
            {
                "adjectives": [
                    "vicious", 
                    "fashionable"
                ], 
                "role": "The Fighting Narcissist: Montparnasse, who became a vicious street crook for the sake of staying fashionable and prides himself on his beauty even as he murders and steals his way through life.", 
                "id": "TheFightingNarcissist"
            }, 
            {
                "adjectives": [], 
                "role": "Genflou, from the 1952 film version of Les Misérables; a character who is not in the novel and was created to fill this role in the film version.", 
                "id": "TheOldConvict"
            }, 
            {
                "adjectives": [
                    "Jean", 
                    "Valjean", 
                    "strong", 
                    "other", 
                    "such"
                ], 
                "role": "Jean Valjean of Les Misérables is not established as actually being the world's strongest man, but he is so unusually strong that in all his life Javert has never seen any other person possess such strength, which is what causes him to recognize Valjean. Interestingly, Valjean is also about as far as you can get from being a meathead.", 
                "id": "WorldsStrongestMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Broken Bird: Fantine. Valjean after his release from prison.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "common", 
                    "street-smart", 
                    "vindictive", 
                    "ex-boyfriend", 
                    "weird"
                ], 
                "role": "Very common in Les Misérables tics that focus on Eponine. In-canon she's street-smart, more than a little vindictive, known to stand up to gangs of armed criminals each twice her size, and is implied to have connections in the Paris underworld via ex-boyfriend Montparnasse. In fanfic, she's a weepy victim of said Paris underworld ripe for being rescued Disney Princess style by Marius or Enjolras. Though in a weird bit of meta, this is actually how the canon Eponine perceives herself.", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [
                    "Éponine"
                ], 
                "role": "Clingy Jealous Girl: Éponine.", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [
                    "notable", 
                    "jealous"
                ], 
                "role": "Eponine of Les Misérables is notable for being about as clingy and jealous as you can get while still remaining The Woobie. While she desperately wants Marius to pay attention to her, she lacks the self-confidence and the boldness that would make her fit the trope. Obviously, trying to get him and herself killed on the barricade is taking clinginess to an extreme level, but she had lost all hope at that point.", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Daddy's Girl: Cosette to Valjean. As long as he allows her to.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "young", 
                    "close", 
                    "all-female", 
                    "write", 
                    "male"
                ], 
                "role": "Les Amis de l'ABC from Les Misérables: A group of 9 young revolutionaries, some of whom are very close, results in a pretty much all-female fandom. While there is a preference for Enjolras, fangirls often write slash involving any pairings of these. Hell, an almost entirely male cast of characters pretty much guarantees fangirls will find someone to Squee about!", 
                "id": "EstrogenBrigade"
            }, 
            {
                "adjectives": [
                    "Thénardier"
                ], 
                "role": "Girls with Moustaches: Mme Thénardier has one.", 
                "id": "GirlsWithMoustaches"
            }, 
            {
                "adjectives": [
                    "monstrous", 
                    "hilarious"
                ], 
                "role": "Madame Thenardier in Les Misérables has whiskers as part of her generally monstrous appearance. Javert gets in a pretty hilarious dig about it when she resists arrest and he tells her, \"You have the beard of a man, but I have the claws of a woman,\" dodging the paving slab she throws and nabbing her and her slimy husband.", 
                "id": "GirlsWithMoustaches"
            }, 
            {
                "adjectives": [
                    "only", 
                    "available", 
                    "world-famous", 
                    "musical", 
                    "musical", 
                    "upbeat", 
                    "musical", 
                    "detailed"
                ], 
                "role": "Fantine in Les Misérables turns to prostitution as the only available way to support her daughter and herself, in that order. Neither the book nor the world-famous musical takes her occupation lightly: the musical devotes an upbeat musical number to the dehumanizing life of a seaside hooker. The book is still more detailed about it, but then again, the book details everything.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "straight", 
                    "only", 
                    "available", 
                    "general", 
                    "sad", 
                    "sweet"
                ], 
                "role": "Hooker with a Heart of Gold: Played mostly straight with Fantine, who resorts to prostitution as her only available way to provide for herself and her daughter. Throughout, she still retains her love for Cosette, but her general attitude and comportment become a lot less outwardly sad and sweet than the trope usually entails.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "never-exactly-named", 
                    "fair"
                ], 
                "role": "Ill Girl: Fantine is reduced to a \"ghost of herself,\" suffering from a never-exactly-named disease, and acts as a motivator for Valjean to go and retrieve her daughter — only fair, seeing as how his policies reduced her to her aforesaid state. In Valjean's defense, he didn't know about it.", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [
                    "biological", 
                    "forcing", 
                    "unaware", 
                    "full", 
                    "last", 
                    "long-", 
                    "great", 
                    "own"
                ], 
                "role": "In Les Misérables, Cosette's biological father abandons her mother, Fantine, forcing Fantine into poverty and leading her to arrange for Cosette to live with an innkeeping family in the country, unaware that they force Cosette into Cinderella Circumstances. Their demands for money force Fantine into selling her hair and teeth and then finally entering into prostitution and dying from tuberculosis. Fortunately, Cosette's full Parental Abandonment doesn't last for long- she's rescued by The Hero, Jean Valjean, who raises her with great love as his own daughter and teaches her to revere her mother as a kind of angel, without traumatizing her with the sadder details of Fantine's downfall.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Eponine in Les Misérables for a while - she trades outfits (with a boy who is actually described as enjoying crossdressing for a lark) to disguise herself so she can sneak into the barricades. Marius doesn't even recognize her when she  takes a bullet that saves his life and ultimately ends hers, but that might just be him being a silly, tactless and clueless emo kid.", 
                "id": "SweetPollyOliver"
            }, 
            {
                "adjectives": [
                    "secretive"
                ], 
                "role": "Cosette from Les Misérables, spent her school days in a convent before moving into a very secluded house with her secretive father.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "original", 
                    "pitiful", 
                    "tragic"
                ], 
                "role": "Actually subverted in the original Les Misérables with Eponine - she's more pitiful than tragic, and far from selfless. She despairs when he falls in love with Cosette, so she figures she'll just have him die with her.", 
                "id": "UnrequitedTragicMaiden"
            }
        ]
    }, 
    "imdbid": "tt1707386", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "OverprotectiveDad", 
                "ChildSoldiers", 
                "DudeLooksLikeALady", 
                "DaddysGirl", 
                "DirtyOldMan", 
                "TheFightingNarcissist", 
                "DirtyCoward", 
                "TheIngenue", 
                "MissingMom"
            ], 
            "shared_count": 10, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "HookerWithAHeartOfGold", 
                "DirtyCoward", 
                "TheIngenue", 
                "BrokenBird", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "OliverTwist", 
            "name": "Oliver Twist"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DaddysGirl", 
                "PrettyBoy", 
                "SweetPollyOliver", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward", 
                "MissingMom", 
                "BrokenBird", 
                "DirtyOldMan", 
                "TheOldConvict"
            ], 
            "shared_count": 5, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "UnrequitedTragicMaiden", 
                "TheIngenue", 
                "PrettyBoy", 
                "BrokenBird", 
                "TheDandy"
            ], 
            "shared_count": 5, 
            "id": "ThePictureOfDorianGray", 
            "name": "The Picture of Dorian Gray", 
            "poster_url": "ThePictureOfDorianGray.jpg"
        }
    ], 
    "id": "LesMiserables", 
    "name": "Les Misérables"
}