{
    "plot": "Oskar, a bullied 12-year old, dreams of revenge. He falls in love with Eli, a peculiar girl. She can't stand the sun or food and to come into a room she needs to be invited. Eli gives Oskar the strength to hit back but when he realizes that Eli needs to drink other people's blood to live he's faced with a choice. How much can love forgive? Set in the Stockholm suburb of Blackeberg in 1982.", 
    "genres": "Drama, Horror, Romance", 
    "release_year": "2008", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "evil"
                ], 
                "role": "Blondes are Evil: Abby isn't evil but...", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "fresh", 
                    "genetic"
                ], 
                "role": "Crazy Cat Lady: Gösta. In the book, he has more than two dozen cats locked in his apartment. Since none of them have been neutered and no fresh genetic material has entered the roost in quite a while... well, you won't have to use your imagination, because the book enjoys elaborating on the consequences.", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [
                    "likely"
                ], 
                "role": "Gösta in Let the Right One In, the book and the movie. In his case the cat hoarding most likely ended up  saving his life.", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [
                    "adorable", 
                    "old", 
                    "first", 
                    "next", 
                    "romantic", 
                    "next", 
                    "new"
                ], 
                "role": "In Let the Right One In, Eli fits this trope. She's a vampire, who has the appearance of an adorable 12-13 year old girl. Oskar, when he finds out what she is Is horrified at first, not only over what she is but what she might want from him. However, by the next night he actively invites her into his apartment and is planning on a romantic evening with her...Before his mother unexpectedly comes home, that is. When Eli leaves after being forced to kill the town drunk who finds her daytime resting place, Oskar is inconsolable. That makes it all the sweeter when Eli returns the next night, saves Oskar from the bullies and they proceed to leave town to both start a new life together.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "gender-flipped"
                ], 
                "role": "Oscar and Eli in Let the Right One In count as a gender-flipped example, as Oscar is a boy and Eli is a  castrated boy posing as a girl.", 
                "id": "LesbianVampire"
            }, 
            {
                "adjectives": [], 
                "role": "Little Miss Badass: Eli's vampire powers let her easily take down men twice her size.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Let the Right One In - vampire.", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [], 
                "role": "Eli from Let The Right One In. Then again, she might not count...", 
                "id": "StrangeGirl"
            }
        ]
    }, 
    "imdbid": "tt1139797", 
    "poster_url": "LetTheRightOneIn.jpg", 
    "similar": [
        {
            "shared": [
                "CuteMonsterGirl", 
                "CrazyCatLady", 
                "MagicalGirlfriend"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "CuteMonsterGirl", 
                "CrazyCatLady"
            ], 
            "shared_count": 2, 
            "id": "Gremlins", 
            "name": "Gremlins", 
            "poster_url": "Gremlins.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "LittleSweetheart", 
            "name": "Little Sweetheart", 
            "poster_url": "LittleSweetheart.jpg"
        }, 
        {
            "shared": [
                "StrangeGirl", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "CuteMonsterGirl", 
                "LesbianVampire"
            ], 
            "shared_count": 2, 
            "id": "VanHelsing", 
            "name": "Van Helsing"
        }
    ], 
    "id": "LetTheRightOneIn", 
    "name": "Let the Right One In"
}