{
    "plot": "The space shuttle Churchill is assigned to observe the Halley's Comet under the command of Col. Tom Carlsen. They see a strange form attached to the comet and Carlsen goes with a team to investigate. They find three humanoid life forms in caskets and they bring them to the Churchill. However, Earth loses contact with the shuttle and the Space Research Center sends another spacecraft to search the Churchill. They find the crew dead and the shuttle burnt and one rescue pod missing. They bring the humanoids to Earth and soon Dr. Hans Fallada and his team discover that the Space Girl is a sort of vampire and drains the life force from people transforming them into zombies. When the authorities find that Col. Tom Carlsen has survived, they summon him to explain what happened in the Churchill. Carlsen tells an incredible story about the three aliens and he teams up with Col. Colin Caine trying to save mankind from the evil vampires from the space.", 
    "genres": "Horror, Sci-Fi, Thriller", 
    "release_year": "1985", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "In Lifeforce, Mathilda May plays a vampire from outer space who walks out of a research facility and into the streets of London completely naked, and completely oblivious. Was apparently the inspiration for Species, also about an alien femme fatale who takes on the appearance of a hawt human babe.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Innocent Fanservice Girl: \"Space Girl\" walking around the streets of London stark naked as she has no concept of modesty.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "gorgeous", 
                    "French", 
                    "next-to-nothing"
                ], 
                "role": "Ms. Fanservice: Spectacularly gorgeous French actress Mathilda May, playing \"Space Girl\" (really), starts the movie wearing absolutely nothing, and then graduates to wearing next-to-nothing.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0089489", 
    "poster_url": "Lifeforce.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "InnocentFanserviceGirl"
            ], 
            "shared_count": 2, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "InnocentFanserviceGirl"
            ], 
            "shared_count": 2, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "InnocentFanserviceGirl"
            ], 
            "shared_count": 2, 
            "id": "ForbiddenZone", 
            "name": "Forbidden Zone", 
            "poster_url": "ForbiddenZone.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "Lifeforce", 
    "name": "Lifeforce"
}