{
    "plot": "In a place far, far away, illegal genetic experiment #626 is detected: Ruthless scientist Dr. Jumba Jookiba has created a strong, intelligent, nearly indestructible and aggressive being with only one known weakness: The high density of his body makes it impossible for the experiment to swim in water. The scientist is sentenced to jail by the Grand Council of the Galactic Federation. The experiment is supposed to be transported to a prison asteroid, yet manages to escape Captain Gantu, who was supposed to deliver him there. With a stolen police cruiser (the red one), the destructive being races towards a little and already doomed planet: Earth. Stranded on Hawaii, experiment #626 can't actually do much harm: water all around, no big cities and two well-equipped representatives of the Galactic Federation already following close behind to catch him again. But Dr. Jookiba and the Earth expert Pleakley never could have guessed that earth girl Lilo adopts the experiment as dog, gives him the name Stitch and actually causes an emotional development in the little beast. Her dysfunctional family, consisting only of Lilo and her sister Nani, is about to be ripped apart by social worker Cobra Bubbles. Stitch as the new family member brings quite some action into all their lifes, and after a while, not even Pleakley and Dr. Jookiba can recognize their former target. But how shall they bring the news of failure to the Grand Councilwoman without being punished?", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "past", 
                    "hair"
                ], 
                "role": "Bald Black Leader Guy: The government agent Cobra Bubbles in Lilo & Stitch. Lampshaded near the end of the movie, when one of the aliens reminisces about a past meeting and comments, \"You had hair then.\"", 
                "id": "BaldBlackLeaderGuy"
            }, 
            {
                "adjectives": [
                    "past", 
                    "hair"
                ], 
                "role": "The government agent Cobra Bubbles in Lilo & Stitch. Lampshaded near the end of the movie, when one of the aliens reminisces about a past meeting and comments, \"You had hair then.\"", 
                "id": "BaldBlackLeaderGuy"
            }, 
            {
                "adjectives": [
                    "purplish", 
                    "four-eyed"
                ], 
                "role": "In Lilo & Stitch, Jumba fits this trope, despite being a purplish, four-eyed alien. Being a Mad Scientist, he's the Genius Bruiser variant.", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [
                    "social", 
                    "separate", 
                    "scary", 
                    "nice", 
                    "reasonable", 
                    "same", 
                    "scary"
                ], 
                "role": "Lilo & Stitch:\n Cobra Bubbles (Ving Rhames). Not only is he a social worker who threatens to separate Lilo from Nani, he's also a hardcore government agent who studies alien activity in the United States. Subverted, as he certainly looks scary and imposing but is actually a pretty nice and reasonable guy.\n Gantu from the same film is a scary black alien.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "other", 
                    "later", 
                    "safe"
                ], 
                "role": "Scary Black Man: Cobra Bubbles, who is voiced by none other than Ving Rhames. Played with. At first, he looks very imposing and acts rather uncaring. However later on, he shows himself to be a lot more than that. He does indeed want Lilo to be safe, but he doesn't want to split Lilo and Nani up because they're all they have in the world, mentioning he'll take Lilo away only because he has to. The end credits show him hanging out with them, watching movies and having Thanksgiving dinner.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "In the first Lilo & Stitch movie, Nani's love interest David doesn't put on a shirt until the epilogue, and even then only because it was snowing.", 
                "id": "WalkingShirtlessScene"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Walking Shirtless Scene: David, who only gets a shirt in a few of the photos at the end of the movie.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "The Grand Councilwoman of the Intergalactic Federation in Lilo & Stitch.", 
                "id": "IronLady"
            }, 
            {
                "adjectives": [
                    "home-made", 
                    "other", 
                    "main", 
                    "Hawaiian"
                ], 
                "role": "Lonely Doll Girl: Lilo has one home-made doll, whose appearance freaks out the other girls. Later she is seen making Voodoo dolls of her friends and dipping them in pickle juice. (\"My friends need to be punished.\") The main doll may or may not be intended to be a \"menehune\" (basically Hawaiian dwarves).", 
                "id": "LonelyDollGirl"
            }, 
            {
                "adjectives": [
                    "shy"
                ], 
                "role": "Subverted with Myrtle Edmonds from Lilo & Stitch; she wears glasses and looks as though she'd have a shy, nerdy personality, but she's really the Alpha Bitch. Played much straighter with her mom in the TV series, though.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "female", 
                    "eponymous", 
                    "drive"
                ], 
                "role": "The female eponymous character from Lilo & Stitch lives with her older sister. Apparently their parents died recently, as she remembers things they used to say. Given her explanation (\"It was raining, and they went for a drive\"), we can assume they died in a car accident.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Nani spends almost all of the movie either in cutoffs or a bikini. Which is also justified given that she lives in Hawaii. Also, the lifeguard (who is essentially Nani with a darker tan in a red one-piece).", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0275847", 
    "poster_url": "LiloAndStitch.jpg", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "IronLady", 
                "Meganekko", 
                "BaldBlackLeaderGuy", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "BaldBlackLeaderGuy", 
                "MsFanservice", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "TheScorpionKing", 
            "name": "The Scorpion King", 
            "poster_url": "TheScorpionKing.jpg"
        }, 
        {
            "shared": [
                "HuskyRusskie", 
                "MsFanservice", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "TheBoondockSaints", 
            "name": "The Boondock Saints", 
            "poster_url": "TheBoondockSaints.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "MsFanservice", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "MsFanservice", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "ClashOfTheTitans", 
            "name": "Clash of the Titans", 
            "poster_url": "ClashOfTheTitans.jpg"
        }
    ], 
    "id": "LiloAndStitch", 
    "name": "Lilo & Stitch"
}