{
    "plot": "In Urbania, Ohio, snobby ex-football star Kevin O'Shea conducts try-outs for the town's Peewee football team, the Urbania Cowboys, which will compete for a chance at the state Peewee football playoffs. Kevin slights his younger brother Danny O'Shea by rejecting Danny's daughter Becky \"Icebox\" O'Shea, who is a good player. Kevin rejected her simply because she's a girl. Becky and some of her friends, boys who were also rejected, get the idea to start up their own team, to be coached by Danny. After Kevin tries to put a stop to that plan, Danny gets Kevin to agree to a game to decide which team will represent Urbania, because each town is allowed only one team. Danny and Becky scour the town in search of willing players, and they gather a crew of kids who have limited skills and no team spirit. They luck out when Becky discovers Junior Floyd expertly passing rolls of toilet paper right into a shopping cart at the supermarket, as though he's passing a football. With Becky and Junior on board, the new team, the Giants, has a chance to make a good showing, and they begin their training. But low morale continually threatens to break up the team. A chance visit by former NFL football coach John Madden and four NFL football stars -- Steve Entman, Bruce Smith, Emmitt Smith, and Tim Brown -- leaves the team with several tips on how to create an advantage. Becky develops a crush on Junior Floyd, and she's jealous when her cheerleader cousin Debbie flirts with Junior. Becky decides to compete for Junior on equal terms, so she puts on make-up and a cheerleader outfit, joining the cheerleaders and abandoning the team. But the Cowboys will be coming into the game with a vicious new player named Spike Hammersmith. Will Becky be there for the team if they need her?", 
    "genres": "Comedy, Family, Sport", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Amazon Chaser: Junior likes Becky because she's a football player.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [], 
                "role": "Chick Magnet: Devon Sawa's character Junior Floyd attracts every girl in this film. Becky becomes a cheerleader, thinking he'll notice her more.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: All of the players on the Cowboys team are smug about their greater ability compared to the Giants.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Missing Mom: Danny O'Shea's wife left him and Becky.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Becky \"The Icebox\" O'Shea in Little Giants. She makes boys cry.", 
                "id": "OneOfTheBoys"
            }, 
            {
                "adjectives": [
                    "only", 
                    "later", 
                    "unattractive"
                ], 
                "role": "One of the Boys - Becky \"The Icebox\" O'Shea is the only girl at the tryouts. She later laments this status when she thinks it makes her unattractive.", 
                "id": "OneOfTheBoys"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: Becky O'Shea is rejected from the official team at the start and some boys pick on her but she sticks at the sport.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "typical", 
                    "such", 
                    "other"
                ], 
                "role": "Spike's dad in Little Giants is your typical \"sports dad\" variation; in his words, his son was \"bred for football glory.\" As such, Spike is a merciless Jerk Jock, stronger and faster than any other kid his age. Spike's dad is in tears when his son's team loses at the end.", 
                "id": "StageMom"
            }, 
            {
                "adjectives": [
                    "rough", 
                    "tough", 
                    "other"
                ], 
                "role": "Tomboy: Becky \"Ice Box\" O'Shea is considered one because she's a football player and rough and tough enough to take any of the other players in a fist fight.", 
                "id": "Tomboy"
            }
        ]
    }, 
    "imdbid": "tt0110364", 
    "poster_url": "LittleGiants.jpg", 
    "similar": [
        {
            "shared": [
                "Tomboy", 
                "AmazonChaser", 
                "JerkJock", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "HowToTrainYourDragon", 
            "name": "How to Train Your Dragon", 
            "poster_url": "HowToTrainYourDragon.jpg"
        }, 
        {
            "shared": [
                "Tomboy", 
                "PluckyGirl", 
                "JerkJock", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "TheTwilightSamurai", 
            "name": "The Twilight Samurai", 
            "poster_url": "TheTwilightSamurai.jpg"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "AmazonChaser", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "ChickMagnet", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "Tomboy", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "KickAss", 
            "name": "Kick-Ass", 
            "poster_url": "KickAss.jpg"
        }
    ], 
    "id": "LittleGiants", 
    "name": "Little Giants"
}