{
    "plot": "Having embezzled a small fortune and attempting to lay low, Robert Burger and his mistress Dorothea choose a remote rental property which in unobtrusive. But they soon make the grave mistake of befriending two nine year old girls, Thelma and Elizabeth who live close by. Behind her seemingly cute and innocent façade, Thelma is a scheming, precocious brat who intrudes upon the couples life and photographs the pair and ultimately discovers their dark little secret. With Elizabeth's help they proceed to blackmail the bemused, unsuspecting twosome. But events eventually begin to unravel leading the pseudo-angelic brat to resort to twisted and evil crimes, meaning the lives of those associated with her gradually descend in to hell.", 
    "genres": "Thriller", 
    "release_year": "1989", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Blondes are Evil: Thelma.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "neglectful", 
                    "psychotic", 
                    "amoral", 
                    "old", 
                    "previous", 
                    "other"
                ], 
                "role": "In Little Sweetheart, there are five blondes. One's an idiot, one's neglectful, one's a bank robber cheating on his wife, one's his mistress and one is the psychotic, amoral nine year old girl who is blackmailing the previous two and is related to the other two.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "horrible"
                ], 
                "role": "Little Miss Badass: Thelma, of course. Her aim is horrible, but she still manages to shoot Elizabeth twice.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [
                    "first", 
                    "empathy", 
                    "early-on"
                ], 
                "role": "Little Sweetheart gives us Thelma. Sure, she can't aim very well, but she will chase you and she will kill you if she's trying to. To make up for this, she has the stealth skills of a ninja (after the first stealth attempt, which failed), the empathy of Alex Mercer at the start of Prototype, the photography skills of Frank West and the manipulation skills of an early-on Light Yagami.", 
                "id": "LittleMissBadass"
            }
        ]
    }, 
    "imdbid": "tt0095881", 
    "poster_url": "LittleSweetheart.jpg", 
    "similar": [
        {
            "shared": [
                "LittleMissBadass", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "LetTheRightOneIn", 
            "name": "Let the Right One In", 
            "poster_url": "LetTheRightOneIn.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "KillBill", 
            "name": "Kill Bill", 
            "poster_url": "KillBill.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "BlondesAreEvil"
            ], 
            "shared_count": 1, 
            "id": "DevilsPrey", 
            "name": "Devil's Prey", 
            "poster_url": "DevilsPrey.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "PokemonMewtwoReturns", 
            "name": "Pokémon: Mewtwo Returns"
        }
    ], 
    "id": "LittleSweetheart", 
    "name": "Little Sweetheart"
}