{
    "plot": "With their father away fighting in the Civil War, Jo, Meg, Beth and Amy grow up with their mother in somewhat reduced circumstances. They are a close family who inevitably have their squabbles and tragedies. But the bond holds even when, later, men friends start to become a part of the household.", 
    "genres": "Drama, Romance", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Overprotective", 
                    "overprotective", 
                    "good", 
                    "later"
                ], 
                "role": "Overprotective Mom: In Jo's Boys, Meg is the overprotective mother who doesn't believe Nat is good enough for her daughter Daisy. She relents later, though.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [], 
                "role": "The One Guy: Laurie", 
                "id": "TheOneGuy"
            }, 
            {
                "adjectives": [
                    "next-door"
                ], 
                "role": "Theodore \"Laurie\" Lawrence of Little Women: next-door neighbor, in love with Jo, got over it (despite the screams of the fandom), fell in love with and married her sister Amy.", 
                "id": "TheOneGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "artistic"
                ], 
                "role": "Alpha Bitch: Amy's classmate, April Snow, and, to a lesser degree, her artistic rival, May Chester.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Meg is this to all her younger sisters in Little Women, especially Jo and Amy, and Jo is also this to Beth.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "old", 
                    "young", 
                    "little", 
                    "pleasant"
                ], 
                "role": "Cool Old Lady: Marmee Averted with Aunt March, to the point that it's Lampshaded: \"Some old people keep young at heart in spite of wrinkles and grey hair, can sympathize with children's little cares and joys, make them feel at home, and can hide wise lessons under pleasant plays, giving and receiving friendship in the sweetest way. But Aunt March had not this gift.\"", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "titular", 
                    "old", 
                    "mental", 
                    "physical"
                ], 
                "role": "Education Mama: In Little Men, one of the titular Little Men (Billy) has an already old education papa who drove his promising student son to mental handicapping and physical frailty and then dropped him off at boarding school in shame.", 
                "id": "EducationMama"
            }, 
            {
                "adjectives": [
                    "mental", 
                    "physical"
                ], 
                "role": "Little Men: One of the Men men from the title, Billy, had an Education Papa who drove his promising student son to mental handicapping and physical frailty. He then dropped him off at boarding school in shame.", 
                "id": "EducationMama"
            }, 
            {
                "adjectives": [
                    "fond", 
                    "'feminine", 
                    "several", 
                    "other", 
                    "short", 
                    "honourable", 
                    "happy", 
                    "comfortable"
                ], 
                "role": "Louisa May Alcott was very fond of this trope. The scenes in Little Women putting Jo March through the 'feminine redemption for the tomboy' version were repeated in several other of Alcott's novels and short stories, as her heroines contemplate taking up a profession and are firmly told that the most honourable profession for any woman is to make a happy, comfortable home for her family. Which doesn't mean they always follow it, anyway.", 
                "id": "FeminineWomenCanCook"
            }, 
            {
                "adjectives": [
                    "original", 
                    "shy", 
                    "gentle", 
                    "musical", 
                    "later", 
                    "artistic"
                ], 
                "role": "Four Girl Ensemble: The original!: Meg, the oldest, is the lecturer and mature example-setter who wants a husband and family; Jo is the tomboy who wants a career, fame, and fortune; Beth is the shy, gentle and musical one who wants to stay with her family; Amy is the vain and spoiled but later artistic and flirty young lady who wants to marry someone with money.", 
                "id": "FourGirlEnsemble"
            }, 
            {
                "adjectives": [
                    "shy", 
                    "gentle", 
                    "musical", 
                    "later", 
                    "artistic"
                ], 
                "role": "Little Women is the Trope Codifier: Meg, the oldest, is the lecturer and mature example-setter who wants a husband and family; Jo is the tomboy who wants a career, fame, and fortune; Beth is the shy, gentle and musical one who wants to stay with her family; Amy is the vain and spoiled but later artistic and flirty young lady who wants to marry someone with money.", 
                "id": "FourGirlEnsemble"
            }, 
            {
                "adjectives": [
                    "old", 
                    "drive", 
                    "hidden"
                ], 
                "role": "Gossipy Hens: The old ladies that wonder if Meg and Jo are Gold Diggers in training under Marmee's direction, and unknowingly drive Meg to an Heroic BSOD when she hears them. They also appear in the 40's movie adaptations, and are overheard by the hidden Beth and Amy instead.", 
                "id": "GossipyHens"
            }, 
            {
                "adjectives": [
                    "delicate", 
                    "scarlet", 
                    "untreatable", 
                    "young"
                ], 
                "role": "Ill Girl: Beth has always been delicate, but after she contracts scarlet fever, her health continuously decays. (Truth in Television, as the scarlet fever's side-effects on the heart were untreatable back then and always doomed the ill person to die young.)", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [
                    "bad", 
                    "such"
                ], 
                "role": "Josephine \"Jo\" March, as well as her older sister Meg, their younger sister Amy once she gets over her Spoiled Brat phase, and her pupil Annie aka Nan. (Too bad the fandom refuses to see Amy as such and pegs her as a Mary Sue out of Die for Our Ship butthurt.)\n And also Rose Campbell from the Eight Cousins books.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: All the sisters, but particularly Jo.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "little", 
                    "second", 
                    "Hot-Blooded", 
                    "strong"
                ], 
                "role": "Little Women:\n Margaret aka Meg, Beth's eldest sister who plays Team Mom and Proper Lady to her three little sisters (Beth, Spirited Young Lady Jo, and Spoiled Brat Amy) and her friends (the Spoiled Sweet, but borderline Brainless Beauties Annie and Belle).\n Elizabeth \"Beth\" March evolves from a Fragile Flower into Proper Lady in the second part of  before dying. May have taken it after her mother, Margaret aka Marmee.\n The girls' mother is a Proper Lady after having been more Hot-Blooded in her youth. Her wisdom and strong will are emphasized more than humility and kindness.", 
                "id": "ProperLady"
            }, 
            {
                "adjectives": [
                    "Proper", 
                    "first"
                ], 
                "role": "Proper Lady: Meg, and Amy in all the books after the first one.", 
                "id": "ProperLady"
            }, 
            {
                "adjectives": [
                    "intellectual", 
                    "domestic", 
                    "little"
                ], 
                "role": "Among the March sisters in Little Women, Jo is one who best fits this trope, given her outspoken, tomboy nature and her intellectual gifts. Though she starts off as more of a Tomboy, she gradually conforms a bit more to society's standards as she ages: witness her very domestic mending of Professor Bhaer's clothes as an adult.(Meg plays the Proper Lady in contrast and younger Beth is another little \"angel of the house\".)", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [], 
                "role": "Spirited Young Lady: Jo.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [], 
                "role": "Margaret \"Meg\" March, the oldest sister in Little Women. In Little Men, her middle sister Jo becomes the Team Mom of the Plumfield children.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Team Mom: Meg to her sisters; later, Jo in Little Men", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [], 
                "role": "Little Women: Jo and Amy have The Glorious War Of Sisterly Rivalry covered. Jo also is like this with Shrinking Violet Beth. Meg was in the middle, predictably.", 
                "id": "TomBoyAndGirlyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Jo and Amy Little Men: Nan and Daisy Jo's Boys: Josie and Bess", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt0110367", 
    "poster_url": "LittleWomen.jpg", 
    "similar": [
        {
            "shared": [
                "CoolBigSis", 
                "SpiritedYoungLady", 
                "OverprotectiveDad", 
                "PluckyGirl"
            ], 
            "shared_count": 4, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "TeamMom", 
                "ProperLady", 
                "PluckyGirl"
            ], 
            "shared_count": 4, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "OverprotectiveDad", 
                "ProperLady", 
                "CoolOldLady"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TeamMom", 
                "OverprotectiveDad", 
                "TomBoyAndGirlyGirl", 
                "CoolOldLady"
            ], 
            "shared_count": 4, 
            "id": "TheSoundOfMusic", 
            "name": "The Sound of Music", 
            "poster_url": "TheSoundOfMusic.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "FourGirlEnsemble", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 3, 
            "id": "NowAndThen", 
            "name": "Now And Then", 
            "poster_url": "NowAndThen.jpg"
        }
    ], 
    "id": "LittleWomen", 
    "name": "Little Women"
}