{
    "plot": "In 2079, in Washington, the ex-CIA Operative Snow is brutally interrogated, accused of treason against the United States. The chief of the secret service Scott Langral believes that he shot the agent Frank in a hotel room. Meanwhile, the idealistic daughter of the president of the USA, Emilie Warnock, is visiting MS One, a maximum security prison in outer space expecting to find evidences that the prisoners are actually guinea pigs of a huge corporation. When one of her bodyguards loses a hidden pistol to the dangerous prisoner Hydell, he subdues the staff in the central control room and releases the prisoners, including his brother Alex who becomes the leader of the riot. Now the veteran agent Harry Shaw offers freedom to Snow if he succeeds in rescuing the president's daughter. But the idealistic Emilie does not want to leave MS-One without the hostages.", 
    "genres": "Action, Sci-Fi, Thriller", 
    "release_year": "2012", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "only", 
                    "past", 
                    "other", 
                    "boy", 
                    "forcing"
                ], 
                "role": "In Lockout, Emilie ends up the only woman in the middle of a space prison riot so Snow must disguise her as a prisoner in the hopes that they can sneak past the others. He does this by rubbing coffee, motor oil and dirty toilet water in her hair. The other prisoners still take a interest in her for being a \"pretty boy\" inmate, forcing Snow and Emilie to fight their way through anyway.", 
                "id": "SweetPollyOliver"
            }, 
            {
                "adjectives": [
                    "only", 
                    "past", 
                    "other", 
                    "boy", 
                    "forcing"
                ], 
                "role": "Sweet Polly Oliver: Emilie ends up the only woman in the middle of a space prison riot so Snow must disguise her as a prisoner in the hopes that they can sneak past the others. He does this by rubbing coffee, motor oil and dirty toilet water in her hair. The other prisoners still take a interest in her for being a \"pretty boy\" inmate, forcing Snow and Emilie to fight their way through anyway.", 
                "id": "SweetPollyOliver"
            }
        ]
    }, 
    "imdbid": "tt1592525", 
    "poster_url": "Lockout.jpg", 
    "similar": [
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "HouseOfFlyingDaggers", 
            "name": "House of Flying Daggers", 
            "poster_url": "HouseOfFlyingDaggers.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "RobinHoodPrinceOfThieves", 
            "name": "Robin Hood: Prince of Thieves", 
            "poster_url": "RobinHoodPrinceOfThieves.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "Salt", 
            "name": "Salt", 
            "poster_url": "Salt.jpg"
        }
    ], 
    "id": "Lockout", 
    "name": "Lockout"
}