{
    "plot": "Bugs Bunny and Daffy Duck are up to their feuding ways again. Tired of playing second fiddle to Bugs, Daffy has decided to leave the Studio for good. He is aided by Warner Bros.' humor impaired Vice President of Comedy, Kate Houghton, who releases him from his contract and instructs WB security guard/aspiring stunt man DJ Drake to capture and \"escort\" Daffy off the studio lot. Suddenly a sidekick without a hero, the duck decides to ally himself with DJ, whether he likes it or not. Consequently, Daffy is on the scene when DJ discovers that his famous movie star father was Damian Drake, known for playing suave international spies onscreen, is actually a suave international spy in real life--and has been kidnapped by the evil insane nerdy, prancing villain known as Mr. Chairman of the equally nefarious Acme Corporation. It seems that Damian knows the whereabouts of the mysterious magical and powerful Blue Monkey Diamond, and the Chairman will do anything to get his hands on it! With Daffy in tow, DJ hits the road in a desperate attempt to outrace the evil Acme stooges to the diamond and save the world from their evil clutches. Unbeknownst to the two neo-spies, they are also being followed by VP Kate and Bugs--the studio brass has decided that the rabbit needs a comic foil after all, and Kate's job is on the line if she can't get Daffy back to work ASAP.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Basement-Dweller", 
                    "entire", 
                    "own", 
                    "later"
                ], 
                "role": "Basement-Dweller: According to Warner Bros. executives, Daffy's entire fanbase is made up of these. Never mind that he was the one who got his own series later, not Bugs.", 
                "id": "BasementDweller"
            }
        ]
    }, 
    "imdbid": "tt0318155", 
    "poster_url": "LooneyTunesBackInAction.jpg", 
    "similar": [
        {
            "shared": [
                "BasementDweller"
            ], 
            "shared_count": 1, 
            "id": "TheDarkKnight", 
            "name": "The Dark Knight", 
            "poster_url": "TheDarkKnight.jpg"
        }, 
        {
            "shared": [
                "BasementDweller"
            ], 
            "shared_count": 1, 
            "id": "TheScore", 
            "name": "The Score", 
            "poster_url": "TheScore.jpg"
        }, 
        {
            "shared": [
                "BasementDweller"
            ], 
            "shared_count": 1, 
            "id": "WaynesWorld", 
            "name": "Wayne's World", 
            "poster_url": "WaynesWorld.jpg"
        }, 
        {
            "shared": [
                "BasementDweller"
            ], 
            "shared_count": 1, 
            "id": "BadlyDrawnRoy", 
            "name": "Badly Drawn Roy"
        }, 
        {
            "shared": [
                "BasementDweller"
            ], 
            "shared_count": 1, 
            "id": "Mallrats", 
            "name": "Mallrats", 
            "poster_url": "Mallrats.jpg"
        }
    ], 
    "id": "LooneyTunesBackInAction", 
    "name": "Looney Tunes: Back in Action"
}