{
    "plot": "In the year 2058, the Earth will soon be uninhabitable after the irreversible effects of pollution and global warming! Professor John Robinson, lead scientist of the Jupiter 2 Mission, will lead his family to the habitable planet Alpha Prime to prep it for colonization. The Jupiter 2 is equipped with a hyperdrive that allows faster-than-light travel, which will eventually be employed to evacuate the citizens of Earth. However hypergates must be constructed on Earth and Alpha Prime to provide stable points of departure and arrival. Dr. Zachary Smith is bribed by a terrorist organization to sabotage the mission, and ends up an unwilling stowaway as the ship blasts off.", 
    "genres": "Action, Adventure, Family", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "serious"
                ], 
                "role": "Beard of Evil: The Keeper has a pretty serious one.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "own", 
                    "straight"
                ], 
                "role": "Jonathan Harris. Dr. Smith his own badself. Married 64 years (until his death). One son. Two grandchildren. Go figure.\n When he died, one gay publication published an obit lauding the \"closeted straight\"", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [], 
                "role": "Dr. Smith from Lost in Space.", 
                "id": "SissyVillain"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "perpetual", 
                    "wangsty", 
                    "pre-launch"
                ], 
                "role": "Judy Robinson - Distressed Damsel and perpetual love interest to Major West. She could get annoyingly wangsty in episodes centering on her. In the series played by Marta Kristen, in the film by Heather Graham. The would-be revival cast Adrianne Palicki in the role. In the film, Marta was one of the reporters at the pre-launch press briefing.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "huge"
                ], 
                "role": "Subverted on Lostin Space: an alien has kidnapped Judy. She cries a river over this. In an attempt to quiet her tears, he fabricates a huge diamond for her. Judy looks it over for maybe two seconds before throwing it away and resuming crying.", 
                "id": "DistractedByTheLuxury"
            }, 
            {
                "adjectives": [
                    "literal", 
                    "green", 
                    "skinned", 
                    "crush"
                ], 
                "role": "A literal green skinned space babe was in Lost in Space. She had a crush on Dr. Smith, who had to use her to find out where to get fuel for their stranded ship.\n And ironically, her name is Athena.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "Green-Skinned"
                ], 
                "role": "Green-Skinned Space Babe: The character originally named Lorelei in \"Wild Adventure,\" then renamed Athena in \"The Girl from the Green Dimension.\"", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "Green-Skinned"
                ], 
                "role": "Pretty much all the women in Lost in Space as sort of an Enforced Trope of Stay in the Kitchen; notably Judy, Penny and Green-Skinned Space Babe Athena.", 
                "id": "NeutralFemale"
            }
        ]
    }, 
    "imdbid": "tt0120738", 
    "poster_url": "LostInSpace.jpg", 
    "similar": [
        {
            "shared": [
                "NeutralFemale", 
                "CampStraight", 
                "DamselInDistress", 
                "SissyVillain"
            ], 
            "shared_count": 4, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "DamselInDistress", 
                "SissyVillain"
            ], 
            "shared_count": 3, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "DamselInDistress", 
                "BeardOfEvil"
            ], 
            "shared_count": 3, 
            "id": "ThePrincessBride", 
            "name": "The Princess Bride", 
            "poster_url": "ThePrincessBride.png"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "GreenSkinnedSpaceBabe", 
                "BeardOfEvil"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "DamselInDistress"
            ], 
            "shared_count": 2, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }
    ], 
    "id": "LostInSpace", 
    "name": "Lost in Space"
}