{
    "plot": "Against the backdrop of aged has-been rock star Billy Mack's Christmas themed comeback cover of \"Love Is All Around\" which he knows is crap and makes no bones about it much to his manager Joe's chagrin as he promotes the record, several interrelated stories about romantic love and the obstacles to happiness through love for Londoners are presented in the five weeks preceding Christmas. Daniel's wife has just passed away, leaving him to take care of his adolescent stepson Sam by himself. Daniel is uncertain how to deal with Sam and his problems without his wife present, especially in light of a potential budding romance within their household. Juliet and Peter have just gotten married. They believe that Peter's best friend and best man Mark hates Juliet but won't say so to his or her face. Others looking at the situation from the outside believe Mark is jealous of Juliet as he is in love with Peter himself. Jamie, a writer, is taking a writing retreat by himself in rural France following catching his latest girlfriend in an indiscretion. Jamie ends up spending much time in France with Aurélia, the Portuguese woman hired as the housekeeper. The question becomes not only if they can communicate their day-to-day needs with each other as she speaks no English, he speaks no Portuguese, and neither speaks French well, but communicate what seems to be their increasing mutual attraction to each other. Sarah has been in love with her co-worker Karl for the two years they have worked together, this attraction which everyone in their workplace knows about. Sarah has to decide if she can be forward enough to express this love directly to Karl, especially in light of what has been her personal priority of dealing with a family issue. Harry and Karen have been in a stable long term marriage. His new assistant Mia drops hints to him that she would like them to be romantically involved. Harry has to decide whether to fall to the temptation, especially considering being married to a perceptive wife. Single and relatively young David is the newly elected Prime Minister. At 10 Downing Street, he is attracted to one of the new household servants, slightly overweight Natalie, but isn't sure what to do about it seeing as to their respective positions, the probable public scrutiny, and an incident involving the visiting U.S. President. Socially unaware Colin believes that the lack of romantic love in his life is all the fault of standoffish British women. As such, he decides to take decisive albeit somewhat unusual geographic action. And John and Judy are movie body doubles. They can communicate with each other straightforwardly while they are simulating sex filming a movie, but they may not be able to translate the feelings behind that simulation in real life to each other.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Casanova Wannabe: Colin, at least in his home country; he thinks that going overseas to America will improve his luck with the ladies.  It works.", 
                "id": "CasanovaWannabe"
            }, 
            {
                "adjectives": [
                    "find", 
                    "biological"
                ], 
                "role": "Disappeared Dad: We never do find out what happened to Sam's biological father, aside from the fact that he's not seen.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "biological"
                ], 
                "role": "In Love Actually, Sam's mom dies of cancer just before the start of the film; he's now living with his stepfather, Liam Neeson, who laments that \"this stepfather thing suddenly matters much more than it did before\". No mention of where his biological father fits into the picture.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "native", 
                    "pre-travel", 
                    "American", 
                    "British", 
                    "good"
                ], 
                "role": "Colin Frissell (Kris Marshall) in Love Actually becomes one when he travels from his native Britain to the United States. Lampshaded by way of his pre-travel hypothesis that American women can't resist a man with a British accent, even if he lacks good looks.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "attractive", 
                    "complete", 
                    "blue"
                ], 
                "role": "Subverted in the Colin Firth plot in Love Actually; when Firth travels to Portugal to ask the woman he loves to marry him, he encounters her father... who, thinking that he's wanting to marry her (less attractive) sister, has no problem — and when she indignantly asks him whether he'd sell his daughter to a perfect stranger, blithely replies \"Selling? I'll pay him.\" Even when the misunderstanding is clarified, he still isn't particularly bothered that a complete stranger (to him) wants to propose to his daughter completely out of the blue.", 
                "id": "OverprotectiveDad"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Blonde Tory Sex Kitten: You know what I mean: Margaret Thatcher - that saucy minx!", 
                "id": "BlondeRepublicanSexKitten"
            }, 
            {
                "adjectives": [
                    "married"
                ], 
                "role": "Femme Fatale: Mia. She's pretty and alluring but she is deliberately flirting and making moves on her married boss. During the company's Christmas party, she dances with Harry in front of his wife. She's even wearing a devil costume!", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "Madonna-Whore"
                ], 
                "role": "Madonna-Whore Complex: Harry's wife Karen is contrasted with the seductress Mia who is appropriately dressed as a devil at the party and gets a red lingerie scene.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [], 
                "role": "Madonna Whore Complex: Harry's wife Karen is contrasted with the seductress Mia who is appropriately dressed as a devil at the party and gets a red lingerie scene.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [], 
                "role": "Missing Mom: Sam's dies before the start of the movie. We see her Meaningful Funeral.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Sweater Girl: Juliet in one scene.", 
                "id": "SweaterGirl"
            }
        ]
    }, 
    "imdbid": "tt0314331", 
    "poster_url": "LoveActually.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan", 
                "OverprotectiveDad", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad", 
                "FemmeFatale", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "LoveInTheAfternoon", 
            "name": "Love in the Afternoon", 
            "poster_url": "LoveInTheAfternoon.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "OverprotectiveDad", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "SayAnything", 
            "name": "Say Anything", 
            "poster_url": "SayAnything.jpg"
        }, 
        {
            "shared": [
                "MadonnaWhoreComplex", 
                "DisappearedDad", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "SnowWhiteAndTheSevenDwarfs", 
            "name": "Snow White and the Seven Dwarfs"
        }, 
        {
            "shared": [
                "MadonnaWhoreComplex", 
                "DisappearedDad", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "DarkShadows", 
            "name": "Dark Shadows", 
            "poster_url": "DarkShadows.jpg"
        }
    ], 
    "id": "LoveActually", 
    "name": "Love Actually"
}