{
    "plot": "Lupin and his comrades seek 3 statues that are the key in obtaining Harimao's Treasure that's worth 8 billion dollars. Later teaming up with Sir Archer, a retired British Agent(the main inspiration for James Bond) and his granddaughter Diana. Archer knows the secrets and where abouts of Harimao's treasure as far back as World War 2. Meanwhile the Neo-Himmel, a group of Nazis are after the treasure for themselves.", 
    "genres": "Adventure, Animation, Comedy", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "main"
                ], 
                "role": "It should come as no surprise that Lupin is the main offender, especially where Archer's granddaughter is concerned.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "private", 
                    "actual"
                ], 
                "role": "Cool Old Guy: Sir Archer, who owns a private museum of spy memorabilia,  which were inspired by his actual exploits, during his time as an agent of British Intelligence!", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "quick", 
                    "complete", 
                    "lecherous"
                ], 
                "role": "Dirty Old Man: Archer is a mild example, but still dirty. Near the beginning, Diana warns Fujiko about her grandfather, citing that \"he's quick with his women.\" He spends his time during the pool scene with his head in Fujiko's lap, while nuzzling his cheek against her thighs; complete with lecherous grin. Also shown, in the flashback between him and Fujiko, before they depart for Bangkok. She gives him a peck on the cheek, causing Archer to blush and smile lecherously again.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Effeminate Misogynistic Guy: Herr Mafroditte in this film. The mere touch of a woman repulses him. He openly states that he hates women, and when Fujiko kisses him  he has a shit fit, claiming he's been dirtied.", 
                "id": "EffeminateMisogynisticGuy"
            }, 
            {
                "adjectives": [
                    "narcissistic", 
                    "disgust"
                ], 
                "role": "Lupin III: The Pursuit Of Harimao's Treasure has Herr Mafroditte, who was basically a narcissistic gay Nazi. When Fujiko touches him, he's visibly repulsed by it and tells her not to touch him because he hates women.  Fujiko weaponizes this at the climax by kissing him on the lips, causing him to run away screaming in disgust.", 
                "id": "EffeminateMisogynisticGuy"
            }, 
            {
                "adjectives": [
                    "passive"
                ], 
                "role": "Non-Action Girl: Fujiko, making it a rare instance where she plays a passive role. Justified, since it's part of her cover. She does clock a mook with a champagne bottle though.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [
                    "polish"
                ], 
                "role": "Sissy Villain: Nail polish, lipstick,  a voice chip to make him sound like a woman. Yep. Herr Mafroditte, all the way.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "gay", 
                    "double-crossing", 
                    "double-crossed"
                ], 
                "role": "The Pursuit of Harimao's Treasure: Herr Maffrodite is essentially a crossdressing Nazi, who's actually gay and hates women. Fujiko weaponizes this near the end, when she revenge kisses himnote for double-crossing her, after she had double-crossed Lupin to side with Herr Maffrodite on the lips, causing him to literally run away screaming that he'd been dirtied.", 
                "id": "SissyVillain"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Diana. She's an experienced archeologist, an Ace Pilot, and a crack shot with a shotgun. She even nabs one of the statues before Lupin does, moments before he arrives, and escapes via jet pack.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: Diana, as seen in the Action Girl entry above.", 
                "id": "PluckyGirl"
            }
        ]
    }, 
    "imdbid": "tt0449641", 
    "similar": [
        {
            "shared": [
                "NonActionGuy", 
                "EffeminateMisogynisticGuy", 
                "PluckyGirl", 
                "CoolOldGuy", 
                "ActionGirl"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "ActionGirl", 
                "DirtyOldMan", 
                "ChivalrousPervert"
            ], 
            "shared_count": 4, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "SissyVillain", 
                "CoolOldGuy", 
                "DirtyOldMan"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "ActionGirl", 
                "CoolOldGuy", 
                "DirtyOldMan"
            ], 
            "shared_count": 4, 
            "id": "BuffyTheVampireSlayer", 
            "name": "Buffy the Vampire Slayer"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "ActionGirl", 
                "ChivalrousPervert"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "LupinIIIThePursuitOfHarimaosTreasure", 
    "name": "Lupin III: The Pursuit Of Harimao's Treasure"
}