{
    "plot": "The highly skilled Federale Machete is hired by some unsavory types to assassinate a senator. But just as he's about to take the shot, he notices someone aiming at him and realizes he's been set up. He barely survives the sniper's bullet, and is soon out for revenge on his former employers, with the reluctant assistance of his brother Cheech Marin, who has become a priest and taken a vow of nonviolence. If you hire him to take out the bad guys, make sure the bad guys aren't you!", 
    "genres": "Action, Crime, Thriller", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Mustache: Just look at it. The padre has an awesome one as well.", 
                "id": "BadAssMustache"
            }, 
            {
                "adjectives": [], 
                "role": "Badass Grandpa: Machete Cortez' birthday is listed as May 16, 1944... which is Danny Trejo's birthday, making him 66.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "Machete", 
                    "unavoidable"
                ], 
                "role": "Kavorka Man: Ladies love Machete. Considering the trailer insists \"Machete gets the women,\" this was unavoidable.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [], 
                "role": "Machete. Danny Trejo gets involved with Michelle Rodriguez, Lindsay Lohan (and her mother), and Jessica Alba.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "drug-troubled", 
                    "wrong"
                ], 
                "role": "Papa Wolf:  Booth to his drug-troubled daughter April. It would be his redeeming quality, if it wasn't because he wants to bone her. At least he knows it's wrong, and has confessed it to a priest.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Luz and Sartana. April in the end Took a Level in Badass.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "naked", 
                    "first"
                ], 
                "role": "Dark Faux Action Girl: Aside from shooting the naked woman (who also counts) who tricks Machete in the opening in the back of the head in her first scene, Cheryl Chin's character does ... pretty much nothing.  All she does when Torrez dies is pout fetchingly.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Godiva Hair: April, waking up in a church after having been fucked sensele... drugged by Machete. It doesn't always cover everything up.", 
                "id": "GodivaHair"
            }, 
            {
                "adjectives": [
                    "criminal"
                ], 
                "role": "Mafia Princess: April relishes quite a bit in the life her criminal father allows her to live. He's disgusted by the way she sells herself as a wannabe porn starlett however, but not because he wants to protect his daughter; he wants to have her for himself.", 
                "id": "MafiaPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Sartana in Machete (also featuring Michelle Rodriguez), a rare example of this from Jessica Alba.", 
                "id": "SpicyLatina"
            }, 
            {
                "adjectives": [
                    "several"
                ], 
                "role": "Spicy Latina: Not just Michelle Rodriguez, the poster girl for this trope, but also Jessica Alba who rarely plays this role, as well as several more. The nude woman in the opening scene also counts.", 
                "id": "SpicyLatina"
            }
        ]
    }, 
    "imdbid": "tt0985694", 
    "poster_url": "Machete.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "BadassGrandpa", 
                "ActionGirl", 
                "DarkActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Ben10", 
            "name": "Ben 10"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "ActionGirl", 
                "GodivaHair"
            ], 
            "shared_count": 3, 
            "id": "TheMaskOfZorro", 
            "name": "The Mask of Zorro", 
            "poster_url": "TheMaskOfZorro.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "ActionGirl", 
                "DarkActionGirl"
            ], 
            "shared_count": 3, 
            "id": "XMenDaysOfFuturePast", 
            "name": "X-Men: Days of Future Past", 
            "poster_url": "XMenDaysOfFuturePast.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ActionGirl", 
                "GodivaHair"
            ], 
            "shared_count": 3, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "SpicyLatina", 
                "DarkActionGirl"
            ], 
            "shared_count": 3, 
            "id": "TotalRecall1990", 
            "name": "Total Recall ", 
            "poster_url": "TotalRecall1990.jpg"
        }
    ], 
    "id": "Machete", 
    "name": "Machete"
}