{
    "plot": "At New York's Central Park Zoo, a lion, a zebra, a giraffe, and a hippo are best friends and stars of the show. But when one of the animals goes missing from their cage, the other three break free to look for him, only to find themselves reunited ... on a ship en route to Africa. When their vessel is hijacked, however, the friends, who have all been raised in captivity, learn first-hand what life can be like in the wild.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Big Beautiful Man: Moto Moto.", 
                "id": "BigBeautifulMan"
            }, 
            {
                "adjectives": [
                    "hyperactive", 
                    "first", 
                    "psychotic", 
                    "psychotic"
                ], 
                "role": "Keet: Alex is really hyperactive, especially in the first one. So much that Skipper refers to him as \"that psychotic lion\". This is probably a gag on that Alex called the penguins psychotic earlier.", 
                "id": "Keet"
            }, 
            {
                "adjectives": [], 
                "role": "Officer and a Gentleman: Skipper.", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "courteous", 
                    "little", 
                    "tear"
                ], 
                "role": "Skipper of Madagascar penguins (and in The Penguins of Madagascar) has some of these qualities. He is a lot more cultured than the rest of the commando penguins, generally courteous towards ladies, and also pulls off the craziest stunts.\n Case in point: \"No little girl will shed a tear on my watch!\" from \"What Goes Around.\"", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Pec Flex: Moto Moto does this a few times in Escape 2 Africa.", 
                "id": "PecFlex"
            }, 
            {
                "adjectives": [], 
                "role": "Gloria from Madagascar can smash through brick walls with her power. Makes sense, since she's a hippo.", 
                "id": "StoutStrength"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "large", 
                    "male", 
                    "nice", 
                    "attractive", 
                    "fat", 
                    "Acrofatic", 
                    "sexy"
                ], 
                "role": "Gloria, the hippo in the Madagascar movies. Designed to be sexy. In fact, her large size became a status of attraction to a male hippo named Moto Moto (the name so nice, you say it twice).\n And it would seem that hippos as a species find chubbiness attractive, since Moto Moto and Gloria's flirting is made entirely of fat jokes.\n Gloria is also surprisingly Acrofatic, allowing her to pull off some sexy dance moves, too.", 
                "id": "BigBeautifulWoman"
            }, 
            {
                "adjectives": [
                    "little", 
                    "old", 
                    "first", 
                    "second", 
                    "present", 
                    "special"
                ], 
                "role": "Cool Old Lady: The little old woman from the first movie, who beats up a lion while everyone else is running in terror. She returns in the second, and actually contrives to become even more dangerous. She is present in the penguins' special, too, but lacking Alex she has no fighting scene.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "old"
                ], 
                "role": "The old lady from Madagascar.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "male", 
                    "humanoid", 
                    "female", 
                    "male", 
                    "humanoid", 
                    "other", 
                    "male", 
                    "female"
                ], 
                "role": "Inverted in the Madagascar franchise. For example, Moto Moto the male hippo has a somewhat humanoid chest, but Gloria the female hippo doesn't. Also, Vitaly the male tiger looks a little more humanoid in the chest than the other cats in the franchise, male or female.", 
                "id": "HumanoidFemaleAnimal"
            }, 
            {
                "adjectives": [
                    "old", 
                    "first", 
                    "Bad", 
                    "popular", 
                    "serious"
                ], 
                "role": "Nana, the old woman from Madagascar. She only has a couple of scenes in the first movie, where she kicks Alex in the crotch while shouting \"Bad kitty!\" She proved so popular that she gets a bigger part in the Spin-Off short Christmas Caper, and on the sequel Escape 2 Africa displays serious skills as a survivalist.", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [], 
                "role": "Sassy Black Woman: Gloria is voiced to sound like one.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "starfish"
                ], 
                "role": "In Madagascar, when Gloria washes ashore, she has two starfish on her chest (beside the fact that there is nothing there to cover) and a crab on her crotch (make of that what you will).", 
                "id": "SeashellBra"
            }
        ]
    }, 
    "imdbid": "tt0351283", 
    "poster_url": "Madagascar.jpg", 
    "similar": [
        {
            "shared": [
                "SeashellBra", 
                "NeverMessWithGranny", 
                "BigBeautifulWoman", 
                "PecFlex", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 5, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "BigBeautifulMan", 
                "CoolOldLady", 
                "PecFlex", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "NeverMessWithGranny", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "NeverMessWithGranny", 
                "BigBeautifulWoman"
            ], 
            "shared_count": 2, 
            "id": "TheCroods", 
            "name": "The Croods", 
            "poster_url": "TheCroods.jpg"
        }, 
        {
            "shared": [
                "NeverMessWithGranny", 
                "CoolOldLady"
            ], 
            "shared_count": 2, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }
    ], 
    "id": "Madagascar", 
    "name": "Madagascar"
}