{
    "plot": "A vision of an apocalyptic future set in the wastelands of Australia. Total social decay is just around the corner in this spectacular cheap budget gang orientated road movie, where the cops do their best to lay down the law and the outlaw gangs try their hardest to defy the system. Leather clad Max Rockatansky husband, father and cop turns judge, juror and executioner after his best friend, wife and baby are killed. Here we see the final days of normality of a man who had everything to live for, and his slip into the abyss of madness. Mad Max is the antihero on the road to vengeance and oblivion.", 
    "genres": "Action, Adventure, Thriller", 
    "release_year": "1979", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "ultimate", 
                    "other"
                ], 
                "role": "Dirty Coward: The Nightrider who opens the film leading the cops on a wild chase is ultimate shown to be this after all his bluster and bragging when he plays chicken with Max - only to find that Max isn't the incompetent pushover that the other cops were and breaks down in tears as Max chases him down.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "bad", 
                    "free", 
                    "first", 
                    "next"
                ], 
                "role": "Max Rockatansky (of Mad Max) started out as a highway cop in a disintegrating dystopian future; he didn't turn bad so much as become a free agent independent of the law in order to go on a Roaring Rampage of Revenge against the motorcycle gang that murdered his family. Then, between the end of the first film and the start of the next one, the apocalypse broke out…", 
                "id": "LawmanGoneBad"
            }, 
            {
                "adjectives": [
                    "Australian"
                ], 
                "role": "Australian actor Vernon Wells is best known for playing this type of character: Wez in Mad Max 2: The Road Warrior and Cpt. Bennett in Commando are probably the best known.", 
                "id": "LeatherMan"
            }, 
            {
                "adjectives": [
                    "first", 
                    "first"
                ], 
                "role": "Leatherman: Wez, Mad Max 2's Dragon Fifi Macaffee, Max's police chief in the first film. The exact phrase is used by the nightclub singer in the first movie during her torch song to Goose.", 
                "id": "LeatherMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "same", 
                    "glamorous"
                ], 
                "role": "The Tent Lovers, Anne Jones and James McCardell, whose tent is ripped away from them by Max driving by, revealing them fully naked and going at it in Mad Max 2, The Road Warrior. For McCardell, this is apparently his only film credit, while Jones seems to have had another Fanservice Extra role in the same year, appearing as \"Shower Girl\" in Centrespread (\"The story of a photographer's struggle in the glamorous world of nude modeling. \"). Yeah.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "old", 
                    "hefty", 
                    "real"
                ], 
                "role": "The old lady with whom Max and Jess stay in the middle part of Mad Max. She threatens the Toecutter's biker gang with a pretty hefty gun (by real life standards, not More Dakka), and they listen.", 
                "id": "NeverMessWithGranny"
            }
        ]
    }, 
    "imdbid": "tt0079501", 
    "poster_url": "MadMax.jpg", 
    "similar": [
        {
            "shared": [
                "FanserviceExtra", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "TransformersDarkOfTheMoon", 
            "name": "Transformers: Dark of the Moon", 
            "poster_url": "TransformersDarkOfTheMoon.jpg"
        }, 
        {
            "shared": [
                "NeverMessWithGranny", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "LawmanGoneBad"
            ], 
            "shared_count": 2, 
            "id": "Speed", 
            "name": "Speed", 
            "poster_url": "Speed.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "GodzillaVsMegalon", 
            "name": "Godzilla vs. Megalon", 
            "poster_url": "GodzillaVsMegalon.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "TheFlightOfThePhoenix1965", 
            "name": "The Flight Of The Phoenix", 
            "poster_url": "TheFlightOfThePhoenix1965.jpg"
        }
    ], 
    "id": "MadMax", 
    "name": "Mad Max"
}