{
    "plot": "N/A", 
    "genres": "Animation, Fantasy", 
    "release_year": "2004–", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "only", 
                    "magical", 
                    "titular", 
                    "spectacular", 
                    "handy", 
                    "archeologist/scholar", 
                    "screentime", 
                    "female", 
                    "big", 
                    "main", 
                    "possible", 
                    "offensive", 
                    "forcing", 
                    "many", 
                    "unpleasant"
                ], 
                "role": "Yuuno Scrya from Magical Girl Lyrical Nanoha is the only Mage in the cast without a magical weapon (he had given it up to the series's titular Action Girl — for whom it was much better suited anyway), so his contribution in battle is largely limited to offering backup, rather than throwing around spectacular offensive spells. He's actually extremely handy in a fight, but he ends up accepting a position in the library of all knowledge where he can pursue his passions as an archeologist/scholar (and give more screentime to the female cast). After that, he participates in only one more fight, and the rest of the time he just researches whatever big nasty or mystery the main cast is dealing with now.\n It's possible that Yuuno remains a Non Action Guy because his one demonstrated offensive ability, forcing someone to teleport off the field against their will, offers so many unpleasant possibilities that neither he nor the series creators want to go there.", 
                "id": "NonActionGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "likely"
                ], 
                "role": "Ixpellia of Magical Girl Lyrical Nanoha's StrikerS Sound Stage X was likely meant to evoke this image, what with her qipao and all (in the illustrations to them, do not get any weird ideas).", 
                "id": "AnimeChineseGirl"
            }, 
            {
                "adjectives": [
                    "black", 
                    "convertible"
                ], 
                "role": "Fate of Magical Girl Lyrical Nanoha got herself a black convertible (the Cardiche) sometime during the Time Skip.", 
                "id": "BikerBabe"
            }, 
            {
                "adjectives": [
                    "Magical"
                ], 
                "role": "Magical Girl Lyrical Nanoha\n Ginga Nakajima, Subaru's older sister.\n Nanoha often seems to fill the role as well to the Forwards.\n And Signum seem to be a Grumpy but Cool Big Sis to Nanoha, Fate and some minor characters like Vice or Alto, especially in StrikerS manga.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "original", 
                    "iconic", 
                    "empty-handed", 
                    "biological", 
                    "past", 
                    "medical", 
                    "severe", 
                    "humorous"
                ], 
                "role": "The page image is the original series' iconic Fate Testarossa, who spends the majority of the season attempting to gather the Jewel Seeds before Nanoha, at the behest of her mother, Precia. Eventually, she ends up severely overexerting herself in an attempt to obtain all of the remaining Seeds at once, and is stopped by a concerned Nanoha. Fate ends up returning home empty-handed, and it is at this point that we learn that Fate is a clone of Precia's biological daughter, Alicia, who has spent the past thirty years in medical stasis after a severe accident. Precia considers Fate a failed project, does not acknowledge her as a person, let alone as a daughter, and lashes her with a whip when she doesn't fulfill Precia's orders. The aforementioned scene rapidly converts most viewers' attitude from enjoying the somewhat humorous tone and subversiveness of the series to  \"PRECIA TESTAROSSA MUST DIE\".", 
                "id": "DarkMagicalGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Vita of Magical Girl Lyrical Nanoha A's.", 
                "id": "ElegantGothicLolita"
            }, 
            {
                "adjectives": [
                    "second", 
                    "obvious", 
                    "great", 
                    "easy"
                ], 
                "role": "Fate Testarossa of Magical Girl Lyrical Nanoha seems to have this going on during the second season, though it's more obvious in the manga. Not only do we see a number of girls in the class clustering around her talking about how great she is, but when Arisa gets a smile from her, she blushes and muses that it's easy to see why Nanoha likes her so much.\n Nanoha might have Fate beat when it comes to this, considering the number of people she's befriended through sheer force of her personality (and laser beams). Or even those she hasn't, as Subaru demonstrates in StrikerS.", 
                "id": "EvenTheGirlsWantHer"
            }, 
            {
                "adjectives": [
                    "Magical", 
                    "definitive"
                ], 
                "role": "Magical Girl Lyrical Nanoha: Precia Testarossa is the definitive Evil Matriarch, especially in the TV series where she is nothing but cruelty incarnate when it comes to her daughter Fate.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "former", 
                    "insane", 
                    "general"
                ], 
                "role": "Precia Testarossa of Magical Girl Lyrical Nanoha. Mad Scientist Big Bad and former Chief Engineer of a power plant before she went insane whose villain outfit comes with Absolute Cleavage and shows off a lot of skin in general.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "female", 
                    "physical"
                ], 
                "role": "The Combat Cyborgs of Magical Girl Lyrical Nanoha. There's also the female Wolkenritter and the Unison Devices, who are basically programs with physical forms.", 
                "id": "RobotGirl"
            }
        ]
    }, 
    "imdbid": "tt0808082", 
    "similar": [
        {
            "shared": [
                "DarkMagicalGirl", 
                "EvenTheGirlsWantHer", 
                "BikerBabe", 
                "RobotGirl"
            ], 
            "shared_count": 4, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "EvilMatriarch", 
                "AnimeChineseGirl"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "BatmanMysteryOfTheBatwoman", 
            "name": "Batman: Mystery of the Batwoman", 
            "poster_url": "BatmanMysteryOfTheBatwoman.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "DarkMagicalGirl"
            ], 
            "shared_count": 2, 
            "id": "SleepyHollow", 
            "name": "Sleepy Hollow", 
            "poster_url": "SleepyHollow.jpg"
        }, 
        {
            "shared": [
                "DarkMagicalGirl", 
                "BikerBabe"
            ], 
            "shared_count": 2, 
            "id": "Ben10", 
            "name": "Ben 10"
        }
    ], 
    "id": "MagicalGirlLyricalNanoha", 
    "name": "Magical Girl Lyrical Nanoha"
}