{
    "plot": "The senior partner of an investment brokerage, Jeffrey Desange, has a breakdown due to a financial collapse and kills several co-workers and his estranged wife. He then kidnaps his two young daughters, Victoria 3 and Lilly just 1. He drives his car recklessly through a winding snow covered road. He loses control of his car and drives off an embankment. He finds an abandoned and isolated cabin where he plans to kill his daughters, but the children are saved by a dark ghostly image. After five years of searching and depleting his savings, Jeffrey's twin brother, Lucas, finds the children that were raised without social interaction and claim that they have been raised by 'Mama'. Lucas disputes the custody with the children's Great Aunt but Dr. Dreyfuss, who is working with the girls, helps Lucas get custody of the girls so that he can still have access to them. Lucas, his girlfriend Annabel, Victoria and Lilly move into a house provided be the institute that Dr. Dreyfuss works for. Lucas and Annabel soon find out that the girls have brought Mama with them and their lives are in grave danger.", 
    "genres": "Horror", 
    "release_year": "2013", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Mama/Edith"
                ], 
                "role": "Mama/Edith also subverts Mama Bear, when she accidentally kills her baby, and then kills Lilly.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Ms. Fanservice: Annabel has very few scenes where she's not showing cleavage. Annabel also walks around her house barefoot quite a bit.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt2023587", 
    "poster_url": "Mama.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "TheLongKissGoodnight", 
            "name": "The Long Kiss Goodnight", 
            "poster_url": "TheLongKissGoodnight.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "DarkShadows", 
            "name": "Dark Shadows", 
            "poster_url": "DarkShadows.jpg"
        }
    ], 
    "id": "Mama", 
    "name": "Mama"
}