{
    "plot": "n New York, the immature family man Leo Vidales is a successful businessman, owner of the Underlandish, a successful website of digital games and married to Dr. Ellen Vidales, a dedicated surgeon of the emergency room of a hospital. They have a daughter, Jackie, who is an intelligent girl that is raised by her nanny, the Filipino Gloria that spends more time with her than Ellen. Gloria has two sons in Philippine that miss her. When Leo need to travel to Singapore with his partner Bob (Tom McCarthy) to sign a millionaire contract with investors, Ellen operates on a boy stabbed in the stomach by his own mother and she feels connected to the boy and rethinks her relationship with Jackie. Meanwhile Leo is bored waiting for the negotiation of Bob with the investors and he decides to travel to Bangkok and lodges in a rustic cottage on the seashore. Leo meets the young prostitute and mother Cookie and he has one night stand with her. Meanwhile, Gloria's ten year-old boy Salvador misses her mother and decides to find a job. His innocence leads him to a tragedy.", 
    "genres": "Drama", 
    "release_year": "2009", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Asian", 
                    "major", 
                    "local", 
                    "regular", 
                    "normal", 
                    "heroic", 
                    "sex-worker", 
                    "good-bye", 
                    "Asian", 
                    "central", 
                    "important", 
                    "Asian"
                ], 
                "role": "Asian Hooker Stereotype: A major plotline starts with Leo visiting a place where sex-workers and clients hook up, just to have a look. He obviously expected the local prostitute to be a living stereotype: Finding out that she's a regular normal person makes him shocked and confused. He awkwardly tried to take up the role of Mighty Whitey Knight in Shining Armor instead, but it doesn't work. After that, he spends the rest of the story trying to convince himself that he's a heroic lover and that paying a sex-worker \"for not having sex\" and then have sex with her after all does not make him a John. This also fails miserably, and he end up leaving her without even saying good-bye... Thus after all treating her as a lowly whore to be used and discarded.. As for the racist \"all Asian women are sex-workers\" stereotype version of this trope, the movie averts it by having Gloria as a central character, Gloria's mother as an important side character, and loads of minor female Asian characters who have nothing to do with the sex industry.", 
                "id": "AsianHookerStereotype"
            }, 
            {
                "adjectives": [
                    "major", 
                    "local", 
                    "regular", 
                    "normal", 
                    "heroic", 
                    "sex-worker", 
                    "good-bye", 
                    "Asian", 
                    "central", 
                    "important", 
                    "Asian", 
                    "single", 
                    "actual", 
                    "prostitute"
                ], 
                "role": "In Mammoth, a major plotline starts with Leo visiting a place where sex-workers and clients hook up, just to have a look. He obviously expected the local prostitute to be a living stereotype: Finding out that she's a regular normal person makes him shocked and confused. He awkwardly tried to take up the role of Mighty Whitey Knight in Shining Armor instead, but it doesn't work. After that, he spends the rest of the story trying to convince himself that he's a heroic lover and that paying a sex-worker \"for not having sex\" and then have sex with her after all does not make him a John. This also fails miserably, and he end up leaving her without even saying good-bye... Thus after all treating her as a lowly whore to be used and discarded..\n As for the racist \"all Asian women are sex-workers\" stereotype version of this trope, the movie limits this to Thailand by having Gloria as a central character, Gloria's mother as an important side character, and loads of minor female Asian characters who have nothing to do with the sex industry. In Thailand, however, every single female character who gets any actual dialogue just happens to be prostitute.", 
                "id": "AsianHookerStereotype"
            }
        ]
    }, 
    "imdbid": "tt1038043", 
    "poster_url": "Mammoth.jpg", 
    "similar": [
        {
            "shared": [
                "AsianHookerStereotype"
            ], 
            "shared_count": 1, 
            "id": "TheSandPebbles", 
            "name": "The Sand Pebbles", 
            "poster_url": "TheSandPebbles.jpg"
        }, 
        {
            "shared": [
                "AsianHookerStereotype"
            ], 
            "shared_count": 1, 
            "id": "OnlyGodForgives", 
            "name": "Only God Forgives", 
            "poster_url": "OnlyGodForgives.jpg"
        }, 
        {
            "shared": [
                "AsianHookerStereotype"
            ], 
            "shared_count": 1, 
            "id": "TheBigHit", 
            "name": "The Big Hit", 
            "poster_url": "TheBigHit.jpg"
        }, 
        {
            "shared": [
                "AsianHookerStereotype"
            ], 
            "shared_count": 1, 
            "id": "OngBak", 
            "name": "Ong Bak", 
            "poster_url": "OngBak.jpg"
        }, 
        {
            "shared": [
                "AsianHookerStereotype"
            ], 
            "shared_count": 1, 
            "id": "FullMetalJacket", 
            "name": "Full Metal Jacket", 
            "poster_url": "FullMetalJacket.jpg"
        }
    ], 
    "id": "Mammoth", 
    "name": "Mammoth"
}