{
    "plot": "Forty-two year old Isaac Davis has a romanticized view of his hometown, New York City, most specifically Manhattan, as channeled through the lead character in the first book he is writing, despite his own Manhattan-based life being more of a tragicomedy. He has just quit his job as a hack writer for a bad television comedy, he, beyond the ten second rush of endorphins during the actual act of quitting, now regretting the decision, especially as he isn't sure he can live off his book writing career. He is paying two alimonies, his second ex-wife, Jill Davis, a lesbian, who is writing her own tell-all book of their acrimonious split. The one somewhat positive aspect of his life is that he is dating a young woman named Tracy, although she is only seventeen and still in high school. Largely because of their differences a big part of which is due to their ages, he does not see a long term future with her. His life has the potential to be even more tragicomical when he meets journalist Mary Wilkie, the mistress of his best friend, college professor Yale Pollack. Although Isaac's first impression of Mary is that she is a pretentious intellectual, he falls for her. They do become friends with the potential of becoming more than just friends as she knows that being the \"other woman\" in Yale's life is not a long term role that she wants. An Isaac/Mary coupling may complicate matters even more with Yale being mutually in their lives. Regardless, Isaac may be able to rationalize events after they happen, no matter what those events are.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1979", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Kavorka Man: both Ike and Yale, apparently.", 
                "id": "KavorkaMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Broken Bird: subverted, as Tracy gets dumped by Ike, but gets over it, presumably becoming stronger and more mature.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [], 
                "role": "Manic Pixie Dream Girl: Mary, most of the time.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt0079522", 
    "poster_url": "Manhattan.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan", 
                "BrokenBird"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan", 
                "BrokenBird"
            ], 
            "shared_count": 2, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "NorwegianWood", 
            "name": "Norwegian Wood", 
            "poster_url": "NorwegianWood.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Bridesmaids", 
            "name": "Bridesmaids", 
            "poster_url": "Bridesmaids.jpg"
        }
    ], 
    "id": "Manhattan", 
    "name": "Manhattan"
}