{
    "plot": "A young boy learns that he has extraordinary powers and is not of this Earth. As a young man, he journeys to discover where he came from and what he was sent here to do. But the hero in him must emerge if he is to save the world from annihilation and become the symbol of hope for all mankind.", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Jor-El", 
                    "clean-shaved"
                ], 
                "role": "In Man of Steel, the evil Zod has grown a Superman II-esque beard by the time Clark is an adult.\n Inverted in the intro when bearded Jor-El faces off with clean-shaved Zod.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "off-screen", 
                    "age-old"
                ], 
                "role": "Beardness Protection Program: Clark, when Walking the Earth. He apparently finds time to shave off-screen while changing into the Superman suit (deftly dodging the age-old \"Kryptonite razor\" question...)", 
                "id": "BeardnessProtectionProgram"
            }, 
            {
                "adjectives": [
                    "off-screen", 
                    "age-old"
                ], 
                "role": "Clark in Man of Steel, when Walking the Earth. He apparently finds time to shave off-screen while changing into the Superman suit (deftly dodging the age-old \"Kryptonite razor\" question...)", 
                "id": "BeardnessProtectionProgram"
            }, 
            {
                "adjectives": [], 
                "role": "Cultured Badass: During the bullying scene, you may notice Clark was reading Plato's works.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [], 
                "role": "During the bullying scene in Man of Steel, you may notice Clark was reading Plato's works.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "big", 
                    "fellow", 
                    "himself—to", 
                    "Kal-El"
                ], 
                "role": "Papa Wolf: Zod could arguably be seen as this in a big scheme of things kind of way towards his fellow Kryptonians if you believe he may have seen them as a surrogate family (see Heartbroken Badass above). Jor-El is closer to the trope, as he holds off a splinter faction of the Kryptonian military—despite not being a soldier himself—to allow his son to escape to the safety of Earth. Later, his avatar helps Lois and Kal-El escape Zod's custody, and provides Kal-El with both the means to save Earth and the blessing to embrace Earth's civilization over Krypton's.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "Clark's shirt catches on fire after saving workers from a failing oil rig. The fireproof Clark remains unfazed.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "nigh-invulnerable", 
                    "able"
                ], 
                "role": "Lois Lane makes a return to this trope in Man of Steel, given her Action Survivor status. She gets into danger a lot, but usually she tries to fight her way out of it, and does rather well considering the people she's up against are nigh-invulnerable superpowered aliens. She's even able to  fight her way out of Zod's spacecraft using a Kryptonian gun, with some help from the AI Jor-El.", 
                "id": "DamselOutOfDistress"
            }
        ]
    }, 
    "imdbid": "tt0770828", 
    "poster_url": "ManOfSteel.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "ShirtlessScene", 
                "BeardnessProtectionProgram"
            ], 
            "shared_count": 3, 
            "id": "TheBoondockSaints", 
            "name": "The Boondock Saints", 
            "poster_url": "TheBoondockSaints.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ShirtlessScene", 
                "BeardOfEvil"
            ], 
            "shared_count": 3, 
            "id": "TheTransporter", 
            "name": "The Transporter", 
            "poster_url": "TheTransporter.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "ShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BeardOfEvil"
            ], 
            "shared_count": 2, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }
    ], 
    "id": "ManOfSteel", 
    "name": "Man of Steel"
}