{
    "plot": "At 10, Fanny Price, a poor relation, goes to live at Mansfield Park, the estate of her aunt's husband, Sir Thomas. Clever, studious, and a writer with an ironic imagination and fine moral compass, she becomes especially close to Edmund, Thomas's younger son. Fanny is soon possessed of beauty as well as a keen mind and comes to the attention of a neighbor, Henry Crawford. Thomas promotes this match, but to his displeasure, Fanny has a mind of her own, asking Henry to prove himself worthy. As Edmund courts Henry's sister and as light shines on the link between Thomas's fortunes and New World slavery, Fanny must assess Henry's character and assert her heart as well as her wit.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "A Lady on Each Arm: Henry Crawford with Maria and Julia. Later, when he visits Portsmouth, he repeats it with Fanny and her sister Susan — though in that case, Susan's presence certainly wasn't his idea.", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [
                    "strong", 
                    "lady-killing"
                ], 
                "role": "Ladykiller in Love: Henry Crawford — unfortunately, as in every Austen novel, the \"love\" isn't strong enough to give up his lady-killing ways.", 
                "id": "LadyKillerInLove"
            }, 
            {
                "adjectives": [
                    "already-married"
                ], 
                "role": "Henry Crawford of Mansfield Park — self-affirmed Ladykiller in Love...who runs away with the already-married cousin of the girl he considers himself engaged to (regardless of said girl's thoughts on the matter).", 
                "id": "PrinceCharmingWannabe"
            }, 
            {
                "adjectives": [], 
                "role": "Prince Charming Wannabe: Henry Crawford", 
                "id": "PrinceCharmingWannabe"
            }, 
            {
                "adjectives": [], 
                "role": "The Casanova: Henry Crawford", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [], 
                "role": "The Charmer: Henry Crawford", 
                "id": "TheCharmer"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "shy", 
                    "affectionate", 
                    "much", 
                    "male", 
                    "only", 
                    "many", 
                    "own", 
                    "difficult"
                ], 
                "role": "Emotionless Girl: Fanny as a survival mechanism. Compare Elinor in Sense and Sensibility, Anne in Persuasion, and Georgiana Darcy in Pride and Prejudice — all mortifyingly shy, very affectionate to all, always trying to accommodate everyone's demands as much as they can, all looking up to an older kind male figure to whom they are related by blood (with said male having been their only friend for many years and having taught them all they know), and, to top it off, all having lonely childhoods with no friends of their own ages and used to using silence and emotionlessness to cope with difficult situations.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "late"
                ], 
                "role": "Evil Matriarch: Mrs. Norris, which Sir Thomas doesn't realize until it's too late to repair the damage she's caused in how she raised his daughters.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "Harp of Femininity: Mary Crawford's instrument of choice.", 
                "id": "HarpOfFemininity"
            }, 
            {
                "adjectives": [], 
                "role": "Ill Boy: Tom Bertram towards the end", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [
                    "Rich", 
                    "dig", 
                    "pull"
                ], 
                "role": "Rich Bitch: Mary Crawford, but Maria Bertram even moreso. Although Julia can still give both of them a run for their money when she decides to really dig deep and pull out the claws.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "witty", 
                    "moral", 
                    "admirable"
                ], 
                "role": "Mary Crawford in Mansfield Park is witty and lively, and she enjoys horseback riding and takes pride in being physically strong. However, she also plays the harp and is interested in fashion, and she likes nothing like a life in the city. Her lack of a moral compass ultimately keeps her from being admirable.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [], 
                "role": "Spirited Young Lady: Mary Crawford.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [
                    "male", 
                    "capable"
                ], 
                "role": "The Vamp: Henry Crawford is a male version. Mary eventually reveals herself capable of this.", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "abusive", 
                    "lucky"
                ], 
                "role": "Fanny Price's evil aunt Mrs Norris in Mansfield Park. She's her aunt by blood and emotionally abusive to her. Fanny is lucky she doesn't live with her under one roof, but she visits them constantly. Mrs Norris hates her for no reason and wishes her no comfort, but adores her nephews and nieces who are a baronet's kids.", 
                "id": "WickedStepmother"
            }, 
            {
                "adjectives": [
                    "first", 
                    "close", 
                    "selfish", 
                    "rudimentary"
                ], 
                "role": "Wicked Stepmother: Mrs. Norris is Fanny's aunt but otherwise fits the trope dead on. Considering that it was her idea in the first place to \"adopt\" Fanny, this comes very close to actually happening. Fanny's only saved by it because Mrs. Norris was too selfish to want to take even rudimentary care of her niece.", 
                "id": "WickedStepmother"
            }
        ]
    }, 
    "imdbid": "tt0178737", 
    "poster_url": "MansfieldPark.jpg", 
    "similar": [
        {
            "shared": [
                "SpiritedYoungLady", 
                "EvilMatriarch", 
                "TheCharmer", 
                "WickedStepmother"
            ], 
            "shared_count": 4, 
            "id": "Tangled", 
            "name": "Tangled", 
            "poster_url": "Tangled.png"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "EvilMatriarch", 
                "WickedStepmother"
            ], 
            "shared_count": 3, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "TheVamp", 
                "IllGirl"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "TheCharmer", 
                "EmotionlessGirl"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "LadyKillerInLove", 
                "TheCharmer"
            ], 
            "shared_count": 3, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }
    ], 
    "id": "MansfieldPark", 
    "name": "Mansfield Park"
}