{
    "plot": "The planet Eternia is in the aftermath of Skeletor's war on Castle Greyskull, which he has won after seizing Greyskull and the surrounding city using the Cosmic Key developed by the Thenorian locksmith Gwildor. The Sorceress is now Skeletor's prisoner and he begins to drain her lifeforce as he waits for the Eternia's moon to align with the Great Eye of the Universe that will bestow god-like powers upon him. Once on Earth, He-Man and company team up with two teenagers as they attempt to find the key and return home. However, the evil Skeletor and his vile minions are soon hot on their trail.", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "1987", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "He-Man", 
                    "advanced", 
                    "He-Man", 
                    "He-Man", 
                    "further", 
                    "relieved", 
                    "cable", 
                    "floor.He-Man", 
                    "He-Man", 
                    "whole", 
                    "laser-whip"
                ], 
                "role": "Masters of the Universe: He-Man (Dolph Lundgren) spends most of the movie in an advanced form of leather loincloth-speedo combination, a pair of bandoliers and a cape. He-Man et al get really out numbered by the forces of evil. In order to spare the lives of his friends, He-Man agrees to return in chains with Skeletor as his slave. Once back home, Skeletor parades He-Man in front of his assembled court to make him a trophy. Dolph has been further relieved of clothing, and is completely bare-chested. His writs have shackles and he is attached by means of cable to the floor.He-Man resists all of Skeletor's demands. Skeletor wants to humiliate He-Man and to have him kneel before him with the whole planet watching. He man will have none of that. So, to help him make up his mind, Skeletor decides to laser-whip him.", 
                "id": "ShirtlessCaptives"
            }
        ]
    }, 
    "imdbid": "tt0093507", 
    "poster_url": "MastersOfTheUniverse.jpg", 
    "similar": [
        {
            "shared": [
                "ShirtlessCaptives"
            ], 
            "shared_count": 1, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "ShirtlessCaptives"
            ], 
            "shared_count": 1, 
            "id": "FlashGordon", 
            "name": "Flash Gordon", 
            "poster_url": "FlashGordon.jpg"
        }
    ], 
    "id": "MastersOfTheUniverse", 
    "name": "Masters of the Universe"
}