{
    "plot": "In April 1805 during the Napoleonic Wars, the H.M.S. Surprise, a British frigate, is under the command of Captain Jack Aubrey. Aubrey and the Surprise's current orders are to track and capture or destroy a French privateer named Acheron. The Acheron is currently in the Atlantic off South America headed toward the Pacific in order to extend Napoleon's reach of the wars. This task will be a difficult one as Aubrey quickly learns in an initial battle with the Acheron that it is a bigger and faster ship than the Surprise, which puts the Surprise at a disadvantage. Aubrey's single-mindedness in this seemingly impossible pursuit puts him at odds with the Surprise's doctor and naturalist, Stephen Maturin, who is also Aubrey's most trusted advisor on board and closest friend. Facing other internal obstacles which have resulted in what they consider a string of bad luck, Aubrey ultimately uses Maturin's scientific exploits to figure out a way to achieve his and the ship's seemingly impossible goal.", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Aubrey-Maturin", 
                    "12-year-old", 
                    "solicitous", 
                    "one-armed", 
                    "one-eyed", 
                    "other", 
                    "French"
                ], 
                "role": "In Master and Commander (see also the example from Aubrey-Maturin novels in the Literature section, below), a 12-year-old midshipman loses an arm to enemy fire in the opening scene of the film. Captain Aubrey is very solicitous of him thereafter, giving him a book with an engraving of the one-armed, one-eyed Admiral Nelson, and leaving him in command of the HMS Surprise when the other officers board a French vessel; and the boy remains so game an officer that a case could be made for including this under the \"Precociously Talented Type\". But, still! This is Truth in Television. In fact, most officers of the Royal Navy in that period probably started out as midshipmen in their teens or younger.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "French", 
                    "personal"
                ], 
                "role": "Papa Wolf: Discussed. Aubrey says that the French Captain fights so hard that you would think it's personal for him. Did Aubrey kill his family or something?", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "original", 
                    "Aubrey-Maturin", 
                    "half-naked"
                ], 
                "role": "Master and Commander: A lot of appeal came from the original source — the Aubrey-Maturin series. The film also comes with Russell Crowe, Paul Bettany, and a scene with a half-naked injured Stephen moaning in a way that sounds a tad erotic. While Jack's hands press down on his naked abdomen. No wonder fangirls love it.", 
                "id": "EstrogenBrigade"
            }
        ]
    }, 
    "imdbid": "tt0311113", 
    "poster_url": "MasterAndCommander.jpg", 
    "similar": [
        {
            "shared": [
                "EstrogenBrigade", 
                "PapaWolf"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ChildSoldiers"
            ], 
            "shared_count": 2, 
            "id": "Soldier", 
            "name": "Soldier", 
            "poster_url": "Soldier.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ChildSoldiers"
            ], 
            "shared_count": 2, 
            "id": "KickAss", 
            "name": "Kick-Ass", 
            "poster_url": "KickAss.jpg"
        }, 
        {
            "shared": [
                "EstrogenBrigade", 
                "ChildSoldiers"
            ], 
            "shared_count": 2, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "EstrogenBrigade", 
                "ChildSoldiers"
            ], 
            "shared_count": 2, 
            "id": "LesMiserables", 
            "name": "Les Misérables"
        }
    ], 
    "id": "MasterAndCommander", 
    "name": "Master and Commander"
}