{
    "plot": "Meet Roy and Frank, a couple of professional small-time con artists. What Roy, a veteran of the grift, and Frank, his ambitious protégé, are swindling these days are \"water filtration systems,\" bargain-basement water filters bought by unsuspecting people who pay ten times their value in order to win bogus prizes like cars, jewelry and overseas vacations--which they never collect. These scams net the flim-flam men a few hundred here, another thousand there, which eventually adds up to a lucrative partnership. Roy's private life, however, is not so successful. An obsessive-compulsive agoraphobe with no personal relationships to call his own, Roy is barely hanging on to his wits, and when his idiosyncrasies begin to threaten his criminal productivity he's forced to seek the help of a psychoanalyst just to keep him in working order. While Roy is looking for a quick fix, his therapy begets more than he bargained for: the revelation that he has a teenage daughter--a child whose existence he suspected but never dared confirm. What's more troubling, 14-year-old Angela wants to meet the father she never knew. At first, Angela's appearance disrupts her neurotic father's carefully ordered routine. Soon, however, with his own unique spin on parenthood, Roy begins to enjoy a relationship he never dreamed of having with his daughter. But while he develops paternal feelings for the 14-year-old, she's developing a fascination with Daddy's questionable career.", 
    "genres": "Comedy, Crime, Drama", 
    "release_year": "2003", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "whole"
                ], 
                "role": "Little Miss Con Artist: The whole point of the film.", 
                "id": "LittleMissConArtist"
            }
        ]
    }, 
    "imdbid": "tt0325805", 
    "poster_url": "MatchstickMen.jpg", 
    "similar": [
        {
            "shared": [
                "LittleMissConArtist"
            ], 
            "shared_count": 1, 
            "id": "PaperMoon", 
            "name": "Paper Moon", 
            "poster_url": "PaperMoon.jpg"
        }, 
        {
            "shared": [
                "LittleMissConArtist"
            ], 
            "shared_count": 1, 
            "id": "Zombieland", 
            "name": "Zombieland", 
            "poster_url": "Zombieland.jpg"
        }, 
        {
            "shared": [
                "LittleMissConArtist"
            ], 
            "shared_count": 1, 
            "id": "OnePieceFilmZ", 
            "name": "One Piece Film: Z"
        }, 
        {
            "shared": [
                "LittleMissConArtist"
            ], 
            "shared_count": 1, 
            "id": "KickAss", 
            "name": "Kick-Ass", 
            "poster_url": "KickAss.jpg"
        }, 
        {
            "shared": [
                "LittleMissConArtist"
            ], 
            "shared_count": 1, 
            "id": "OzTheGreatAndPowerful", 
            "name": "Oz: The Great and Powerful", 
            "poster_url": "OzTheGreatAndPowerful.jpg"
        }
    ], 
    "id": "MatchstickMen", 
    "name": "Matchstick Men"
}