{
    "plot": "A grouchy couple are parents to a very sweet girl, Matilda. Unlike her bratty brother and mean parents, Matilda becomes a very sweet and extremely intelligent 6 year old girl, who is very keen to go to school and read books. After a while, her parents send her to school with the worst principal in the world, a very sweet teacher, and good friends. While trying to put up with her parents' and principal's cruelty, she starts to unwittingly unleash telekinetic powers, destroying a television and making a newt fly onto the principal. With enough practice, Matilda starts to learn to control her telekinetic powers and soon using them on her principal so she can drive her away from the school.", 
    "genres": "Comedy, Fantasy", 
    "release_year": "1996", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "The Trunchbull from Matilda.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: Matilda.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "authoritarian", 
                    "athletic", 
                    "lesbian", 
                    "common"
                ], 
                "role": "In Matilda (1996), the Big Bad is a sadistically evil, authoritarian, and athletic monster of a headmistress named Trunchbull. In addition to being a Baroness, the work may hint that she's a lesbian (as Baronesses often are): In one scene, schoolchildren in a spelling lesson chant letters with the word \"Mrs.\" added to set the rhythm: \"Mrs. D, Mrs. I, Mrs. FFI...\" the Trunchbull bursts out, with an annoyed expression, \"Why are all these women married?!\" The \"bull\" in the name Trunchbull probably implies \"bull dyke,\" a common derogatory term for lesbians.", 
                "id": "PsychoLesbian"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "authoritarian", 
                    "athletic"
                ], 
                "role": "In Matilda, the Big Bad is a sadistically evil, authoritarian, and athletic monster of a headmistress named Trunchbull. The work may hint that she's a Psycho Lesbian too.", 
                "id": "TheBaroness"
            }
        ]
    }, 
    "imdbid": "tt0117008", 
    "poster_url": "Matilda.jpg", 
    "similar": [
        {
            "shared": [
                "TheBaroness", 
                "PluckyGirl"
            ], 
            "shared_count": 2, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "TheBaroness", 
                "PluckyGirl"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TheBaroness", 
                "PluckyGirl"
            ], 
            "shared_count": 2, 
            "id": "StarWarsTheCloneWars", 
            "name": "Star Wars: The Clone Wars", 
            "poster_url": "StarWarsTheCloneWars.jpg"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "BrawnHilda"
            ], 
            "shared_count": 2, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "PluckyGirl"
            ], 
            "shared_count": 1, 
            "id": "PorcoRosso", 
            "name": "Porco Rosso", 
            "poster_url": "PorcoRosso.jpg"
        }
    ], 
    "id": "Matilda", 
    "name": "Matilda"
}