{
    "plot": "In November 1937, high school student and aspiring thespian Richard Samuels takes a day trip into New York City. There, he meets and begins a casual friendship with Gretta Adler, their friendship based on a shared love and goal of a profession in the creative arts. But also on this trip, Richard stumbles across the Mercury Theatre and meets Orson Welles, who, based on an impromptu audition, offers Richard an acting job as Lucius in his modern retelling of Julius Caesar, which includes such stalwart Mercury Theatre players as Joseph Cotten and George Coulouris. Despite others with official roles as producer John Houseman, this production belongs to Welles, the unofficial/official dictator. In other words, whatever Welles wants, the cast and crew better deliver. These requests include everything, even those of a sexual nature. Welles does not believe in conventions and will do whatever he wants, which includes not having a fixed opening date, although the unofficial opening date is in one week's time. In turn, Welles realizes that his name will either be strengthened or ruined in the theater community by this production. Richard is taken under the wing by the production's Jane-of-All-Trades, Sonja Jones. Known as the Ice Queen by the male cast, Sonja deflects much of the unwanted sexual attention by jokingly implying that she and Richard are having a fling, which Richard wants nothing more than to be the truth. As the end of the week and opening night approaches, Richard, having seen Welles' behavior, has to decide if acting in this production is worth it at any cost.", 
    "genres": "Drama", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "female"
                ], 
                "role": "The Casanova: Welles again. He tries to seduce just about every female in the movie. Joe Cotten, too.", 
                "id": "TheCasanova"
            }
        ]
    }, 
    "imdbid": "tt1175506", 
    "poster_url": "MeAndOrsonWelles.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "TheGreatBeauty", 
            "name": "The Great Beauty", 
            "poster_url": "TheGreatBeauty.jpg"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "KamenRider", 
            "name": "Kamen Rider"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "TheCommitments", 
            "name": "The Commitments", 
            "poster_url": "TheCommitments.jpg"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "MeAndOrsonWelles", 
    "name": "Me and Orson Welles"
}