{
    "plot": "After super-villain Megamind (Ferrell) kills his good-guy nemesis, Metro Man (Pitt), he becomes bored since there is no one left to fight. He creates a new foe, Titan (Hill), who, instead of using his powers for good, sets out to destroy the world, positioning Megamind to save the day for the first time in his life.", 
    "genres": "Animation, Action, Comedy", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "malicious", 
                    "good", 
                    "facial", 
                    "massive", 
                    "Tighten/Titan/Hal", 
                    "main"
                ], 
                "role": "Megamind has one of those  not being a particularly malicious person and turning good in the end. And it is one \"nice\" goatee.\n In contrast, Metro Man has no facial hair at all.  Until he faked his death to give up the hero gig and grew a massive beard (either as a disguise or out of sheer laziness).\n Also,  Tighten/Titan/Hal has no beard to speak of, and is actually the main antagonist of the film. Then again, the movie makes a point of subverting the superhero tropes pretty thoroughly.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "Last"
                ], 
                "role": "Megamind. That guy has Ho Yay, Foe Yay or both with pretty much every guy in the movie, and yet he never gets explicit about any of them in that way (Dreamworks kids' movie, remember?) and actually ends up with Roxanne by the end of the movie following a naturally progressing relationship (so no Last Minute Hook Up there).", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "crazy", 
                    "intellectual"
                ], 
                "role": "Hal Stewart in Megamind, who goes crazy after Roxanne Ritchi rejects him for \"intellectual dweeb\" Bernard, who is actually Megamind himself in disguise.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "first", 
                    "sympathetic", 
                    "apparent", 
                    "insensitive", 
                    "actual", 
                    "childish"
                ], 
                "role": "Subverted in Megamind. Hal seems like a Type 1 in the making at first, his attempts to win Roxanne's attention are sympathetic or creepy even at the very beginning. Either way, it quickly becomes apparent that he is, at best, highly insensitive to her actual feelings, not to mention mildly delusional. In the end,  far from winning her over, his childish attitude toward Roxanne contributes to his proving to be the villain of the piece .", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "full-blown"
                ], 
                "role": "Hal from Megamind thinks that Roxanne will automatically swoon into his arms after he gains superhero powers and shows them off to her. When she doesn't and displays interest in another man instead, he snaps and becomes a full-blown villain.", 
                "id": "PrinceCharmingWannabe"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "same"
                ], 
                "role": "By the same author, there's the crossover fic with Megamind, called Protectors, only this girl, Rikki, is Roxanne's elder sister. She's just as awesome, but not just to Roxanne; she's this to all the kids.", 
                "id": "CoolBigSis"
            }
        ]
    }, 
    "imdbid": "tt1001526", 
    "poster_url": "Megamind.jpg", 
    "similar": [
        {
            "shared": [
                "DoggedNiceGuy", 
                "BeardOfEvil", 
                "PrinceCharmingWannabe"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "Super", 
            "name": "Super", 
            "poster_url": "Super.jpg"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "WeekendAtBernies", 
            "name": "Weekend at Bernie's", 
            "poster_url": "WeekendAtBernies.jpg"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "ShowMeLove", 
            "name": "Show Me Love", 
            "poster_url": "ShowMeLove.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "HorribleBosses", 
            "name": "Horrible Bosses", 
            "poster_url": "HorribleBosses.jpg"
        }
    ], 
    "id": "Megamind", 
    "name": "Megamind"
}