{
    "plot": "Shou's father Norio finds his son in a rather meaningless existence in Tokyo dominated by alcohol and porn videos. Having left home two years earlier to pursue life as a musician, Shou has left his band and his girlfriend has left him. His father asks a favor, that Shou clean out the apartment of his aunt Matsuko, who he says led a meaningless life until her murder at the age of 53. The apartment is filled with garbage bags and is even more unkempt than his apartment has become, and he becomes intrigued with his aunt as details of her life are supplied by a tattooed neighbor and others. Her feelings of neglect by her father Tsunehiro, who favored her chronically ill younger sister, Kumi, translated into becoming a dutiful junior high school teacher devoted to her students until being forced to resign after being blamed for the theft of some money by one of them. Leaving her family due to the disgrace, she had a series of affairs with lovers who physically abused her and did a stint as a massage parlor girl due to her beauty. After her pimp lover dumped her and gave her share of earnings to his new lover, they argued and after killing him she left by train and contemplated suicide. Dissuaded by a lonely barber, she happily set out to build a quiet life with him until the police came to charge her with murder. Upon her release from prison she silently slipped away after finding that the barber had started a new family. Becoming a \"Yakusa Girl\" she rationalized that it was better to be on the run with a mobster than be alone. However, her mobster lover rejected her after being released from a term in prison and she became an eccentric recluse. Shou concludes that his aunt fulfilled his ex-girlfriend's parting comment about it being better to give to others rather than expecting to receive.", 
    "genres": "Comedy, Drama, Musical", 
    "release_year": "2006", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "little"
                ], 
                "role": "Ill Girl: Matsuko's little sister.", 
                "id": "IllGirl"
            }
        ]
    }, 
    "imdbid": "tt0768120", 
    "similar": [
        {
            "shared": [
                "IllGirl"
            ], 
            "shared_count": 1, 
            "id": "Innerspace", 
            "name": "Innerspace", 
            "poster_url": "Innerspace.jpg"
        }, 
        {
            "shared": [
                "IllGirl"
            ], 
            "shared_count": 1, 
            "id": "WutheringHeights", 
            "name": "Wuthering Heights", 
            "poster_url": "WutheringHeights.jpg"
        }, 
        {
            "shared": [
                "IllGirl"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "IllGirl"
            ], 
            "shared_count": 1, 
            "id": "Balto", 
            "name": "Balto", 
            "poster_url": "Balto.jpg"
        }, 
        {
            "shared": [
                "IllGirl"
            ], 
            "shared_count": 1, 
            "id": "MyGirl", 
            "name": "My Girl", 
            "poster_url": "MyGirl.jpg"
        }
    ], 
    "id": "MemoriesOfMatsuko", 
    "name": "Memories of Matsuko"
}