{
    "plot": "It's May 1943 at a US Army Air Corps base in England. The four officers and six enlisted men of the Memphis Belle - a B-17 bomber so nicknamed for the girlfriend of its stern and stoic captain, Dennis Dearborn - will soon start their twenty-fifth mission, having completed their previous twenty-four successfully with nary an incident, while fewer and fewer other planes are coming back from their missions at all. If they complete their next mission successfully, they will be the first Army Air Corps B-17 Crew to complete their tour of duty. Visiting communications officer Lt. Col. Bruce Derringer wants to publicize and highly tout their accomplishment, even before it happens, as a long term good news campaign at a time when there is little good news to report. Derringer's plan is against the wishes of the base commander, Col. Craig Harriman, who would prefer to treat the ten as any of his other hard working men. The previous success of the Memphis Belle is despite the disparate natures of the ten men, whose personalities and backgrounds could not be more different. Each of the ten has a differing view of Derringer's publicity campaign as well as to the probable success or failure of what will be their last mission regardless, a dangerous one into enemy territory over the skies of Bremen, Germany.", 
    "genres": "Action, Drama, War", 
    "release_year": "1990", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "A Father to His Men: Dennis likes to think of himself as this. The others respect that he gives it his all, but they also mostly think he's a bit of a dork.", 
                "id": "AFatherToHisMen"
            }
        ]
    }, 
    "imdbid": "tt0100133", 
    "poster_url": "MemphisBelle.jpg", 
    "similar": [
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "Downfall", 
            "name": "Downfall"
        }, 
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "CatherineTheGreat", 
            "name": "Catherine The Great", 
            "poster_url": "CatherineTheGreat.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "TheKeep", 
            "name": "The Keep", 
            "poster_url": "TheKeep.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "BeneathHill60", 
            "name": "Beneath Hill 60", 
            "poster_url": "BeneathHill60.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen"
            ], 
            "shared_count": 1, 
            "id": "Lincoln", 
            "name": "Lincoln", 
            "poster_url": "Lincoln.jpg"
        }
    ], 
    "id": "MemphisBelle", 
    "name": "Memphis Belle"
}