{
    "plot": "Frank Quinlan and Huey Driscoll, two reporters from a Chicago-based tabloid, along with Dorothy Winters, an 'angel expert', are asked to travel to rural Iowa to investigate a claim from an old woman that she shares her house with a real, live archangel named Michael. Upon arrival, they see that her claims are true - but Michael is not what they expected: he smokes, drinks beer, has a very active libido and has a rather colourful vocabulary. In fact, they would never believe it were it not for the two feathery wings protruding from his back. Michael agrees to travel to Chicago with the threesome, but what they don't realise is that the journey they are about to undertake will change their lives forever.", 
    "genres": "Comedy, Drama, Fantasy", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "sole", 
                    "female", 
                    "magical"
                ], 
                "role": "In Michael, John Travolta's character has this power over most of the women in the film — the sole exception being Dorothy, the female lead. Frank asks Dorothy at one point just what it is that women see in the angel. She doesn't have a clue. Michael lampshades the trope by claiming that he put a \"block\" on Dorothy. But Michael is an angel, so it's not out of keeping for him to have magical powers. This is presumably the source of his power over women, and how he can arbitrarily \"block\" Dorothy", 
                "id": "SexyManInstantHarem"
            }
        ]
    }, 
    "imdbid": "tt0117038", 
    "poster_url": "Michael.jpg", 
    "similar": [
        {
            "shared": [
                "SexyManInstantHarem"
            ], 
            "shared_count": 1, 
            "id": "EightAndAHalf", 
            "name": "8½"
        }, 
        {
            "shared": [
                "SexyManInstantHarem"
            ], 
            "shared_count": 1, 
            "id": "CatalinaCaper", 
            "name": "Catalina Caper"
        }, 
        {
            "shared": [
                "SexyManInstantHarem"
            ], 
            "shared_count": 1, 
            "id": "TheWitchesOfEastwick", 
            "name": "The Witches of Eastwick", 
            "poster_url": "TheWitchesOfEastwick.jpg"
        }, 
        {
            "shared": [
                "SexyManInstantHarem"
            ], 
            "shared_count": 1, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "SexyManInstantHarem"
            ], 
            "shared_count": 1, 
            "id": "ptitlenzlwumi9", 
            "name": "8½"
        }
    ], 
    "id": "Michael", 
    "name": "Michael"
}