{
    "plot": "This panoramic tale of Savannah's eccentricities focuses on a murder and the subsequent trial of Jim Williams: self made man, art collector, antiques dealer, bon vivant and semi-closeted homosexual. John Kelso a magazine reporter finds himself in Savannah amid the beautiful architecture and odd doings to write a feature on one of William's famous Christmas parties. He is intrigued by Williams from the start, but his curiosity is piqued when he meets Jim's violent, young and sexy lover, Billy. Later that night, Billy is dead, and Kelso stays on to cover the murder trial. Along the way he encounters the irrepressible Lady Chablis, a drag queen commedienne, Sonny Seiler, lawyer to Williams, whose famous dog UGA is the official mascot of the Georgia Bulldogs, an odd man who keeps flies attached to mini leashes on his lapels and threatens daily to poison the water supply, the Married Ladies Card Club, and Minerva, a spiritualist. Between being Jim's buddy, cuddling up to a torch singer, meeting every eccentric in Savannah, participating in midnight graveyard rituals and helping solve the mysteries surrounding Billy's murder, Kelso has his hands full.", 
    "genres": "Crime, Drama, Mystery", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "good", 
                    "many", 
                    "cast"
                ], 
                "role": "A good many of the cast in Midnight in the Garden of Good and Evil.", 
                "id": "GoodOlBoy"
            }, 
            {
                "adjectives": [
                    "Many", 
                    "different", 
                    "classic"
                ], 
                "role": "Good Ol' Boy: Many different flavors are sampled, the most classic example of the trope being Jim's lawyer Sonny.", 
                "id": "GoodOlBoy"
            }
        ]
    }, 
    "imdbid": "tt0119668", 
    "poster_url": "MidnightInTheGardenOfGoodAndEvil.jpg", 
    "similar": [
        {
            "shared": [
                "GoodOlBoy"
            ], 
            "shared_count": 1, 
            "id": "TheBirdcage", 
            "name": "The Birdcage", 
            "poster_url": "TheBirdcage.jpg"
        }, 
        {
            "shared": [
                "GoodOlBoy"
            ], 
            "shared_count": 1, 
            "id": "EasyRider", 
            "name": "Easy Rider", 
            "poster_url": "EasyRider.jpg"
        }, 
        {
            "shared": [
                "GoodOlBoy"
            ], 
            "shared_count": 1, 
            "id": "Tank", 
            "name": "Tank", 
            "poster_url": "Tank.jpg"
        }, 
        {
            "shared": [
                "GoodOlBoy"
            ], 
            "shared_count": 1, 
            "id": "TheGumballRally", 
            "name": "The Gumball Rally", 
            "poster_url": "TheGumballRally.jpg"
        }, 
        {
            "shared": [
                "GoodOlBoy"
            ], 
            "shared_count": 1, 
            "id": "Man-Thing", 
            "name": "Man-Thing", 
            "poster_url": "Man-Thing.jpg"
        }
    ], 
    "id": "MidnightInTheGardenOfGoodAndEvil", 
    "name": "Midnight in the Garden of Good and Evil"
}