{
    "plot": "Six teenagers Tommy, Kimberly, Adam, Billy, Rocky and Aisha have discovered the power to fight the forces of evil. A giant egg is unearthed in Angel Grove. Lord Zedd and Rita Repulsa investigate the egg, and release the creature inside - Ivan Ooze, whom Zordon had trapped him inside the egg six thousand years ago. Once released, Ooze left to seek revenge on Zordon. And now Zordon in his crystalline deathbed is dying because he has no power, without the power then Zordon of Eltar will never existed. Now the fate of the universe is in their hands. But this time the Power Rangers head for a distant planet to meet up with a bikini-clad warrior babe named Dulcea who imparts ancient wisdom and power. But now that they have their powers back and becomes Power Rangers once more they will now get back to business and defeat Ivan Ooze at all costs.", 
    "genres": "Action, Adventure, Family", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "early", 
                    "imparable", 
                    "odd"
                ], 
                "role": "A Father to Us All: Kimberly said this to Zordon. In an early script, Dulcea said Zordon was an inspiration. If he dies, a part of those he inspired dies with him, and the universe will suffer an \"imparable blow\". ...which was odd, given the ending of Power Rangers in Space. However, that was a Heroic Sacrifice.", 
                "id": "AFatherToHisMen"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Australian"
                ], 
                "role": "Ms. Fanservice: Dulcea, obviously, but we can't forget about Kimberly's outfit. Inverted with Aisha was wearing a sweatshirt and sweatpants. Poor Karan Ashley mentioned in an interview that she almost had a heatstroke multiple times being dressed like that in the Australian summer and still do action scenes.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "provocative", 
                    "wide", 
                    "fabric", 
                    "top", 
                    "much", 
                    "Gaze-ish"
                ], 
                "role": "Nubile Savage: Dulcea. There was actually a little bit of outrage over the outfit, while it shows a lot of skin it wasn't too provocative (a skirt made of wide strips of fabric and a top that didn't show much cleavage), but a publicity photo showing her pining Tommy to the ground had a Male Gaze-ish angle and made it look worse than it was.", 
                "id": "NubileSavage"
            }
        ]
    }, 
    "imdbid": "tt0113820", 
    "poster_url": "MightyMorphinPowerRangers.jpg", 
    "similar": [
        {
            "shared": [
                "NubileSavage", 
                "MsFanservice", 
                "AFatherToHisMen"
            ], 
            "shared_count": 3, 
            "id": "MightyMorphinPowerRangersTheMovie", 
            "name": "Mighty Morphin' Power Rangers: The Movie", 
            "poster_url": "MightyMorphinPowerRangersTheMovie.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "WereTheMillers", 
            "name": "We're the Millers", 
            "poster_url": "WereTheMillers.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "RedCliff", 
            "name": "Red Cliff", 
            "poster_url": "RedCliff.jpg"
        }, 
        {
            "shared": [
                "NubileSavage", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "Tarzan", 
            "name": "Tarzan", 
            "poster_url": "Tarzan.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "Pukar", 
            "name": "Pukar", 
            "poster_url": "Pukar.jpg"
        }
    ], 
    "id": "MightyMorphinPowerRangers", 
    "name": "Mighty Morphin' Power Rangers: The Movie"
}