{
    "plot": "Six teenagers Tommy, Kimberly, Adam, Billy, Rocky and Aisha have discovered the power to fight the forces of evil. A giant egg is unearthed in Angel Grove. Lord Zedd and Rita Repulsa investigate the egg, and release the creature inside - Ivan Ooze, whom Zordon had trapped him inside the egg six thousand years ago. Once released, Ooze left to seek revenge on Zordon. And now Zordon in his crystalline deathbed is dying because he has no power, without the power then Zordon of Eltar will never existed. Now the fate of the universe is in their hands. But this time the Power Rangers head for a distant planet to meet up with a bikini-clad warrior babe named Dulcea who imparts ancient wisdom and power. But now that they have their powers back and becomes Power Rangers once more they will now get back to business and defeat Ivan Ooze at all costs.", 
    "genres": "Action, Adventure, Family", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "A Father to Us All: Kimberly said this to Zordon-\"Ever since you came into our lives you've been like a father to us all\".", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "early", 
                    "imparable", 
                    "odd"
                ], 
                "role": "Kimberly states this in the film version of Mighty Morphin' Power Rangers: The Movie when she tells Zordon that he has been \"a father to us all\" as he is dying.\n In an early script, Dulcea said Zordon was an inspiration. If he dies, a part of those he inspired dies with him, and the universe will suffer an \"imparable blow\".\n ...which was odd, given the ending of Power Rangers in Space.", 
                "id": "AFatherToHisMen"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Amazonian", 
                    "tall", 
                    "fit"
                ], 
                "role": "Amazonian Beauty: Dulcea, the tall, fit master warrior of Phaedos who defeated a flock of mooks and pinned Tommy with her staff effortlessly.", 
                "id": "AmazonianBeauty"
            }, 
            {
                "adjectives": [
                    "first", 
                    "due", 
                    "natural", 
                    "martial", 
                    "trouble", 
                    "second", 
                    "new", 
                    "magnetic"
                ], 
                "role": "Damsel in Distress: Kimberly twice. The first time was when a zombie mastodon cornered her and Tommy came in. This one is justified due to being Brought Down to Normal (Kim is a natural gymnast, not a martial artist) and even Tommy had trouble with it. The second time was when her new Zord was trapped in Ooze's \"electro magnetic zekze lock\" but she used her thrusters to get out of that one.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "close", 
                    "Australian"
                ], 
                "role": "Ms. Fanservice: Dulcea, obviously. Kimberly's outfit also counts. Inverted with Aisha, who was wearing a sweatshirt and sweatpants. Poor Karan Ashley mentioned in an interview that she came very close to developing heatstroke more than once in the Australian summer heat.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "provocative", 
                    "wide", 
                    "fabric", 
                    "top", 
                    "much", 
                    "Gaze-ish"
                ], 
                "role": "Nubile Savage: Dulcea. There was a little bit of outrage over the outfit, while it shows a lot of skin it wasn't too provocative (a skirt made of wide strips of fabric and a top that didn't show much cleavage), but a publicity photo showing her pinning Tommy to the ground had a Male Gaze-ish angle and made it look worse than it was.", 
                "id": "NubileSavage"
            }
        ]
    }, 
    "imdbid": "tt0113820", 
    "poster_url": "MightyMorphinPowerRangersTheMovie.jpg", 
    "similar": [
        {
            "shared": [
                "DamselInDistress", 
                "MsFanservice", 
                "NubileSavage"
            ], 
            "shared_count": 3, 
            "id": "Tarzan", 
            "name": "Tarzan", 
            "poster_url": "Tarzan.jpg"
        }, 
        {
            "shared": [
                "NubileSavage", 
                "MsFanservice", 
                "AFatherToHisMen"
            ], 
            "shared_count": 3, 
            "id": "MightyMorphinPowerRangers", 
            "name": "Mighty Morphin' Power Rangers: The Movie", 
            "poster_url": "MightyMorphinPowerRangers.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "RedHotRidingHood", 
            "name": "Red Hot Riding Hood"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "CrocodileDundee", 
            "name": "Crocodile Dundee", 
            "poster_url": "CrocodileDundee.jpg"
        }
    ], 
    "id": "MightyMorphinPowerRangersTheMovie", 
    "name": "Mighty Morphin' Power Rangers: The Movie"
}