{
    "plot": "The manager of England's national football unexpectedly succumbs to a heart attack, and suddenly the search is on for a replacement. Most people who seem qualified for the position have the good sense to turn it down, and so the responsibility falls to Mike Bassett, a scruffy and loud-mouthed lout whose claim to football fame is leading a previously undistinguished team to a league championship. Bassett insists that England will win the World Cup under his leadership, but that's before he replaces his star player with a once-gifted footballer who has since developed a drinking problem, and hired a one-time car salesman as his assistant. After stunning losses to Poland and Belgium, Bassett goes from a favorite of both fans and the press to one of the most hated men in England; hoping to whip his team into shape, he subjects them to the high-tech training methods of eccentric Dr. Shoegaarten, which injures more players than it helps. Despite Bassett's ineptitude, England manages to qualify for the World Cup tournament thanks to group opponents Turkey losing their final game, and he flies to Rio with his team in hopes of somehow turning their bad luck around.", 
    "genres": "Comedy, Sport", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "inordinate", 
                    "deleted", 
                    "young"
                ], 
                "role": "Dirty Old Man: Jack Marshall, the England physio, seems to take inordinate levels of care when inspecting the players' groins. In a deleted scene, he also gleefully talks at length about how his job involves \"rubbing young men's thighs.\"", 
                "id": "DirtyOldMan"
            }
        ]
    }, 
    "imdbid": "tt0282744", 
    "poster_url": "MikeBassettEnglandManager.jpg", 
    "similar": [
        {
            "shared": [
                "DirtyOldMan"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "DirtyOldMan"
            ], 
            "shared_count": 1, 
            "id": "AHardDaysNight", 
            "name": "A Hard Day's Night", 
            "poster_url": "AHardDaysNight.jpg"
        }, 
        {
            "shared": [
                "DirtyOldMan"
            ], 
            "shared_count": 1, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "DirtyOldMan"
            ], 
            "shared_count": 1, 
            "id": "AgentForHARM", 
            "name": "Agent for H.A.R.M.", 
            "poster_url": "AgentForHARM.jpg"
        }, 
        {
            "shared": [
                "DirtyOldMan"
            ], 
            "shared_count": 1, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }
    ], 
    "id": "MikeBassettEnglandManager", 
    "name": "Mike Bassett England Manager"
}