{
    "plot": "In the year 2054 A.D. crime is virtually eliminated from Washington D.C. thanks to an elite law enforcing squad \"Precrime\". They use three gifted humans (called \"Pre-Cogs\") with special powers to see into the future and predict crimes beforehand. John Anderton heads Precrime and believes the system's flawlessness steadfastly. However one day the Pre-Cogs predict that Anderton will commit a murder himself in the next 36 hours. Worse, Anderton doesn't even know the victim. He decides to get to the mystery's core by finding out the 'minority report' which means the prediction of the female Pre-Cog Agatha that \"might\" tell a different story and prove Anderton innocent.", 
    "genres": "Action, Mystery, Sci-Fi", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "illegal", 
                    "pre-crime"
                ], 
                "role": "In Minority Report, the trope is both subverted and played straight. For a while, it seems as if John Anderton will become a murderer, since he's already abusing illegal drugs to cope with the death of his son. In fact, it's his boss, Lamar Burgess, who has been committing murders to validate the pre-crime system.", 
                "id": "LawmanGoneBad"
            }, 
            {
                "adjectives": [
                    "illegal", 
                    "pre-crime"
                ], 
                "role": "Lawman Gone Bad: The trope is both subverted and played straight. For a while, it seems as if John Anderton will become a murderer, since he's already abusing illegal drugs to cope with the death of his son. In fact, it's his boss, Lamar Burgess, who has been committing murders to validate the pre-crime system.", 
                "id": "LawmanGoneBad"
            }
        ]
    }, 
    "imdbid": "tt0181689", 
    "poster_url": "MinorityReport.jpg", 
    "similar": [
        {
            "shared": [
                "LawmanGoneBad"
            ], 
            "shared_count": 1, 
            "id": "TheDarkKnight", 
            "name": "The Dark Knight", 
            "poster_url": "TheDarkKnight.jpg"
        }, 
        {
            "shared": [
                "LawmanGoneBad"
            ], 
            "shared_count": 1, 
            "id": "HardRain", 
            "name": "Hard Rain", 
            "poster_url": "HardRain.jpg"
        }, 
        {
            "shared": [
                "LawmanGoneBad"
            ], 
            "shared_count": 1, 
            "id": "MadMax", 
            "name": "Mad Max", 
            "poster_url": "MadMax.jpg"
        }, 
        {
            "shared": [
                "LawmanGoneBad"
            ], 
            "shared_count": 1, 
            "id": "TheGodfather", 
            "name": "The Godfather", 
            "poster_url": "TheGodfather.jpg"
        }, 
        {
            "shared": [
                "LawmanGoneBad"
            ], 
            "shared_count": 1, 
            "id": "ItsAMadMadMadMadWorld", 
            "name": "It's a Mad, Mad, Mad, Mad World", 
            "poster_url": "ItsAMadMadMadMadWorld.jpg"
        }
    ], 
    "id": "MinorityReport", 
    "name": "Minority Report"
}