{
    "plot": "At the Macy's Department Store Thanksgiving Day parade, the actor playing Santa is discovered to be drunk by a whiskered old man. Doris Walker, the no nonsense special events director, persuades the old man to take his place. The old man proves to be a sensation and is quickly recruited to be the store Santa at the main Macy's outlet. While he is successful, Ms. Walker learns that he calls himself Kris Kringle and he claims to be the actual Santa Claus. Despite reassurances by Kringle's doctor that he is harmless, Doris still has misgivings, especially when she has cynically trained herself, and especially her daughter, Susan, to reject all notions of belief and fantasy. And yet, people, especially Susan, begin to notice there is something special about Kris and his determination to advance the true spirit of Christmas amidst the rampant commercialism around him and succeeding in improbable ways. When a raucous conflict with the store's cruelly incompetent psychologist erupts, Kris finds himself held at Bellevue where, in despair, he deliberates fails a mental examination to ensure his commitment. All seems lost until Doris' friend, Fred Gaily, reassure Kris of his worth and agrees to represent him in the fight to secure his release. To achieve that, Fred arranges a formal hearing in which he argues that Kris is sane because he is in fact Santa Claus. What ensues is a bizarre hearing in which people's beliefs are reexamined and put to the test, but even so, it's going to take a miracle for Kris to win.", 
    "genres": "Comedy, Drama, Family", 
    "release_year": "1947", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "due", 
                    "own"
                ], 
                "role": "Broken Bird: Doris raises Susan without fairy tales or fantasies of any kind due to her own heartbreak of her failed marriage.", 
                "id": "BrokenBird"
            }
        ]
    }, 
    "imdbid": "tt0039628", 
    "poster_url": "MiracleOnThirtyFourthStreet.jpg", 
    "similar": [
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "PracticalMagic", 
            "name": "Practical Magic", 
            "poster_url": "PracticalMagic.jpg"
        }, 
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "Scarecrow", 
            "name": "Scarecrow", 
            "poster_url": "Scarecrow.jpg"
        }, 
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "SevenFacesOfDrLao", 
            "name": "7 Faces of Dr. Lao", 
            "poster_url": "SevenFacesOfDrLao.jpg"
        }
    ], 
    "id": "MiracleOnThirtyFourthStreet", 
    "name": "Miracle on 34th Street"
}