{
    "plot": "War threatens London as Miss Pettigrew, a destitute governess, filches a client's card from her agency and presents herself at the door. A singer named Delysia Lafosse wants a social secretary as she seeks a West End role by sleeping with a feckless producer in the bed of Nick, a smarmy nightclub owner with whom she also dallies. She ignores Michael, her piano player, who loves her and has tickets for New York on the Queen Mary. Miss Pettigrew's job is to make sure Delysia gets the part. Over 24 hours, Miss Pettigrew is also called upon to help an ambitious and unfaithful fashion editor patch things up with her older fiancé, a lingerie designer. Has Miss Pettigrew found her calling?", 
    "genres": "Comedy, Romance", 
    "release_year": "2008", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "British"
                ], 
                "role": "Delysia Lafosse to uptight British governess Miss Pettigrew in Miss Pettigrew Lives for a Day, although there's a bit of sharing going on and Delysia actually matures because of Miss Pettigrew as well.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "clear", 
                    "unsustainable", 
                    "female"
                ], 
                "role": "Manic Pixie Dream Girl: Well, Delysia is played by Amy Adams...  Except in her case, it's made clear that the character realizes her lifestyle is unsustainable, and that the public persona is largely a mask she uses to emotionally manipulate others. If anything, Miss Pettigrew is the character who helps others find their truest desires. Through calm, heart-to-heart discussions. The film has been called a female buddy flick for a reason.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt0970468", 
    "poster_url": "MissPettigrewLivesForADay.jpg", 
    "similar": [
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Lo", 
            "name": "Lo"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "LAStory", 
            "name": "LA Story"
        }
    ], 
    "id": "MissPettigrewLivesForADay", 
    "name": "Miss Pettigrew Lives for a Day"
}