{
    "plot": "A city of monsters with no humans called Monstropolis centers around the city's power company, Monsters, Inc. The lovable, confident, tough, furry blue behemoth-like giant monster named James P. Sullivan (better known as Sulley) and his wisecracking best friend, short, green cyclops monster Mike Wazowski, discover what happens when the real world interacts with theirs in the form of a 2-year-old baby girl dubbed \"Boo,\" who accidentally sneaks into the monster world with Sulley one night. And now it's up to Sulley and Mike to send Boo back in her door before anybody finds out, especially two evil villains such as Sulley's main rival as a scarer, chameleon-like Randall (a monster that Boo is very afraid of), who possesses the ability to change the color of his skin, and Mike and Sulley's boss Mr. Waternoose, the chairman and chief executive officer of Monsters, Inc.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2001", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "cute", 
                    "other", 
                    "monstrous"
                ], 
                "role": "Celia from Monsters, Inc..\n Monsters University splits this trope down the middle: Claire Wheeler and the Python Nu Kappa sisters are on the \"cute\" side, while the other sororities and Dean Hardscrabble are on the \"monstrous\" side.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "perspective"
                ], 
                "role": "Cute Monster Girl: Celia. Boo, from Sulley's perspective.", 
                "id": "CuteMonsterGirl"
            }
        ]
    }, 
    "imdbid": "tt0198781", 
    "poster_url": "MonstersInc.jpg", 
    "similar": [
        {
            "shared": [
                "CuteMonsterGirl"
            ], 
            "shared_count": 1, 
            "id": "Gremlins", 
            "name": "Gremlins", 
            "poster_url": "Gremlins.jpg"
        }, 
        {
            "shared": [
                "CuteMonsterGirl"
            ], 
            "shared_count": 1, 
            "id": "ZombieStrippers", 
            "name": "Zombie Strippers", 
            "poster_url": "ZombieStrippers.jpg"
        }, 
        {
            "shared": [
                "CuteMonsterGirl"
            ], 
            "shared_count": 1, 
            "id": "Halloweentown", 
            "name": "Halloweentown", 
            "poster_url": "Halloweentown.jpg"
        }, 
        {
            "shared": [
                "CuteMonsterGirl"
            ], 
            "shared_count": 1, 
            "id": "Species", 
            "name": "Species", 
            "poster_url": "Species.jpg"
        }, 
        {
            "shared": [
                "CuteMonsterGirl"
            ], 
            "shared_count": 1, 
            "id": "LetTheRightOneIn", 
            "name": "Let the Right One In", 
            "poster_url": "LetTheRightOneIn.jpg"
        }
    ], 
    "id": "MonstersInc", 
    "name": "Monsters, Inc."
}