{
    "plot": "The movie starts out with Arthur, King of the Britons, looking for knights to sit with him at Camelot. He finds many knights including Sir Galahad the pure, Sir Lancelot the brave, the quiet Sir Bedevere, and Sir Robin the Not-Quite-So-Brave-as-Sir Lancelot. They do not travel on horses, but pretend they do and have their servants bang coconuts to make the sound of horse's hooves. Through satire of certain events in history (witch trials, the black plague) they find Camelot, but after literally a quick song and dance they decide that they do not want to go there. While walking away, God (who seems to be grumpy) come to them from a cloud and tells them to find the Holy Grail. They agree and begin their search. While they search for the Grail, scenes of the knight's tales appear and why they have the name they have. Throughout their search they meet interesting people and knights along the way. Most of the characters die; some through a killer rabbit (which they defeat with the holy hand grenade), others from not answering a question right from the bridge of Death, or die some other ridiculous way. In the end, King Arthur and Sir Bedevere are left and find the Castle Arrrghhh where the Holy Grail is. They are met by some French soldiers who taunted them earlier in the film, so they were not able to get into the castle.", 
    "genres": "Adventure, Comedy, Fantasy", 
    "release_year": "1975", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Distressed"
                ], 
                "role": "Distressed Dude: The Swamp Prince is in need of rescuing. Lancelot thinks he's a Distressed Damsel.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "first", 
                    "song"
                ], 
                "role": "Miles Gloriosus: \"Brave\" Sir Robin, who has a troupe of troubadours to follow him about and sing of his praises. Unfortunately he runs away at the first sign of danger, and they incorporate his cowardice into their song....", 
                "id": "MilesGloriosus"
            }, 
            {
                "adjectives": [
                    "Not-Quite-So-Brave-as-Sir-Lancelot", 
                    "vicious"
                ], 
                "role": "\"Sir Robin the Not-Quite-So-Brave-as-Sir-Lancelot, who had nearly fought the Dragon of Angnor, who had nearly stood up to the vicious Chicken of Bristol, and who had personally wet himself at the Battle of Badon Hill\" from Monty Python and the Holy Grail.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Lancelot in Monty Python and the Holy Grail \"rescuing\" Galahad from the \"clutches\" of the girls of Castle Anthrax. Though the fact that Galahad was Lancelot's son was never mentioned in the film, it can be assumed that he was intended to be (as in the source material) as the Pythons knew their Arthuriana.", 
                "id": "OverprotectiveDad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "very", 
                    "ostentatiously-hyper-masculine", 
                    "personal", 
                    "young", 
                    "interested", 
                    "big"
                ], 
                "role": "After Launcelot \"saves\" him from Castle Anthrax, Galahad accuses Launcelot of being gay, which he denies. Subsequently, we see Launcelot rush to a castle to rescue a \"damsel\" who turns out to be the very effeminate Prince Herbert — who already had an escape plan. So not-gay, ostentatiously-hyper-masculine Launcelot ends up answering the personal ad of a young feminine guy who isn't at all interested in marrying a girl with big breasts.", 
                "id": "DeliberatelyDistressedDamsel"
            }, 
            {
                "adjectives": [], 
                "role": "Gag Boobs: Referenced. Huge... tracts of land.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "huge", 
                    "vast", 
                    "good", 
                    "swamp-like", 
                    "actual", 
                    "large", 
                    "relative"
                ], 
                "role": "Monty Python and the Holy Grail - \"And she has huge... tracts of land!\" This is a subversion, though. The Lord of Swamp Castle actually is referring to the bride's vast holdings of good, not at all swamp-like land. The bride's actual breasts are not shown to be particularly large relative to the rest of her body.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [], 
                "role": "Girl in the Tower: Parodied. First, it's a guy, and it only gets worse from there.", 
                "id": "GirlInTheTower"
            }, 
            {
                "adjectives": [], 
                "role": "In Monty Python and the Holy Grail, Lancelot goes to rescue a damsel in distress from the Tall Tower. Hilarity Ensues.", 
                "id": "GirlInTheTower"
            }, 
            {
                "adjectives": [
                    "8-score", 
                    "pseudo-nun", 
                    "Grail-shaped", 
                    "other"
                ], 
                "role": "Castle Anthrax in Monty Python and the Holy Grail is populated by 8-score blondes and brunettes between the ages of 17 and 19 and a half, in pseudo-nun habits, with a Grail-shaped beacon atop the castle.\n And the punishment for lighting the beacon is a spanking... for both the nun that lit it and every other sister in the castle.", 
                "id": "NaughtyNuns"
            }, 
            {
                "adjectives": [
                    "whole"
                ], 
                "role": "In Monty Python and the Holy Grail, there's a whole castle of vamps.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0071853", 
    "poster_url": "MontyPythonAndTheHolyGrail.jpg", 
    "similar": [
        {
            "shared": [
                "TheVamp", 
                "OverprotectiveDad"
            ], 
            "shared_count": 2, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad", 
                "GagBoobs"
            ], 
            "shared_count": 2, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }, 
        {
            "shared": [
                "DistressedDude", 
                "GirlInTheTower"
            ], 
            "shared_count": 2, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "GagBoobs", 
                "MilesGloriosus"
            ], 
            "shared_count": 2, 
            "id": "Rango", 
            "name": "Rango", 
            "poster_url": "Rango.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "TheVamp"
            ], 
            "shared_count": 2, 
            "id": "SleepyHollow", 
            "name": "Sleepy Hollow", 
            "poster_url": "SleepyHollow.jpg"
        }
    ], 
    "id": "MontyPythonAndTheHolyGrail", 
    "name": "Monty Python and the Holy Grail"
}