{
    "plot": "Loretta Castorini, a Brooklyn bookkeeper in her late 30s whose husband died several years earlier in a bus accident, decides it's time to get married again. So she accepts the proposal of a nice, middle-aged fellow named Johnny Cammareri. Loretta is convinced her first marriage was cursed because she and her husband had gotten married at City Hall; this time, she's determined to do things right, even as she admits to her mother, Rose, that she's not really in love with Johnny. (To which Rose replies: \"Good. When you love them, they drive you crazy, 'cause they know they can.\" Rose speaks from rueful experience; she suspects, with good reason, that her husband, Cosmo, is cheating on her.) Loretta is convinced that marrying Johnny is the safe and sure thing to do - until she meets his estranged younger brother Ronny, who tends the ovens in a neighborhood bakery. Loretta discovers that in startling contrast to the pleasant, mild-mannered Johnny, Ronny is moody and passionate; what follow are complications worthy of a comic opera.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1987", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "non-Italian"
                ], 
                "role": "Cool Old Guy: Grandpa. (Also played by a non-Italian.)", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "big"
                ], 
                "role": "Momma's Boy: Johnny (\"Johnny Camareri? He's a big baby.\")", 
                "id": "MommasBoy"
            }
        ]
    }, 
    "imdbid": "tt0093565", 
    "poster_url": "Moonstruck.jpg", 
    "similar": [
        {
            "shared": [
                "CoolOldGuy", 
                "MommasBoy"
            ], 
            "shared_count": 2, 
            "id": "ItsAMadMadMadMadWorld", 
            "name": "It's a Mad, Mad, Mad, Mad World", 
            "poster_url": "ItsAMadMadMadMadWorld.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "MommasBoy"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "MommasBoy"
            ], 
            "shared_count": 2, 
            "id": "Waitress", 
            "name": "Waitress", 
            "poster_url": "Waitress.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "MommasBoy"
            ], 
            "shared_count": 2, 
            "id": "SmokeSignals", 
            "name": "Smoke Signals", 
            "poster_url": "SmokeSignals.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "Moonstruck", 
    "name": "Moonstruck"
}