{
    "plot": "Set in contemporary New York City, a seemingly ordinary teenager, Clary Fray, discovers she is the descendant of a line of Shadowhunters, a secret cadre of young half-angel warriors locked in an ancient battle to protect our world from demons. After the disappearance of her mother, Clary must join forces with a group of Shadowhunters, who introduce her to a dangerous alternate New York called Downworld, filled with demons, warlocks, vampires, werewolves and other deadly creatures.", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Magnus Bane, the High Warlock of Brooklyn, from Cassandra Clare's Mortal Instruments series is this. He features glitter eye shadow, rainbow leather pants, and awsum ass-kicking.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [
                    "skilled", 
                    "large", 
                    "first", 
                    "main", 
                    "alive"
                ], 
                "role": "Jace in The Mortal Instruments series. A recurring plot in almost every book is Jace being held in some form of captivity. This despite the fact that he is one of the most skilled Shadowhunters of his generation. Most of it is that he is a bit of a Death Seeker, and a large amount of effort on the part of his family and friends goes into getting him out of whatever trouble he has gotten into. In the first book his best friend Alec had initially never slain a demon, primarily because his main focus was on keeping Jace alive instead.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "only", 
                    "normal", 
                    "second"
                ], 
                "role": "Simon, in Mortal Instruments, is the only main character that is 100% a mundane and is depicted as totally normal and needs rescuing from a hotel crammed with vampires. However, this is ended when he kills a Greater Demon, and then is turned into a vampire in the second book.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [
                    "stereotypical", 
                    "several"
                ], 
                "role": "Alec Lightwood from the Mortal Instruments series. Doesn't have any stereotypical gay traits, although several people manage to figure it out anyway.", 
                "id": "StraightGay"
            }, 
            {
                "adjectives": [
                    "only", 
                    "archaic"
                ], 
                "role": "Straight Gay:  Alec. Generally the only way gays could be without being expelled from the Clave. Interestingly, homosexuality is not in fact prohibited by the Law. Shadowhunters just tend to look down on it, possibly as a reflection of their slightly archaic culture.", 
                "id": "StraightGay"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "own"
                ], 
                "role": "Naginatas Are Feminine: In City of Ashes Isabelle walks in with her trademark whip and a naginata. When Alec asks if the naginata is for him, she tells him to get his own weapon, promptly giving it to their mother.", 
                "id": "NaginatasAreFeminine"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Clary and Isabelle. Played with in that Clary starts out as The Chick and evolves into a Badass while Isabelle is a Badass Action Girl.", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt1538403", 
    "poster_url": "MortalInstruments.jpg", 
    "similar": [
        {
            "shared": [
                "StraightGay", 
                "AgentPeacock"
            ], 
            "shared_count": 2, 
            "id": "TheBoondockSaints", 
            "name": "The Boondock Saints", 
            "poster_url": "TheBoondockSaints.jpg"
        }, 
        {
            "shared": [
                "DistressedDude", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 2, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 2, 
            "id": "Bandidas", 
            "name": "Bandidas", 
            "poster_url": "Bandidas.jpg"
        }, 
        {
            "shared": [
                "TomBoyAndGirlyGirl", 
                "AgentPeacock"
            ], 
            "shared_count": 2, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "TomBoyAndGirlyGirl", 
                "DistressedDude"
            ], 
            "shared_count": 2, 
            "id": "AngryBirds", 
            "name": "Angry Birds"
        }
    ], 
    "id": "MortalInstruments", 
    "name": "Mortal Instruments"
}