{
    "plot": "The film begins with the finishing of a water canal for the village set in the present. Radha (Nargis), as the mother of the village, is asked to open the canal and remembers back to her past when she was newly married, mirroring the new independence of India. The wedding between Radha and Shamu (Raaj Kumar) was paid for by Radha's mother-in-law, who got a loan from the moneylender Sukhilala. This event starts the spiral of poverty and hardship that Radha endures. The conditions of the loan are disputed, but the village elders decide in favor of the moneylender, after which Shamu and Radha are forced to pay three-quarters of their crop as interest on the loan of 500 rupees. While trying to use more of their land to alleviate their poverty, Shamu's arms are crushed by a boulder. He is shamed by his helplessness and is humiliated by others in the village. Deciding that he is no use to his family, he leaves and does not return. Soon after this, Radha's mother-in-law dies. Radha continues to work in the fields with her children and gives birth again. Sukhilala offers to help alleviate her poverty in return for Radha marrying him, but she refuses to sell herself. A storm sweeps through the village that destroys the harvest and kills Radha's youngest child, and the villagers start to migrate but decide to stay and rebuild because of Radha's urging. The film then skips forward several years to when Radha's two surviving children, Birju (Sunil Dutt) and Ramu (Rajendra Kumar), are young men. Birju, embittered by the exactions of Sukhilala since he was a child, takes out his frustrations by pestering the village girls, especially Sukhilala's daughter. Ramu, by contrast, has a calmer temper and is married soon after. He becomes a father ,but his wife is soon absorbed into the cycle of poverty. Birju's anger finally becomes dangerous and, after being provoked, attacks Sukhilala and his daughter and violently lashes out at his family. He is chased out of the village and becomes a bandit. On the day of the wedding of Sukhilala's daughter, Birju returns to exact vengeance. He kills Sukhilala and takes his daughter--but Radha, who had promised that Birju would not do harm, shoots Birju, who dies in her arms. The film ends with her opening the canal and reddish water flowing into the fields.", 
    "genres": "Drama, Musical, Family", 
    "release_year": "1957", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Keet: Young Birju. So much.", 
                "id": "Keet"
            }, 
            {
                "adjectives": [
                    "Sensitive", 
                    "sensitive"
                ], 
                "role": "Sensitive Guy and Manly Man: Ramu's the sensitive obedient son to Birju's hothead", 
                "id": "SensitiveGuyAndManlyMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "ironic"
                ], 
                "role": "Mama Bear: Radha, which proves to be ironic", 
                "id": "MamaBear"
            }
        ]
    }, 
    "imdbid": "tt0050188", 
    "poster_url": "MotherIndia.jpg", 
    "similar": [
        {
            "shared": [
                "SensitiveGuyAndManlyMan", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "CurseOfTheGoldenFlower", 
            "name": "Curse of the Golden Flower", 
            "poster_url": "CurseOfTheGoldenFlower.jpg"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Zombieland", 
            "name": "Zombieland", 
            "poster_url": "Zombieland.jpg"
        }, 
        {
            "shared": [
                "Keet", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Bolt", 
            "name": "Bolt", 
            "poster_url": "Bolt.jpg"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "SnowFlowerAndTheSecretFan", 
            "name": "Snow Flower and the Secret Fan", 
            "poster_url": "SnowFlowerAndTheSecretFan.jpg"
        }
    ], 
    "id": "MotherIndia", 
    "name": "Mother India"
}