{
    "plot": "Ineffectual, 'has-been' film-maker (Dennis Quaid) swindles his way into an interview with a film executive (Greg Kinnear) in order to pitch an outrageous and controversial comedy manuscript. After pitching the first of his thirteen offbeat fables, the dejected artist forces the rest of his disjointed allegory on the executive at gunpoint. He tells stories of a woman on a blind date with a man who has testicles growing from his neck, in another a smitten woman offers her neck to her boyfriend to 'poop' on -as a sign of commitment and love. In yet another two parents take home-schooling to a whole new level of indecency, striving to give their isolated teenage son all the 'regular' torment and humiliation of puberty by bullying, peer-pressuring and even seducing him themselves. An off-beat, elephant-in-the-room type film.", 
    "genres": "Comedy", 
    "release_year": "2013", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "human", 
                    "other", 
                    "music"
                ], 
                "role": "One of the segments in Movie 43 features an MP3 player that is the size and shape of a human woman. Not surprisingly, the user base ends up using it for \"other purposes\" besides listening to music.", 
                "id": "RobotGirl"
            }
        ]
    }, 
    "imdbid": "tt1333125", 
    "poster_url": "Movie43.jpg", 
    "similar": [
        {
            "shared": [
                "RobotGirl"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }, 
        {
            "shared": [
                "RobotGirl"
            ], 
            "shared_count": 1, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "RobotGirl"
            ], 
            "shared_count": 1, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "RobotGirl"
            ], 
            "shared_count": 1, 
            "id": "RobotechTheShadowChronicles", 
            "name": "Robotech: The Shadow Chronicles", 
            "poster_url": "RobotechTheShadowChronicles.jpg"
        }, 
        {
            "shared": [
                "RobotGirl"
            ], 
            "shared_count": 1, 
            "id": "Metropolis", 
            "name": "Metropolis", 
            "poster_url": "Metropolis.jpg"
        }
    ], 
    "id": "Movie43", 
    "name": "Movie 43"
}