{
    "plot": "Daniel Hillard is an eccentric actor who specializes in dubbing voices for cartoon characters. Daniel is a kind man and a loving father to his three kids Lydia, Chris, and Natalie, but Daniel's wife Miranda sees him as a poor disciplinarian, and a bad role model. After Daniel throws an elaborate and disastrous birthday party for Chris, Miranda reaches the end of her limited patience, and files for a divorce. Daniel is heartbroken when Miranda is given custody of the kids and he's only allowed to visit them once a week. Determined to stay in contact with his kids, Daniel discovers that Miranda is looking for a housekeeper, and with help from his brother Frank, a makeup artist, Daniel gets the job, disguised as Mrs. Iphegenia Doubtfire, a Scottish nanny. Daniel pulls off the ruse so well that neither Miranda nor his children recognize him, and in the process, he learns some parenting tips. Daniel also has to deal with Miranda's new boyfriend, a jerk named Stu Dunmeyer.", 
    "genres": "Comedy, Drama, Family", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Camp Gay: Daniel's brother (played by Harvey Fierstein, no less) and his partner.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [
                    "crazy"
                ], 
                "role": "Crazy Jealous Guy: Daniel over Stuart and Miranda. Starts off as Petty Jealousy Guy but definitely becomes crazy when he poisons his food.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "likely", 
                    "final", 
                    "unable"
                ], 
                "role": "Lastly, something which likely went over the head over most of the children at the final trial scene is that the judge is implying that Daniel is a Depraved Homosexual, unable to be trusted with his kids.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "favorite", 
                    "waitng", 
                    "male"
                ], 
                "role": "To land a role on the American version of his favorite children's show, Jolly Farm (References to both Mrs. Doubtfire and Tootsie also appear in this episode) mainly because as he was waitng to get an audition, he was informed that all the male roles in the show were filled.", 
                "id": "DisguisedInDrag"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "hairy"
                ], 
                "role": "Mrs. Doubtfire does some zigzagging with this trope. Daniel, dressed in drag as Mrs. Doubtfire, boards a bus with his stockings falling down. The bus driver begins flirting with \"her\" and upon noticing some legs that are considerably hairy, the driver admits that he likes women that way.", 
                "id": "HairyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Mrs. Doubtfire: A Rare Male Example is Mrs. Doubtfire (and the book Madam Doubtfire) where a divorced dad crossdresses so he can be hired as a nanny and spend more time with his kids. As you do.", 
                "id": "MagicalNanny"
            }, 
            {
                "adjectives": [
                    "normal"
                ], 
                "role": "Never Mess with Granny: \"Don't...fuss with me\". Also seen when a robber tries to steal his purse. He starts yelling at the man in his normal voice (which scares the crap out of the snatcher), then goes over to Mrs. Doubtfire's voice \"And he broke my purse, the bastard!\"", 
                "id": "NeverMessWithGranny"
            }
        ]
    }, 
    "imdbid": "tt0107614", 
    "poster_url": "MrsDoubtfire.jpg", 
    "similar": [
        {
            "shared": [
                "CampGay", 
                "CrazyJealousGuy", 
                "DisguisedInDrag"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "DepravedHomosexual", 
                "CampGay", 
                "DisguisedInDrag"
            ], 
            "shared_count": 3, 
            "id": "DiamondsAreForever", 
            "name": "Diamonds Are Forever", 
            "poster_url": "DiamondsAreForever.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "DisguisedInDrag"
            ], 
            "shared_count": 2, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "DepravedHomosexual", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "DepravedHomosexual", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "AMidsummerNightsDream", 
            "name": "A Midsummer Night's Dream"
        }
    ], 
    "id": "MrsDoubtfire", 
    "name": "Mrs. Doubtfire"
}