{
    "plot": "It's 1914 in New York City. Adult brother and sister Trippy Trellis and Fanny Trellis, whose parents are now deceased, were once wealthy, but Trippy squandered away the family fortune, about which no one knows except their cousin George Trellis and their many creditors. Fanny and Trippy still put on the façade to the outside world that they have money. The beautiful Fanny can have any man that she wants to marry, but she sets her sights on Job Skeffington, the son of Russian-Jewish immigrants. Job's wealth was self-made in finance. They met as Trippy was once employed by Job in his brokerage house. Fanny and Job, who is now aware of the Trellis' financial straits, ultimately do get married, much to the consternation of Fanny's many suitors, but most specifically to Trippy, who knows the reason why Fanny married him. Job also realizes that Fanny does not love him, but is unaware of the real reason she agreed to marry him. After their marriage, Fanny's suitors are still around with more joining the ranks, which Job does not mind as he is aware that Fanny is not leading them on. But when the reason for Fanny marrying Job no longer exists, their relationship changes. They have to figure out what to do, which now takes into consideration their daughter, also named Fanny. As time goes on, they grow into middle age and Fanny's physical beauty deteriorates, Fanny comes to the realization of what is really important in life.", 
    "genres": "Drama, Romance", 
    "release_year": "1944", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Daddy's Girl: Job's daughter adores him.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "marital"
                ], 
                "role": "Sexy Secretary: Job takes solace in his secretaries after his wife exiles him from the marital bed.", 
                "id": "SexySecretary"
            }
        ]
    }, 
    "imdbid": "tt0037094", 
    "poster_url": "MrSkeffington.jpg", 
    "similar": [
        {
            "shared": [
                "DaddysGirl"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl"
            ], 
            "shared_count": 1, 
            "id": "AnneFrankTheWholeStory", 
            "name": "Anne Frank The Whole Story"
        }, 
        {
            "shared": [
                "SexySecretary"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "SexySecretary"
            ], 
            "shared_count": 1, 
            "id": "IronMan", 
            "name": "Iron Man", 
            "poster_url": "IronMan.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl"
            ], 
            "shared_count": 1, 
            "id": "OurTown", 
            "name": "Our Town", 
            "poster_url": "OurTown.jpg"
        }
    ], 
    "id": "MrSkeffington", 
    "name": "Mr Skeffington"
}