{
    "plot": "14 year-old Ellis (Tye Sheridan) lives on a makeshift houseboat on the banks of a river in Arkansas with his parents, Mary Lee (Sarah Paulson) and Senior (Ray McKinnon). He sneaks out early one morning to meet his best friend, Neckbone (Jacob Lofland). Neckbone, also 14, lives with his uncle, Galen (Michael Shannon), who makes a hardscrabble living diving for oysters. The two boys set out to an island on the Mississippi River, where Neckbone has discovered an unusual sight-a boat, suspended high in the trees, a remnant of an extreme flood some time in the past. They climb the tree and into the boat only to find fresh bread and fresh footprints. Realizing that they are not the only ones who have discovered the treehouse boat, they decide to leave. When they reach the shore, they find the same footprint in their boat. And that's when they meet Mud (Matthew McConaughey). Mud is a gritty, superstitious character; his clothes are dirty, his tooth is cracked, and he needs help. He tells the boys he will give them the treehouse boat, his current hideout, in exchange for food. Neckbone is reluctant, but Ellis brings food to Mud, and they develop a tentative friendship. Ellis learns that Mud has killed a man in Texas, and police and bounty hunters are looking for him, but Mud is more concerned about reuniting with his longtime love, Juniper (Reese Witherspoon). Ellis, who has recently developed his own crush, agrees to help Mud escape with Juniper. Ellis and Neckbone carry out bold schemes in an effort to protect Mud and relay messages to Juniper, who is holed up in a fleabag motel, under constant surveillance by Carver (Paul Sparks), a Texas bounty hunter. Carver and his gang are intent on capturing Mud, on orders from the cold-blooded King (Joe Don Baker). As the boys risk everything to reunite these seeming mythical lovers, Ellis's own ideas about love and romance are challenged by the strains in the relationships closest to him: his parents' marriage is dissolving while he himself falters in his efforts to impress May Pearl (Bonnie Sturdivant). Through it all, Ellis struggles to look for an example of love that he can believe in, learning about the unspoken rules and risks of love and the reality of heartbreak.", 
    "genres": "Drama", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Grandpa: Tom Blankenship, an ex Marine sharpshooter.", 
                "id": "BadassGrandpa"
            }
        ]
    }, 
    "imdbid": "tt1935179", 
    "poster_url": "Mud.jpg", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "Go", 
            "name": "Go"
        }, 
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "Kagemusha", 
            "name": "Kagemusha", 
            "poster_url": "Kagemusha.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "TheMaskOfZorro", 
            "name": "The Mask of Zorro", 
            "poster_url": "TheMaskOfZorro.jpg"
        }
    ], 
    "id": "Mud", 
    "name": "Mud"
}