{
    "plot": "This retelling of the old Chinese folktale is about the story of a young Chinese maiden who learns that her weakened and lame father is to be called up into the army in order to fight the invading Huns. Knowing that he would never survive the rigours of war in his state, she decides to disguise herself and join in his place. Unknown to her, her ancestors are aware of this and to prevent it, they order a tiny disgraced dragon, Mushu to join her in order to force her to abandon her plan. He agrees, but when he meets Mulan, he learns that she cannot be dissuaded and so decides to help her in the perilous times ahead.", 
    "genres": "Animation, Adventure, Family", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "In Mulan, Shang is noticeably smitten with Mulan after she saves the Emperor from the Huns and it's heavily implied that he was confused about his attraction towards her while she was disguised as Ping.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "ambiguous", 
                    "male"
                ], 
                "role": "Yao of Mulan. Made all the more ambiguous by the fact that he's voiced by Harvey Fierstein. Keep in mind that this is also a movie whose male cast includes B.D. Wong and George Takei.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Old Guy: The Emperor.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Mulan: Li Shang's father was killed in a battle against the Huns. Mulan, however, still has her father.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "song", 
                    "nasty", 
                    "nasty", 
                    "tough", 
                    "good", 
                    "miserable"
                ], 
                "role": "Drill Sergeant Nasty: Shang has a song illustrating just how nasty he is and it sounds exactly like what a Drill Sergeant Nasty is supposed to sound like, with the language cleaned up. Besides the language it's downplayed in that he isn't that nasty - he's tough but good, and reacts with approval when he sees his band of miserable slobs becoming efficient and disciplined soldiers.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "G-rated", 
                    "competent"
                ], 
                "role": "Mulan. \"Let's get down to business, to defeat the Huns./ Did they give me daughters when I asked for sons?\" Shang isn't that degrading (and in a G-rated movie, he can't be), but still. He's also noticeably proud when they gradually become more competent.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "told", 
                    "worth"
                ], 
                "role": "Chi Fu from Mulan would be a milder example; he is a Non-Action Guy known for his Girly Scream, yet when told Mulan is a hero he simply says \"she's a woman, she'll never be worth anything\".", 
                "id": "EffeminateMisogynisticGuy"
            }, 
            {
                "adjectives": [
                    "Chi-Fu", 
                    "told", 
                    "worth"
                ], 
                "role": "Effeminate Misogynistic Guy: Chi-Fu is a Non-Action Guy known for his Girly Scream, yet when told that Mulan is a hero he simply says, \"She's a woman. She'll never be worth anything!\"", 
                "id": "EffeminateMisogynisticGuy"
            }, 
            {
                "adjectives": [
                    "in-universe"
                ], 
                "role": "Mr. Fanservice: Captain Shang trains without a shirt. Ping is also one in-universe, according to Yao:", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "kind", 
                    "rude", 
                    "worthy"
                ], 
                "role": "Mulan combines this with Deliberate Values Dissonance in its depiction of ancient China.\n Similarly, Beauty and the Beast shows that France in the 1800s is not kind to a girl like Belle, as everyone considers her crazy for liking to read and back Gaston in his behavior towards her, even though he does things that are rude at best and worthy of a restraining order at most drastic. The only people who consider Belle's opinions or desires are her father, the castle servants, and the Beast.", 
                "id": "NoWomansLand"
            }, 
            {
                "adjectives": [], 
                "role": "Chi Fu of Mulan.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: The Emperor is this to Imperial China. The ancestors and the dragons to Mulan's family.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "Shang in Mulan. Yao even refers to him as Pretty Boy during his Shirtless Scene.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [], 
                "role": "Prince Ji-Ki from Mulan II.", 
                "id": "PrinceCharmless"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Shang.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "well-meaning", 
                    "loyal"
                ], 
                "role": "In Mulan, this is the trait that justifies Chi-Fu's treatment as a minor villain. He's otherwise unpleasant but well-meaning and loyal (to the Emperor, anyway).", 
                "id": "StrawMisogynist"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "combat", 
                    "capable"
                ], 
                "role": "Action Girl: After going through combat training, Mulan is perfectly capable of taking on Huns, and even manages to stand against their leader with a bit of cleverness.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Action Girl: Mulan.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "fantastic", 
                    "final", 
                    "Shan-Yu", 
                    "simple", 
                    "cute"
                ], 
                "role": "Mulan is a reverse example of this, as in order to become a kickbutt swordswoman she has to hide her beauty, but that doesn't stop her from looking fantastic in the final battle with Shan-Yu where she wears a simple but still cute dress.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "key"
                ], 
                "role": "Mulan is easily the poster girl of Badass Disney Princesses, with this being a key basis of the premise itself. She's a slight subversion because she's not a princess, but she's considered part of the princess lineup nonetheless.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Grandmother Fa of Mulan.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "eponymous", 
                    "close", 
                    "clear"
                ], 
                "role": "The eponymous Mulan is close with her family (including her grandmother) but it's clear she is the closest with her father.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Mulan — Mulan (1998)\n \"She hugged royalty, but that's about it.\"", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "good", 
                    "guile", 
                    "few", 
                    "good", 
                    "good", 
                    "headbutts—it"
                ], 
                "role": "Faux Action Guy: Shang. He's introduced as a badass, fights circles around his recruits, trains them to perfection... and from that point on becomes consistently less competent than Mulan. Subverted in that he is still a good warrior, but his lack of success with brute force to defeat the Huns shows that the Chinese will have to use guile and cleverness to win. He provides perfect timing in disarming Shan Yu and even lands a few good hits on him in the ensuing fight. The problem is that Shan Yu is bigger, meaner, and devastatingly good at headbutts—it takes more than being a Badass Army Captain to beat this guy.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Mulan has the title character screwing up the traditionally feminine \"matchmaker\" process.", 
                "id": "FemininityFailure"
            }, 
            {
                "adjectives": [], 
                "role": "One of Mulan's outfits in Mulan II.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [
                    "song"
                ], 
                "role": "Hero's Muse: The soldiers discuss this trope in the song \"A Girl Worth Fighting For\".", 
                "id": "HerosMuse"
            }, 
            {
                "adjectives": [
                    "song"
                ], 
                "role": "The soldiers in Mulan discuss this trope in the song \"A Girl Worth Fighting For\".", 
                "id": "HerosMuse"
            }, 
            {
                "adjectives": [
                    "Chinese"
                ], 
                "role": "Mulan has a lot of the elements, despite being based on a Chinese legend a thousand years older. Maybe Joan of Arc isn't so much the Trope Maker as the Trope Codifier.", 
                "id": "JeanneDArchetype"
            }, 
            {
                "adjectives": [
                    "fellow"
                ], 
                "role": "Mulan dresses like a courtesan (along with three of her fellow soldiers) to infiltrate the invaded palace and together they curbstomp the villain's lieutenants.", 
                "id": "KickingAssInAllHerFinery"
            }, 
            {
                "adjectives": [
                    "Used", 
                    "royal", 
                    "brief"
                ], 
                "role": "Lipstick and Load Montage: Used when the soldiers are applying drag to infiltrate Shan Yu's guard in the royal palace (set to a brief reprise of \"I'll Make A Man Out Of You\", no less!).", 
                "id": "LipstickAndLoadMontage"
            }, 
            {
                "adjectives": [
                    "Used", 
                    "royal", 
                    "brief"
                ], 
                "role": "Used in Mulan when the soldiers are applying drag to infiltrate Shan Yu's guard in the royal palace (set to a brief reprise of \"I'll Make A Man Out Of You\", no less!).", 
                "id": "LipstickAndLoadMontage"
            }, 
            {
                "adjectives": [], 
                "role": "Li Shang from Mulan has no mother.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Mulan from... Mulan.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "little", 
                    "initial"
                ], 
                "role": "Plucky Girl: Mulan doesn't let a little thing like a bleeding chest wound stop her from saving Shang's life. Hell, aside from the initial pain, she doesn't even seem to notice it until things have calmed down. Gotta love that adrenaline, eh?", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "disabled"
                ], 
                "role": "In Disney's Mulan, Mulan disguises herself as a man by making her hair shorter and wearing a soldier's outfit so that her disabled father won't have to go.", 
                "id": "SweetPollyOliver"
            }, 
            {
                "adjectives": [], 
                "role": "Sweet Polly Oliver: Ping is Mulan.", 
                "id": "SweetPollyOliver"
            }, 
            {
                "adjectives": [], 
                "role": "Sweet Polly Oliver: Mulan", 
                "id": "SweetPollyOliver"
            }, 
            {
                "adjectives": [
                    "much", 
                    "old", 
                    "male"
                ], 
                "role": "Yamato Nadeshiko: Mulan herself plays with the trope. She has the looks, is extremely devoted to her parents and desperately tries to fit in as a perfectly feminine and demure daughter... without much success. However, when she learns that her already old father will have to go to war with the Huns, she shows the core of steel part by dressing up as a male and taking his place, not for glory or to rebel against her family but to save her dad's life and the family honor.", 
                "id": "YamatoNadeshiko"
            }
        ]
    }, 
    "imdbid": "tt0120762", 
    "poster_url": "Mulan.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "CoolOldLady", 
                "DaddysGirl", 
                "CoolOldGuy", 
                "KickingAssInAllHerFinery", 
                "EverythingsBetterWithPrincesses", 
                "MissingMom", 
                "PluckyGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 9, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "AmazonChaser", 
                "PrinceCharmless", 
                "KickingAssInAllHerFinery", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "PluckyGirl", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 8, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "GracefulLadiesLikePurple", 
                "PapaWolf", 
                "EverythingsBetterWithPrincesses", 
                "BadassPrincess", 
                "PluckyGirl", 
                "MrFanservice", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "AmazonChaser", 
                "CampStraight", 
                "PapaWolf", 
                "EverythingsBetterWithPrincesses", 
                "DrillSergeantNasty", 
                "PluckyGirl", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 8, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "NoWomansLand", 
                "PrinceCharmless", 
                "DaddysGirl", 
                "EverythingsBetterWithPrincesses", 
                "StrawMisogynist", 
                "PluckyGirl", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }
    ], 
    "id": "Mulan", 
    "name": "Mulan"
}