{
    "plot": "Henri Young stole five dollars from a post office and ended up going to prison - to the most famous, or infamous, prison of them all: Alcatraz. He tried to escape, failed, and spent three years and two months in solitary confinement - in a dungeon, with no light, no heat and no toilet. Milton Glenn, the assistant warden, who was given free reign by his duty-shirking superior, was responsible for Young's treatment. Glenn even took a straight razor and hobbled Young for life. After three years and two months, Young was taken out of solitary confinement and put with the rest of the prisoners. Almost immediately, Young took a spoon and stabbed a fellow prisoner in the neck, killing him. Now, Young is on trial for murder, and if he's convicted he'll go to the gas chamber. An eager and idealistic young attorney, James Stamphill, is given this impossible case, and argues before a shocked courtroom that Young had a co-conspirator. The true murderer, he says, was Alcatraz.", 
    "genres": "Drama, Thriller", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Murder in the First: Not at all played for laughs when it happens to Henri Young (as played by Kevin Bacon).", 
                "id": "TheLoinsSleepTonight"
            }, 
            {
                "adjectives": [
                    "dramatic", 
                    "co-operate"
                ], 
                "role": "The Loins Sleep Tonight: A rare dramatic example, when Stamphill tries to use a prostitute to get Young to co-operate.", 
                "id": "TheLoinsSleepTonight"
            }
        ]
    }, 
    "imdbid": "tt0113870", 
    "poster_url": "MurderInTheFirst.jpg", 
    "similar": [
        {
            "shared": [
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 1, 
            "id": "WhosAfraidOfVirginiaWoolf", 
            "name": "Who's Afraid of Virginia Woolf?", 
            "poster_url": "WhosAfraidOfVirginiaWoolf.jpg"
        }, 
        {
            "shared": [
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 1, 
            "id": "BeingThere", 
            "name": "Being There", 
            "poster_url": "BeingThere.jpg"
        }, 
        {
            "shared": [
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 1, 
            "id": "MidnightCowboy", 
            "name": "Midnight Cowboy", 
            "poster_url": "MidnightCowboy.jpg"
        }, 
        {
            "shared": [
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 1, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }, 
        {
            "shared": [
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 1, 
            "id": "Shame", 
            "name": "Shame", 
            "poster_url": "Shame.jpg"
        }
    ], 
    "id": "MurderInTheFirst", 
    "name": "Murder in the First"
}