{
    "plot": "Richard Haywood, a Californian high school's coolest kid, secretly teams up with another rich kid in his class, brilliant nerd Justin 'Bonaparte' Pendleton, whose erudition, specially in forensic matters, allows them to plan elaborately perfect murders, just for the kick, for which they set up Richard's marijuana supplier, their school's janitor Ray Feathers, as a psychotic serial killer. The case is assigned to detectives Cassie 'the hyena' Mayweather, who carries a sequoia-size chip on the shoulder from her previous life, and her brilliant new partner, Sam Kennedy, who just transferred from the vice squad; they can work together very well, and even fit romantically, but fall out over different professional attitudes towards the investigation, which Captain Rod Cody and her understandably vindictive abused ex, Assistant D.A. Al Swanson, soon ban her from when she disobeys instructions and hand to him. When the plotting boys both dig class-mate Lisa Mills, their unnatural bond comes under stress- will it break, allowing the hard-pressed police to bring them down?", 
    "genres": "Crime, Drama, Thriller", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Sensitive", 
                    "sensitive"
                ], 
                "role": "Sensitive Guy and Manly Man: Justin and Richie, for given values of sensitive and manly.", 
                "id": "SensitiveGuyAndManlyMan"
            }
        ]
    }, 
    "imdbid": "tt0264935", 
    "similar": [
        {
            "shared": [
                "SensitiveGuyAndManlyMan"
            ], 
            "shared_count": 1, 
            "id": "DaysOfHeaven", 
            "name": "Days Of Heaven", 
            "poster_url": "DaysOfHeaven.jpg"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan"
            ], 
            "shared_count": 1, 
            "id": "RebelWithoutACause", 
            "name": "Rebel Without a Cause", 
            "poster_url": "RebelWithoutACause.jpg"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan"
            ], 
            "shared_count": 1, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan"
            ], 
            "shared_count": 1, 
            "id": "ThePagemaster", 
            "name": "The Pagemaster", 
            "poster_url": "ThePagemaster.jpg"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan"
            ], 
            "shared_count": 1, 
            "id": "TheToweringInferno", 
            "name": "The Towering Inferno", 
            "poster_url": "TheToweringInferno.gif"
        }
    ], 
    "id": "MurderByNumbers", 
    "name": "Murder by Numbers"
}