{
    "plot": "Despite not knowing him, the world's most famous detectives can't pass up the offer of a \"dinner and murder\" invitation from wealthy Lionel Twain. Each has no idea until their arrival at Two Two Twain who else will be in attendance. Those detectives are: amateur sleuths and New York socialites Dick and Dora Charleston, accompanied by their pet terrier, Myron; Belgian detective Monsieur Milo Perrier, accompanied by his chauffeur, Marcel; Shanghainese Inspector Sidney Wang, accompanied by his Japanese adopted son, Willie Wang; frumpish Brit Miss Jessica Marbles, accompanied by her invalid nurse, Miss Withers; and San Francisco gumshoe Sam Diamond, accompanied by his femme fatale sidekick, Tess Skeffington. The dinner part of the invitation runs into problems due to the non-communication between Twain's blind butler, Jamesir Bensonmum, and Twain's new deaf-mute and non-Anglophone cook, Yetta. On the murder side, the guests initially believe Twain will try to kill each of them. However, Twain eventually announces his rationale for the gathering: that one of the people at the dinner table will be murdered before midnight, and that Twain will consider himself the greatest detective if his guests, who are now trapped in the house until dawn, cannot figure out who committed the murder, that person also at the dinner table. If one does figure out who committed the crime, he/she will be the recipient of $1 million and the exclusive rights to the story. So the guests anxiously await the stroke of midnight, with those still alive after that time trying to figure out both motive and the opportunity to murder before the rise of dawn and before the murderer has the opportunity to strike again on one or all of them.", 
    "genres": "Comedy, Mystery, Thriller", 
    "release_year": "1976", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Armoured Closet Gay:  Sam Diamond, although he never did anything to a man that he wouldn't do to a woman. And he didn't kiss nobody, neither.", 
                "id": "ArmouredClosetGay"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Little Old Lady Investigates: Jessica Marbles.", 
                "id": "LittleOldLadyInvestigates"
            }
        ]
    }, 
    "imdbid": "tt0074937", 
    "poster_url": "MurderByDeath.jpg", 
    "similar": [
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "FourLions", 
            "name": "Four Lions", 
            "poster_url": "FourLions.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "ThePunisher", 
            "name": "The Punisher", 
            "poster_url": "ThePunisher.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "SmallSoldiers", 
            "name": "Small Soldiers", 
            "poster_url": "SmallSoldiers.jpg"
        }
    ], 
    "id": "MurderByDeath", 
    "name": "Murder by Death"
}