{
    "plot": "Based on a series of true stories posted by Ho-sik Kim on the Internet describing his relationship with his girlfriend. These were later transformed into a best-selling book and the movie follows the book closely. It describes the meeting of Kyun-woo (Cha) and an unnamed girl. Kyun-woo is shamed into assisting the girl because the other passengers mistakenly think she is his girlfriend. Once he helps her, Kyun-woo develops a deep sense of responsibility for her which enables him to tolerate (somehow) the girl's abuses.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2001", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "dangerous"
                ], 
                "role": "Manic Pixie Dream Girl: Pretty violent and dangerous example.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "quirky", 
                    "Ax-Crazy", 
                    "original", 
                    "Cuthbert-equivalent", 
                    "harmful"
                ], 
                "role": "My Sassy Girl:\n The trailer shows Elisha Cuthbert playing a version of this. However, instead of simply being \"quirky,\" she is portrayed as being Ax-Crazy, in that she may very well kill the protagonist for a lark.\n In the original Korean movie, Cuthbert-equivalent's character's \"quirky antics\" tend to have harmful consequences, but the protagonist falls for her anyway and she does indeed teach him to live and love. However, she definitely has issues and motivations unrelated to her man, and it turns out that she's been using him as a substitute for her dead fiancé, who was the protagonist's cousin. Things end up working out, though.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt0293715", 
    "poster_url": "MySassyGirl.jpg", 
    "similar": [
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Lo", 
            "name": "Lo"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "LAStory", 
            "name": "LA Story"
        }
    ], 
    "id": "MySassyGirl", 
    "name": "My Sassy Girl"
}