{
    "plot": "Kelly and Mac are settling down in a quiet neighborhood with their newborn child, until the frat brothers move into the house next door. Teddy is the President, and Pete is his right hand man, and they're quick to accept friendship when Kelly and Mac introduce themselves as the neighbors. Night after night, Mac asks Teddy to lower the fraternity's noise, even accepting the invitation to the party one evening. When Teddy goes back on his word to keep the partying down, Mac calls the police to deal with the problem. The police quickly blame Mac for their presence, and the war begins. As the family feuds with the frat brothers, things get hilariously dangerous and the fraternity ends up on thin ice with their college. After receiving their final warning and being placed on probation, Mac and Kelly pull a prank so ingenious that Teddy and Mac are forced to respond. All hell breaks loose, from Robert DeNiro parties to Christopher Mintz-Plasse having sex in the bushes, this comedy shows how things can go really wrong really quickly when a family and a frat house become neighbors.", 
    "genres": "Comedy", 
    "release_year": "2014", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Girl Next Door: Or at least in the building across the alley.", 
                "id": "GirlNextDoor"
            }
        ]
    }, 
    "imdbid": "tt2004420", 
    "poster_url": "Neighbors1920.jpg", 
    "similar": [
        {
            "shared": [
                "GirlNextDoor"
            ], 
            "shared_count": 1, 
            "id": "OurTown", 
            "name": "Our Town", 
            "poster_url": "OurTown.jpg"
        }, 
        {
            "shared": [
                "GirlNextDoor"
            ], 
            "shared_count": 1, 
            "id": "ChungkingExpress", 
            "name": "Chungking Express", 
            "poster_url": "ChungkingExpress.jpg"
        }, 
        {
            "shared": [
                "GirlNextDoor"
            ], 
            "shared_count": 1, 
            "id": "ANightmareOnElmStreet1984", 
            "name": "A Nightmare on Elm Street ", 
            "poster_url": "ANightmareOnElmStreet1984.jpg"
        }, 
        {
            "shared": [
                "GirlNextDoor"
            ], 
            "shared_count": 1, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "GirlNextDoor"
            ], 
            "shared_count": 1, 
            "id": "TeenWolf", 
            "name": "Teen Wolf"
        }
    ], 
    "id": "Neighbors1920", 
    "name": "Neighbors"
}