{
    "plot": "Kelly and Mac are settling down in a quiet neighborhood with their newborn child, until the frat brothers move into the house next door. Teddy is the President, and Pete is his right hand man, and they're quick to accept friendship when Kelly and Mac introduce themselves as the neighbors. Night after night, Mac asks Teddy to lower the fraternity's noise, even accepting the invitation to the party one evening. When Teddy goes back on his word to keep the partying down, Mac calls the police to deal with the problem. The police quickly blame Mac for their presence, and the war begins. As the family feuds with the frat brothers, things get hilariously dangerous and the fraternity ends up on thin ice with their college. After receiving their final warning and being placed on probation, Mac and Kelly pull a prank so ingenious that Teddy and Mac are forced to respond. All hell breaks loose, from Robert DeNiro parties to Christopher Mintz-Plasse having sex in the bushes, this comedy shows how things can go really wrong really quickly when a family and a frat house become neighbors.", 
    "genres": "Comedy", 
    "release_year": "2014", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Scoonie from Neighbors. Plus a bit of Gag Penis.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [
                    "reasonable"
                ], 
                "role": "Teddy Sanders and the rest of his fraternity brothers from Neighbors all fit this stereotype. The film actually serves as a Deconstructive Parody of frat boy comedies, showing the worst aspects of the immaturity displayed by Fratbro characters when surrounded by reasonable people.", 
                "id": "Fratbro"
            }, 
            {
                "adjectives": [], 
                "role": "Teddy, for the most part in Neighbors. He eventually makes money on this by working for Abercrombie & Fitch.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Kelly invokes this in Neighbors. Her plan to break up Teddy and Pete's bromance is to make out with both Peter and Teddy's girlfriend and then coercing the pair into have sex.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt2004420", 
    "poster_url": "Neighbors2014.jpg", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "TheVamp"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "ShowdownInLittleTokyo", 
            "name": "Showdown in Little Tokyo", 
            "poster_url": "ShowdownInLittleTokyo.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "TheVamp"
            ], 
            "shared_count": 2, 
            "id": "TheTenCommandments", 
            "name": "The Ten Commandments", 
            "poster_url": "TheTenCommandments.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "Sunrise", 
            "name": "Sunrise", 
            "poster_url": "Sunrise.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "Neighbors2014", 
    "name": "Neighbors"
}