{
    "plot": "Tom Farrell is a navy officer who gets posted at the Pentagon and is to report to the secretary of defense David Brice. He starts an affair with Susan Atwell not knowing that she is Brice's mistress. When Susan is found dead, Tom is assigned to the case of finding the killer who is believed to be a KGB mole! Tom could soon become a suspect when a Polaroid negative of him was found at Susan's place. He now has only a few hours to find the killer before the computer regenerates the photo.", 
    "genres": "Action, Crime, Drama", 
    "release_year": "1987", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Depraved Homosexual: Pritchard has apparently been harboring an Unrequited Love for Brice and is obsessed with protecting his reputation at any cost. When Brice discovers the lengths to which Pritchard has gone, he rejects him, leading him to kill himself.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "psychopathic", 
                    "suicide"
                ], 
                "role": "In the 1987 thriller No Way Out, Scott Pritchard, Defense Secretary David Brice's aide, helps him cover up his involvement in the death of his mistress. As the situation devolves, Pritchard becomes increasingly psychopathic until, at the end, it is revealed that he's been harboring an Unrequited Love for Brice. He commits suicide upon being rejected.", 
                "id": "DepravedHomosexual"
            }
        ]
    }, 
    "imdbid": "tt0093640", 
    "poster_url": "NoWayOut.jpg", 
    "similar": [
        {
            "shared": [
                "DepravedHomosexual"
            ], 
            "shared_count": 1, 
            "id": "NorthByNorthwest", 
            "name": "North by Northwest", 
            "poster_url": "NorthByNorthwest.jpg"
        }, 
        {
            "shared": [
                "DepravedHomosexual"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "DepravedHomosexual"
            ], 
            "shared_count": 1, 
            "id": "Irreversible", 
            "name": "Irreversible", 
            "poster_url": "Irreversible.jpg"
        }, 
        {
            "shared": [
                "DepravedHomosexual"
            ], 
            "shared_count": 1, 
            "id": "AMidsummerNightsDream", 
            "name": "A Midsummer Night's Dream"
        }, 
        {
            "shared": [
                "DepravedHomosexual"
            ], 
            "shared_count": 1, 
            "id": "Coonskin", 
            "name": "Coonskin"
        }
    ], 
    "id": "NoWayOut", 
    "name": "No Way Out"
}