{
    "plot": "In Boston, the over-weight spinster Charlotte Vale is a repressed woman without self-esteem and completely dominated by her wealthy mother Mrs. Henry Vale. When her sister-in-law Lisa Vale brings the renowned psychiatrist Dr. Jaquith, who is her friend, to visit Charlotte, he invites her to spend some time in his sanatorium. Soon Charlotte transforms in a sophisticated and confident woman and travels in a cruise to South America. She meets architect Jerry Durrance, who is married, and they have a love affair in Rio de Janeiro. Six months later, she returns home and confronts her mother with her independence and own free will. One day, Charlotte has an argument with her mother and she dies of a heart attack. Charlotte becomes the heir of the Vale's fortune but she feels guilty for the death of her mother. She decides to return to Dr. Jaquith's sanatorium whether she befriends Tina, who is the twelve-year-old daughter of Jerry rejected by her mother. She brings the girl to her house in Boston and one day, Jerry visits Tina and Charlotte with Dr. Jaquith.", 
    "genres": "Drama, Romance", 
    "release_year": "1942", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "shy", 
                    "weight", 
                    "fashionable", 
                    "shy"
                ], 
                "role": "The movie that arguably originated this trope, Now, Voyager (1942), also served to subvert it in anticipation. Bette Davis plays an overweight, dowdy, bespectacled, poorly dressed woman who's also painfully shy, unsocialized, maladjusted, and bullied by her widowed mother. When she loses weight, takes off her glasses, and buys fashionable clothes... she's still shy, unsocialized, maladjusted, and bullied by her mother.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "nasty", 
                    "independent", 
                    "emotional"
                ], 
                "role": "In Now, Voyager, Charlotte Vale's mother is a particularly nasty version of this trope, controlling her daughter and keeping her from being independent through emotional abuse.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "malign"
                ], 
                "role": "My Beloved Smother: A particularly malign example. Charlotte's domineering mother seems to take pleasure in tormenting her.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "malign"
                ], 
                "role": "My Beloved Smother: A particularly malign example.", 
                "id": "MyBelovedSmother"
            }
        ]
    }, 
    "imdbid": "tt0035140", 
    "poster_url": "NowVoyager.jpg", 
    "similar": [
        {
            "shared": [
                "BeautifulAllAlong", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "Hairspray", 
            "name": "Hairspray", 
            "poster_url": "Hairspray.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "TheAddamsFamily", 
            "name": "The Addams Family", 
            "poster_url": "TheAddamsFamily.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "Gypsy", 
            "name": "Gypsy", 
            "poster_url": "Gypsy.jpg"
        }, 
        {
            "shared": [
                "MyBelovedSmother"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "MyBelovedSmother"
            ], 
            "shared_count": 1, 
            "id": "PeytonPlace", 
            "name": "Peyton Place", 
            "poster_url": "PeytonPlace.jpg"
        }
    ], 
    "id": "NowVoyager", 
    "name": "Now, Voyager"
}