{
    "plot": "Berlin is the epitome of political and economic polarization. A microcosm of that polarization is the life of American C.R. MacNamara, known as Mac to his friends. He is Coca-Cola's head of West Berlin operations, although he feels he deserves to be Coca-Cola's head of European operations based in London. Mac's wife, Phyllis, wants him instead to get a steady and stable job back in head office in Atlanta. His West Berlin staff are all still used to treating him like their old master, the Fuhrer. The one exception is his secretary, Ingeborg, who is the latest in the long line of his secretary mistresses. And he's working on a trade agreement of getting Coca-Cola into the Russian market. His life goes into a tailspin when he hosts Scarlett Hazeltine in his home for two weeks. She is the seventeen year old spoiled and party-loving daughter of his Atlanta based boss, Wendell Hazeltine. Unlike most of the stops she's made on her European trip, Scarlett seems to like West Berlin and stays longer than expected. On the day that Mac learns that Mr. & Mrs. Hazeltine will be in Berlin in 24 hours to retrieve their daughter, he also learns that Scarlett has married Otto Ludwig Piffl, a staunch East German Communist. Mac feels this marriage will ruin his career and does whatever he can to get rid of Otto for good and wipe any record of the marriage off the official books. But when Mac further learns that Scarlett is pregnant, Mac has to get Otto back, which is more difficult than it was to get rid of him, and to make him respectable in the eyes of Otto's father-in-law and Mac's boss. Meanwhile, Phyllis has her own ideas of what are right and wrong in both Scarlett and Mac's lives and takes appropriate action.", 
    "genres": "Comedy", 
    "release_year": "1961", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "free"
                ], 
                "role": "In One, Two, Three, Right-hand man Schlemmer disguises in Sexy Secretary Ingeborg's dress to fool the Russians, so they'll let Otto free.", 
                "id": "DisguisedInDrag"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Sexy Secretary: Ingeborg, played by Lilo Pulver.", 
                "id": "SexySecretary"
            }
        ]
    }, 
    "imdbid": "tt0055256", 
    "poster_url": "OneTwoThree.jpg", 
    "similar": [
        {
            "shared": [
                "SexySecretary", 
                "DisguisedInDrag"
            ], 
            "shared_count": 2, 
            "id": "TheFlintstones", 
            "name": "The Flintstones", 
            "poster_url": "TheFlintstones.jpg"
        }, 
        {
            "shared": [
                "DisguisedInDrag"
            ], 
            "shared_count": 1, 
            "id": "LupinIIIOperationReturnTheTreasure", 
            "name": "Lupin III Operation Return The Treasure"
        }, 
        {
            "shared": [
                "SexySecretary"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "DisguisedInDrag"
            ], 
            "shared_count": 1, 
            "id": "SororityBoys", 
            "name": "Sorority Boys", 
            "poster_url": "SororityBoys.jpg"
        }, 
        {
            "shared": [
                "DisguisedInDrag"
            ], 
            "shared_count": 1, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }
    ], 
    "id": "OneTwoThree", 
    "name": "One, Two, Three"
}