{
    "plot": "Joe Young was a simple young man trying to spread the word of the Book of Mormon when he picked the wrong house to preach at! The owner, a porn director named Maxxx Orbison, tells his henchmen to kill the guy at the door who interrupted their scene, but Joe fights off the guards with great skill, which impresses Maxxx so much that he offers Joe the lead role in the movie he's making at the moment: Orgazmo, which is about a sex superhero who fights crime with his Orgazmorator, and ChodaBoy, his sidekick. Joe, against his beliefs, takes the job so that he can pay for the wedding he plans for himself and his fiancée, whom he doesn't tell about his risqué new acting job. However, when the movie becomes an amazing hit just about everywhere and he finds out that Ben (ChodaBoy) has created a real Orgazmorator, Joe is in some serious hot water!", 
    "genres": "Comedy", 
    "release_year": "1997", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Maxxx Orbison decides to kidnap Lisa, Joe's fiancee, to ensure that Joe continues to play the part of Orgazmo. Guess what Joe and Ben decide to do?", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "Madonna-Whore", 
                    "sole", 
                    "G-Fresh", 
                    "own"
                ], 
                "role": "Madonna-Whore Complex: Interestingly applied to males as well as females. With the sole exceptions of G-Fresh, the owner of the sushi bar and those who regularly harass him in an attempt to run him out of his own business, every character of any importance is either involved in the porn business or a devout Mormon.", 
                "id": "MadonnaWhoreComplex"
            }
        ]
    }, 
    "imdbid": "tt0124819", 
    "poster_url": "Orgazmo.jpg", 
    "similar": [
        {
            "shared": [
                "MadonnaWhoreComplex", 
                "DamselInDistress"
            ], 
            "shared_count": 2, 
            "id": "Metropolis", 
            "name": "Metropolis", 
            "poster_url": "Metropolis.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "HouseOfFlyingDaggers", 
            "name": "House of Flying Daggers", 
            "poster_url": "HouseOfFlyingDaggers.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "TurtlesForever", 
            "name": "Turtles Forever", 
            "poster_url": "TurtlesForever.png"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }
    ], 
    "id": "Orgazmo", 
    "name": "Orgazmo"
}