{
    "plot": "Vietnam veteran Billy Ray Lancing, a former CSA agent who now works on a wildlife refuge in Northern Alaska, has been exchanging letters in a pen-pal relationship with Irina Morawska, a 13-year-old orphaned girl in Poland that he's helping out financially. When the letters suddenly stop coming, Billy heads to Poland to figure out why -- only to discover that the orphanage that Irena was staying in, which is financed by honest -- and unsuspecting -- good-intentioned Samaritans, is a cover for a human trafficking network. Run by a man named Faisal, the operation is worth billions -- girls are sold and traded to the highest bidders from all over the world. Through Billy's letters to Irina, Billy has taught Irina how to use secret codes, which she uses to keep Billy updated on where Faisal is taking her to. That's how Billy stays on Faisal's trail as Billy teams up with local cop Kasia Lato to rescue Irina and the other girls, and bring down Faisal's human trafficking network.", 
    "genres": "Action, Drama, Romance", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Papa Wolf: he isn't the girl's father, but close enough.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "white"
                ], 
                "role": "Woman in White: Irena dons a white dress towards the end.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0377100", 
    "poster_url": "OutOfReach.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "WomanInWhite"
            ], 
            "shared_count": 2, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "WomanInWhite"
            ], 
            "shared_count": 2, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "WomanInWhite"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteATaleOfTerror", 
            "name": "Snow White: A Tale of Terror", 
            "poster_url": "SnowWhiteATaleOfTerror.jpg"
        }, 
        {
            "shared": [
                "WomanInWhite"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "OutOfReach", 
    "name": "Out Of Reach"
}