{
    "plot": "Traveling raccoon con artist, RJ, arrives in a woods outside a human city in the Midwest, excited about the wonders that living near humans can bring hungry animals. What he finds, however, is an Amish-like community that is deathly afraid of humans, after their leader, Vern the tortoise (Shandling), has an encounter with human boys that terrifies him. Encouraged by RJ, however, the animals slowly venture over the hedge that separates them from the brand new suburban development that appeared over the winter while they were sleeping, and what RJ shows them is a whole new world where humans leave tin cans full of fish and other food in big canisters, ripe for the taking. As they get closer and closer to humans, however, their comfortable lives in the woods appears to be threatened...", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Dirty Coward: Gladys, at the end. RJ could have ended up this, but luckily Character Development prevented it.", 
                "id": "DirtyCoward"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "make-over", 
                    "beautiful"
                ], 
                "role": "Beautiful All Along: Subverted when Stella actually needs a make-over to become very beautiful and seduce a pedigree cat. Becomes a a Double Subversion; Tiger doesn't care that she's a skunk or what she really looks like, he loves her anyway.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "Persian", 
                    "cat", 
                    "beautiful"
                ], 
                "role": "Over the Hedge has Stella, the skunk, who \"looks like a nest and smells like a swamp\" until she's called upon to distract Tiger, a purebred Persian cat, by passing her off for lovely cat...and turns out, it just took a haircut and a dye-job to reveal how beautiful she was.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "In Over the Hedge, the absence of Ozzie's mate and Heather's mother is never addressed.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "single", 
                    "debatable"
                ], 
                "role": "Missing Mom: Not only is Ozzie a single father, but his wife is never mentioned in the film. She is briefly mentioned by Heather in the video game, but the continuity of that is debatable.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "sassy"
                ], 
                "role": "Sassy Black Woman: Stella the skunk has a lot of sass and also her voice actor Wanda Sykes who often plays this role help her sound more like a sassy black women.", 
                "id": "SassyBlackWoman"
            }
        ]
    }, 
    "imdbid": "tt0327084", 
    "poster_url": "OverTheHedge.jpg", 
    "similar": [
        {
            "shared": [
                "BeautifulAllAlong", 
                "MissingMom", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "MissingMom", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "CloudyWithAChanceOfMeatballs", 
            "name": "Cloudy with a Chance of Meatballs", 
            "poster_url": "CloudyWithAChanceOfMeatballs.jpg"
        }, 
        {
            "shared": [
                "MissingMom", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "NextAvengersHeroesOfTomorrow", 
            "name": "Next Avengers: Heroes of Tomorrow"
        }, 
        {
            "shared": [
                "SassyBlackWoman", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "TheCuriosityOfChance", 
            "name": "The Curiosity Of Chance", 
            "poster_url": "TheCuriosityOfChance.jpg"
        }, 
        {
            "shared": [
                "SassyBlackWoman", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }
    ], 
    "id": "OverTheHedge", 
    "name": "Over the Hedge"
}