{
    "plot": "Oscar Diggs (James Franco), a small-time circus magician with dubious ethics, is hurled away from dusty Kansas to the vibrant Land of Oz. At first he thinks he's hit the jackpot-fame and fortune are his for the taking. That all changes, however, when he meets three witches, Theodora (Mila Kunis), Evanora (Rachel Weisz), and Glinda (Michelle Williams), who are not convinced he is the great wizard everyone's been expecting. Reluctantly drawn into the epic problems facing the Land of Oz and its inhabitants, Oscar must find out who is good and who is evil before it is too late. Putting his magical arts to use through illusion, ingenuity-and even a bit of wizardry-Oscar transforms himself not only into the great and powerful Wizard of Oz but into a better man as well.", 
    "genres": "Adventure, Family, Fantasy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "bad", 
                    "willing", 
                    "later"
                ], 
                "role": "Oscar Diggs, aka The Wizard of Oz, is one in Oz: The Great and Powerful. He's made Ann—from Kansas, his assistants, the strongman's wife ( really bad idea, that one), Theodora and Glinda fall in love with him. And he didn't care for any of the women he was with, stating they'll get over him and the heartbreak. Ann was the closest to loving a woman he ever came, but he still wasn't willing to change for her and settle. He later falls for Glinda, possibly only because he reminds her of Ann, but he can have her without compromising his wanton hero/show-off status.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [
                    "music", 
                    "simple", 
                    "last", 
                    "big", 
                    "same"
                ], 
                "role": "The Casanova: Oscar, with a music box and a heartfelt (and false) story as his lockpicks. On-screen we see him do it to a simple country girl May, the strongman's wife, and Theodora. That last one bites back big time when Evanora claims he also did the same with her.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Hot", 
                    "easy", 
                    "beautiful", 
                    "other", 
                    "true", 
                    "hideous", 
                    "able", 
                    "ugly"
                ], 
                "role": "Hot Witch: Glinda, Evanora and Theodora are all quite easy on the eyes. Even after her transformation, Theodora still looks fairly beautiful since she's supposed to be 20 years younger than the character in the 1939 film. Evanora, on the other hand, was actually hiding her true hideous self through her magic. After her magic is stripped from her after battling Glinda, she was no longer able to mask her ugly form.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [
                    "attractive", 
                    "green-skinned", 
                    "evil", 
                    "naive"
                ], 
                "role": "Oz: The Great and Powerful has three witches: Glinda (Michelle Williams), Theodora (Mila Kunis), and Evanora (Rachel Weisz). All are very attractive (Oz flirts with all three). However, Theodora is turned into the green-skinned Wicked Witch of the West by her evil sister Evanora, who herself is revealed to be a hag after her amulet is broken. In fact, Oz's flirting with the naive Theodora allows her sister to corrupt her and seek vengeance.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [], 
                "role": "In Oz: The Great and Powerful, China Girl can manipulate the Con Man Oz by turning on the waterworks.", 
                "id": "LittleMissConArtist"
            }, 
            {
                "adjectives": [
                    "hideous", 
                    "old", 
                    "beautiful"
                ], 
                "role": "In Oz: The Great and Powerful, the Wicked Witch of the East is a hideous old crone, but spends most of the movie under a spell that makes her appear as a beautiful woman. Defied by the Wicked Witch of the West, who refuses to hide her appearance because she wants Oz to see the monster he's turned her into.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [
                    "many"
                ], 
                "role": "Wicked Witch: Evanora and Theodora, who becomes Trope Codifier the Wicked Witch of The West. Ironically, it was Oscar that gave her the idea for many of the conventions, most noticeably her broom.", 
                "id": "WickedWitch"
            }, 
            {
                "adjectives": [
                    "later", 
                    "own"
                ], 
                "role": "Woman Scorned: Theodora, who had her heart broken by Oscar. Her desire for revenge kickstarts her transformation into the Wicked Witch of the West. Exploited later by Oz who tricked her into faking his own death.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt1623205", 
    "poster_url": "OzTheGreatAndPowerful.jpg", 
    "similar": [
        {
            "shared": [
                "VainSorceress", 
                "WickedWitch", 
                "HotWitch"
            ], 
            "shared_count": 3, 
            "id": "SnowWhiteAndTheSevenDwarfs", 
            "name": "Snow White and the Seven Dwarfs"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "WomanScorned"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "HotWitch"
            ], 
            "shared_count": 2, 
            "id": "TheWitchesOfOz", 
            "name": "The Witches Of Oz", 
            "poster_url": "TheWitchesOfOz.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "WomanScorned"
            ], 
            "shared_count": 2, 
            "id": "Krull", 
            "name": "Krull"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "HotWitch"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "OzTheGreatAndPowerful", 
    "name": "Oz: The Great and Powerful"
}