{
    "plot": "When monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's resources for years on end. To combat the giant Kaiju, a special type of weapon was devised: massive robots, called Jaegers, which are controlled simultaneously by two pilots whose minds are locked in a neural bridge. But even the Jaegers are proving nearly defenseless in the face of the relentless Kaiju. On the verge of defeat, the forces defending mankind have no choice but to turn to two unlikely heroes - a washed up former pilot (Charlie Hunnam) and an untested trainee (Rinko Kikuchi) - who are teamed to drive a legendary but seemingly obsolete Jaeger from the past. Together, they stand as mankind's last hope against the mounting apocalypse.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "former"
                ], 
                "role": "Action Dad: Both Stacker Pentecost and Hercules Hansen definitely count. The latter even pilots Striker Eureka alongside his son, Chuck. And then the former does as well.", 
                "id": "ActionDad"
            }, 
            {
                "adjectives": [], 
                "role": "Likewise Elba's character Marshall Pentecost in Pacific Rim. When he talks about cancellin' the Apocalypse, you believe him!", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [], 
                "role": "Bash Brothers: Jaeger pilots (sometimes literally). As Raleigh posits at the beginning of the film: \"The deeper the bond, the better you fight.\"", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "Australian", 
                    "father-son", 
                    "Hair-Trigger", 
                    "terrible", 
                    "double", 
                    "later", 
                    "likely", 
                    "several", 
                    "other", 
                    "other", 
                    "young"
                ], 
                "role": "In Pacific Rim, the Australian Jaeger consists of father-son duo, Hercules and Chuck Hansen. It's revealed that Chuck was only 16 when he was first deployed in Striker Eureka in 2019, and (according to the artbook) was enlisted in the Jaeger Academy at age 12 in 2015. And despite being one of the best Jaeger pilots with the highest Kaiju kill count in history at only 21, Chuck is also shown to have a Hair-Trigger Temper, terrible communication skills, and a double dose of Daddy Issues and Survivors Guilt with regards to his father choosing to save him over his mother. He later pulls a Heroic Sacrifice and blows up Striker Eureka to take down two Kaiju so Gipsy Danger can seal the Breach.\n It's very likely that several other Jaeger pilots were reared from adolescence to fight the Kaiju as well. Sadly, if there were any other teenage or young pilots during the Golden Age of the Jaegers, they were almost certainly killed prior to the film in Kaiju battles.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "military", 
                    "British", 
                    "Australian", 
                    "young"
                ], 
                "role": "Dad the Veteran: Both Stacker Pentecost and Hercules Hansen have served in the military for nearly two decades. Prior to K-Day and the Kaiju invasion, Stacker had served in the British Royal Air Force with his sister, Luna, while Herc was already enlisted in the Australian Royal Air Force. After that, they joined the Pan Pacific Defense Corps and eventually became the longest serving (and surviving) Jaeger pilots. By the time of the film, Stacker is the Marshal of the PPDC and Hong Kong Shatterdome; Herc still pilots Striker Eureka alongside his young son, Chuck.", 
                "id": "DadTheVeteran"
            }, 
            {
                "adjectives": [
                    "military", 
                    "British", 
                    "Australian", 
                    "young"
                ], 
                "role": "In Pacific Rim, both Stacker Pentecost and Hercules Hansen have served in the military for nearly two decades. Prior to K-Day and the Kaiju invasion, Stacker had served in the British Royal Air Force with his sister, Luna, while Herc was already enlisted in the Australian Royal Air Force. After that, they joined the Pan Pacific Defense Corps and eventually became the longest serving (and surviving) Jaeger pilots. By the time of the film, Stacker is the Marshal of the PPDC and Hong Kong Shatterdome; Herc still pilots Striker Eureka alongside his young son, Chuck.", 
                "id": "DadTheVeteran"
            }, 
            {
                "adjectives": [], 
                "role": "Herc Hansen in Pacific Rim. Also Stacker Pentecost, the adopted father of Mako Mori.", 
                "id": "HotDad"
            }, 
            {
                "adjectives": [
                    "Russian", 
                    "nuclear", 
                    "such", 
                    "massive", 
                    "more-protected", 
                    "tall", 
                    "humongous", 
                    "professional"
                ], 
                "role": "Husky Russkie: The Russian Jaeger Cherno Alpha is the biggest, bulkiest, and most heavily armored Jaeger, with a head that bears a vague resemblance to a nuclear reactor's cooling tower. (This is no accident — it actually is a reactor, intended to put out all the juice such a massive machine needs, while also incidentally resembling a head and possibly diverting attacks from the pilots, who were in the more-protected chest cavity. In the end, it doesn't work.) This also applies also to the its pilots, the Kaidanovsky couple. Sasha is portrayed by the rather tall 5'10 Heather Doerksen, and Aleksis by humongous 6'11 professional wrestler Robert Maillet.", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [
                    "Russian", 
                    "vague", 
                    "nuclear", 
                    "tall", 
                    "humongous", 
                    "professional"
                ], 
                "role": "Pacific Rim: The Russian Cherno Alpha is the biggest, bulkiest, and most heavily armored Jaeger, with a vague resemblance to a nuclear reactor cooling tower. This also applies to it's pilots, the Kaidanovsky couple. Sasha is portrayed by rather tall 5'10 Heather Doerksen, and Aleksis by humongous 6'11 professional wrestler Robert Maillet.", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Mr. Fanservice: Raleigh is REALLY well built and often shirtless. The other men generally apply too. C'mon, Idris Elba, Rob Kazinsky, hell, even Charlie Day.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Stacker, towards Mako.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed"
                ], 
                "role": "Sharp-Dressed Man: Tendo Choi, Stacker Pentecost, and Hannibal Chau.", 
                "id": "SharpDressedMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Mako Mori. Sasha Kaidanovsky.  Technically, applies to all the women working in the LOCCENT and the Shatterdome itself.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "Disposable"
                ], 
                "role": "Disposable Woman: Angela Hansen. Died to cause her husband and son to both angst.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "comic", 
                    "neural"
                ], 
                "role": "The prequel comic also gives us Dr. Caitlin Lightcap, inventor of the Jaegers' neural interface system.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "nuclear"
                ], 
                "role": "Missing Mom: Chuck Hansen's mother. A point of contention between father and son because Hercules had one hour to get in and out of Sydney. He chose to save his son, and his wife, Angela, died. The official report says she died in the Kaiju attack rather than the nuclear explosion.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "Pregnant"
                ], 
                "role": "Pregnant Badass:  Otachi was revealed to be this, with her spawn gobbling up Hannibal and almost killing Newt.", 
                "id": "PregnantBadass"
            }
        ]
    }, 
    "imdbid": "tt1663662", 
    "poster_url": "PacificRim.jpg", 
    "similar": [
        {
            "shared": [
                "HotScientist", 
                "PapaWolf", 
                "SharpDressedMan", 
                "BadassBaritone", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "MissingMom", 
                "DisposableWoman", 
                "PregnantBadass", 
                "HotDad", 
                "BashBrothers"
            ], 
            "shared_count": 5, 
            "id": "StarTrek", 
            "name": "Star Trek", 
            "poster_url": "StarTrek.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MrFanservice", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "PregnantBadass", 
                "ActionGirl", 
                "BashBrothers"
            ], 
            "shared_count": 4, 
            "id": "LethalWeapon", 
            "name": "Lethal Weapon", 
            "poster_url": "LethalWeapon.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HuskyRusskie", 
                "MissingMom", 
                "BashBrothers"
            ], 
            "shared_count": 4, 
            "id": "TheBoondockSaints", 
            "name": "The Boondock Saints", 
            "poster_url": "TheBoondockSaints.jpg"
        }
    ], 
    "id": "PacificRim", 
    "name": "Pacific Rim"
}