{
    "plot": "Parsimonious Bhanwarlal is a Bania (businessman) who lives in Navalgarh, Rajasthan, along with his wife; his sons Sunderlal and Kishanlal; Sunderlal is married to Gajrobai and has a son. During the annual camel race, Sunderlal loses the race to the Thakur and out of shame leaves home, never to return. Now Kishanlal has come of age and is married to Lachchi. But on the very next day of the marriage, he must leave for Jamnagar to attend to business, and can only return after five years. A tearful Lachchi bids him goodbye, but to her pleasant surprise he returns within a few days, and informs his dad that he had met a holy sage who had instructed him to return as he will find five gold coins every morning. Pleased with this, Bhanwarlal does not object to Kishanlal's return. After four years, it is now time for the camel race again, and this time Bhanwarlal's camel wins, much to the chagrin of the Thakur who suspects witchcraft. Then Lachchi gets pregnant and on the day of the child's birth the family finds out to their horror that there is an impostor who is claiming to be Kishanlal, and the husband of Lachchi. The family and the town are unable to decide who is real and who the impostor, as both look like twins, so they decide to approach the king and do his bidding. The question remains, who is the second Kishanlal and what possible motive could he have for coming to claim Lachchi as his wife?", 
    "genres": "Fantasy, Romance", 
    "release_year": "2005", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "suspicious"
                ], 
                "role": "Distracted by the Luxury - The ghost keeps Kishanlal's father from becoming too suspicious by giving him gold coins.", 
                "id": "DistractedByTheLuxury"
            }
        ]
    }, 
    "imdbid": "tt0451850", 
    "poster_url": "Paheli.jpg", 
    "similar": [
        {
            "shared": [
                "DistractedByTheLuxury"
            ], 
            "shared_count": 1, 
            "id": "Legend", 
            "name": "Legend", 
            "poster_url": "Legend.jpg"
        }, 
        {
            "shared": [
                "DistractedByTheLuxury"
            ], 
            "shared_count": 1, 
            "id": "Bedazzled1967", 
            "name": "Bedazzled", 
            "poster_url": "Bedazzled1967.jpg"
        }, 
        {
            "shared": [
                "DistractedByTheLuxury"
            ], 
            "shared_count": 1, 
            "id": "SinginInTheRain", 
            "name": "Singin' in the Rain", 
            "poster_url": "SinginInTheRain.jpg"
        }, 
        {
            "shared": [
                "DistractedByTheLuxury"
            ], 
            "shared_count": 1, 
            "id": "LostInSpace", 
            "name": "Lost in Space", 
            "poster_url": "LostInSpace.jpg"
        }, 
        {
            "shared": [
                "DistractedByTheLuxury"
            ], 
            "shared_count": 1, 
            "id": "Female", 
            "name": "Female", 
            "poster_url": "Female.jpg"
        }
    ], 
    "id": "Paheli", 
    "name": "Paheli"
}