{
    "plot": "Three scientists at the Foundation for Psychiatric Research fail to secure a device they've invented, the D.C. Mini, which allows people to record and watch their dreams. A thief uses the device to enter people's minds, when awake, and distract them with their own dreams and those of others. Chaos ensues. The trio - Chiba, Tokita, and Shima - assisted by a police inspector and by a sprite named Paprika must try to identify the thief as they ward off the thief's attacks on their own psyches. Dreams, reality, and the movies merge, while characters question the limits of science and the wisdom of Big Brother.", 
    "genres": "Animation, Mystery, Sci-Fi", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "magnificent"
                ], 
                "role": "Badass Mustache: Konakawa has a particularly magnificent one.", 
                "id": "BadAssMustache"
            }, 
            {
                "adjectives": [], 
                "role": "Osanai from Paprika tries to strangle someone who tried to take Paprika away from him.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "master/slave", 
                    "sexual", 
                    "romantic", 
                    "dirty"
                ], 
                "role": "Depraved Homosexual: Possibly the Chairman, though his attachment to Osanai seems more a master/slave thing than a sexual or romantic relationship. Also possibly Himuro, who seems to have fetishized Osanai — we briefly see dirty magazines in his apartment with a younger Osanai on the cover, and his dreamscape features a towering statue of Osanai as a Greek god.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "master/slave", 
                    "sexual", 
                    "romantic", 
                    "dirty", 
                    "cross-dressing", 
                    "enough", 
                    "possible", 
                    "other"
                ], 
                "role": "Paprika: Possibly the Chairman, though his attachment to  Osanai seems more a master/slave thing than a sexual or romantic relationship. Also possibly Himuro, who seems to have fetishized Osanai, since we briefly see dirty magazines in his apartment with a younger Osanai on the cover, and his dreamscape features a towering statue of Osanai as a Greek god. It's the Depraved part that's up for debate with Himuro; the gay Porn Stash, cross-dressing and \"idolization\" of Osanai are more than enough evidence of his sexuality. It's possible Osanai tricked Himuro, or that Himuro was just thinking with his other head when Osanai offered himself.", 
                "id": "DepravedHomosexual"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Emotionless Girl: Chiba, at times.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "literal"
                ], 
                "role": "Manic Pixie Dream Girl: Paprika, in a more literal sense than most.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "therapist", 
                    "daily", 
                    "spontaneous"
                ], 
                "role": "Paprika's job in Paprika is being a Manic Pixie Dream Girl for men: a spritely therapist who joins them in their dreams and takes them on surrealist adventures. In her daily life,  she sees herself only as a dull, proper scientist and ignores the spontaneous part of herself too much.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "Straight-laced"
                ], 
                "role": "Naughty by Night: Straight-laced Chiba becomes a lot more flirty and extroverted when she turns into Paprika.", 
                "id": "NaughtyByNight"
            }, 
            {
                "adjectives": [
                    "Straight-laced"
                ], 
                "role": "Paprika: Straight-laced Chiba becomes a lot more flirty and extroverted when she turns into  Paprika.", 
                "id": "NaughtyByNight"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: Paprika.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "The title character of Paprika wears one while briefly in mermaid form.", 
                "id": "SeashellBra"
            }
        ]
    }, 
    "imdbid": "tt0851578", 
    "poster_url": "Paprika.jpg", 
    "similar": [
        {
            "shared": [
                "EmotionlessGirl", 
                "PluckyGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "SeashellBra", 
                "PluckyGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "DepravedHomosexual", 
                "BadAssMustache", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "PulpFiction", 
            "name": "Pulp Fiction", 
            "poster_url": "PulpFiction.jpg"
        }, 
        {
            "shared": [
                "EmotionlessGirl", 
                "CrazyJealousGuy", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "Waitress", 
            "name": "Waitress", 
            "poster_url": "Waitress.jpg"
        }, 
        {
            "shared": [
                "BadAssMustache", 
                "PluckyGirl"
            ], 
            "shared_count": 2, 
            "id": "PorcoRosso", 
            "name": "Porco Rosso", 
            "poster_url": "PorcoRosso.jpg"
        }
    ], 
    "id": "Paprika", 
    "name": "Paprika"
}