{
    "plot": "In the town of Blithe Hollow, Norman Babcock is a boy who can speak to the dead, but no one besides his eccentric new friend, Neil, believes his ability is real. One day, Norman's estranged eccentric uncle tells him of an important annual ritual he must take up to protect the town from a curse cast by a witch it condemned centuries ago. Eventually, Norman decides to cooperate, but things don't go according to plan. Now, a magic storm of the witch threatens Blithe Hollow as the accursed dead rise. Together with unexpected new companions, Norman struggles to save his town, only to discover the horrific truth of the curse. With that insight, Norman must resolve the crisis for good as only he can.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "close", 
                    "aware"
                ], 
                "role": "Casanova Wannabe: Alvin is frequently seen trying to woo girls while never coming close to impressing them. He's aware of it, too.", 
                "id": "CasanovaWannabe"
            }, 
            {
                "adjectives": [], 
                "role": "Crusty Caretaker: According to the novelization, Mr. Prenderghast is the caretaker to the Blithe Hollow Cemetery.", 
                "id": "CrustyCaretaker"
            }, 
            {
                "adjectives": [
                    "strong", 
                    "bright"
                ], 
                "role": "Dumb Muscle: Mitch and Alvin are pretty strong given their ages, and not too bright.", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [
                    "typical", 
                    "teenaged", 
                    "chick-flick"
                ], 
                "role": "In ParaNorman, Mitch is the typical teenaged Dumb Muscle, causing Norman's sister, Courtney, to be Distracted by the Sexy throughout the movie. He replies to her asking him out to see a movie that \"My boyfriend's a chick-flick nut.\"", 
                "id": "ManlyGay"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice: Mitch, who even gets a Shirtless Scene, and constantly gets Courtney Distracted by the Sexy.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "last-line", 
                    "sub-plot"
                ], 
                "role": "Mitch Downe in ParaNorman. A rare children's movie example of the trope revealed as a last-line, sub-plot wrap-up stinger.", 
                "id": "StraightGay"
            }, 
            {
                "adjectives": [], 
                "role": "Straight Gay: Turns out Mitch is gay.", 
                "id": "StraightGay"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "dead"
                ], 
                "role": "Cool Old Lady: Norman's dead grandmother.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "One-Winged", 
                    "aforementioned"
                ], 
                "role": "Agatha Prenderghast in ParaNorman when  she isn't going all One-Winged Angel. Bonus points for using the aforementioned The White Stripes song over the end credits.", 
                "id": "CuteGhostGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Cute Ghost Girl: Agatha, once Norman calms her down.", 
                "id": "CuteGhostGirl"
            }, 
            {
                "adjectives": [
                    "Ensemble"
                ], 
                "role": "Ms. Fanservice: Courtney, which may be incidentally why she's something of an Ensemble Darkhorse. The Hartman Hips certainly don't hurt.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Sassy Black Woman: Sheriff Hooper (the motorcycle cop.)", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "female", 
                    "Insufferable"
                ], 
                "role": "The female cop from ParaNorman. Salma could count too, but her sassiness mostly comes from her Insufferable Genius tendencies.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Screaming Woman: The girl in the horror flick Norman watches. She doesn't even have any lines, all she does is shriek in terror.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [], 
                "role": "The woman in the monster movie Norman watches at the beginning of ParaNorman has no lines, just a lot of terrified shrieks.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [
                    "'bitchy", 
                    "'stupid", 
                    "bad"
                ], 
                "role": "The Cheerleader: Courtney is the 'bitchy' version (with shades of the 'stupid' version) but she turns out to be not so bad in the end.", 
                "id": "TheCheerleader"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick - Courtney", 
                "id": "TheChick"
            }, 
            {
                "adjectives": [
                    "cheesy"
                ], 
                "role": "The town in ParaNorman once executed a supposed witch in its past, and is now filled with cheesy attractions and shops depicting her as this, which Salma finds historically inaccurate.  And she's right. The witch was really just a little girl that could speak to ghosts.", 
                "id": "WickedWitch"
            }
        ]
    }, 
    "imdbid": "tt1623288", 
    "poster_url": "ParaNorman.jpg", 
    "similar": [
        {
            "shared": [
                "CasanovaWannabe", 
                "MsFanservice", 
                "MrFanservice", 
                "TheChick"
            ], 
            "shared_count": 4, 
            "id": "PitchPerfect", 
            "name": "Pitch Perfect", 
            "poster_url": "PitchPerfect.jpg"
        }, 
        {
            "shared": [
                "CrustyCaretaker", 
                "TheChick", 
                "MsFanservice"
            ], 
            "shared_count": 3, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "MrFanservice", 
                "DumbMuscle"
            ], 
            "shared_count": 3, 
            "id": "TheCroods", 
            "name": "The Croods", 
            "poster_url": "TheCroods.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "WickedWitch", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "SassyBlackWoman", 
                "DumbMuscle"
            ], 
            "shared_count": 3, 
            "id": "OliverAndCompany", 
            "name": "Oliver & Company"
        }
    ], 
    "id": "ParaNorman", 
    "name": "ParaNorman"
}