{
    "plot": "Parker is a thief who has an unusual code. He doesn't steal from the poor and hurt innocent people. He is asked to join 4 other guys on a job. They pull it off flawlessly. They tell Parker that what they got can help them set up another job which will net them much more. But Parker doesn't want to join them and asks for his share. But they need it all so they try to kill him. They dispose of his body but someone finds him and he is still alive and takes him to the hospital. After recovering he sets out to get back at the ones who tried to kill him, another one of his codes. Despite being told that they are working for a known mobster which he was not aware of, he still wants to go after them. He learns where they are and poses as a wealthy Texan looking to buy a house. So he hires a real estate agent, Leslie Rogers to show him around. He is actually trying to find out where they're holed up. And when he finds it, he sets out on his plan to get them. But when they learn he is alive, they contact the mobster to take care of him. So he sends a killer to take care of him. And Leslie also finds herself intrigued with him so she follows him.", 
    "genres": "Action, Crime, Thriller", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Gentleman Thief: Parker.", 
                "id": "GentlemanThief"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Leslie Rogers siezes the Idiot Ball  by going to the hideout and nearly bollixing Parker's play.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "Disposable"
                ], 
                "role": "Disposable Woman: Subverted.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Leslie. Especially in her underwear.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt1904996", 
    "poster_url": "Parker.jpg", 
    "similar": [
        {
            "shared": [
                "GentlemanThief", 
                "DamselInDistress"
            ], 
            "shared_count": 2, 
            "id": "Popeye", 
            "name": "Popeye", 
            "poster_url": "Popeye.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "DisposableWoman"
            ], 
            "shared_count": 2, 
            "id": "TheDarkKnight", 
            "name": "The Dark Knight", 
            "poster_url": "TheDarkKnight.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "DisposableWoman"
            ], 
            "shared_count": 2, 
            "id": "Taken", 
            "name": "Taken", 
            "poster_url": "Taken.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "RedHotRidingHood", 
            "name": "Red Hot Riding Hood"
        }
    ], 
    "id": "Parker", 
    "name": "Parker"
}