{
    "plot": "Former CIA analyst, Jack Ryan is in England with his family on vacation. He then goes to Buckingham Palace to meet them when there's an explosion. Some people are trying to abduct a member of the Royal Family but Jack stops them killing one of them and capturing the other. He learns that they're Irish revolutionaries and the two men are brothers. The one that's still alive vows to get Jack. Later while the man is being transported, he is broken out. Jack learns of this but doesn't think there's anything to worry about. But when he's at the Naval Academy someone tries to kill him but he stops him. He learns that they're also going after his family so he rushes to find them but they made an attempt but they survive. That's when Jack decides to rejoin the CIA. And they try to find the man before he makes another attempt.", 
    "genres": "Action, Crime, Drama", 
    "release_year": "1992", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "near-fatal", 
                    "responsible"
                ], 
                "role": "In the film Patriot Games, while they're not killed, the near-fatal attack on his wife and daughter spurs Jack Ryan to rejoin the CIA in order to find the people responsible.", 
                "id": "CrusadingWidower"
            }
        ]
    }, 
    "imdbid": "tt0105112", 
    "poster_url": "PatriotGames.jpg", 
    "similar": [
        {
            "shared": [
                "CrusadingWidower"
            ], 
            "shared_count": 1, 
            "id": "StarTrekGenerations", 
            "name": "Star Trek: Generations", 
            "poster_url": "StarTrekGenerations.jpg"
        }, 
        {
            "shared": [
                "CrusadingWidower"
            ], 
            "shared_count": 1, 
            "id": "Super", 
            "name": "Super", 
            "poster_url": "Super.jpg"
        }, 
        {
            "shared": [
                "CrusadingWidower"
            ], 
            "shared_count": 1, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "CrusadingWidower"
            ], 
            "shared_count": 1, 
            "id": "EscapePlan", 
            "name": "Escape Plan", 
            "poster_url": "EscapePlan.jpg"
        }, 
        {
            "shared": [
                "CrusadingWidower"
            ], 
            "shared_count": 1, 
            "id": "TheIncredibles", 
            "name": "The Incredibles"
        }
    ], 
    "id": "PatriotGames", 
    "name": "Patriot Games"
}