{
    "plot": "In 1970s Iran, Marjane 'Marji' Statrapi watches events through her young eyes and her idealistic family of a long dream being fulfilled of the hated Shah's defeat in the Iranian Revolution of 1979. However as Marji grows up, she witnesses first hand how the new Iran, now ruled by Islamic fundamentalists, has become a repressive tyranny on its own. With Marji dangerously refusing to remain silent at this injustice, her parents send her abroad to Vienna to study for a better life. However, this change proves an equally difficult trial with the young woman finding herself in a different culture loaded with abrasive characters and profound disappointments that deeply trouble her. Even when she returns home, Marji finds that both she and homeland have changed too much and the young woman and her loving family must decide where she truly belongs.", 
    "genres": "Animation, Biography, Drama", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Child Soldiers", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "real"
                ], 
                "role": "Mariane Satrapi's Persepolis featured a portrayal of the real life Iranian unit of children, who were walked into the minefields to detonate them ahead of the troops.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Uncle Anoosh.", 
                "id": "CoolOldGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Cool Old Lady: Marjane's Grandmother.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "seductive"
                ], 
                "role": "Girls with Moustaches: A teacher tells her female students to wear head scarves because a glimpse of any part of a woman's hair is a temptation to men. Marjane's father comments that the teacher's moustache is hardly seductive.", 
                "id": "GirlsWithMoustaches"
            }, 
            {
                "adjectives": [
                    "graphic", 
                    "main", 
                    "seductive"
                ], 
                "role": "In the graphic novel Persepolis, a teacher tells her female students to wear headcoverings because a glimpse of any of a woman's hair is a temptation to men. The main character's father comments that the teacher's moustache is hardly seductive.", 
                "id": "GirlsWithMoustaches"
            }, 
            {
                "adjectives": [
                    "noticeable", 
                    "comic"
                ], 
                "role": "Hairy Girl: Marjane's roommate, Lucia, has hairy armpits. They aren't very noticeable in the comic, but in the animated film they comically blow in the wind from her hairdryer.", 
                "id": "HairyGirl"
            }, 
            {
                "adjectives": [
                    "noticeable", 
                    "comic", 
                    "hairy", 
                    "nice", 
                    "painful"
                ], 
                "role": "Persepolis. Marjane's roommate, Lucia, has hairy armpits. They aren't very noticeable in the comic, but in the animated film they comically blow in the wind from her hairdryer.\n Marjane herself is fairly hairy, but it's treated a sign of her lack of self-esteem. After she becomes determined to take charge of her life following her failed suicide attempt, a montage ensues of Marjane working to make herself look nice again, including plucking out all her body hair in a comically painful manner.", 
                "id": "HairyGirl"
            }
        ]
    }, 
    "imdbid": "tt0808417", 
    "poster_url": "Persepolis.jpg", 
    "similar": [
        {
            "shared": [
                "CoolOldLady", 
                "ChildSoldiers", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "CoolOldLady", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "ChildSoldiers"
            ], 
            "shared_count": 2, 
            "id": "TheStraightStory", 
            "name": "The Straight Story", 
            "poster_url": "TheStraightStory.jpg"
        }, 
        {
            "shared": [
                "CoolOldLady", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "CoolOldLady", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "TheLastStarfighter", 
            "name": "The Last Starfighter", 
            "poster_url": "TheLastStarfighter.jpg"
        }
    ], 
    "id": "Persepolis", 
    "name": "Persepolis"
}