{
    "plot": "Perry's worst fear comes true when Phineas and Ferb find out that he is in fact Secret Agent P, but that soon pales in comparison during a trip to the 2nd dimension where Perry finds out that Dr. Doofenshmirtz is truly evil and successful.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "episode"
                ], 
                "role": "Amazon Chaser: Buford-2's reaction to Candace-2. Which is a stealth reference to another, earlier episode in which Candace wonders how Buford's number got in the contacts list of her cellphone.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "facial", 
                    "Freudian"
                ], 
                "role": "Doof-2's Beard of Evil may be a nod to \"Crack the Whip!\", specifically Doof-1's inability to grow facial hair, in pointing out that Doof-2 shares none of his counterpart's Freudian Excuses.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "comic-con", 
                    "particular"
                ], 
                "role": "Phineas and Ferb The Movie: Across the 2nd Dimension has Alternate Doofenshmirtz who sports an eviler than thou goatee. Hilariously commented upon between Jeff Swampy Marsh and Dan Povenmire (the voice of Heinz Doofenshmirtz) during the comic-con 2011 Phineas and Ferb panel, pointing out this particular trope... and the fact that Dan sports a goatee as well.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Non-Action Guy: Baljeet-2, even more noticeably than Baljeet-1. He isn't shown to accompany the other Resistance members on missions, for instance.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [
                    "Overprotective", 
                    "deleted"
                ], 
                "role": "Overprotective Dad: A deleted scene shows that Doof-2 is even worse than Doof-1 in this regard, using his power to banish any boy who shows an interest in his daughter.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "same", 
                    "same", 
                    "hard"
                ], 
                "role": "Papa Wolf: Perry doesn't even break his masquerade when the Platyborg punches him clear across the room. When that same robot moves to do the same to Phineas and Ferb, he immediately jumps up and punches him just as hard.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "normal", 
                    "first", 
                    "final"
                ], 
                "role": "Action Girl: The alternate versions of Isabella and the Fireside girls (who are called \"Firestorm Girls\" according to Word of God), more so than their normal counterparts. Candace-2 is more a Lady of War. One only needs to see Candace-2's first encounter with the Norm-bots for proof. And the First Dimension Candace, Isabella, Stacy, and Fireside Girls all help out in the final battle.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Little Miss Badass: Isabealla-2, along with all the other Firestorm girls.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [
                    "much"
                ], 
                "role": "Ms. Fanservice: Candace-2, oh so very much.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt1825918", 
    "poster_url": "PhineasAndFerbTheMovieAcrossThe2ndDimension.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "NonActionGuy", 
                "AmazonChaser", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "OverprotectiveDad", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "LittleMissBadass", 
                "BeardOfEvil", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "KillBill", 
            "name": "Kill Bill", 
            "poster_url": "KillBill.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "OverprotectiveDad", 
                "MsFanservice"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "OverprotectiveDad", 
                "AmazonChaser"
            ], 
            "shared_count": 3, 
            "id": "TheCroods", 
            "name": "The Croods", 
            "poster_url": "TheCroods.jpg"
        }
    ], 
    "id": "PhineasAndFerbTheMovieAcrossThe2ndDimension", 
    "name": "Phineas and Ferb The Movie: Across the 2nd Dimension"
}