{
    "plot": "N/A", 
    "genres": "Adventure, Fantasy, Horror", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Agent Peacock: Jack Sparrow.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [
                    "flamboyant", 
                    "bisexual"
                ], 
                "role": "To some extent Captain Jack Sparrow of Pirates of the Caribbean is one of these, with the eyeliner and all the dangly things in his hair and his rather effete and flamboyant mannerisms. Johnny Depp has stated in interviews that he intends Captain Jack to read as bisexual.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [
                    "awesome"
                ], 
                "role": "Jack Sparrow of Pirates Of The Caribbean fame. Come his beard has beads in it! That's pretty awesome.", 
                "id": "BadAssBeard"
            }, 
            {
                "adjectives": [
                    "various", 
                    "pure", 
                    "free"
                ], 
                "role": "Pirates of the Caribbean had this in various sequences, but the most pure form was when Will was trying to free Jack from the noose and they raced to the castle edge. Subverted in that they taken down plenty of soldiers between the two of them, but sheer numbers and guns outweighed their ability to finish their job.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Mercer from the Pirates of the Caribbean series unquestionably serves Lord Cutler Beckett.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "shifty", 
                    "real", 
                    "clean-shaven"
                ], 
                "role": "Pirates of the Caribbean, naturally. Jack Sparrow, Hector Barbossa, and Davy Jones (who has a beard made of tentacles) are all rather shifty, but the real Big Bad is clean-shaven, as is his second-in-command. \"Good guy\" Will Turner also has a goatee, to complement his pirate lineage.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "clean-shaven"
                ], 
                "role": "In Pirates of the Caribbean, Norrington is clean-shaven while he is accepted in society, but while he is disgraced (and has lost his love), he doesn't shave.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "full", 
                    "entire", 
                    "full", 
                    "tough"
                ], 
                "role": "Captain Teague on Pirates of the Caribbean. Not only is he the Keeper of the Code and Jack's Dad, he's also badass enough to shut a room full of brawling pirate captains (including Barbossa) up by merely entering the room.\n Granted, he shot one of them to punctuate his entrance. And when Jack asks if the Pirate Lords won't keep to the code, all it takes is a loud discordant guitar twang and a Death Glare to get an entire room full of Bad Ass pirates to sit down and shut up.\n Of course, being played by Keith Richards doesn't hurt.\n Barbossa himself is a bit of one.\n And Blackbeard, who is into his 70's. Also Teague's crew in At Worlds End, who all look to be quite tough.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "Lovable", 
                    "certain", 
                    "major"
                ], 
                "role": "Pirates of the Caribbean: One of the glaring personality flaws of Captain Jack Sparrow is his tendency toward dirty cowardice (though he may arguably be more of a Lovable Coward), especially in the face of certain death, and escape from death becomes his major motivation in Dead Man's Chest and At World's End.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "first", 
                    "original", 
                    "true", 
                    "other", 
                    "male"
                ], 
                "role": "The first three Pirates of the Caribbean films share the In Distress role around a bit between the original 3 leads- Elizabeth gets more time in it than anyone else, true, but the other two get it sometimes, and as they're both male...", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "only", 
                    "male"
                ], 
                "role": "Angelica in Pirates of the Caribbean: On Stranger Tides poses as Jack because he was the only (male) pirate she thought she could pass for.", 
                "id": "DudeLooksLikeALady"
            }, 
            {
                "adjectives": [
                    "only", 
                    "male"
                ], 
                "role": "Dude Looks Like a Lady: Angelica poses as Jack because he was the only (male) pirate she thought she could pass for.", 
                "id": "DudeLooksLikeALady"
            }, 
            {
                "adjectives": [], 
                "role": "Gibbs, Barbossa, and Jones from Pirates of the Caribbean.", 
                "id": "FatherNeptune"
            }, 
            {
                "adjectives": [], 
                "role": "A case of Gag Balls occurs in Pirates of the Caribbean 3. Two cannonballs are positioned so that they hang between Barbossa's legs. There's also the scene with the telescopes.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [
                    "second"
                ], 
                "role": "Though she doesn't fit in the buxom category, Elizabeth Swann inexplicably did this to Jack Sparrow in the second Pirates of the Caribbean while he was attempting to shoot the Kraken.", 
                "id": "LegCling"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "minor"
                ], 
                "role": "Mr. Fanservice: Pretty much the entire male cast, excepting perhaps some of the minor characters.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "polite", 
                    "chivalrious", 
                    "loyal", 
                    "devious", 
                    "severe", 
                    "first", 
                    "former"
                ], 
                "role": "Pirates of the Caribbean: Will Turner is polite, chivalrious and loyal while Captain Jack Sparrow is devious and has a severe case of Chronic Backstabbing Disorder. Throughout the first three films Will only has eyes for his childhood friend Elizabeth, while Jack is regularly slapped by former lovers.", 
                "id": "NobleMaleRoguishMale"
            }, 
            {
                "adjectives": [
                    "south", 
                    "royal", 
                    "first"
                ], 
                "role": "Commodore Norrington of Pirates of the Caribbean fame started out this way, but went disappointingly south once he fell from royal favor,  Death Equals Redemption notwithstanding.\n He did let his emotions get the best of him even in the first film. When Elizabeth asked him to go rescue Will from Barbossa, Norrington refused until she agreed to marry him. Then all his talk of duty and serving others went right out the window.", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "Bo'sun", 
                    "ritual", 
                    "terrible"
                ], 
                "role": "Big Scary Black Man: Captain Barbossa's Bo'sun in Curse Of The Black Pearl- he's even got ritual scars and terrible teeth. Also, one of Blackbeard's zombie officers in On Stranger Tides.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "Bo'sun", 
                    "ritual", 
                    "terrible"
                ], 
                "role": "Pirates of the Caribbean: Captain Barbossa's Bo'sun in Curse Of The Black Pearl- he's even got ritual scars and terrible teeth. Also, one of Blackbeard's zombie officers in On Stranger Tides.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "complete"
                ], 
                "role": "Philip from Pirates of the Caribbean, complete with Shirtless Scene.", 
                "id": "SexyPriest"
            }, 
            {
                "adjectives": [
                    "real", 
                    "18th", 
                    "canon"
                ], 
                "role": "Lord Cutler Beckett from Pirates of the Caribbean has elements of this as well, though a lot of real life aristocrats of 18th century acted like that so it's purely canon instead of being for just the heck of it.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Arguably Captain Jack Sparrow from Pirates of the Caribbean. He charms not only the women, but also the men and all the fans!", 
                "id": "TheCharmer"
            }, 
            {
                "adjectives": [], 
                "role": "Captain Jack Sparrow in Pirates of the Caribbean\n As well as Will Turner.", 
                "id": "WaistcoatOfStyle"
            }, 
            {
                "adjectives": [
                    "resemble"
                ], 
                "role": "Davy Jones from Pirates of the Caribbean has Octopus tentacles around his face to resemble his beard in human form.", 
                "id": "WeirdBeard"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Action Girl: Elizabeth Swann and Angelica. Played with in the first movie when Elizabeth tries to grab a sword to fight off Pintel and Ragetti and can't pull it out of the decoration it's built into. But by Dead Man's Chest, she's all about this trope.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Over the course of the three films, Elizabeth Swann of Pirates of the Caribbean loses the corset, lets her hair down, and gets the upgrade from Damsel in Distress to Action Girl (Captain Swann!)(Pirate King Swann!), which debatably results in better outfits in the process.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "second", 
                    "only"
                ], 
                "role": "Tia Dalma, a minor character in the second Pirates of the Caribbean movie, joins the crew in At World's End so that Elizabeth isn't the only woman on the ship (since Anamaria vanished in Dead Man's Chest).", 
                "id": "AffirmativeActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Amazon Brigade: The Mermaids.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [
                    "first", 
                    "second", 
                    "third"
                ], 
                "role": "Elizabeth Swann from Pirates Of The Caribbean is like this in the first movie. In the second and third, she graduates to Action Girl.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "royal", 
                    "valid", 
                    "rid", 
                    "unmarried"
                ], 
                "role": "Not just royal mistresses- it was a valid way of getting rid of any unmarried woman who had somehow disgraced herself. They also sometimes incorporated girls' schools.", 
                "id": "CatholicSchoolGirlsRule"
            }, 
            {
                "adjectives": [], 
                "role": "In On Stranger Tides, Judi Dench's gown. With cleavage.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "first", 
                    "first", 
                    "later", 
                    "own", 
                    "undead", 
                    "second", 
                    "third"
                ], 
                "role": "Elizabeth Swann from Pirates of the Caribbean is like this in the first movie where she uses the Pirate Code to get out of her first instance of distress and later arranging for her own rescue by smoke signal, as well as helping Will fight off some undead pirates. In the second and third, she graduates to Action Girl.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Dirty Old Woman: The old lady that Jack fondles in the London carriage. \"Is that it?\"", 
                "id": "DirtyOldWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Dragon Lady: Mistress Ching.", 
                "id": "DragonLady"
            }, 
            {
                "adjectives": [
                    "real-life"
                ], 
                "role": "The pirate lord Mistress Ching, based on the real-life pirate Ching Shih, in Pirates of the Caribbean.", 
                "id": "DragonLady"
            }, 
            {
                "adjectives": [], 
                "role": "The  mermaid in the glass case in Pirates of the Caribbean: On Stranger Tides", 
                "id": "GirlInABox"
            }, 
            {
                "adjectives": [], 
                "role": "Godiva Hair: Syrena the mermaid.", 
                "id": "GodivaHair"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Syrena and some of the other mermaids in Pirates of the Caribbean: On Stranger Tides have this. Except for when they have Barbie Doll Anatomy instead.", 
                "id": "GodivaHair"
            }, 
            {
                "adjectives": [], 
                "role": "Elizabeth Swann in Pirates of the Caribbean.", 
                "id": "LadyOfAdventure"
            }, 
            {
                "adjectives": [
                    "second"
                ], 
                "role": "Though she doesn't fit in the buxom category, Elizabeth Swann inexplicably did this to Jack Sparrow in the second Pirates of the Caribbean while he was attempting to shoot the Kraken.", 
                "id": "LegCling"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Penelope Cruz, especially in that one scene of her and Jack rolling about on the deck. Also, the mermaid Syrena, who was pretty much half naked for all of her scenes. In fact, all of the mermaids really, until they attack.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Naughty Nuns: Angelica was about to take her vows when Jack arrived. He was there because he'd mistaken the convent for a brothel. Honest mistake.", 
                "id": "NaughtyNuns"
            }, 
            {
                "adjectives": [
                    "famous", 
                    "second"
                ], 
                "role": "Ching Shih, one of the most famous female pirates (and the basis for Mistress Ching in Pirates of the Caribbean) only took over the fleet after her husband died and she married their adopted son.\n That said, both husbands seem to have been under her thumb completely—we know more about her than them, especially her second husband whom is not really heard from after the marriage. Presumably, he survived the wedding night, but...", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "third"
                ], 
                "role": "In the third Pirates of the Caribbean movie Shao Feng's meek maids, Lian and Park, instantly turn badass when the East Indian Trading Company attacks his lair.", 
                "id": "NinjaMaid"
            }, 
            {
                "adjectives": [
                    "proud", 
                    "small"
                ], 
                "role": "While her makeup in Pirates of the Caribbean was designed to create the illusion of cleavage, she is proud of her small chest. Captain Jack couldn't resist taking a shot, though:", 
                "id": "PetitePride"
            }, 
            {
                "adjectives": [], 
                "role": "Pirates of the Caribbean's character list also includes Anamaria, who is apparently a no - nonsense Lady of War type.", 
                "id": "PirateGirl"
            }, 
            {
                "adjectives": [
                    "due", 
                    "magical", 
                    "hefty", 
                    "facial"
                ], 
                "role": "Let's not forget Pirates Of The Caribbean's Elizabeth Swann and the Aztec medallion that — due to a gold chain's magical length-fluxuating ability — would pop down from her cleavage into her corset for a handy spider hole.\n Forget the medallion - what about the firearms? Even Barbossa could not figure out from whence Miss Swann pulled that hefty blunderbuss in POTC 3. His facial expression at that moment, by the way, is the best shot in the movie.", 
                "id": "Ptitleba4e2b2g"
            }, 
            {
                "adjectives": [
                    "above", 
                    "usual", 
                    "rebellious"
                ], 
                "role": "Like with the above, Elizabeth from Pirates of the Caribbean is a governor's daughter instead of a princess, but shows the usual rebellious princess traits.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "new", 
                    "large", 
                    "clear"
                ], 
                "role": "In Pirates of the Caribbean, Elizabeth Swann normally prefers swords, but dips into this trope as part of her new Action Girl status in the beginning of At Worlds' End. They make her take out all her weapons, including one large handgun. It's never made clear where she kept it. Or is it?", 
                "id": "SmallGirlBigGun"
            }, 
            {
                "adjectives": [
                    "friendly", 
                    "common"
                ], 
                "role": "Elizabeth from Pirates of the Caribbean. She's the governor's daughter but she's friendly to common people like Will and is Nice to the Waiter.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "second", 
                    "few"
                ], 
                "role": "In the second Pirates of the Caribbean movie, Elizabeth Swann disguises herself as a man to sneak on board a ship. Since she changes on the ship itself, her dress is found by a few of the sailors, which leads to a mad rush to find the stowaway naked lady.", 
                "id": "SweetPollyOliver"
            }, 
            {
                "adjectives": [
                    "other", 
                    "able", 
                    "capricious", 
                    "angry", 
                    "first", 
                    "single", 
                    "fourth", 
                    "foreign", 
                    "very", 
                    "certain", 
                    "unpredictable", 
                    "past", 
                    "hers—and", 
                    "single"
                ], 
                "role": "Pirates of the Caribbean:\n The goddess Calypso is called \"a woman scorned, like which fury hell hath no.\" As the story goes, she gave Davy Jones the condition that if he did the job of the Captain of the Flying Dutchman for ten years - namely, ferrying the souls of those who died at sea to the other side - then they would be able to be together forever. However, she seems to be a very capricious goddess (not uncommon with sea deities actually) and was not at the designated meeting place after the ten years were up. This made Davy Jones (understandably) angry and so he and the first Brethren Court bound her in a single human form, which turned out to be Tia Dalma. When the fourth Brethren Court finally released Calypso, she was more than a little ticked off and started cursing at them in a foreign language while growing to be at least a hundred feet tall, before finally crumbling into an avalanche of rock crabs.\n It makes a bit more sense, though, when you remember that Calypso is the goddess of the sea, which by its very nature cannot be predictable. When she realized that showing up at a certain place and time would go against the unpredictable nature of the sea, she didn't come.\n You do have to remember, though, that Davy isn't unjustified in his rage, either. Part of the contract was that after ten years, when he comes back, if his love is waiting for him, he can go free. So Calypso consciously screwed him over, just for the sake of her image.\n Davy Jones could also count as a man scorned.\n Angelica in On Stranger Tides, who Jack seduced in the past and then left behind. Things don't get any better when Jack uses the chalices to give a dying Angelica immortality rather than her father Blackbeard—whose life is sacrificed for hers—and then maroons her on an island with nothing but a pistol with a single bullet.", 
                "id": "WomanScorned"
            }, 
            {
                "adjectives": [
                    "whole", 
                    "first", 
                    "past", 
                    "hers—and", 
                    "single"
                ], 
                "role": "Woman Scorned: Subverted in At World's End. Calypso fits this trope to a T, but in all technicality she started the whole thing in the first place. Angelica in On Stranger Tides, who Jack seduced in the past and then left behind. Things don't get any better when Jack uses the chalices to give a dying Angelica immortality rather than her father Blackbeard—whose life is sacrificed for hers—and then maroons her on an island with nothing but a pistol with a single bullet.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0368925", 
    "similar": [
        {
            "shared": [
                "BeardOfSorrow", 
                "DirtyCoward", 
                "SpoiledSweet", 
                "SweetPollyOliver", 
                "NeverASelfMadeWoman", 
                "BeardOfEvil", 
                "WeirdBeard", 
                "OfficerAndAGentleman", 
                "SissyVillain", 
                "WomanScorned", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 11, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "CoolOldLady", 
                "DudeLooksLikeALady", 
                "DirtyCoward", 
                "CoolOldGuy", 
                "BashBrothers", 
                "SpoiledSweet", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 10, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "WaistcoatOfStyle", 
                "CoolOldGuy", 
                "BashBrothers", 
                "OfficerAndAGentleman", 
                "WomanScorned", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 8, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "BeardOfSorrow", 
                "DamselOutOfDistress", 
                "MsFanservice", 
                "DirtyCoward", 
                "BadassDamsel", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 8, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "DamselOutOfDistress", 
                "MsFanservice", 
                "RebelliousPrincess", 
                "SpoiledSweet", 
                "BeardOfEvil", 
                "DirtyCoward", 
                "BadassDamsel", 
                "MrFanservice"
            ], 
            "shared_count": 8, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }
    ], 
    "id": "PiratesOfTheCaribbean", 
    "name": "Pirates of the Caribbean"
}