{
    "plot": "The Barden Bellas are a collegiate, all-girls a cappella singing group thriving on female pop songs and their perfect looks. After a disastrous failing at last year's finals, they are forced to regroup. Among the new recruits is freshman Beca, an independent, aspiring DJ with no interest in the college life. But after she meets Jesse, from the rival all-male a cappella group, Beca has a new outlook and takes it upon herself to help the Bellas find their new look and sound and get back into the competition.", 
    "genres": "Comedy, Music, Romance", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Casanova Wannabe: Bumper, in between insulting Fat Amy he still hints towards sex.", 
                "id": "CasanovaWannabe"
            }, 
            {
                "adjectives": [], 
                "role": "Dad the Veteran / Drill Sergeant Nasty: Implied to be the case with Aubrey's father.", 
                "id": "DadTheVeteran"
            }, 
            {
                "adjectives": [], 
                "role": "Fat Amy from Pitch Perfect is another Rare Female Example, though her success with men is somewhat lampshaded by her confident personality and zany sense of humor.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Unicycle actually does this a few times throughout the movie. He apparently thinks of himself as Mr. Fanservice.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "wide", 
                    "final", 
                    "few"
                ], 
                "role": "Shirtless Scene: Luke, the college station DJ has a lovely moment of this. Beca is appreciative. Unicycle, one of The Treblemakers, has one in a wide shot after their final performance. Unicycle actually does this a few times throughout the movie. He apparently thinks of himself as Mr. Fanservice.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "first", 
                    "male"
                ], 
                "role": "Alpha Bitch: The first scene shows us that the leaders of the Bellas have to be this way. Also, a male version with Bumper of the Treblemakers, if you count that.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Big Beautiful Woman / Fat Girl: Fat Amy kind of...alternates between these two throughout the film.", 
                "id": "BigBeautifulWoman"
            }, 
            {
                "adjectives": [
                    "attractive"
                ], 
                "role": "Pitch Perfect has Fat Amy, a boisterously extroverted Fat and Proud college student. After joining the Bellas, she is hit on by the rival group's resident Jerk Ass (she is revealed to have the Jerkass's phone number) and at one point she is seen in a pool laughing it up with very attractive people of both genders. She also mentions that one of her reasons for joining the Bellas was to have a distraction from \"all of [her] boyfriends\".", 
                "id": "BigBeautifulWoman"
            }, 
            {
                "adjectives": [
                    "French"
                ], 
                "role": "French Maid: Well, maids in bikinis anyway. There are a couple of girls in revealing clothing rather unenthusiastically dusting the Treble's (frat?) house while they lounge in the hot tub. They are watching the \"dusting\" on their tv.", 
                "id": "FrenchMaid"
            }, 
            {
                "adjectives": [], 
                "role": "Missing Mom: No mention is made of where Beca's mother is, though it's revealed in conversation with her father that her parents are divorced.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "several", 
                    "blatant"
                ], 
                "role": "Ms. Fanservice: Stacie is put to a lot of Male Gaze. Becca is involved in several blatant cleavage shots.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "The Chicks: Stacie and Lilly.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt1981677", 
    "poster_url": "PitchPerfect.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan", 
                "ShirtlessScene", 
                "MsFanservice", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MsFanservice", 
                "MrFanservice", 
                "TheChick"
            ], 
            "shared_count": 4, 
            "id": "GIJoeRetaliation", 
            "name": "G.I. Joe: Retaliation", 
            "poster_url": "GIJoeRetaliation.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MsFanservice", 
                "MrFanservice", 
                "TheChick"
            ], 
            "shared_count": 4, 
            "id": "VanHelsing", 
            "name": "Van Helsing"
        }, 
        {
            "shared": [
                "CasanovaWannabe", 
                "MsFanservice", 
                "MrFanservice", 
                "TheChick"
            ], 
            "shared_count": 4, 
            "id": "ParaNorman", 
            "name": "ParaNorman", 
            "poster_url": "ParaNorman.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MsFanservice", 
                "MrFanservice", 
                "TheChick"
            ], 
            "shared_count": 4, 
            "id": "Immortals", 
            "name": "Immortals", 
            "poster_url": "Immortals.jpg"
        }
    ], 
    "id": "PitchPerfect", 
    "name": "Pitch Perfect"
}