{
    "plot": "Bruno is dumped by his girlfriend; behind a calm, indifferent expression, his mind plans a cold, sweet vengeance. She, a modern girl, keeps on seeing him once in a while, but has another boyfriend, Pablo. Bruno becomes Pablo's friend, with the idea of eroding the couple, maybe introducing him to another woman. But, along the way, the possibility of a plan B arises, a more effective one, which will put his own sexuality into question.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "strange", 
                    "main", 
                    "great", 
                    "kiss", 
                    "ex-girlfriend", 
                    "real"
                ], 
                "role": "A very strange version of this makes up the main plot of the Argentinian film Plan B: Bruno goes to great lengths to befriend, flirt with and even kiss Pablo, but it's all right because he's just doing it to drive him away from his ex-girlfriend Laura so that he can hook back up with her. Until he finds himself falling in love with Pablo for real...", 
                "id": "GayBravado"
            }, 
            {
                "adjectives": [
                    "other", 
                    "later", 
                    "clear", 
                    "love", 
                    "next", 
                    "other", 
                    "actual"
                ], 
                "role": "Gay Bravado: Bruno and Pablo's flirtations with each other are initially done in a jokey, \"hey let's show just how macho we are for not freaking out about being called fags\" manner. They become distinctly less macho later on, with Pablo freaking out when he tries to call Bruno's bluff by having sex with him and Bruno vomiting when his friend points out that it's clear that he's in love with Pablo. The director has said that this is a reflection of Argentinean culture where two guys sleeping next to each other in their underwear is considered a display of masculinity but actual homosexuality gives them more pause.", 
                "id": "GayBravado"
            }
        ]
    }, 
    "imdbid": "tt1408972", 
    "similar": [
        {
            "shared": [
                "GayBravado"
            ], 
            "shared_count": 1, 
            "id": "TheWildOne", 
            "name": "The Wild One", 
            "poster_url": "TheWildOne.jpg"
        }, 
        {
            "shared": [
                "GayBravado"
            ], 
            "shared_count": 1, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "GayBravado"
            ], 
            "shared_count": 1, 
            "id": "ReservoirDogs", 
            "name": "Reservoir Dogs", 
            "poster_url": "ReservoirDogs.jpg"
        }, 
        {
            "shared": [
                "GayBravado"
            ], 
            "shared_count": 1, 
            "id": "Jarhead", 
            "name": "Jarhead", 
            "poster_url": "Jarhead.jpg"
        }
    ], 
    "id": "PlanB", 
    "name": "Plan B"
}