{
    "plot": "David, single, lonely and not happy with his life, flees reality by watching Pleasantville - a 1950's b&w soap opera, where everything is just that... pleasant. His sister Jennifer, sexually far more active than her brother, gets in a fight with him about a very strange remote control. The remote was given to them just seconds after the TV broke, by an equally strange repair man. They suddenly find themselves in Pleasantville, as Bud and Mary-Sue Parker, completely assimilated and therefore black and white, in clothes a little different and with new parents... pleasant ones. David wants to get out of the situation as well as his sister, but whereas he tries to blend in (effortlessly, with his knowledge), she does whatever she wants to do. One event leads to the other, and suddenly there is a red rose growing in Pleasantville. The more rules are broken, the more colorful life gets in Pleasantville, USA.", 
    "genres": "Comedy, Drama, Fantasy", 
    "release_year": "1998", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "David/Bud", 
                    "shy", 
                    "downtrodden", 
                    "favorite", 
                    "rescue", 
                    "strong", 
                    "sterile", 
                    "black-and-white"
                ], 
                "role": "David/Bud in Pleasantville starts the film as a shy, downtrodden loner who gets beamed into his favorite wholesome 50s Sitcom. Halfway into the story, he's forced to help the town firemen put out a fire (all they did previously was rescue cats from trees), subsequently gets a date with a cheerleader, and rescues his mother from a gang of thugs. From that point on, he becomes a strong, competent leader whose insights and bravery eventually bring color and life to the previously sterile black-and-white world he's (temporarily) living in.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "sweet"
                ], 
                "role": "Mary Sue: Invoked in the form of the perfect, sweet sister character named Mary Sue — although once Jennifer assumes her role, this quickly ends.", 
                "id": "MarySue"
            }, 
            {
                "adjectives": [], 
                "role": "Pleasantville: Played with, where a girl from our day and age ends up stepping into this role... and by the time the movie's done, every girl in town is like that to some extent, except the girl who started the behavior.", 
                "id": "SeeminglyWholesomeFiftiesGirl"
            }, 
            {
                "adjectives": [
                    "such"
                ], 
                "role": "Jennifer of Pleasantville once she gets Trapped in TV Land as \"Mary Sue\". She even comments on the effect of one such sweater in one scene.", 
                "id": "SweaterGirl"
            }, 
            {
                "adjectives": [
                    "typical"
                ], 
                "role": "Sweater Girl: Jennifer is taken aback when she puts on the typical sweater and bullet bra.", 
                "id": "SweaterGirl"
            }
        ]
    }, 
    "imdbid": "tt0120789", 
    "poster_url": "Pleasantville.jpg", 
    "similar": [
        {
            "shared": [
                "SeeminglyWholesomeFiftiesGirl", 
                "SweaterGirl"
            ], 
            "shared_count": 2, 
            "id": "Christine", 
            "name": "Christine", 
            "poster_url": "Christine.jpg"
        }, 
        {
            "shared": [
                "SeeminglyWholesomeFiftiesGirl", 
                "AdrenalineMakeover"
            ], 
            "shared_count": 2, 
            "id": "CryBaby", 
            "name": "Cry-Baby", 
            "poster_url": "CryBaby.jpg"
        }, 
        {
            "shared": [
                "SeeminglyWholesomeFiftiesGirl", 
                "AdrenalineMakeover"
            ], 
            "shared_count": 2, 
            "id": "Cry-Baby", 
            "name": "Cry-Baby", 
            "poster_url": "Cry-Baby.jpg"
        }, 
        {
            "shared": [
                "SeeminglyWholesomeFiftiesGirl", 
                "SweaterGirl"
            ], 
            "shared_count": 2, 
            "id": "ReeferMadness", 
            "name": "Reefer Madness", 
            "poster_url": "ReeferMadness.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover", 
                "MarySue"
            ], 
            "shared_count": 2, 
            "id": "RomancingTheStone", 
            "name": "Romancing the Stone", 
            "poster_url": "RomancingTheStone.jpg"
        }
    ], 
    "id": "Pleasantville", 
    "name": "Pleasantville"
}