{
    "plot": "Capt. John Smith leads a rag-tag band of English sailors & soldiers to the New World to plunder its riches for England (or, more precisely, for Governor Ratcliffe, who comes along for the ride). Meanwhile, in this \"New World,\" Chief Powhatan has pledged his daughter, Pocahontas, to be married to the village's greatest warrior. Pocahontas, however, has other ideas. She has seen a vision of a spinning arrow, a vision she believes tells her change is coming. Her life does indeed change when the English ship lands near her village. Between Ratcliffe, who believes the \"savages\" are hiding the gold he expected to be plentiful, and Powhatan, who believes these pale newcomers will destroy their land, Smith and Pocahontas have a difficult time preventing all-out war, and saving their love for each other.", 
    "genres": "Animation, Adventure, Drama", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "tame"
                ], 
                "role": "Angry Native Girl: Pocahontas gives a rather tame example during Colors of the Wind.", 
                "id": "AngryBlackMan"
            }, 
            {
                "adjectives": [
                    "second", 
                    "not-evil"
                ], 
                "role": "Governor Radcliffe in Pocahontas has a beard. In the second film, King James, a not-evil man also has a beard but Governor Radcliffe's is a goatee.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "evident", 
                    "other"
                ], 
                "role": "Non-Action Guy: Wiggins, particularly evident when you compare him to the other settlers, who are all manly looking.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [
                    "greedy", 
                    "first"
                ], 
                "role": "Sissy Villain: Ratcliffe subverts this. He's vain, greedy, and wears pink, but he's also the first to be suited up for battle and leads the Virginians from the front. Not to mention being the one to try and shoot Powhatan, even if John Smith jumped in the way.", 
                "id": "SissyVillain"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Pocahontas and Nakoma.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Boobs of Steel: Pocahontas.", 
                "id": "BoobsOfSteel"
            }, 
            {
                "adjectives": [], 
                "role": "Pocahontas — Pocahontas (1995)", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "dead", 
                    "outright"
                ], 
                "role": "The title character of Pocahontas also has a dead mother and receives a necklace in memory of her. According to Wikipedia, though it's not outright stated in the film, the mother's spirit is the source of the Dramatic Wind that follows the heroine throughout.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Nubile Savage: Quite.", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [
                    "titular", 
                    "obvious"
                ], 
                "role": "Pocahontas - The titular character is one of the more obvious examples of the trope as she and her people are referred to as \"savages\".", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [
                    "Rebellious", 
                    "outright"
                ], 
                "role": "Rebellious Princess: Pocahontas is a Downplayed version; for example, when her father tells her that he wants her to marry Kocuom she's clearly not thrilled, but doesn't outright reject the idea.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "important"
                ], 
                "role": "She is The Chief's Daughter. Not technically a princess, yes, but still fairly important.", 
                "id": "TheChiefsDaughter"
            }, 
            {
                "adjectives": [
                    "beautiful"
                ], 
                "role": "Pocahontas has The Queen of England - a beautiful and kindly woman who welcomes Pocahontas graciously to the court. As well as that she acts as a voice of reason towards her rather impatient husband.", 
                "id": "TheHighQueen"
            }, 
            {
                "adjectives": [
                    "High", 
                    "beautiful"
                ], 
                "role": "The High Queen: The Queen of England - a beautiful and kindly woman who welcomes Pocahontas graciously to the court. As well as that she acts as a voice of reason towards her rather impatient husband.", 
                "id": "TheHighQueen"
            }
        ]
    }, 
    "imdbid": "tt0114148", 
    "poster_url": "Pocahontas.jpg", 
    "similar": [
        {
            "shared": [
                "NubileSavage", 
                "BoobsOfSteel", 
                "AngryBlackMan", 
                "NonActionGuy", 
                "SissyVillain", 
                "BeardOfEvil"
            ], 
            "shared_count": 6, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "EverythingsBetterWithPrincesses", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter", 
                "SissyVillain", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "AngryBlackMan", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }
    ], 
    "id": "Pocahontas", 
    "name": "Pocahontas"
}