{
    "plot": "In this direct-to-video sequel to Pokémon: The First Movie, Ash, Misty, and Brock continue exploring the Johto region, then have to rescue Pikachu after Jessie and James of Team Rocket kidnap him. The search leads them to the hidden plateau where Mewtwo has established a haven for the cloned Pokémon from the previous film. The evil Giovanni is plotting to recapture Mewtwo and renew his efforts to create an army of bio-engineered Pokémon. Aided by the reluctant Meowth, Ash and his friends defeat Giovanni and his henchman.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "2000", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Little Miss Badass: Domino of Team Rocket, who is only around Brock's age. Also a Badass Normal.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [
                    "Pokémon", 
                    "own", 
                    "electric", 
                    "main", 
                    "good", 
                    "traditional", 
                    "real", 
                    "female", 
                    "Pokémon", 
                    "Special", 
                    "same", 
                    "Pokémon"
                ], 
                "role": "Pokemon Mewtwo Returns: Team Rocket agent Domino. She has literally no Pokémon of her own, and manages to kick ass merely with gymnastics and electric flowers. She also successfully fools the main cast into thinking she's one of the good guys by acting like a traditional dumb blonde when her real personality is exactly the opposite.\n Perhaps more badass than that is that Domino gets away with talking to Giovanni any way she damn well pleases, including telling him that he's crossed the line and lost all sense of Pragmatic Villainy.\n All of the female 'Dex Holders in Pokémon Special qualify as this. Of note is Yellow, who everyone underestimates until she  gets pissed off and completely crushes the competition.\n The Anime has at least two in Ash's Bayleef and Snivy. Best Wishes character Iris is this too...but not for the same reasons as in Pokémon White.\n Phantom Thief Pokémon 7 has Lily who is, or was, one of the best grunts Team Galactic has to offer (and in this continuity they're quite the fearsome bunch), but can't be older than fifteen at best.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Perky Female Minion: Domino, who almost fits the criteria for Perky Goth...except for not actually being a Goth.", 
                "id": "PerkyFemaleMinion"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "In Pokemon Mewtwo Returns, Domino talked this way at first, but it turned out to be an act.", 
                "id": "ValleyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Valley Girl: Domino speaks like this in the dub before The Reveal that she's part of Team Rocket.", 
                "id": "ValleyGirl"
            }
        ]
    }, 
    "imdbid": "tt0304564", 
    "similar": [
        {
            "shared": [
                "LittleMissBadass", 
                "ValleyGirl"
            ], 
            "shared_count": 2, 
            "id": "BuffyTheVampireSlayer", 
            "name": "Buffy the Vampire Slayer"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "Oculus", 
            "name": "Oculus", 
            "poster_url": "Oculus.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "LittleSweetheart", 
            "name": "Little Sweetheart", 
            "poster_url": "LittleSweetheart.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass"
            ], 
            "shared_count": 1, 
            "id": "Annie1982", 
            "name": "Annie", 
            "poster_url": "Annie1982.jpg"
        }
    ], 
    "id": "PokemonMewtwoReturns", 
    "name": "Pokémon: Mewtwo Returns"
}