{
    "plot": "Grim story of one of the major battles of the Korean War. While negotiators are at work in Panmunjom trying to bring the conflict to a negotiated end, Lt. Joe Clemons is ordered to launch an attack and retake Pork Cop Hill. It's tough on the soldiers who know that the negotiations are under way and no one wants to die when they think it will all soon be over. The hill is of no particular strategic military value but all part of showing resolve during the negotiations. Under the impression that the battle has been won, battalion headquarters orders some of the men withdrawn when in fact they are in dire need of reinforcements and supplies. As the Chinese prepare to counterattack and broadcast propaganda over loudspeakers, the men prepare for what may be their last battle.", 
    "genres": "War, Drama, Action", 
    "release_year": "1959", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "regular"
                ], 
                "role": "A Father to His Men: Lt. Clemons is this, despite some of his men worrying about him being regular army.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "several", 
                    "unable"
                ], 
                "role": "Dirty Coward: Pvt. Franklin (played by Woody Strode), who feigns injury several times but is unable to fool Clemons.  He ends up threatening to kill Clemons, but is convinced to join the defenders on the line.", 
                "id": "DirtyCoward"
            }
        ]
    }, 
    "imdbid": "tt0053183", 
    "poster_url": "PorkChopHill.jpg", 
    "similar": [
        {
            "shared": [
                "AFatherToHisMen", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "AFatherToHisMen", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Centurion", 
            "name": "Centurion", 
            "poster_url": "Centurion.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "AMidnightClear", 
            "name": "A Midnight Clear", 
            "poster_url": "AMidnightClear.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "AFatherToHisMen", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "TheGunsOfNavarone", 
            "name": "The Guns of Navarone", 
            "poster_url": "TheGunsOfNavarone.jpg"
        }
    ], 
    "id": "PorkChopHill", 
    "name": "Pork Chop Hill"
}