{
    "plot": "1954. The sexual hijinks of a group of mid-teen male students of Angel Beach High School in Florida are presented. Their main goal is to lose their collective virginity. In the process, they embark on games of sexual innuendo with their female classmates, as witnessed by the activities of Billy, Tommy and Pee Wee in their secret surveillance. Pee Wee is the most desperate, that desperation which gets him into one predicament after another, especially as he is the butt of many a prank. A side issue for Tim, basically a good guy, is dealing with his learned racism, which comes to the surface with the arrival to their school of new student, Jewish Brian Schwartz. The sexual pursuits at the school are not limited to the student body as new boys Phys Ed coach, Roy Brackett, has a mutual attraction with cheer-leading coach, Miss Lynn Honeywell, who doesn't want to go all the way; Coach Brackett's goal is to find out why Coach Warren has nicknamed Miss Honeywell \"Lassie\". All these goings-on offend the sensibilities of female Phys Ed coach, Miss Beulah Balbricker, who takes it upon herself to maintain the moral standards of the school. The boys' mission seems to be stalled, so Mickey, whose brother Ted is the local sheriff, suggests they go to Porky's, a bar and unofficial brothel in neighboring Wallacetown in the middle of the Everglades, to lose their virginity. Porky's is owned by the violent Porky, whose actions are supported by his sheriff brother. The boys' experience at Porky's leads to a continuing feud between the boys and Porky and his posse, the boys' collective anger fueled by Mickey. They will learn that they may not be able to beat Porky with their fists, but may be able to do so with a little ingenuity, which may hurt Porky more in the long run.", 
    "genres": "Comedy", 
    "release_year": "1982", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "hung"
                ], 
                "role": "Bigger Is Better in Bed: \"Anthony Tuperelli affectionately known as Meat\". \"My God, the boy's deformed!\" Irony: Reportedly, the actor playing Meat was modestly endowed, and the actor playing Pee Wee was well hung.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [
                    "first", 
                    "elated", 
                    "previous", 
                    "sharp", 
                    "personal", 
                    "original"
                ], 
                "role": "Porky's\n Pee Wee's first elated act in II, upon waking and recalling he'd scored at the end of the previous film, is to add a sharp (exaggerated) upward slash to his personal penis-growth chart. His mom soon finds the chart in his room, and her eyes bug out at the Biggus Dickus implications.\n Perhaps more to the point, Meat from the original, who elicits a \"That boy is deformed!\" from a woman pretending to be a prostitute.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [
                    "scary", 
                    "good"
                ], 
                "role": "Scary Black Man: Subverted, He's only scary in the context of a prank, in reality he cracks up and has a good time alongside the boys.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Porky's has a team of boys out to get laid. It's no secret that their equipment comes in varying size, with this end being taken by Pee Wee.", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [
                    "main"
                ], 
                "role": "Teeny Weenie: Where Meat got the bigger end of the spectrum, there's no secret what Pee Wee's main problem is. Even the prostitute they hire can't help but crack jokes at his expense. See Irony above.", 
                "id": "TeenyWeenie"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Battleaxe Nurse: Balbricker.", 
                "id": "BattleaxeNurse"
            }, 
            {
                "adjectives": [], 
                "role": "Coach Balbricker in Porky's", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [], 
                "role": "Good Bad Girl: Wendy", 
                "id": "GoodBadGirl"
            }
        ]
    }, 
    "imdbid": "tt0084522", 
    "poster_url": "Porkys.jpg", 
    "similar": [
        {
            "shared": [
                "BrawnHilda", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "RobinHoodPrinceOfThieves", 
            "name": "Robin Hood: Prince of Thieves", 
            "poster_url": "RobinHoodPrinceOfThieves.jpg"
        }, 
        {
            "shared": [
                "GagPenis", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }, 
        {
            "shared": [
                "TeenyWeenie", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "NoHoldsBarred", 
            "name": "No Holds Barred", 
            "poster_url": "NoHoldsBarred.jpg"
        }, 
        {
            "shared": [
                "GagPenis", 
                "TeenyWeenie"
            ], 
            "shared_count": 2, 
            "id": "Unforgiven", 
            "name": "Unforgiven", 
            "poster_url": "Unforgiven.jpg"
        }, 
        {
            "shared": [
                "GagPenis", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheLongestYard", 
            "name": "The Longest Yard", 
            "poster_url": "TheLongestYard.jpg"
        }
    ], 
    "id": "Porkys", 
    "name": "Porky's"
}