{
    "plot": "Sally and Gillian Owens have always known they were different. Raised by their aunts after their parents' death, the sisters grew up in a household that was anything but typical--their aunts fed them chocolate cake for breakfast and taught them the uses of practical magic. But the invocation of the Owens' sorcery also carries a price--some call it a curse: the men they fall in love with are doomed to an untimely death. Now adult women with very different personalities, the quiet Sally and the fiery Gillian must use all of their powers to fight the family curse and a swarm of supernatural forces that threatens the lives of all the Owens women.", 
    "genres": "Comedy, Fantasy, Romance", 
    "release_year": "1998", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Practical"
                ], 
                "role": "Practical Magic averts this, it is implied that every witch born to the family is either a brunette or a redhead.", 
                "id": "BlondesAreWitches"
            }, 
            {
                "adjectives": [], 
                "role": "Broken Bird: Sally, after losing her husband.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "black"
                ], 
                "role": "Crazy Cat Lady: Both of the aunts in the book, where they're said to have half a dozen raggedy cats. In the movie, only one black cat is shown.", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [
                    "little", 
                    "adorable"
                ], 
                "role": "Cute Witch: Sally and Gilly as little girls. You just want to cuddle them both. Sally's daughters are adorable, too.", 
                "id": "CuteWitch"
            }, 
            {
                "adjectives": [], 
                "role": "Gossipy Hens: The ladies in town relentlessly gossip and spread rumors about the Owens women.", 
                "id": "GossipyHens"
            }, 
            {
                "adjectives": [
                    "few", 
                    "all-natural", 
                    "oatmeal-based", 
                    "vegetarian", 
                    "bird-killing", 
                    "great"
                ], 
                "role": "Granola Girl: Sally has a few of these tendencies, with her all-natural, oatmeal-based shampoos, soaps, and body lotions. Even moreso in the books, where she becomes a vegetarian after witnessing the bird-killing love spell, and great detail is used in describing her cooking.", 
                "id": "GranolaGirl"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Witch: Sally, in spite of herself. Gillian, quite deliberately. (The Aunts were apparently quite the lookers in their days, as well.)", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [
                    "Practical", 
                    "light", 
                    "seductive", 
                    "Gillian", 
                    "double"
                ], 
                "role": "Practical Magic has motherly Sally (light) and seductive Gillian (dark). That goes double for the movie adaptation. In fact, a quote in the book used to describe them sums up this trope quite nicely (albeit poetically):", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "Practical", 
                    "free"
                ], 
                "role": "Practical Magic has Sally Owens, widow and mother of two, her free spirited sister Gillian Owens, and their aunts Frances and Jet together each make a part of the crone.", 
                "id": "TheHecateSisters"
            }, 
            {
                "adjectives": [
                    "Practical", 
                    "same"
                ], 
                "role": "Practical Magic has Sandra Bullock playing the part of a Widow Witch... same curse as below.", 
                "id": "WidowWitch"
            }, 
            {
                "adjectives": [], 
                "role": "Widow Witch: Sally.", 
                "id": "WidowWitch"
            }
        ]
    }, 
    "imdbid": "tt0120791", 
    "poster_url": "PracticalMagic.jpg", 
    "similar": [
        {
            "shared": [
                "LightFeminineAndDarkFeminine", 
                "BrokenBird", 
                "HotWitch"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "WidowWitch", 
                "HotWitch", 
                "GossipyHens"
            ], 
            "shared_count": 3, 
            "id": "TheWitchesOfEastwick", 
            "name": "The Witches of Eastwick", 
            "poster_url": "TheWitchesOfEastwick.jpg"
        }, 
        {
            "shared": [
                "LightFeminineAndDarkFeminine", 
                "BrokenBird", 
                "HotWitch"
            ], 
            "shared_count": 3, 
            "id": "DarkShadows", 
            "name": "Dark Shadows", 
            "poster_url": "DarkShadows.jpg"
        }, 
        {
            "shared": [
                "WidowWitch", 
                "HotWitch", 
                "GossipyHens"
            ], 
            "shared_count": 3, 
            "id": "EvesBayou", 
            "name": "Eve's Bayou", 
            "poster_url": "EvesBayou.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "TheHecateSisters"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "PracticalMagic", 
    "name": "Practical Magic"
}