{
    "plot": "Set in the mystical lands of Persia, a rogue prince and a mysterious princess race against dark forces to safeguard an ancient dagger capable of releasing the Sands of Time -- a gift from the gods that can reverse time and allow its possessor to rule the world.", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Seso, the Scary Black Man that bodyguards Amar, is a badass Knife Nut.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "real", 
                    "first"
                ], 
                "role": "The scars on Nizam's hands provide a clue to Dastan about the real cause of why he's on the run in the first place. Dastan himself is covered in scars, seen in his Shirtless Scene early on, as well as one on his face.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "good"
                ], 
                "role": "Prince Nizam from Prince of Persia: The Sands of Time although he's never called by this title, since the audience could confuse him with the good guy.", 
                "id": "TheEvilPrince"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "independent", 
                    "time-reversing"
                ], 
                "role": "Everything's Better with Princesses: Tamina, the reigning princess of Alamut, which is obviously an independent principality at the start of the movie. One comment by her suggests that for some reason, each woman who guards the time-reversing dagger is called a princess.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "time-reversing", 
                    "independent", 
                    "such", 
                    "city’s"
                ], 
                "role": "Princess Tamina in Prince of Persia: The Sands of Time, who is apparently the princess of a city: one comment by her suggests that for some reason, each woman who guards the time-reversing dagger is called a princess. The movie seems to imply that her city is an independent principality. As such the title of the city’s monarch would be princess, especially if only women ascend to the throne.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "outside"
                ], 
                "role": "Princess Tamina in Prince of Persia: The Sands of Time . Her looks are widely known and when the Persian army first sees her all the men rather hilariously go \"OOOOOOOOOOHH!!!!\" as if they have never seen a woman before. Ironically once she is out and about outside her palace no one else reacts like this throughout the rest of the film.", 
                "id": "WorldsMostBeautifulWoman"
            }
        ]
    }, 
    "imdbid": "tt0473075", 
    "poster_url": "PrinceOfPersiaTheSandsOfTime.jpg", 
    "similar": [
        {
            "shared": [
                "TheEvilPrince", 
                "ShirtlessScene", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "ShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheIcePirates", 
            "name": "The Ice Pirates", 
            "poster_url": "TheIcePirates.jpg"
        }, 
        {
            "shared": [
                "TheEvilPrince", 
                "EverythingsBetterWithPrincesses"
            ], 
            "shared_count": 2, 
            "id": "ShrekTheThird", 
            "name": "Shrek the Third", 
            "poster_url": "ShrekTheThird.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "WorldsMostBeautifulWoman"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "PrinceOfPersiaTheSandsOfTime", 
    "name": "Prince of Persia: The Sands of Time"
}