{
    "plot": "While protecting his village from rampaging boar-god/demon, a confident young warrior, Ashitaka, is stricken by a deadly curse. To save his life, he must journey to the forests of the west. Once there, he's embroiled in a fierce campaign that humans were waging on the forest. The ambitious Lady Eboshi and her loyal clan use their guns against the gods of the forest and a brave young woman, Princess Mononoke, who was raised by a wolf-god. Ashitaka sees the good in both sides and tries to stem the flood of blood. This is met be animosity by both sides as they each see him as supporting the enemy.", 
    "genres": "Animation, Adventure, Fantasy", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "gorgeous"
                ], 
                "role": "Chick Magnet: All of the Irontown women think Ashitaka is gorgeous and fawn over him constantly, and even San seems attracted to him.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "married"
                ], 
                "role": "Princess Mononoke's Ashitaka manages to effortlessly draw the affection of Irontown's entire female population. Even the married ones.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "odd", 
                    "original", 
                    "own"
                ], 
                "role": "Disappeared Dad: Neither of Ashitaka's parents are ever even mentioned in passing, which seems odd as his father would be the leader of the Emishi. For that matter, the father of Moro's wolf cubs is never mentioned either. The original language seems to hint that just as the women want to avenge their husbands, San has come to avenge her own tribe — sounds like there were more wolves before.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "underwear"
                ], 
                "role": "Ashitaka from Princess Mononoke has a fundoshi as underwear.", 
                "id": "Fundoshi"
            }, 
            {
                "adjectives": [
                    "young", 
                    "attractive", 
                    "great"
                ], 
                "role": "Mr. Fanservice: Arguably Ashitaka, the one young, attractive male in the cast who frequently performs feats of great badassery and/or takes his shirt off.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Ashitaka steadily loses more and more of his clothes throughout the movie, until he is running around in just his pants and his... sleeves?", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "prime"
                ], 
                "role": "The Wise Prince: Ashitaka, who is also a prime example of a Warrior Prince.", 
                "id": "TheWisePrince"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "other", 
                    "gun-wielding"
                ], 
                "role": "Action Girl: San is the foremost example. Lady Eboshi also has a place here. Toki and the other gun-wielding girls, too.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "actual", 
                    "own", 
                    "spear"
                ], 
                "role": "Princess Mononoke doesn't control an actual kingdom, she does have her own family of wolves and fights pretty especially with a spear.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "enigmatic"
                ], 
                "role": "God Save Us from the Queen!: Inverted. The enigmatic Lady Eboshi. She's \"saving\" her people from the gods, though, not vice versa...", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "Former", 
                    "many", 
                    "other", 
                    "kind", 
                    "sarcastic"
                ], 
                "role": "Hooker with a Heart of Gold: Former hookers, anyway. Toki and many (if not all) of the other women in the town used to work in brothels. They are very kind, if sarcastic, and all bravely take up arms and defend Iron Town from the invading samurai.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "close"
                ], 
                "role": "Lady Eboshi is as close to this as an Iron Lady can be (having Minnie Driver as your English VA helps a lot).", 
                "id": "IronLady"
            }, 
            {
                "adjectives": [
                    "primal", 
                    "elegant", 
                    "arsenal"
                ], 
                "role": "Lady Eboshi, when compared to the more primal and savage San, is elegant, calm, calculating and has an arsenal of rifles at her disposal that can pierce samurai armor like paper.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "unladylike"
                ], 
                "role": "Lady of War: Lady Eboshi, quite literally. Though her favored weapon is a very unladylike gun.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "magical"
                ], 
                "role": "San from Princess Mononoke is quite pretty and well groomed for somebody Raised by Wolves, aside from the fact that her face is often smeared with blood. It may have something to do with the fact that the wolves that raised her are also magical Shinto demigods.", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [
                    "warfare", 
                    "personal", 
                    "powerful", 
                    "whole"
                ], 
                "role": "Eboshi in Princess Mononoke believes that women should not be excluded from warfare and has her gunsmiths design a rifle for women. It is fired more like a rocket launcher than a musket and her personal prototype seems to be the most powerful weapon in the whole film.", 
                "id": "SmallGirlBigGun"
            }, 
            {
                "adjectives": [], 
                "role": "The Woman Wearing the Queenly Mask: Lady Eboshi.", 
                "id": "TheWomanWearingTheQueenlyMask"
            }, 
            {
                "adjectives": [], 
                "role": "Princess Mononoke definitely counts. Also counts as Badass Princess.", 
                "id": "TomboyPrincess"
            }
        ]
    }, 
    "imdbid": "tt0119698", 
    "poster_url": "PrincessMononoke.jpg", 
    "similar": [
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "TomboyPrincess", 
                "LadyOfWar", 
                "MrFanservice", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 6, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "TomboyPrincess", 
                "LadyOfWar", 
                "SmallGirlBigGun", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 6, 
            "id": "NausicaaOfTheValleyOfTheWind", 
            "name": "Nausicaä of the Valley of the Wind", 
            "poster_url": "NausicaaOfTheValleyOfTheWind.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "ShirtlessScene", 
                "MrFanservice", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "TomboyPrincess", 
                "GodSaveUsFromTheQueen", 
                "BadassPrincess", 
                "ActionGirl", 
                "TheWomanWearingTheQueenlyMask"
            ], 
            "shared_count": 5, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "ShirtlessScene", 
                "MrFanservice", 
                "ActionGirl", 
                "GodSaveUsFromTheQueen"
            ], 
            "shared_count": 5, 
            "id": "MirrorMirror", 
            "name": "Mirror, Mirror"
        }
    ], 
    "id": "PrincessMononoke", 
    "name": "Princess Mononoke"
}