{
    "plot": "Having always wanted to be a disc-jockey, Howard Stern works his way painfully from radio at his 1970's college to a Detroit station. It is with a move to Washington that he hits on an outrageous off-the-wall style that catches audience attention. Despite his on-air blue talk, at home he is a loving husband. He needs all the support he can get when he joins NBC in New York and comes up against a very different vision of radio.", 
    "genres": "Biography, Comedy, Drama", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "later", 
                    "male", 
                    "male", 
                    "normal", 
                    "median", 
                    "perspective", 
                    "normal"
                ], 
                "role": "Teeny Weenie: Discussed throughout the book, as was a staple of his schtick for years. Interestingly, years later, all the male staff members (heh, male staff members) had their penises measured for a show bit...and Howard was in fact, shockingly in the normal range, and was actually over the median range of the rest of the staff (6 inches if you're really wondering). Turns out it was just a matter of perspective (he's 6'5\", so to him...) His (now ex) wife always claimed when interviewed that it was in fact normal.", 
                "id": "TeenyWeenie"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "My Beloved Smother: Howard describes his mother raising him \"like a veal.\"", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "former", 
                    "regular", 
                    "various"
                ], 
                "role": "The Vamp: Jessica Hahn, Penthouse Pet and former mistress of disgraced televangelist Jimmy Bakker. During the height of the scandal, she was a regular on The Stern Show and became...enamoured with Howard, and him to her. Howard was married at the time. He describes in the book as her being one of the biggest temptations to cheat on his wife he ever had, and put a strain on his marraige at the time, even more than the various bimbos who've been naked and butt bongo'd in the studio.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0119951", 
    "poster_url": "PrivateParts.jpg", 
    "similar": [
        {
            "shared": [
                "TeenyWeenie", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "BlackSwan", 
            "name": "Black Swan", 
            "poster_url": "BlackSwan.jpg"
        }, 
        {
            "shared": [
                "MyBelovedSmother"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "MyBelovedSmother"
            ], 
            "shared_count": 1, 
            "id": "PeytonPlace", 
            "name": "Peyton Place", 
            "poster_url": "PeytonPlace.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "Sunrise", 
            "name": "Sunrise", 
            "poster_url": "Sunrise.jpg"
        }
    ], 
    "id": "PrivateParts", 
    "name": "Private Parts"
}