{
    "plot": "Major Jaidev Rajvansh and his fellow officer Hussein manage to rescue a leading politician as well as capture his kidnapper, Abhrush. The terrorist has been searched for years and he is finally captured by the two officers. Jai returns to a joyous welcome, and is declared a national hero. He takes a break from the army and returns to his hometown. There he meets his childhood friend Anjali who has always harboured love for Jai. Anjali is determined to make sure she and Jai stay together 24/7. At a party, he meets Miss India, Pooja Mallapa. As they spend more time together, he begins to love her and she too begins to love him. In the mean time, Jai's parents are arranging his marriage to Anjali but when they find out about Jai's love for Pooja, they realise that they have to tell Anjali everything. Anjali, heartbroken and jealous swears revenge on Jai for rejecting her. Realising her hatred for him. Abrush takes advantage and together they plot to destroy Jai's reputation and life. Anjali manages to steal some important documents regarding Abrush's plans. The events following leads to Jai being dismissed from the army and he is declared a traitor to the country. Jai, determined to prove his innocence and redeem himself, decides to pursue Abrush alone. Will Jai find out about Anjali's betrayal?", 
    "genres": "Action, Drama, Romance", 
    "release_year": "2000", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "successful"
                ], 
                "role": "A Father to His Men: The reason why Jai is successful in capturing Abrush at the beginning of the movie.", 
                "id": "AFatherToHisMen"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Clingy Jealous Girl: Anjali at the beginning of the movie.", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [
                    "slinky"
                ], 
                "role": "Ms. Fanservice: Anjali in a slinky nightclub outfit and Pooja during one of the songs.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Woman Scorned: Anjali, of course.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0218533", 
    "poster_url": "Pukar.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "WomanScorned"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "WomanScorned"
            ], 
            "shared_count": 2, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "WomanScorned"
            ], 
            "shared_count": 2, 
            "id": "MySuperExGirlfriend", 
            "name": "My Super Ex Girlfriend"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "WaynesWorld", 
            "name": "Wayne's World", 
            "poster_url": "WaynesWorld.jpg"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "WomanScorned"
            ], 
            "shared_count": 2, 
            "id": "TheRockyHorrorPictureShow", 
            "name": "The Rocky Horror Picture Show", 
            "poster_url": "TheRockyHorrorPictureShow.jpg"
        }
    ], 
    "id": "Pukar", 
    "name": "Pukar"
}