{
    "plot": "Frank is a drug pusher on the roll until he makes a huge deal with dope that he hasn't paid for and he gets busted by the police. He manages to dump the dope in a nearby lake but he owes his supplier a lot of money (not a nice guy to owe money to). Now we follow Frank in his quest to raise money in the underworld of Copenhagen.", 
    "genres": "Crime, Thriller", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Archnemesis Dad: the Duke to Tonny in 2. Despite this, he loves his younger son, Valdemar, enough to  ask Tonny to kill Valdemar's mother, who wants full custody of him", 
                "id": "ArchnemesisDad"
            }, 
            {
                "adjectives": [
                    "unable"
                ], 
                "role": "The Loins Sleep Tonight: Tonny in Pusher 2, who's unable to get it up with two prostitutes.", 
                "id": "TheLoinsSleepTonight"
            }, 
            {
                "adjectives": [
                    "unable", 
                    "entire"
                ], 
                "role": "Tonny in Pusher 2 hires two prostitutes for a celebratory orgy after getting out of prison, but is completely unable to perform. This is just one of an entire film's worth of indignities that he suffers.", 
                "id": "TheLoinsSleepTonight"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Daddy's Little Villain: In Pusher 3, we discover that Milo's daughter clearly wears the pants in the family. She barks orders at her flustered father during her birthday celebration. When she discovers that Milo is forcing her boyfriend to buy his heroin for distribution, she tells her father to lower his price. What a family!", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [
                    "independent"
                ], 
                "role": "In the Danish film Pusher 3, Serb druglord Milo's daughter clearly wears the pants in the family, ordering her flustered father around to prepare for her 25th birthday party. After Milo discovers that her boyfriend is an independent drug dealer and forces him to buy his product for distribution, his daughter finds out and hardballs his price down. What a family!", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [
                    "Disposable", 
                    "later", 
                    "new"
                ], 
                "role": "Disposable Sex Worker: In Pusher 2, Kurt kills a hooker in his home, tricking Tonny into being an accomplice. However, Tonny later refuses to kill his father's new wife, who is a brothel madam. Milo also treats a sex slave as a human being, which leads to a war with the Albanian gangsters.", 
                "id": "DisposableSexWorker"
            }, 
            {
                "adjectives": [], 
                "role": "Pusher 2 has Kurt trick Tonny into being an accomplice in the murder of a prostitute. However, when Tonny is given the job to kill another prostitute, he decides not to go through with it.", 
                "id": "DisposableSexWorker"
            }, 
            {
                "adjectives": [
                    "patient", 
                    "complete", 
                    "doormat—when"
                ], 
                "role": "Hooker with a Heart of Gold: While Vic doesn't really consider herself a prostitute, she's awfully patient and understanding with Frank, and tries to help him. But she's not a complete doormat—when Frank turns away and demeans her plan to escape to Barcelona, she takes his money and leaves.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "drug-dealer"
                ], 
                "role": "In Pusher 3, it's revealed that the ruthless druglord Milo has a very demanding adult daughter. The film is set on the day of her birthday, while he's trying to throw her a celebration that meets her standards. Along the way, he discovers that her boyfriend is a drug-dealer, so Milo browbeats the boyfriend into buying all of his drugs from him. When Milo's daughter finds out, she browbeats Milo into lowering his price. Whatta family!", 
                "id": "MafiaPrincess"
            }, 
            {
                "adjectives": [
                    "happy"
                ], 
                "role": "Woman Scorned: After having the idea of a happy life away from all the troubles in Denmark dangled in front of her nose for too long, only to be ultimately snatched away, Vic finally decides to hell with Frank, grabs his money, and runs.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0117407", 
    "similar": [
        {
            "shared": [
                "HookerWithAHeartOfGold", 
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 2, 
            "id": "MidnightCowboy", 
            "name": "Midnight Cowboy", 
            "poster_url": "MidnightCowboy.jpg"
        }, 
        {
            "shared": [
                "DisposableSexWorker", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "TotalRecall1990", 
            "name": "Total Recall ", 
            "poster_url": "TotalRecall1990.jpg"
        }, 
        {
            "shared": [
                "DisposableSexWorker", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "Deadman", 
            "name": "Deadman"
        }, 
        {
            "shared": [
                "DisposableSexWorker", 
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 2, 
            "id": "Nekromantik", 
            "name": "Nekromantik", 
            "poster_url": "Nekromantik.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold", 
                "TheLoinsSleepTonight"
            ], 
            "shared_count": 2, 
            "id": "TheSting", 
            "name": "The Sting", 
            "poster_url": "TheSting.jpg"
        }
    ], 
    "id": "Pusher", 
    "name": "Pusher"
}