{
    "plot": "Is there solace in revenge? Bond and \"M\" sniff a shadowy international network of power and corruption reaping billions. As Bond pursues the agents of an assassination attempt on \"M,\" all roads lead to Dominic Greene, a world-renowned developer of green technology. Greene, a nasty piece of work, is intent on securing a barren area of Bolivia in exchange for assisting a strongman stage a coup there. The CIA looks the other way, and only Bond, with help from a retired spy and from a mysterious beauty, stands in Greene's way. \"M\" wonders if she can trust Bond, or if vengeance possesses him. Beyond that, can anyone drawn to Bond live to tell the tale?", 
    "genres": "Action, Adventure, Thriller", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "General Medrano from Quantum of Solace.", 
                "id": "TheGeneralissimo"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "'That", 
                    "good"
                ], 
                "role": "The \"New\" Bond films have continued this trend. Witness Strawberry Fields in Quantum of Solace.\n Bond is appropriately horrified, however. He doesn't sleep with Camille either. Hopefully this realism will continue.\n Not really. In Skyfall when Silva kills Severine, Bond doesn't seem to care. His only response is 'That was a waste of perfectly good scotch'. And he slept with her.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "only", 
                    "real", 
                    "last", 
                    "significant", 
                    "military", 
                    "She-Fu"
                ], 
                "role": "Faux Action Girl: Camille. She is supposed to be an Action Girl, because she dares shoot Bond, doesn't sleep with him, and has a fistfight with Medrano in the climax. In truth, she doesn't do anything. In fact, she's more of The Load to Bond. During the plane dogfight, she only clings on the floor as Bond pilots; worse, she bails out before Bond by taking the only parachute without even giving Bond a word. The night Bond is arrested in the hotel, she bails out from him again, claiming that it isn't her fight. She doesn't show up during the bar shoot-out either. The real kicker of all, however, is her fight with Medrano. Watch closely; it is she who gets her ass handed to her. It just happens that a shard is within her arm's reach after her last fall. Reality Ensues: Medrano not only has a significant height, weight, reach and strength advantage over her, but military training to boot. Against an opponent like that, it doesn't matter how much She-Fu you know, you're going to get your ass kicked.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [
                    "clear", 
                    "quick", 
                    "quick"
                ], 
                "role": "Girl of the Week: Deliberately done differently. It's clear to Bond, Fields and the audience that she's just a quick lay, and all Camille gives Bond is a quick peck before apparently leaving him forever. Deconstructed with Fields, since she's used to show Bond that his cold manipulation of the people around him can actually ruin or end their lives.", 
                "id": "GirlOfTheWeek"
            }, 
            {
                "adjectives": [
                    "closing"
                ], 
                "role": "So far, just about every girl that Daniel Craig's Bond has had sex with has died before the closing credits. The only two Daniel Craig-era Bond girls to survive so far are Camille Montes (who Bond doesn't even get in bed with) in \"Quantum of Solace\" and the random woman he is seen with at the beginning of Skyfall.", 
                "id": "GirlOfTheWeek"
            }, 
            {
                "adjectives": [], 
                "role": "Camille, Jinx, Wai Lin, Certes, Domino (with a harpoon!), Contessa Tracy, Pussy Galore, Melina, Pam, May Day, and Vesper.", 
                "id": "NeutralFemale"
            }
        ]
    }, 
    "imdbid": "tt0830515", 
    "poster_url": "QuantumOfSolace.jpg", 
    "similar": [
        {
            "shared": [
                "NeutralFemale", 
                "DisposableWoman", 
                "TheGeneralissimo"
            ], 
            "shared_count": 3, 
            "id": "LicenceToKill", 
            "name": "Licence to Kill", 
            "poster_url": "LicenceToKill.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "DisposableWoman", 
                "GirlOfTheWeek"
            ], 
            "shared_count": 3, 
            "id": "CasinoRoyale", 
            "name": "Casino Royale", 
            "poster_url": "CasinoRoyale.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "FauxActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheBladeMaster", 
            "name": "The Blade Master"
        }, 
        {
            "shared": [
                "DisposableWoman", 
                "GirlOfTheWeek"
            ], 
            "shared_count": 2, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "GirlOfTheWeek", 
                "FauxActionGirl"
            ], 
            "shared_count": 2, 
            "id": "BatmanReturns", 
            "name": "Batman Returns", 
            "poster_url": "BatmanReturns.jpg"
        }
    ], 
    "id": "QuantumOfSolace", 
    "name": "Quantum of Solace"
}