{
    "plot": "In Las Vegas, the regenerated ex-con Jack Bruno works as taxi driver. During an UFO Convention at Planet Hollywood, the skeptical Jack picks up Dr. Alex Friedman, who will present a scientific lecture in the event. Then he is pressed by two henchmen of his former boss, the criminal Wolff, that wants to talk to him, but Jack does not want to return to the crime life. Jack fights and gets rid of them; out of the blue, he finds two teenagers on the backseat of his cab. They tell that they are siblings, Sara and Seth, and they need to travel to a location outside Las Vegas in the middle of nowhere. Meanwhile the government finds a spacecraft that crashed nearby Las Vegas and is chasing the two aliens; after the investigation of the men of Major Henry Burke, they discover that the two siblings are the aliens. Jack Bruno, Sara and Seth are chased by Henry Burke's team and by the \"Syphon\", a killer from outer space that has been sent to kill them by the military of their planet that want to invade Earth. Sara and Seth explain that they traveled to Earth to collect scientific data of an experiment and save Earth from invasion, but they need to return immediately to their planet. Jack teams up with Dr. Alex to retrieve their spacecraft in a secret base in the Witch Mountain.", 
    "genres": "Action, Adventure, Family", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Papa Wolf: Jack Bruno", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scientist: Dr. Friedman", 
                "id": "HotScientist"
            }
        ]
    }, 
    "imdbid": "tt1075417", 
    "poster_url": "RaceToWitchMountain.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "TheAmazingSpiderMan", 
            "name": "The Amazing Spider-Man", 
            "poster_url": "TheAmazingSpiderMan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "JohnCarter", 
            "name": "John Carter", 
            "poster_url": "JohnCarter.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "RiseOfThePlanetOfTheApes", 
            "name": "Rise of the Planet of the Apes", 
            "poster_url": "RiseOfThePlanetOfTheApes.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "PacificRim", 
            "name": "Pacific Rim", 
            "poster_url": "PacificRim.jpg"
        }
    ], 
    "id": "RaceToWitchMountain", 
    "name": "Race to Witch Mountain"
}