{
    "plot": "A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobic profession. When fate places Remy in the sewers of Paris, he finds himself ideally situated beneath a restaurant made famous by his culinary hero, Auguste Gusteau. Despite the apparent dangers of being an unlikely - and certainly unwanted - visitor in the kitchen of a fine French restaurant, Remy's passion for cooking soon sets into motion a hilarious and exciting rat race that turns the culinary world of Paris upside down.", 
    "genres": "Animation, Comedy, Family", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Rémy", 
                    "Rémy", 
                    "uhhh—", 
                    "different"
                ], 
                "role": "When Linguini tries to confess to Colette about Rémy (until Rémy forces him to kiss her) he says something along the lines of \"I have a little uhhh—\". Cue Colette briefly glancing down, as though she thought he was referring to a different dirty little secret.", 
                "id": "TeenyWeenie"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Biker Babe: Colette", 
                "id": "BikerBabe"
            }, 
            {
                "adjectives": [
                    "strong", 
                    "outstanding", 
                    "top"
                ], 
                "role": "Colette from Ratatouille twists this trope around by being strong, feminine, and an outstanding chef at one of Paris' top restaurants all at once. She makes a speech partway through the film which is a Take That to the notion that women can only cook within the home, which is clearly a Berserk Button.", 
                "id": "FeminineWomenCanCook"
            }, 
            {
                "adjectives": [
                    "difficult", 
                    "due", 
                    "only", 
                    "professional", 
                    "willing", 
                    "true", 
                    "hard", 
                    "culinary"
                ], 
                "role": "Feminine Women Can Cook: Inverted. Colette makes it clear that it's very difficult for a woman to get into haute cuisine, due to the sexism ingrained in the system, and that the only reason why she managed to become a professional chef was because she was willing to go through hell. (This is quite true; women have an extremely hard time making it in the culinary world, particularly in France.)", 
                "id": "FeminineWomenCanCook"
            }, 
            {
                "adjectives": [
                    "dead", 
                    "Rémy"
                ], 
                "role": "Missing Mom: Linguini's mother is recently dead and Rémy's is never mentioned at all.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "There is no mention of Remy's mother in Ratatouille. Early production art shows that she was intended to be a character (named Desiree), but was dropped to allow greater focus upon the father-son relationship between Django and Remy.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "old", 
                    "own", 
                    "disastrous"
                ], 
                "role": "Ratatouille's old lady. See rat, grab shotgun, shoot up own home in disastrous yet badass attempt to kill it.", 
                "id": "NeverMessWithGranny"
            }
        ]
    }, 
    "imdbid": "tt0382932", 
    "poster_url": "Ratatouille.jpg", 
    "similar": [
        {
            "shared": [
                "NeverMessWithGranny", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }, 
        {
            "shared": [
                "BikerBabe", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "TeenyWeenie", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Unforgiven", 
            "name": "Unforgiven", 
            "poster_url": "Unforgiven.jpg"
        }, 
        {
            "shared": [
                "FeminineWomenCanCook", 
                "TeenyWeenie"
            ], 
            "shared_count": 2, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "NeverMessWithGranny", 
                "BikerBabe"
            ], 
            "shared_count": 2, 
            "id": "Goldfinger", 
            "name": "Goldfinger", 
            "poster_url": "Goldfinger.jpg"
        }
    ], 
    "id": "Ratatouille", 
    "name": "Ratatouille"
}