{
    "plot": "In the near future when people become uninterested in boxing and similar sports, a new sport is created - Robot boxing wherein robots battle each other while being controlled by someone. Charlie Kenton, a former boxer who's trying to make it in the new sport, not only doesn't do well, he is very deeply in the red. When he learns that his ex, mother of his son Max, dies, he goes to figure out what to do with him. His ex's sister wants to take him in but Charlie has first say in the matter. Charlie asks her husband for money so he can buy a new Robot in exchange for turning Max over to them. He takes Max for the summer. And Max improves his control of his robot. But when the robot is destroyed, they go to a scrap yard to get parts. Max finds an old generation robot named Atom and restores him. Max wants Atom to fight but Charlie tells him he won't last a round. However, Atom wins. And it isn't long before Atom is getting major bouts. Max gets Charlie to teach Atom how to fight, and the father and son bond strenghtens.", 
    "genres": "Action, Drama, Sci-Fi", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "late"
                ], 
                "role": "Disappeared Dad: Charlie, who has been out of Max's life for nearly all of his eleven years of living. Needless to say, his late girlfriend's sister and husband hate him for it.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Charlie fights even more ferociously when Ricky and his men are going to proceed with beating up Max, his son as well.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Wrench Wench: Bailey", 
                "id": "WrenchWench"
            }
        ]
    }, 
    "imdbid": "tt0433035", 
    "poster_url": "RealSteel.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad"
            ], 
            "shared_count": 2, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad"
            ], 
            "shared_count": 2, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad"
            ], 
            "shared_count": 2, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad"
            ], 
            "shared_count": 2, 
            "id": "TheAristocats", 
            "name": "The Aristocats", 
            "poster_url": "TheAristocats.jpg"
        }
    ], 
    "id": "RealSteel", 
    "name": "Real Steel"
}