{
    "plot": "Professional photographer L.B. \"Jeff\" Jeffries breaks his leg while getting an action shot at an auto race. Confined to his New York apartment, he spends his time looking out of the rear window observing the neighbors. He begins to suspect that a man across the courtyard may have murdered his wife. Jeff enlists the help of his high society fashion-consultant girlfriend Lisa Freemont and his visiting nurse Stella to investigate.", 
    "genres": "Mystery, Thriller", 
    "release_year": "1954", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Girl Friday: Lisa to Jeff. The trope is even discussed by them:", 
                "id": "GirlFriday"
            }, 
            {
                "adjectives": [
                    "own"
                ], 
                "role": "Lisa from Rear Window refers to herself as this while helping Jeff try to figure out if one of the neighbors killed his own wife. She proceeds to send a letter from Jeff to the suspect, inspect the courtyard for any body parts, and even break into the accused's apartment to search for clues.", 
                "id": "GirlFriday"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: One of Jeff's neighbours, \"Miss Torso,\" is a ballet dancer, who dances around in her underwear.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "elegant", 
                    "professional", 
                    "well-off", 
                    "granted—and", 
                    "wrong"
                ], 
                "role": "Lisa Fremont from Hitchcock's Rear Window. Played by Grace Kelly—and therefore highly feminine, elegant, and dignified—Lisa is nonetheless a professional model and saleswoman for a luxury clothing company, and is quite well-off and influential. She dotes upon the man she loves—L.B. Jefferies, played by Jimmy Stewart—but gets understandably miffed when he chafes against her efforts to \"fit into\" his world of \"tough\" photography. She defies the gender conventions he seems to take for granted—and ultimately proves him wrong as the film progresses.", 
                "id": "SpiritedYoungLady"
            }
        ]
    }, 
    "imdbid": "tt0047396", 
    "poster_url": "RearWindow.jpg", 
    "similar": [
        {
            "shared": [
                "SpiritedYoungLady", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "MsFanservice"
            ], 
            "shared_count": 2, 
            "id": "Tarzan", 
            "name": "Tarzan", 
            "poster_url": "Tarzan.jpg"
        }, 
        {
            "shared": [
                "SpiritedYoungLady"
            ], 
            "shared_count": 1, 
            "id": "TheDuchess", 
            "name": "The Duchess", 
            "poster_url": "TheDuchess.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }, 
        {
            "shared": [
                "MsFanservice"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "RearWindow", 
    "name": "Rear Window"
}