{
    "plot": "In 208 A.D., in the final days of the Han Dynasty, shrewd Prime Minster Cao Cao convinced the fickle Emperor Han the only way to unite all of China was to declare war on the kingdoms of Xu in the west and East Wu in the south. Thus began a military campaign of unprecedented scale, led by the Prime Minister, himself. Left with no other hope for survival, the kingdoms of Xu and East Wu formed an unlikely alliance. Numerous battles of strength and wit ensued, both on land and on water, eventually culminating in the battle of Red Cliff. During the battle, two thousand ships were burned, and the course of Chinese history was changed forever.", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "final"
                ], 
                "role": "A Father to His Men: Liu Bei makes straw footwear for his soldiers by hand. Gan Xing too, till his final moments", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "Bromantic"
                ], 
                "role": "Bromantic Foil: Zhuge Liang and Zhou Yu, natch.", 
                "id": "BromanticFoil"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Huang Gai and Guan Yu", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "great"
                ], 
                "role": "Cultured Badass: Guan Yu combines this with Friend to All Children as he spends his offtime as a schoolteacher. Whereas Zhang Fei has yet to master calligraphy. Zhou Yu, too. The northerners know him more for being a great musician, and their southern allies have to warn him that he has been their deadliest foe for years.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "great"
                ], 
                "role": "Cultured Badass: Guan Yu combines this with Friend To All Children as he spends his offtime as a schoolteacher. Whereas Zhang Fei has yet to master calligraphy. Zhou Yu, too. The northerners know him more for being a great musician, and their southern allies have to warn him that he has been their deadliest foe for years.", 
                "id": "CulturedBadass"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "tomboyish"
                ], 
                "role": "Action Girl: Sun Shangxiang; also technically a Lady of War, since she's a princess, if a rather tomboyish one.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "all-women"
                ], 
                "role": "Amazon Brigade: Sun Shangxiang's all-women cavalry archers.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [
                    "soft-spoken", 
                    "different", 
                    "Japanese", 
                    "demographic"
                ], 
                "role": "Before these two made waves in Taiwan, the soft-spoken and equally leggy model Lin Chiling (of Red Cliff fame) was often accused of this, but actually fits a completely different Japanese demographic.", 
                "id": "Kawaiiko"
            }, 
            {
                "adjectives": [
                    "Gratuitious", 
                    "actual", 
                    "later"
                ], 
                "role": "Ms. Fanservice: Xiao Qiao stars in a Gratuitious Sex Scene with Zhou Yu to make the audience care about her more, since she goes to Cao Cao's camp before the actual battle later after in an attempt to get him to throw the fight. Also, she is usually the focus of the scenes she's in and the camera also loves to focus whatever part of her skin she has exposed at that time, notably on that Bare Your Midriff scene.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Sweet Polly Oliver: Shangxiang disguises herself as a soldier in order to infiltrate Cao Cao's camp.", 
                "id": "SweetPollyOliver"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "crucial"
                ], 
                "role": "In Red Cliff, Xiao Qiao is claimed to be the most beautiful woman in the world. It's even suggested that Cao Cao is only fighting the war because he's obsessed with her. Which she manages to use to her advantage by making tea for him at a crucial moment, thus delaying his attack and allowing her husband to win the upcoming battle.", 
                "id": "WorldsMostBeautifulWoman"
            }, 
            {
                "adjectives": [
                    "Zhōnghuá", 
                    "following"
                ], 
                "role": "Yamato Nadeshiko: Xiao Qiao. (Technically, more like a Zhōnghuá Yěhuā.) Lampshaded in the following dialogue:", 
                "id": "YamatoNadeshiko"
            }, 
            {
                "adjectives": [
                    "Japanese", 
                    "new", 
                    "first", 
                    "major"
                ], 
                "role": "Red Cliff: Xiao Qiao is the reason why Japanese Love Lin Chiling (a Taiwanese model-and-first-time actress, known for exhibiting this behavior in Real Life).\n In some form of distaff Hilarious in Hindsight karma, trailers for Lin Chiling's new movie Treasure Hunter have her wielding a Blade on a Stick in her first major fight scene.", 
                "id": "YamatoNadeshiko"
            }, 
            {
                "adjectives": [
                    "following"
                ], 
                "role": "Yamato Nadeshiko: Xiao Qiao. Lampshaded in the following dialogue:", 
                "id": "YamatoNadeshiko"
            }
        ]
    }, 
    "imdbid": "tt0425637", 
    "poster_url": "RedCliff.jpg", 
    "similar": [
        {
            "shared": [
                "AmazonBrigade", 
                "MsFanservice", 
                "CoolOldGuy", 
                "ActionGirl", 
                "SweetPollyOliver"
            ], 
            "shared_count": 5, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "YamatoNadeshiko", 
                "CoolOldGuy", 
                "ActionGirl", 
                "SweetPollyOliver"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "AmazonBrigade", 
                "ActionGirl", 
                "AFatherToHisMen"
            ], 
            "shared_count": 4, 
            "id": "Dune", 
            "name": "Dune", 
            "poster_url": "Dune.jpg"
        }, 
        {
            "shared": [
                "AmazonBrigade", 
                "MsFanservice", 
                "CoolOldGuy", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "SuckerPunch", 
            "name": "Sucker Punch", 
            "poster_url": "SuckerPunch.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "CoolOldGuy", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "RedCliff", 
    "name": "Red Cliff"
}