{
    "plot": "In the year 2056 - the not so distant future - an epidemic of organ failures devastates the planet. Out of the tragedy, a savior emerges: GeneCo, a biotech company that offers organ transplants, for a price. Those who miss their payments are scheduled for repossession and hunted by villainous Repo Men. In a world where surgery addicts are hooked on painkilling drugs and murder is sanctioned by law, a sheltered young girl searches for the cure to her own rare disease as well as information about her family's mysterious history. After being sucked into the haunting world of GeneCo, she is unable to turn back, as all of her questions will be answered at the wildly anticipated spectacular event: The Genetic Opera.", 
    "genres": "Horror, Musical, Sci-Fi", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Battle Butler: Rotti's henchgirls as a female example.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "effeminate", 
                    "big"
                ], 
                "role": "Camp Straight: Pavi, who is really effeminate but is also a big womanizer.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "woman-hating", 
                    "effeminate"
                ], 
                "role": "Effeminate Misogynistic Guy: Pavi Largo is a woman-hating (implied) rapist, but he wears the face of a woman he killed and is generally effeminate.", 
                "id": "EffeminateMisogynisticGuy"
            }, 
            {
                "adjectives": [
                    "love-a", 
                    "rich", 
                    "mercenary"
                ], 
                "role": "Kavorka Man: They all love-a the Pavi! Despite him being a horrifically scarred man with the mind of a horny teenage Vanity Smurf who wears women's faces. An in-universe Draco in Leather Pants, perhaps? Just because Pavi sees himself this way and is rich enough to afford \"Women of mercenary affection\" doesn't mean anyone else agrees.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "such", 
                    "song"
                ], 
                "role": "Keet: The Band Leader is such a keet that at the end of his song you can even hear him coughing and running out of breath!", 
                "id": "Keet"
            }, 
            {
                "adjectives": [
                    "scary", 
                    "good", 
                    "complete"
                ], 
                "role": "Nathan Wallace in Repo! The Genetic Opera takes this to some scary extremes with his daughter, Shilo. When the story begins, she's been locked in her bedroom for 17 years. It seems like he has good reason for this, as she has a rare blood disease. Until it turns out that she doesn't, and he was actually poisoning her so he could keep her with him and away from the outside world. Though with it becoming a complete Crapsack World, can you really blame him?", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "Overprotective", 
                    "scary"
                ], 
                "role": "Overprotective Dad: Nathan takes this to some scary extremes with Shilo.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Nathan as the Repo Man.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "only", 
                    "big"
                ], 
                "role": "Right Through His Pants: In \"Come Up And Try My New Parts\", Amber convinces Graverobber to sleep with her to get out of paying for her Zydrate. Both remain fully clothed for the entire scene— the only item of clothing removed is Graverobber's big coat.", 
                "id": "RightThroughHisPants"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Not really a scene, but Luigi Largo has a lot of shirtless moments.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "foppish", 
                    "flamboyant", 
                    "Italian", 
                    "outrageous", 
                    "Italian", 
                    "good", 
                    "serial", 
                    "beautiful", 
                    "own"
                ], 
                "role": "Repo! The Genetic Opera has Parvi Largo as a minor villain. He is foppish, flamboyant and painfully vain; he dresses in replica vintage Italian suits, and speaks with an outrageous Italian accent for no good reason. He's also a serial rapist who wears the face of a beautiful woman over his own.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "Co-writer", 
                    "young"
                ], 
                "role": "Co-writer Terrance Zdunich stated at a 2008 screening afterparty that a young Pavi crafted the accent to hide his speech impediment. Eventually it just became part of his The Casanova reputation. This is widely accepted as a canon part of the Expanded Universe.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [
                    "close", 
                    "'Mark"
                ], 
                "role": "Pavi Largo from Repo! The Genetic Opera is close to being the epitome of this trope. As he says himself in 'Mark It Up':", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [
                    "Grave-Robber", 
                    "sarcastic"
                ], 
                "role": "Troubled, but Cute: Fan opinion is divided if Grave-Robber is this, or just very sarcastic and very pretty.", 
                "id": "TroubledButCute"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "scantily-clad"
                ], 
                "role": "Bodyguard Babes: Rotti's henchgirls. Amber's scantily-clad male bodyguards are a Spear Counterpart.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Rotti Largo from Repo! The Genetic Opera is always accompanied by his two female body guards. For a gender inversion, Amber Sweet and her two bondage guards.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [], 
                "role": "Broken Bird: Blind Mag, after years of service to Gene Co with the knowledge that retirement = death.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [], 
                "role": "Ill Girl: Shilo, continuing the proud tradition of Marni (dead before the story starts) and Blind Mag (cured, at least temporarily.) Or at least, so it seems. Nathan's actually been poisoning Shilo to keep her with him after her mother died.", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Missing Mom: Marni, and the Largo children's mother(s).", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Repo! The Genetic Opera has Marni, Shilo's mother, who died before the movie began, and the missing mother(s) of the three Largo children.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "female", 
                    "full"
                ], 
                "role": "Ms. Fanservice: Where to begin? Amber Sweet, Blind Mag, the Genterns, the scalpel sluts, Rotti's henchgirls, even Shilo when she dresses in skimpy leather Zettai Ryouiki outfits... It would probably be easier to list the female characters who DON'T satisfy someone's fetish. Here's the full list:", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "The Vamp: Amber Sweet in a nutshell and latex panties.", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [
                    "gothic", 
                    "gothic", 
                    "white"
                ], 
                "role": "Woman in White: Shilo's dressing style combines gothic black and gothic white.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0963194", 
    "poster_url": "RepoTheGeneticOpera.jpg", 
    "similar": [
        {
            "shared": [
                "OverprotectiveDad", 
                "SissyVillain", 
                "TheCasanova", 
                "TheVamp", 
                "BodyguardBabes", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "CampStraight", 
                "ShirtlessScene", 
                "EffeminateMisogynisticGuy", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MsFanservice", 
                "SissyVillain", 
                "WomanInWhite", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "ShirtlessScene", 
                "IllGirl", 
                "WomanInWhite", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "TheGrudge", 
            "name": "The Grudge", 
            "poster_url": "TheGrudge.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "TheVamp", 
                "ShirtlessScene", 
                "MsFanservice", 
                "WomanInWhite"
            ], 
            "shared_count": 5, 
            "id": "LordOfTheDance1997", 
            "name": "Lord Of The Dance", 
            "poster_url": "LordOfTheDance1997.jpg"
        }
    ], 
    "id": "RepoTheGeneticOpera", 
    "name": "Repo! The Genetic Opera"
}