{
    "plot": "A virus has escaped in a secret facility called \"The Hive,\" turning the staff into hungry zombies and releasing the mutated Lab \"Animals\" that they were studying. The complex computer shuts down the base to prevent infection. The parent corporation sends in an elite military unit, where they meet Alice, who is suffering from amnesia due to exposure to nerve gas. The military team must shut down the computer and get out, fighting their way past zombies, mutants, and the computer itself, before the virus escapes and infects the rest of the world. Alice must also come to terms with her slowly-returning memories.", 
    "genres": "Action, Horror, Sci-Fi", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bald Black Leader Guy: One, the leader of the soldiers.", 
                "id": "BaldBlackLeaderGuy"
            }, 
            {
                "adjectives": [], 
                "role": "The Squad leader from Resident Evil.", 
                "id": "BaldBlackLeaderGuy"
            }, 
            {
                "adjectives": [
                    "co-op", 
                    "Double", 
                    "co-op", 
                    "first", 
                    "second", 
                    "other"
                ], 
                "role": "Any co-op game gives players the option for this, from Resident Evil to Kirby.\n Mario Kart: Double Dash!! is built on doing this in a racing game. Each kart has two racers: a driver and a support. They function as one when one person is playing, but if two players decide to go co-op on one kart, racing ability is expanded with one player driving and both players mashing the control stick to achieve miniturbos. The first player can pass items he gets back to the second player, who focuses on using them and can also punch left and right to move the kart a little in those directions to dodge things, attack other players, and steal items.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "Chivalrous", 
                    "funny"
                ], 
                "role": "Chivalrous Pervert: Leon's a funny case in that he definitely has the chivalry going on and engages in some joking flirtation, but aside from the one time he kissed Ada when he thought she was dying, he never actually makes a move.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "first", 
                    "final", 
                    "high"
                ], 
                "role": "Brad Vickers, S.T.A.R.S Alpha Team helicopter pilot from the Resident Evil franchise, who immediately turns tail and runs off, abandoning his teammates during the events of the first game when the Cerebuses attack. When Chief of Police Irons dismisses the rest of the team's claims about the mansion, Vickers goes along with them to keep his job. To the satisfaction of the player, he eventually is killed off..\n Though to Brad's credit, he did he show up just in time to drop them a rocket launcher to use against the final boss, and then did his damnedest to extract the remaining members of S.T.A.R.S before the mansion went up in smoke. Brad will never hold a very high place in the eyes of the fandom, but if he hadn't worked up the nerve to turn back, there wouldn't have been any survivors of that mission.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [], 
                "role": "Chris Redfield and Billy Coen in Resident Evil. There's only one known picture of his facenote Shown in his epilogue from Resident Evil 3, but Agent HUNK qualifies, too, appropriately enough.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "good"
                ], 
                "role": "The Casanova: Luis and Carlos at least talk a good game.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [
                    "likeable", 
                    "dorky-but-cool"
                ], 
                "role": "Leon S. Kennedy from Resident Evil is this. He's got that likeable, dorky-but-cool thing going on. At least Ashley seems to think so.", 
                "id": "TheCharmer"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Alice is the standout example, but there's also Rain Ocampo.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "playable", 
                    "young"
                ], 
                "role": "Action Girl: All the playable female characters, not including Ashley and a young Sherry.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Ada Wong, from the Resident Evil games in which Leon appears.\n Also Fong Ling from Resident Evil: Dead Aim.", 
                "id": "AnimeChineseGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Blondes are Evil / Blond Guys Are Evil: Pretty much every blonde character except Ashley, Leon, and Sherry is a villain.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "former", 
                    "evil"
                ], 
                "role": "The Resident Evil series has Annette Birkin and Alexia Ashford, though the former isn't so much evil as she is obsessed with getting revenge on the people who wronged her husband.\n In Resident Evil 5, Jill Valentine, usually a brunette, has her hair turn blond during her Brainwashed and Crazy period, it lost all the pigment because the virus was constantly being pumped into her bloodstream.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Dark Action Girl: Ada Wong, and Jill Valentine during most of RE5.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "sociopathic", 
                    "human"
                ], 
                "role": "Resident Evil has Alexia Ashford. She's completely sociopathic and believes all around her exist only to be experimented on. When in human form, she does not seem so threatening. Then she transforms into a monster that uses her blood like napalm and fights Wesker to a stand-still.\n  Jill is one for most of Resident Evil 5, thanks to being brainwashed.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "first", 
                    "fourth", 
                    "first-class", 
                    "clear", 
                    "retrospect", 
                    "whole", 
                    "poor", 
                    "serious", 
                    "manipulative", 
                    "opportunistic"
                ], 
                "role": "Ada Wong from the Resident Evil series initially showed very mild Distressed Damsel qualities in her first appearance, but by the fourth game in the series, there was no question that she was a first-class Femme Fatale, to the point that it's clear in retrospect that her originally helpless was playact the whole time. Trying to figure out which side the girl is on and if she's going to help you or hurt you can give you (and poor Leon) a serious headache.\n Excella Gionne from Resident Evil 5 is also an example, being Wesker's Dragon. An example that ends up being subverted: it is she who ends up being manipulated and betrayed by Wesker, who injects her with the Uroboros virus she created. Rather than a manipulative woman behind the man, she's actually just an opportunistic Rich Bitch who is Too Dumb to Live.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "sole"
                ], 
                "role": "From Resident Evil, we have Rebecca Chambers, the sole official survivor of her team from Resident Evil 0.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [], 
                "role": "With a side of Mad Scientist's Beautiful Daughter from the adult Sherry.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [
                    "first", 
                    "world-class"
                ], 
                "role": "Ada Wong of Resident Evil is first introduced as this, seducing an Umbrella employee in order to gain access to company secrets. Doesn't hurt that she's also a Dark Action Girl and a world-class Femme Fatale.", 
                "id": "MataHari"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Alice.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "Mysterious"
                ], 
                "role": "Mysterious Waif: Lucia from Gaiden.", 
                "id": "MysteriousWaif"
            }, 
            {
                "adjectives": [
                    "spiritual"
                ], 
                "role": "Rain Ocampo from Resident Evil is a spiritual successor to Vasquez.", 
                "id": "SpicyLatina"
            }, 
            {
                "adjectives": [], 
                "role": "Spicy Latina: Rain.", 
                "id": "SpicyLatina"
            }, 
            {
                "adjectives": [
                    "Medical"
                ], 
                "role": "The Chick: The Medical Officer. Alice is one but only at the start.", 
                "id": "TheChick"
            }, 
            {
                "adjectives": [
                    "Several", 
                    "various", 
                    "semi-official"
                ], 
                "role": "Several of Claire Redfield's outfits in the various Resident Evil games depict valkyries. It's been adopted by the fandom as her semi-official insignia, in line with Ada's butterfly, and to a much lesser extent, Leon's skull.", 
                "id": "Valkyries"
            }
        ]
    }, 
    "imdbid": "tt0120804", 
    "poster_url": "ResidentEvil.jpg", 
    "similar": [
        {
            "shared": [
                "MadScientistsBeautifulDaughter", 
                "MataHari", 
                "DarkActionGirl", 
                "BashBrothers", 
                "DirtyCoward", 
                "TheCasanova", 
                "BaldBlackLeaderGuy"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "ChivalrousPervert", 
                "BashBrothers", 
                "Hunk", 
                "TheCasanova", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "MsFanservice", 
                "DarkActionGirl", 
                "FemmeFatale", 
                "DirtyCoward"
            ], 
            "shared_count": 5, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "BashBrothers", 
                "MsFanservice", 
                "ActionGirl", 
                "ChivalrousPervert"
            ], 
            "shared_count": 5, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "MsFanservice", 
                "TheCharmer", 
                "FemmeFatale", 
                "ChivalrousPervert"
            ], 
            "shared_count": 5, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }
    ], 
    "id": "ResidentEvil", 
    "name": "Resident Evil"
}