{
    "plot": "In Rio de Janeiro, baby macaw, Blu, is captured by dealers and smuggled to the USA. While driving through Moose Lake, Minnesota, the truck that is transporting Blu accidentally drops Blu's box on the road. A girl, Linda, finds the bird and raises him with love. Fifteen years later, Blu is a domesticated and intelligent bird that does not fly and lives a comfortable life with bookshop owner Linda. Out of the blue, clumsy Brazilian ornithologist, Tulio, visits Linda and explains that Blu is the last male of his species, and he has a female called Jewel in Rio de Janeiro. He invites Linda to bring Blu to Rio so that he and Jewel can save their species. Linda travels with Blu and Tulio to Rio de Janeiro and they leave Blu and Jewel in a large cage in the institute where Tulio works. While they are having dinner, smugglers break into the institute and steal Blu and Jewel to sell them. Linda and Tulio look everywhere for Blu, who is chained to Jewel and hidden in a slum. Meanwhile, Jewel and Blu escape from their captors and befriend a group of birds that help them to get rid of the chains. It is Carnival and the smugglers and mean cockatoo, Nigel, do not intend to give up Blu and Jewel, and chase the birds through the crowded streets.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Keel-Billed", 
                    "willing"
                ], 
                "role": "Henpecked Husband: Rafael the toucan, almost literally, by his Keel-Billed Toucan wife. Nonetheless he still does love her, willing to gladly sacrifice Carnaval to spend time with her.", 
                "id": "HenpeckedHusband"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Gaussian", 
                    "first"
                ], 
                "role": "Gaussian Girl: Jewel, repeatedly to Blu. It becomes a Running Gag when it happens to Linda, when first dressed as a macaw.", 
                "id": "GaussianGirl"
            }, 
            {
                "adjectives": [
                    "female", 
                    "male", 
                    "later"
                ], 
                "role": "Rio repeatedly applies this to Jewel (a female macaw; the protagonist's a male one). It's later used on Linda, but only when she wears a macaw costume.", 
                "id": "GaussianGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Meganekko: Linda", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [], 
                "role": "Rio: Linda. Male example: Tulio.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [], 
                "role": "My Beloved Smother: While he never outright states it, Tulio does imply that it was Linda's doting that caused Blu to be so introverted and never learn to fly.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [], 
                "role": "Perky Female Minion: Gabi in the sequel.", 
                "id": "PerkyFemaleMinion"
            }, 
            {
                "adjectives": [
                    "several", 
                    "main", 
                    "Nice"
                ], 
                "role": "Blu from Rio, despite getting several luxuries from his \"mother\" Linda, is the main protagonist and definitely a Nice Guy.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Good heavens, Blu — at the start. He Takes A Level In Badass and upgrades to The Hero to rescue Jewel at the end.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt1436562", 
    "poster_url": "Rio.jpg", 
    "similar": [
        {
            "shared": [
                "SpoiledSweet", 
                "TheChick"
            ], 
            "shared_count": 2, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "TheChick"
            ], 
            "shared_count": 2, 
            "id": "BarbieAFashionFairytale", 
            "name": "Barbie A Fashion Fairytale"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "MaidInManhattan", 
            "name": "Maid In Manhattan", 
            "poster_url": "MaidInManhattan.jpg"
        }, 
        {
            "shared": [
                "GaussianGirl", 
                "Meganekko"
            ], 
            "shared_count": 2, 
            "id": "WaynesWorld", 
            "name": "Wayne's World", 
            "poster_url": "WaynesWorld.jpg"
        }, 
        {
            "shared": [
                "HenpeckedHusband", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "TheManchurianCandidate", 
            "name": "The Manchurian Candidate", 
            "poster_url": "TheManchurianCandidate.jpg"
        }
    ], 
    "id": "Rio", 
    "name": "Rio"
}