{
    "plot": "When an evil spirit known as Pitch lays down the gauntlet to take over the world, the immortal Guardians must join forces for the first time to protect the hopes, beliefs, and imaginations of children all over the world.", 
    "genres": "Animation, Adventure, Family", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "biological", 
                    "main"
                ], 
                "role": "In the Rise of the Guardians fanfiction Guardian of Light, it's revealed that  Pitch is the biological father of the main character, Helen.", 
                "id": "ArchnemesisDad"
            }, 
            {
                "adjectives": [], 
                "role": "Husky Russkie: North.", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [
                    "Russian"
                ], 
                "role": "Nicolas st. North from Rise of the Guardians, although it could be attributed more to him being Santa Claus than him being Russian.", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [
                    "such", 
                    "other"
                ], 
                "role": "Tooth and her mini fairies-when they're fangirling over Jack. He's such a Mr. Fanservice, even the other characters want him.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "other", 
                    "male"
                ], 
                "role": "Papa Wolf: Jack has shades of this attitude towards Baby Tooth, Jamie and Sophie and the other kids. In fact, all the male Guardians are this to children in general.  According to his backstory, Pitch was one as well. In the movie...not so much.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "Jack Frost in Rise of the Guardians. He even has Tooth and her helpers fangirling all over him, although it may be solely to do with his teeth.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "fic", 
                    "main", 
                    "willing"
                ], 
                "role": "In the Rise of the Guardians fic Guardian of Light, the main character Helen  discovers that Pitch is her father. Jack isn't her boyfriend  at this point, but he doesn't hold this against her despite everything, and is willing to protect her at all costs.", 
                "id": "UnderstandingBoyfriend"
            }, 
            {
                "adjectives": [
                    "human", 
                    "white", 
                    "immortal"
                ], 
                "role": "Jack Frost from Rise Of The Guardians. He may fit the looks, but he's The Hero. He had brown hair when he was still a human boy, but he gained white hair once he drowned and became immortal.", 
                "id": "WhiteHairedPrettyBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "fic", 
                    "note-worthy", 
                    "many", 
                    "only", 
                    "same"
                ], 
                "role": "In the Rise of the Guardians fic Guardian of Light, Jamie and Sophie have an adopted elder sibling, Helen, who is this to them both. It should be note-worthy that throughout the fandom, there are many stories in which Jamie and Sophie have an elder sister. Helen is the only one who actually cares about them, and doesn't abandon them the minute she meets Jack.\n By the same author, there's the crossover fic with Megamind, called Protectors, only this girl, Rikki, is Roxanne's elder sister. She's just as awesome, but not just to Roxanne; she's this to all the kids.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "fic", 
                    "other"
                ], 
                "role": "In the Rise of the Guardians fic Guardian of Light Pitch wants his daughter to be this. She has other ideas.", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [
                    "fic", 
                    "main", 
                    "biological", 
                    "later", 
                    "able"
                ], 
                "role": "In the Rise of the Guardians fic Guardian of Light, the main character, Helen, is kidnapped by Pitch, her biological father. When she wakes up, she tries to attack him, and when he tries to attack her, she defends herself with ease. She sings to annoy him, gives him a \"The Reason You Suck\" Speech for his trouble, and is later able to escape by making him think she's crying.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "fic", 
                    "create/control"
                ], 
                "role": "Helen Bennett from the Rise of the Guardians fic Guardian of Light is this. She has the ability to create/control light, which comes in handy when fighting Pitch, the personification of darkness.", 
                "id": "ExtraordinarilyEmpoweredGirl"
            }, 
            {
                "adjectives": [
                    "various", 
                    "interested"
                ], 
                "role": "Fangirls: Toothania and her fairy helpers openly swoon over Jack at various points, though they soon prove less interested in his looks than in his teeth.", 
                "id": "Fangirl"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Bear: Tooth, to her fairies and the kids of the world.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: Baby Tooth- when Pitch holds her hostage against Jack, she responds by stabbing his hand with her beak. Note that Pitch's fist is bigger than her.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Tooth (The Chick)", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt1446192", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "PrettyBoy", 
                "PluckyGirl", 
                "MrFanservice"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "PluckyGirl", 
                "MrFanservice", 
                "MamaBear"
            ], 
            "shared_count": 4, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HuskyRusskie", 
                "PluckyGirl", 
                "MamaBear"
            ], 
            "shared_count": 4, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "TheChick", 
                "ExtraordinarilyEmpoweredGirl", 
                "MamaBear"
            ], 
            "shared_count": 4, 
            "id": "SuckerPunch", 
            "name": "Sucker Punch", 
            "poster_url": "SuckerPunch.jpg"
        }, 
        {
            "shared": [
                "ArchnemesisDad", 
                "DamselOutOfDistress", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }
    ], 
    "id": "RiseOfTheGuardians", 
    "name": "Rise of the Guardians"
}