{
    "plot": "Birth of a legend. Following King Richard's death in France, archer Robin Longstride, along with Will Scarlett, Alan-a-Dale and Little John, returns to England. They encounter the dying Robert of Locksley, whose party was ambushed by treacherous Godfrey, who hopes to facilitate a French invasion of England. Robin promises the dying knight he will return his sword to his father Walter in Nottingham. Here Walter encourages him to impersonate the dead man to prevent his land being confiscated by the crown, and he finds himself with Marian, a ready-made wife. Hoping to stir baronial opposition to weak King John and allow an easy French take-over, Godfrey worms his way into the king's service as Earl Marshal of England and brutally invades towns under the pretext of collecting Royal taxes. Can Robin navigate the politics of barons, royals, traitors, and the French?", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Corrupt Hick: Despite being set in Medieval England, the Sheriff and his underlings act like stereotypes from the American deep south.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [
                    "different", 
                    "heroic"
                ], 
                "role": "Robin Hood: The Sheriff of Nottingham, who has a Southern accent despite the film taking place in England. Presumably the script team heard the word \"sheriff\"note which means something somewhat different in Britain, by the way and decided to stick to what they knew. See also Friar Tuck, who sounds like a Deep South Preacher Man stereotype, albeit the heroic Good Shepherd variety.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [
                    "blind-side"
                ], 
                "role": "Dirty Coward: Prince John in the Archery Tournament fiasco. While Robin Hood was fighting off the guards, Prince John tried to blind-side him. However, Robin Hood easily disarms him before that happened, and Prince John immediately runs away in fear while pathetically begging for his life.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [], 
                "role": "And, on one occasion, Little John in drag.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [], 
                "role": "Friar Tuck in Robin Hood.", 
                "id": "FurryBaldness"
            }, 
            {
                "adjectives": [
                    "anthropomorphic", 
                    "such"
                ], 
                "role": "Robin Hood's anthropomorphic depiction of Prince John out-swishes Scar to such a degree, the Lion King villain looks positively Leatherman by comparison.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "obese", 
                    "formidable"
                ], 
                "role": "Robin Hood: The Sheriff, Friar Tuck and Little John are all obese, but are also the most physically formidable characters in the film. Lady Kluck, Marian's handmaiden and the resident Violent Glaswegian, also qualifies with flying colours.", 
                "id": "StoutStrength"
            }, 
            {
                "adjectives": [
                    "fat", 
                    "fair", 
                    "bear", 
                    "powerful"
                ], 
                "role": "Stout Strength: Little John, Friar Tuck, and the Sheriff of Nottingham are all grossly fat (though to be fair to John, he is a bear). They're also among the most physically powerful of the named characters in the film (although the Sheriff only really gets to show it in the climax). On the distaff side, we have Lady Kluck. Just look at the way she took down those rhino guards!!!", 
                "id": "StoutStrength"
            }, 
            {
                "adjectives": [], 
                "role": "Prince John from Robin Hood.", 
                "id": "TheEvilPrince"
            }, 
            {
                "adjectives": [
                    "literal"
                ], 
                "role": "King Richard the Lionheart (a literal lion) from Robin Hood. Everything gets better once he arrives; Jon is imprisoned and Robin Hood gets a Happily Ever After ending with Marion.", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "On the distaff side, we have Lady Kluck. Just look at the way she took down those rhino guards!!!", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "graceful", 
                    "helpful"
                ], 
                "role": "Damsel in Distress: Marian. She's lovely and graceful but almost completely helpless, even when her love is about to be executed before her eyes. However, she almost manages to convince Prince John to spare Robin through The Power of Love and hits a guard aiming for Robin with a pie, which just goes to show how helpful she can be when she tries.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "obvious"
                ], 
                "role": "Maid Marian from Disney's Robin Hood. What makes this even more obvious is the fact that all of her dance moves are based on those of Snow White!", 
                "id": "HumanoidFemaleAnimal"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Lady Cluck to Maid Marian in the Disney version of Robin Hood. In their first scene they are playing badminton and Cluck jokes \"As your lady in waiting, I'm waiting.\"", 
                "id": "LadyInWaiting"
            }, 
            {
                "adjectives": [
                    "much", 
                    "dangerous"
                ], 
                "role": "Neutral Female: Averted by Maid Marian; she typically isn't of much help when things get dangerous, but she does have a couple of moments where she's actively trying to assist the protagonists.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [], 
                "role": "Maid Marian from Robin Hood. She is part of Prince John's household and his niece, but she is one of the nicest characters in the movie.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [], 
                "role": "Spoiled Sweet: Despite being part of Prince John's household, Maid Marian is one of the nicest characters in the film.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0955308", 
    "poster_url": "RobinHood.jpg", 
    "similar": [
        {
            "shared": [
                "TheEvilPrince", 
                "DirtyCoward", 
                "NeutralFemale", 
                "StoutStrength", 
                "DamselInDistress", 
                "TheGoodKing"
            ], 
            "shared_count": 6, 
            "id": "ThePrincessBride", 
            "name": "The Princess Bride", 
            "poster_url": "ThePrincessBride.png"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "DamselInDistress", 
                "ActionGirl", 
                "DisguisedInDrag"
            ], 
            "shared_count": 4, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "CorruptHick", 
                "SissyVillain", 
                "HumanoidFemaleAnimal", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "RockADoodle", 
            "name": "Rock-A-Doodle", 
            "poster_url": "RockADoodle.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "DisguisedInDrag", 
                "SissyVillain", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "DisguisedInDrag", 
                "SissyVillain", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "RobinHood", 
    "name": "Robin Hood"
}