{
    "plot": "Birth of a legend. Following King Richard's death in France, archer Robin Longstride, along with Will Scarlett, Alan-a-Dale and Little John, returns to England. They encounter the dying Robert of Locksley, whose party was ambushed by treacherous Godfrey, who hopes to facilitate a French invasion of England. Robin promises the dying knight he will return his sword to his father Walter in Nottingham. Here Walter encourages him to impersonate the dead man to prevent his land being confiscated by the crown, and he finds himself with Marian, a ready-made wife. Hoping to stir baronial opposition to weak King John and allow an easy French take-over, Godfrey worms his way into the king's service as Earl Marshal of England and brutally invades towns under the pretext of collecting Royal taxes. Can Robin navigate the politics of barons, royals, traitors, and the French?", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Badass Grandpa: Sir Walter, Marion's father-in-law, isn't afraid to swing a sword at his enemies, despite being 84 years old and nearly blind. Plus his \"tumescent growth...\"", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "many", 
                    "facial", 
                    "full", 
                    "various", 
                    "true", 
                    "only", 
                    "clean-shaven", 
                    "different"
                ], 
                "role": "Beard of Evil: While many males in the film have facial hair, ranging from Perma Stubble to full BadassBeards, this trope applies to various villain characters: King John, the Sheriff, the true Big Bad  King Philip, and Godfrey's second-in-command. Godfrey is the only clean-shaven villain, but a different trope applies to him.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Dirty Old Man: Walter;", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [
                    "old", 
                    "able"
                ], 
                "role": "Papa Wolf: Sir Walter. Upon learning the man before him was his son's murderer, he flew into a rage against him, despite being very old and blind. He was able to wound Godfrey before he was taken down.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Marion. Many eyes rolled at this inclusion, though one ballad has Marion disguise herself as a page and duel Robin with swords \"for at least an hour or more\".", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "Self-Made"
                ], 
                "role": "Never a Self-Made Woman: who else but Marion?  She even ends up as the camp mom at the end", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "early", 
                    "old"
                ], 
                "role": "In Robin Hood (2010), it is mentioned that Lady Marion didn't marry until her early thirties, and was already established as an old maid by that time.", 
                "id": "OldMaid"
            }
        ]
    }, 
    "imdbid": "tt0955308", 
    "poster_url": "RobinHood2010.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "NeverASelfMadeWoman", 
                "BeardOfEvil", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "TheSecretOfNIMH", 
            "name": "The Secret of NIMH", 
            "poster_url": "TheSecretOfNIMH.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil", 
                "ActionGirl", 
                "DirtyOldMan"
            ], 
            "shared_count": 3, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "NeverASelfMadeWoman", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "XMenDaysOfFuturePast", 
            "name": "X-Men: Days of Future Past", 
            "poster_url": "XMenDaysOfFuturePast.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "ActionGirl", 
                "DirtyOldMan"
            ], 
            "shared_count": 3, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "NeverASelfMadeWoman", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }
    ], 
    "id": "RobinHood2010", 
    "name": "Robin Hood "
}