{
    "plot": "After being captured by Turks during the Crusades, Robin of Locksley and a Moor, Azeem, escape back to England, where Azeem vows to remain until he repays Robin for saving his life. Meanwhile, Robin's father, a nobleman loyal to King Richard the Lionhearted, has been murdered by the brutal Sheriff of Nottingham, who helped install Richard's treacherous brother, Prince John, as king while Richard is overseas fighting the Crusades. When Robin returns home, he vows to avenge his father's death and restore Richard to the throne. Even though Maid Marian, his childhood friend, cannot help him, he escapes to the Forest of Sherwood where he joins a band of exiled villagers and becomes their leader. With their help he attempts to cleanse the land of the evil that the Sheriff has spread.", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "1991", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Will of Robin Hood: Prince of Thieves is Robin's illegitimate half-brother, who blames Robin for their father abandoning him and his mother.", 
                "id": "BastardBastard"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Black Man: Azeem to the British. Less so to audience, considering he's played by Morgan Freeman.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "In Robin Hood: Prince of Thieves, Maid Marion's lady in waiting is an example.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Mama Bear and Papa Wolf: Fanny and Little John, who are this way about each other as well as their kids.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "final"
                ], 
                "role": "Neutral Female: During the final fight between Robin and the Sheriff, Marian (who is unarmed), does her best to stay out of the way, though she doesn't hesitate to throw whatever she can get her hands on at the Sheriff when his back is to her.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [
                    "climactic", 
                    "aside", 
                    "first", 
                    "few", 
                    "useless", 
                    "entire", 
                    "meant"
                ], 
                "role": "The climactic fight in Robin Hood: Prince of Thieves has Maid Marion stand aside and watch Robin and the Sheriff fight. This is after she was established as a Badass Action Girl in her first scene and after the Sheriff had tried to rape her only a few minutes before. Sure, she does try to burn the Sheriff with a candle, but is otherwise useless the entire fight, even when the Sheriff is about to kill Robin.\n Ditto in the Mel Brooks parody Robin Hood: Men in Tights, although at least Marion was never meant to be an Action Girl in that film.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "In another Robin Hood example, Maid Marian first appears dressed in armor and assumed to be male in Robin Hood: Prince of Thieves.", 
                "id": "SweetPollyOliver"
            }
        ]
    }, 
    "imdbid": "tt0102798", 
    "poster_url": "RobinHoodPrinceOfThieves.jpg", 
    "similar": [
        {
            "shared": [
                "BastardBastard", 
                "NeutralFemale"
            ], 
            "shared_count": 2, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver", 
                "BrawnHilda"
            ], 
            "shared_count": 2, 
            "id": "LaserMission", 
            "name": "Laser Mission", 
            "poster_url": "LaserMission.jpg"
        }, 
        {
            "shared": [
                "BrawnHilda", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "RevengeOfTheNerds", 
            "name": "Revenge of the Nerds"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "BrawnHilda"
            ], 
            "shared_count": 2, 
            "id": "RobinHoodMenInTights", 
            "name": "Robin Hood: Men in Tights", 
            "poster_url": "RobinHoodMenInTights.jpg"
        }, 
        {
            "shared": [
                "MamaBear", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TitusAndronicus", 
            "name": "Titus Andronicus", 
            "poster_url": "TitusAndronicus.jpg"
        }
    ], 
    "id": "RobinHoodPrinceOfThieves", 
    "name": "Robin Hood: Prince of Thieves"
}