{
    "plot": "The six drunken sons of influential local business owner Tiny Doyle have been terrorizing the streets of their small town in their pick-up truck. Local trucker Big Joe Rosso has a wife named Kathy, a son named Joey, and two young daughters named Allison and Kristin. Big Joe and Joey do business with Tiny, delivering liquor to his bar, but that doesn't stop Tiny's son Vic from driving drunk and running Kathy off the road, killing Kathy, Allison, and Kristin. Thanks to Tiny's influence, the local judge sets Vic free after ordering Vic to pay a $300 fine. Lieutenant Sly, one of the local cops, is sympathetic toward the Rosso family, but Sly is about to retire, and Tiny has a lot of clout in this town. Enraged and bereaved, Big Joe goes after Vic, but the Doyles kill Big Joe. After that, they rape Joey's girlfriend Misty. Enraged and frustrated, Joey builds a monster truck out of junked car and truck parts, with seven-foot tall tires, a flame thrower, and a giant retractable combination drill and metal cutter mounted on it. Joey is out to do what the local authorities cannot or will not do...put an end to the Doyles once and for all.", 
    "genres": "Action, Drama", 
    "release_year": "1987", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Corrupt Hick: Tiny is all over this trope. While he doesn't want to overthrow the town like most examples, he and his sons use their wealth to thumb their noses at any law (or person) they don't like.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [
                    "general"
                ], 
                "role": "Dad the Veteran: Tiny is a Vietnam War vet, which probably helps flavor his general nihilism.", 
                "id": "DadTheVeteran"
            }
        ]
    }, 
    "imdbid": "tt0093876", 
    "poster_url": "RollingVengeance.jpg", 
    "similar": [
        {
            "shared": [
                "DadTheVeteran"
            ], 
            "shared_count": 1, 
            "id": "BoyzNTheHood", 
            "name": "Boyz n the Hood", 
            "poster_url": "BoyzNTheHood.jpg"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "Coonskin", 
            "name": "Coonskin"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "Diggstown", 
            "name": "Diggstown", 
            "poster_url": "Diggstown.jpg"
        }, 
        {
            "shared": [
                "CorruptHick"
            ], 
            "shared_count": 1, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }
    ], 
    "id": "RollingVengeance", 
    "name": "Rolling Vengeance"
}