{
    "plot": "Joe Bradley is a reporter for the American News Service in Rome, a job he doesn't much like as he would rather work for what he considers a real news agency back in the States. He is on the verge of getting fired when he, sleeping in and getting caught in a lie by his boss Hennessy, misses an interview with HRH Princess Ann, who is on a goodwill tour of Europe, Rome only her latest stop. However, he thinks he may have stumbled upon a huge scoop. Princess Ann has officially called off all her Rome engagements due to illness. In reality, he recognizes the photograph of her as being the young well but simply dressed drunk woman he rescued off the street last night (as he didn't want to turn her into the police for being a vagrant), and who is still in his small studio apartment sleeping off her hangover. What Joe doesn't know is that she is really sleeping off the effects of a sedative given to her by her doctor to calm her down after an anxiety attack, that anxiety because she hates her regimented life where she has no freedom and must always do and say the politically correct things, not what is truly on her mind or in her heart. In wanting just a little freedom, she seized upon a chance opportunity to escape from the royal palace where she was staying, albeit with no money in her pockets. Joe believes he can get an exclusive interview with her without she even knowing that he's a reporter or that he's interviewing her. As Joe accompanies \"Anya Smith\" - her name as she tells him in trying to hide her true identity - around Rome on her incognito day of freedom somewhat unaware that the secret service is searching for her, along for the ride is Joe's photographer friend, Irving Radovich, who Joe has tasked with clandestinely taking photographs of her, those photos to accompany the story. As the day progresses, Joe and Ann slowly start to fall for each other. Their feelings for each other affect what both decide to do, Ann with regard to her royal duties, Joe with regard to the story, and both with regard to if there is a future for them together.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1953", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "Rebellious"
                ], 
                "role": "Rebellious Princess: Princess Ann.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "short", 
                    "out-of-place", 
                    "absolute", 
                    "adorable"
                ], 
                "role": "The Ingenue: Princess Ann, short of one jarringly out-of-place smoking scene, is the absolute epitome of adorable innocence.", 
                "id": "TheIngenue"
            }
        ]
    }, 
    "imdbid": "tt0046250", 
    "poster_url": "RomanHoliday.jpg", 
    "similar": [
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "TheIngenue"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "TheIngenue"
            ], 
            "shared_count": 3, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess"
            ], 
            "shared_count": 2, 
            "id": "TheIcePirates", 
            "name": "The Ice Pirates", 
            "poster_url": "TheIcePirates.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess"
            ], 
            "shared_count": 2, 
            "id": "Spaceballs", 
            "name": "Spaceballs", 
            "poster_url": "Spaceballs.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess"
            ], 
            "shared_count": 2, 
            "id": "Fantaghiro", 
            "name": "Fantaghiro"
        }
    ], 
    "id": "RomanHoliday", 
    "name": "Roman Holiday"
}