{
    "plot": "Joan Wilder, a mousy romance novelist, receives a treasure map in the mail from her recently murdered brother-in-law. Meanwhile, her sister Elaine is kidnapped in Colombia and the two criminals responsible demand that she travel to Colombia to exchange the map for her sister. Joan does, and quickly becomes lost in the jungle after being waylayed by Zolo, a vicious and corrupt Colombian cop who will stop at nothing to obtain the map. There, she meets an irreverent soldier-of-fortune named Jack Colton who agrees to bring her back to civilization. Together, they embark upon an adventure that could be straight out of Joan's novels.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "1984", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "stiff", 
                    "perpetual", 
                    "whole"
                ], 
                "role": "Adrenaline Makeover: Joan begins the movie mousy and stiff with a perpetual sloppy hair bun. By the time she returns from Colombia, she's changed her whole look, starting with literally letting her hair down.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "mousy", 
                    "reclusive", 
                    "full", 
                    "sensible", 
                    "jungle", 
                    "dip-dancing", 
                    "backslid", 
                    "second"
                ], 
                "role": "Romancing the Stone: Joan Wilder is a mousy, reclusive romance novelist. But when she gets in over her head in Colombia, Jack T. Colton is there to help her out — for a price. Along the way, after he chops the heels off her shoes and tosses her suitcase full of sensible business suits into the jungle, they ride a mudslide, swing on vines, and do the sort of things she writes about in her novels. By the midpoint of the movie, her hair is down and she's dip-dancing in Jack's arms. By the end of the movie, she's no longer mousy or reclusive. By the sequel, Joan's backslid a little and goes through the transformation a second time.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [], 
                "role": "Determined Homesteader's Wife: Angelina draws liberally from the archetype.", 
                "id": "DeterminedHomesteadersWife"
            }, 
            {
                "adjectives": [], 
                "role": "Mary Sue: invoked Angelina in Joan's novels.", 
                "id": "MarySue"
            }
        ]
    }, 
    "imdbid": "tt0088011", 
    "poster_url": "RomancingTheStone.jpg", 
    "similar": [
        {
            "shared": [
                "AdrenalineMakeover", 
                "MarySue"
            ], 
            "shared_count": 2, 
            "id": "Pleasantville", 
            "name": "Pleasantville", 
            "poster_url": "Pleasantville.jpg"
        }, 
        {
            "shared": [
                "MarySue"
            ], 
            "shared_count": 1, 
            "id": "Misery", 
            "name": "Misery", 
            "poster_url": "Misery.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover"
            ], 
            "shared_count": 1, 
            "id": "Innerspace", 
            "name": "Innerspace", 
            "poster_url": "Innerspace.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover"
            ], 
            "shared_count": 1, 
            "id": "TheHillsHaveEyes", 
            "name": "The Hills Have Eyes", 
            "poster_url": "TheHillsHaveEyes.jpg"
        }
    ], 
    "id": "RomancingTheStone", 
    "name": "Romancing the Stone"
}