{
    "plot": "12-year-old Henry Rowengartner, whose late father was a minor league baseball player, grew up dreaming of playing baseball, despite his physical shortcomings. Although he's close to his mother Mary, Henry hates Mary's latest boyfriend, Jack Bradfield. After Henry's arm is broken while trying to catch a baseball at school, the tendon in that arm heals too tightly, allowing Henry to throw pitches that are as fast as 103 mph. Henry is spotted at nearby Wrigley Field by Larry \"Fish\" Fisher, the general manager of the struggling Chicago Cubs, after Henry throws an opponent's home-run ball all the way from the outfield bleachers back to the catcher, and it seems that Henry may be the pitcher that team owner Bob Carson has been praying for. At first, Cubs manager Sal Martinella doesn't like Henry being on the team, but despite the rawness of his talent, Henry revives everyone's team spirit and reignites the enthusiasm of the fans. While money hungry Jack pulls strings behind the scenes to line his own pockets, Mary starts to fall for veteran pitcher Chet \"Rocket\" Steadman, whose injuries are curtailing a once sparkling career. While Henry bonds with Chet, Henry's friends resent Henry's star status when he arrives late to help them work on an old boat. As the Cubs head for the National League Championship series, Jack agrees to hand over Henry's contract to the New York Yankees for 25 million dollars. Mary doesn't like that, so when Jack angers Mary even more by stupidly saying that Henry is half his, Mary literally punches Jack out the door, with Henry cheering her on. Thinking about the idea of retiring, both Henry and Chet start performing badly, but they set out to redeem themselves at the National League championship series.", 
    "genres": "Comedy, Family, Fantasy", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Disappeared Dad: Henry's dad", 
                "id": "DisappearedDad"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Mama Bear: Henry's mom", 
                "id": "MamaBear"
            }
        ]
    }, 
    "imdbid": "tt0107985", 
    "poster_url": "RookieOfTheYear.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "ACatInParis", 
            "name": "A Cat in Paris", 
            "poster_url": "ACatInParis.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "WhiteFang", 
            "name": "White Fang", 
            "poster_url": "WhiteFang.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "ClassOf1984", 
            "name": "Class Of", 
            "poster_url": "ClassOf1984.jpg"
        }
    ], 
    "id": "RookieOfTheYear", 
    "name": "Rookie of the Year"
}