{
    "plot": "Wishes come true in Rugrats in Paris The Movie, and love makes its way into the hearts of those young, old and overseas. Chuckie's dad, Chazz, starts dating again, and it's Chuckie's wish to find a new mom. When Stu Pickles is summoned to Reptarland, an amazing new amusement park in Paris, to work on his Reptar invention, Tommy, Chuckie, Angelica, Phil, Lil, Dil, Didi and the whole gang tag along to the city of romance. But the Rugrats' big adventure turns out to be more than glamour, fashion and smelly cheese. Chuckie learns that when it comes to princesses and potential mommies, things are not always what they seem, and for Chazz, finding the right woman can be difficult in any language. As the Rugrats' travels take them from the Eiffel Tower to Notre Dame and everywhere in between, the world's favorite babies learn new lessons about courage, loyalty, trust and above all, true love.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2000", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Disappeared Dad: Kimi's father doesn't show in the film, though it's implied to be the function of a divorce. An episode of \"All Grown Up\" confirms this.", 
                "id": "DisappearedDad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "main", 
                    "new"
                ], 
                "role": "Similarly in Rugrats in Paris a stage play in Reptarland has a princess as a main character. After seeing it, Chuckie wishes for the princess to be his new mother. Coco La Bouche attempts to exploit this when she hears about it and Chuckie admits that all he wants is a mother who loves him.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "thematic", 
                    "different", 
                    "different", 
                    "first"
                ], 
                "role": "The Fashionista: Coco, and a thematic one at that! She seems to wear a different outfit every scene she appears in, and each one has a different theme (for example, she wore an outfit covered in clocks while talking to Stu the first time).", 
                "id": "TheFashionista"
            }
        ]
    }, 
    "imdbid": "tt0213203", 
    "poster_url": "RugratsInParis.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses"
            ], 
            "shared_count": 2, 
            "id": "TheSwanPrincess", 
            "name": "The Swan Princess", 
            "poster_url": "TheSwanPrincess.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses"
            ], 
            "shared_count": 2, 
            "id": "PansLabyrinth", 
            "name": "Pan's Labyrinth", 
            "poster_url": "PansLabyrinth.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses"
            ], 
            "shared_count": 2, 
            "id": "CastleInTheSky", 
            "name": "Castle in the Sky", 
            "poster_url": "CastleInTheSky.jpg"
        }, 
        {
            "shared": [
                "TheFashionista", 
                "EverythingsBetterWithPrincesses"
            ], 
            "shared_count": 2, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }
    ], 
    "id": "RugratsInParis", 
    "name": "Rugrats in Paris"
}