{
    "plot": "In the near future, a police officer specializes in malfunctioning robots. When a robot turns out to have been programmed to kill, he begins to uncover a homicidal plot to create killer robots... and his son becomes a target.", 
    "genres": "Action, Crime, Sci-Fi", 
    "release_year": "1984", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Fanservice Extra: Ramsey startles a topless prostitute during the raid on the Ritz hotel.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "slow"
                ], 
                "role": "Feminine Women Can Cook: By the end Ramsey and Thompson are falling in love, and how does he ask her to have a relationship with him? He says \"Can you cook?\", causing the woman to melt adoringly into his arms as the sparks fly. This caused reviewer Harlan Ellison to do a slow burn. He said Ramsay's robot maid/cook Lois was featured prominently in the film (including a scene where it cooks pasta) so Ramsay's partner should have replied, \"I don't have to; Lois can do it. I can fuck; Lois can't do that!\"", 
                "id": "FeminineWomenCanCook"
            }, 
            {
                "adjectives": [
                    "rogue", 
                    "strong", 
                    "capable", 
                    "competent"
                ], 
                "role": "In the 1984 film Runaway, it's Twenty Minutes into the Future and robots do a lot of the routine work. Tom Selleck plays Ramsay, a policeman who hunts down rogue Killer Robot s. He's assisted by a strong and capable female officer, Karen Thompson, who in fact is more competent than he is because he's acrophobic. By the end they're falling in love, and how does he ask her to have a relationship with him? He says \"Can you cook?\", causing the woman to melt adoringly into his arms as the sparks fly.", 
                "id": "FeminineWomenCanCook"
            }, 
            {
                "adjectives": [
                    "tight"
                ], 
                "role": "Sexy Secretary: Jackie Rodgers, a secretary at Vetrocon and Luther's girlfriend. Played by Kirstie Alley in a tight leather skirt.", 
                "id": "SexySecretary"
            }
        ]
    }, 
    "imdbid": "tt0088024", 
    "poster_url": "Runaway.jpg", 
    "similar": [
        {
            "shared": [
                "FanserviceExtra", 
                "SexySecretary"
            ], 
            "shared_count": 2, 
            "id": "Airheads", 
            "name": "Airheads", 
            "poster_url": "Airheads.jpg"
        }, 
        {
            "shared": [
                "SexySecretary"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "StarTrekIIITheSearchForSpock", 
            "name": "Star Trek III: The Search for Spock", 
            "poster_url": "StarTrekIIITheSearchForSpock.jpg"
        }, 
        {
            "shared": [
                "SexySecretary"
            ], 
            "shared_count": 1, 
            "id": "IronMan", 
            "name": "Iron Man", 
            "poster_url": "IronMan.jpg"
        }, 
        {
            "shared": [
                "SexySecretary"
            ], 
            "shared_count": 1, 
            "id": "CasinoRoyale1967", 
            "name": "Casino Royale ", 
            "poster_url": "CasinoRoyale1967.jpg"
        }
    ], 
    "id": "Runaway", 
    "name": "Runaway"
}