{
    "plot": "Max Fischer is a precocious 15-year-old whose reason for living is his attendance at Rushmore, a private school where he's not doing well in any of his classes, but where he's the king of extracurricular activities - from being in the beekeeping society to writing and producing plays, there's very little after school he doesn't do. His life begins to change, however, when he finds out he's on academic probation, and when he stumbles into love with Miss Cross, a pretty teacher of the elementary school at Rushmore. Added to the mix is his friendship with Herman Blume, wealthy industrialist and father to boys who attend the school, and who also finds himself attracted to Miss Cross. Max's fate becomes inextricably tied to this odd love triangle, and how he sets about resolving it is the story in the film.", 
    "genres": "Comedy, Drama", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Cock Fight", 
                "id": "CockFight"
            }, 
            {
                "adjectives": [
                    "Dogged", 
                    "It’s", 
                    "clear", 
                    "own"
                ], 
                "role": "Dogged Nice Guy: It’s clear pretty soon after she’s introduced that Margaret Yang is harboring an attraction for Max, but he gives her the cold shoulder in favor of his own infatuation with Ms. Cross.  Things get better by the end, though, when he warms up to and eventually begins dating her after getting over Ms. Cross (maybe).", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "High"
                ], 
                "role": "High School Hustler", 
                "id": "HighSchoolHustler"
            }, 
            {
                "adjectives": [
                    "low", 
                    "very"
                ], 
                "role": "In Rushmore Max Fisher is the low key version of this trope. Actually a Deconstruction of the very concept.", 
                "id": "HighSchoolHustler"
            }
        ]
    }, 
    "imdbid": "tt0128445", 
    "poster_url": "Rushmore.jpg", 
    "similar": [
        {
            "shared": [
                "CockFight", 
                "DoggedNiceGuy"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "HighSchoolHustler", 
                "DoggedNiceGuy"
            ], 
            "shared_count": 2, 
            "id": "Swindle", 
            "name": "Swindle"
        }, 
        {
            "shared": [
                "CockFight", 
                "DoggedNiceGuy"
            ], 
            "shared_count": 2, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "DoggedNiceGuy"
            ], 
            "shared_count": 1, 
            "id": "LoveInTheAfternoon", 
            "name": "Love in the Afternoon", 
            "poster_url": "LoveInTheAfternoon.jpg"
        }, 
        {
            "shared": [
                "DoggedNiceGuy"
            ], 
            "shared_count": 1, 
            "id": "Taal", 
            "name": "Taal", 
            "poster_url": "Taal.jpg"
        }
    ], 
    "id": "Rushmore", 
    "name": "Rushmore"
}