{
    "plot": "Sam Stone is a clothing manufacturer, who married his wife Barbara, for the money that she was supposed to inherit from her dying father, but her father didn't die for another fifteen years. He is now planning to kill her and he tells his girlfriend Carol what he is going to do. He then on his way home to do just that but when he gets there, she's not there. He then receives a call from someone claiming to have kidnapped Barbara and threatening to kill her if he informs the police, which he does hoping that they do. What Stone doesn't know is that the kidnappers, Ken and Sandy are a couple whose idea for a garment he stole and made fortune off, are not that lethal, as a matter of fact Barbara's more lethal. And what Stone doesn't know is that Carol, has another boyfriend and they plan to blackmail Sam, by videotaping him disposing of Barbara's body. When her boyfriend, Earl goes there to do that, the person who goes there was not Sam but a guy with a hooker, and the guy instructs the hooker to scream her head off, Earl mistakenly believes that Barbara's not dead and that Sam was killing her there, and was so freaked out that he didn't bother to see if it was Sam. And Carol tries to put her plan in operation by sending Sam a copy of the tape, Sam thinks that it's for something kinky that Carol wants and when Sam tells her that he is going to do what was done on the tape to her, she assumes that he is going to kill her. So she sends another copy of the tape to the Chief of Police, and tells him that she wants him to arrest Sam for murdering Barbara, and the Chief is happy to oblige cause he is the guy who is on the tape. The Chief manages to find the instruments that Sam was going to use to kill Barbara and arrests him. Sam now has to get Barbara, alive, so that he can prove that he didn't kill her. And Barbara starts to bond with Sandy.", 
    "genres": "Comedy, Crime", 
    "release_year": "1986", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Sweater Girl: Carol has a few sweaters.", 
                "id": "SweaterGirl"
            }
        ]
    }, 
    "imdbid": "tt0091877", 
    "poster_url": "RuthlessPeople.jpg", 
    "similar": [
        {
            "shared": [
                "SweaterGirl"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "SweaterGirl"
            ], 
            "shared_count": 1, 
            "id": "Election", 
            "name": "Election", 
            "poster_url": "Election.jpg"
        }, 
        {
            "shared": [
                "SweaterGirl"
            ], 
            "shared_count": 1, 
            "id": "TheManchurianCandidate", 
            "name": "The Manchurian Candidate", 
            "poster_url": "TheManchurianCandidate.jpg"
        }, 
        {
            "shared": [
                "SweaterGirl"
            ], 
            "shared_count": 1, 
            "id": "LordLoveADuck", 
            "name": "Lord Love A Duck", 
            "poster_url": "LordLoveADuck.jpg"
        }, 
        {
            "shared": [
                "SweaterGirl"
            ], 
            "shared_count": 1, 
            "id": "Christine", 
            "name": "Christine", 
            "poster_url": "Christine.jpg"
        }
    ], 
    "id": "RuthlessPeople", 
    "name": "Ruthless People"
}