{
    "plot": "Orphaned and homeless Ranbir Raj re-locates to a small town and orders a glass of milk in the RK Bar. He befriends a prostitute by the name of Gulabji, who invites him to spend the night with her, and when he refuses, she re-directs him to Lillian who rents out rooms. Ranbir meets with Lillian, who has been living alone for 37 years after her son, Vincent, left to join the army and did not return, charms her, and rents a room from her. He gets a job as a singer in a local restaurant. On the occasion of Eid, while returning home, he comes across a woman standing on the bridge. He finds her very attractive, befriends her, walks her home, finds out her name is Sakina, who is a carpet weaver and lives with her aunt and blind grandma. Just when Ranbir is about to confess his love, she tells him that she has already given her heart to Imaan, a former tenant of her grandmother's. Imaan had left, promising to return on Eid, but has not done so. She finds out that he may be staying at the Momim Lodge and asks Ranbir to deliver a letter to him. A crestfallen Ranbir destroys the letter, but does go to Momim Lodge, and this is where he finds that no one by the name of Imaan had ever lived there. Encouraged by this news, he returns back and attempts to win Sakina's heart. The question remains will he succeed or will Sakina spend the rest of her life waiting for Imaan's return?", 
    "genres": "Drama, Musical, Romance", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Dogged"
                ], 
                "role": "Dogged Nice Guy: Raj's approach to his feelings for Sakina. To creepy effect, at times.", 
                "id": "DoggedNiceGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Determined Widow: Lillipop.", 
                "id": "DeterminedWidow"
            }, 
            {
                "adjectives": [], 
                "role": "Fragile Flower: Sakina.", 
                "id": "FragileFlower"
            }, 
            {
                "adjectives": [], 
                "role": "Hooker with a Heart of Gold: Gulabji.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [], 
                "role": "Manic Pixie Dream Girl: Raj is arguably a rare Spear Counterpart to this.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt0758053", 
    "poster_url": "Saawariya.jpg", 
    "similar": [
        {
            "shared": [
                "FragileFlower", 
                "DoggedNiceGuy", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "TrueRomance", 
            "name": "True Romance", 
            "poster_url": "TrueRomance.jpg"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "ChungkingExpress", 
            "name": "Chungking Express", 
            "poster_url": "ChungkingExpress.jpg"
        }, 
        {
            "shared": [
                "FragileFlower", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "NorwegianWood", 
            "name": "Norwegian Wood", 
            "poster_url": "NorwegianWood.jpg"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Bridesmaids", 
            "name": "Bridesmaids", 
            "poster_url": "Bridesmaids.jpg"
        }
    ], 
    "id": "Saawariya", 
    "name": "Saawariya"
}