{
    "plot": "Jae-Young is an amateur prostitute who sleeps with men while her best friend Yeo-Jin \"manages\" her, fixing dates, taking care of the money and making sure the coast is clear. When Jae-Young falls in love with one of those man she suppresses her feelings towards him in respect of her friend who's jealous. One Day Yeo-Jin fails in doing her job overlooking police officers looking for under-aged prostitutes. In order to not get caught Jae-Young jumps out of a window almost killing herself. On her deathbed, she wishes to see the man again whom she fell in love with and turned away from. But the man only agrees if Yeo-Jin sleeps with him. She does but as they arrive in the hospital Jae-Young is already dead. Trying to understand her best friend, Yeo-Jin tracks down every man she slept with and does the same. As her father learns about this he gets on revenge with fatal consequences...", 
    "genres": "Drama", 
    "release_year": "2004", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Jae-yeong", 
                    "bad", 
                    "modern", 
                    "legendary"
                ], 
                "role": "Good Bad Girl: Jae-yeong has no idea she's doing anything bad by sleeping with older men for money. She fancies herself a modern emulator of a legendary prostitute who converted men to Buddhism through sex.", 
                "id": "GoodBadGirl"
            }, 
            {
                "adjectives": [
                    "Jae-yeong", 
                    "innocent"
                ], 
                "role": "Jae-yeong in Samaritan Girl by Kim Ki-duk. Although she engages in teenage prostitution, she does so in a surprisingly innocent way, and genuinely cares about her customers (regardless of the fact that they are creeps).", 
                "id": "GoodBadGirl"
            }, 
            {
                "adjectives": [
                    "Jae-yeong"
                ], 
                "role": "Hooker with a Heart of Gold: Again, Jae-yeong.", 
                "id": "HookerWithAHeartOfGold"
            }
        ]
    }, 
    "imdbid": "tt0397619", 
    "poster_url": "SamaritanGirl.jpg", 
    "similar": [
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "Purgatory", 
            "name": "Purgatory", 
            "poster_url": "Purgatory.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "Django", 
            "name": "Django", 
            "poster_url": "Django.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "McCabeAndMrsMiller", 
            "name": "McCabe & Mrs. Miller", 
            "poster_url": "McCabeAndMrsMiller.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "TheBarberOfSiberia", 
            "name": "The Barber of Siberia", 
            "poster_url": "TheBarberOfSiberia.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }
    ], 
    "id": "SamaritanGirl", 
    "name": "Samaritan Girl"
}