{
    "plot": "Dr. Frankenstein's female descendant is an excellent mad scientist in her own right. At a ripe old age, she discovered that the blood of the supernatural wrestling hero, Santo, is a youth elixir. For years she has been periodically injecting herself, and her henchmen, with a serum made from the blood she wiped from Santo's nose. But now, her body is so saturated with the serum that she needs frequent painful injections to maintain her youth. Before the serum stops working completely, she needs to experiment on more of Santo's blood. Instead of attending another wrestling match, and hoping for another nosebleed, she has her lackeys kidnap Santo's girlfriend. Santo, of course, comes looking for her. What he'll find is a spooky underground cave, filled with corpses, bats and flying daggers. A half-man-half-gorilla will cause him trouble. But his ultimate battle will be with Frankenstein's old monster, yet again brought back to life.", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "1972", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Justified for the Mandatory In-Ring Sequences. Not so justified when Santo is captured, and the thugs removed his shirt before chaining him up to await Frieda Frankenstein's pleasure ... Oh, yeah.", 
                "id": "ShirtlessScene"
            }
        ]
    }, 
    "imdbid": "tt0067707", 
    "similar": [
        {
            "shared": [
                "ShirtlessScene"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene"
            ], 
            "shared_count": 1, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene"
            ], 
            "shared_count": 1, 
            "id": "SaturdayNightFever", 
            "name": "Saturday Night Fever", 
            "poster_url": "SaturdayNightFever.jpg"
        }
    ], 
    "id": "SantoVsLaHijaDeFrankestein", 
    "name": "Santo vs. La Hija de Frankestein"
}