{
    "plot": "Nineteen-year-old Brooklyn native Tony Manero lives for Saturday nights at the local disco, where he's king of the club, thanks to his stylish moves on the dance floor. But outside of the club, things don't look so rosy. At home, Tony fights constantly with his father and has to compete with his family's starry-eyed view of his older brother, a priest. Nor can he find satisfaction at his dead-end job at a paint store. However, things begin to change when he spies Stephanie in the disco and starts training with her for the club's dance competition. Stephanie dreams of the world beyond Brooklyn, and her plans to move to the big city just over the bridge soon change Tony's life forever.", 
    "genres": "Drama, Music", 
    "release_year": "1977", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Tony has his fair share of these, most notably Annette, and the Hollywood Homely blonde woman that wiped his forehead after he danced.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Travolta shows his pectorals a lot. This continues in the sequel, in which he becomes a Walking Shirtless Scene in a Show Within a Show.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Fangirl Tony has his fair share of these, most notably Annette, and the Hollywood Homely blonde woman that wiped his forehead after he danced. Also subverted because one girl begs him to kiss her, and she believes she kissed Al Pacino (even though Tony looks nothing like him).", 
                "id": "Fangirl"
            }, 
            {
                "adjectives": [
                    "guilt-tripping"
                ], 
                "role": "A Catholic version in Saturday Night Fever: Mrs. Manero is always criticizing and guilt-tripping Tony and dotes on her older son Frankie the Priest. She is absolutely crushed when she finds out Frankie is leaving the priesthood, and ends up disowning him for \"disgracing the family.\"", 
                "id": "JewishMother"
            }, 
            {
                "adjectives": [
                    "Italian", 
                    "estranged"
                ], 
                "role": "Italian Mother: Tony's mother, always nagging and criticizing him, and doting on Her Son, The Priest (Tony's older brother Frank) who ends up leaving the priesthood for unknown reasons and becoming estranged from his family.", 
                "id": "JewishMother"
            }, 
            {
                "adjectives": [], 
                "role": "In Saturday Night Fever, Tony believes a girl can be a \"nice girl\" or a \"cunt\", not both.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [
                    "Madonna-Whore", 
                    "serious", 
                    "marry", 
                    "c**t"
                ], 
                "role": "Madonna-Whore Complex: Tony believes that a girl can be either a \"nice girl\" you enter into a serious relationship with and maybe even marry eventually or a \"c**t\" that you sleep with, not both.", 
                "id": "MadonnaWhoreComplex"
            }
        ]
    }, 
    "imdbid": "tt0076666", 
    "poster_url": "SaturdayNightFever.jpg", 
    "similar": [
        {
            "shared": [
                "ShirtlessScene", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "JewishMother", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "TheBirdcage", 
            "name": "The Birdcage", 
            "poster_url": "TheBirdcage.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "MagicMike", 
            "name": "Magic Mike", 
            "poster_url": "MagicMike.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MrFanservice"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }
    ], 
    "id": "SaturdayNightFever", 
    "name": "Saturday Night Fever"
}