{
    "plot": "When Walt Disney's daughters begged him to make a movie of their favorite book, P.L. Travers' Mary Poppins (1964), he made them a promise - one that he didn't realize would take 20 years to keep. In his quest to obtain the rights, Walt comes up against a curmudgeonly, uncompromising writer who has absolutely no intention of letting her beloved magical nanny get mauled by the Hollywood machine. But, as the books stop selling and money grows short, Travers reluctantly agrees to go to Los Angeles to hear Disney's plans for the adaptation. For those two short weeks in 1961, Walt Disney pulls out all the stops. Armed with imaginative storyboards and chirpy songs from the talented Sherman brothers, Walt launches an all-out onslaught on P.L. Travers, but the prickly author doesn't budge. He soon begins to watch helplessly as Travers becomes increasingly immovable and the rights begin to move further away from his grasp. It is only when he reaches into his own childhood that Walt discovers the truth about the ghosts that haunt her, and together they set Mary Poppins free to ultimately make one of the most endearing films in cinematic history.", 
    "genres": "Biography, Comedy, Drama", 
    "release_year": "2013", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "non-Flashback", 
                    "musical", 
                    "only", 
                    "fun-loving"
                ], 
                "role": "Manic Pixie Dream Girl: The non-Flashback storyline is essentially a Gender Flipped version of this, with Travers as the stuffed-shirt and the Disney team (most notably the Sherman brothers, whose talents convince her to let the movie be a musical, and Ralph, \"the only American she's ever liked,\" but even Walt himself by the end) as the fun-loving people who defrost her.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt2140373", 
    "poster_url": "SavingMrBanks.jpg", 
    "similar": [
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Lo", 
            "name": "Lo"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "LAStory", 
            "name": "LA Story"
        }
    ], 
    "id": "SavingMrBanks", 
    "name": "Saving Mr. Banks"
}