{
    "plot": "Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother...", 
    "genres": "Action, Drama, War", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "A Father to His Men: John H. Miller, especially during the desertion scene.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "final", 
                    "machine-gun", 
                    "usual", 
                    "easy", 
                    "own", 
                    "realistic", 
                    "psychological", 
                    "cold-blooded", 
                    "few", 
                    "cold-blooded", 
                    "dead", 
                    "sympathy", 
                    "later", 
                    "other", 
                    "such", 
                    "second"
                ], 
                "role": "Dirty Coward: Upham is sometimes accused of being this at the final battle when he breaks down in fear upon seeing the advancing German troops while he was supposed to bring ammunition belts to the machine-gun position in the ruined house. As usual, it's easy to judge a character's actions from the comfort of your own living room, but it is actually a realistic portrayal of the psychological issues combatants have to face in war, where not everyone is a cold-blooded killer. He's a bit different kind of coward. When he finally decides to act, he takes few POWs. And then proceeds with cold-blooded execution of  Steamboat Willie. Not only that, but the audience is supposed to cheer for him finally becoming a \"brave\" man. That is, if your the kind of person who sees it as him becoming a man by killing an enemy soldier who obviously had it coming... or him ruthlessly executing a helpless prisoner at a time when the battle itself is actually over and the people he could have saved are already dead because of his earlier \"cowardice\". Is it manhood gained, innocence lost, or both? And admittingly you can probably feel sympathy for what he did. He sided with an enemy soldier to take him captive instead of executing him, and that man later returned the favor by killing the other man who vouched for him. You would probably be unwilling to take such a man prisoner a second time.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "free", 
                    "final", 
                    "responsible", 
                    "Mellish", 
                    "own"
                ], 
                "role": "In Saving Private Ryan, the German soldier known as Steamboat Willie shamefully grovels to the American protagonists when they have him prisoner. They spare him and allow him to walk free, but he joins up with another German unit and shows up for the final battle, and isn't so forthcoming of mercy when the situation is reversed, being responsible for the deaths of Captain Miller and another American mauve-shirt. Upham is often argued as one as well, as he sat cowering in fear as a German soldier was overpowering Mellish and stabbing him with his own knife, although he redeems himself for avenging Miller and shooting Willie dead.", 
                "id": "DirtyCoward"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "big"
                ], 
                "role": "Gag Boobs: A character in one of the soldier's stories before the big battle.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "big", 
                    "hilarious", 
                    "well-endowed"
                ], 
                "role": "In Saving Private Ryan, right before a big battle, Reiben tells a hilarious story of when a well-endowed lady went buying underwear in his mom's shop, and he gave her a smaller bra.", 
                "id": "GagBoobs"
            }
        ]
    }, 
    "imdbid": "tt0120815", 
    "poster_url": "SavingPrivateRyan.jpg", 
    "similar": [
        {
            "shared": [
                "GagBoobs", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "MeetTheFeebles", 
            "name": "Meet the Feebles", 
            "poster_url": "MeetTheFeebles.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "AFatherToHisMen", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Centurion", 
            "name": "Centurion", 
            "poster_url": "Centurion.jpg"
        }, 
        {
            "shared": [
                "GagBoobs", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "TheBlackCauldron", 
            "name": "The Black Cauldron", 
            "poster_url": "TheBlackCauldron.jpg"
        }, 
        {
            "shared": [
                "AFatherToHisMen", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "AMidnightClear", 
            "name": "A Midnight Clear", 
            "poster_url": "AMidnightClear.jpg"
        }
    ], 
    "id": "SavingPrivateRyan", 
    "name": "Saving Private Ryan"
}