{
    "plot": "When Sarah Cain, a self-involved big-city newspaper columnist, travels to Pennsylvania for the funeral of her Amish sister, she soon discovers that she is the legal guardian of her five Amish nieces and nephews. Rather than choose to move to Lancaster County to finish raising them there herself, or let them be separated by the foster care system, Sarah decides to take them with her back to Portland where she believes she can make a new life for them. However, she soon realizes that the modern world has forced them to compromise who they are, and that she has moved them there for all the wrong reasons - a motive which is soon exposed - because secrets can really never be kept secret. In order to find her own redemption, she knows she must make a choice to give them back their lives in Amish Country. And whether she remains part of their lives will have a lot to do with how much she has grown to love them.", 
    "genres": "Drama", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "other", 
                    "sinful", 
                    "non-Amish"
                ], 
                "role": "Drill Sergeant Nasty: When Lyddie finds that the other children have been doing sinful things like wearing non-Amish clothes and being on the wrestling team. Also they were showing that they are ashamed of their kinfolk by doing so. That was what Lyddie was irritated at.", 
                "id": "DrillSergeantNasty"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Apron Matron: One of Lyddie's career goals.", 
                "id": "ApronMatron"
            }, 
            {
                "adjectives": [
                    "crazy", 
                    "guardian"
                ], 
                "role": "God Save Us from the Queen!: Aunt Sarah; their mother must have been crazy to name her as guardian.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "crazy", 
                    "guardian"
                ], 
                "role": "God Save Us From the Queen!: Aunt Sarah; their mother must have been crazy to name her as guardian.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "Proper"
                ], 
                "role": "Proper Lady: Lyddie who tries to be, and make the children, proper to Amish standards.", 
                "id": "ProperLady"
            }, 
            {
                "adjectives": [], 
                "role": "Schoolmarm: Another of Lyddie's career goals.", 
                "id": "SchoolMarm"
            }, 
            {
                "adjectives": [], 
                "role": "Team Mom: Lyddie", 
                "id": "TeamMom"
            }
        ]
    }, 
    "imdbid": "tt0918557", 
    "poster_url": "SavingSarahCain.jpg", 
    "similar": [
        {
            "shared": [
                "TeamMom", 
                "ProperLady"
            ], 
            "shared_count": 2, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "ApronMatron"
            ], 
            "shared_count": 2, 
            "id": "WeWereSoldiers", 
            "name": "We Were Soldiers", 
            "poster_url": "WeWereSoldiers.jpg"
        }, 
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "TeamMom"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheSevenDwarfs", 
            "name": "Snow White and the Seven Dwarfs"
        }, 
        {
            "shared": [
                "ProperLady", 
                "ApronMatron"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TeamMom", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 2, 
            "id": "TheThinRedLine", 
            "name": "The Thin Red Line", 
            "poster_url": "TheThinRedLine.jpg"
        }
    ], 
    "id": "SavingSarahCain", 
    "name": "Saving Sarah Cain"
}