{
    "plot": "A group of teenagers including Cindy Campbell and Bobby Prinze, accidentally hit a man when driving, and dispose of the body, but now they are being stalked by a very recognisable masked killer. The victim count increases, whilst Cindy must survive the carnage that has she has seen in so many films before.", 
    "genres": "Comedy", 
    "release_year": "2000", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Ray from Scary Movie is gay, but he hides it, rather poorly though.", 
                "id": "ArmouredClosetGay"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Movie 2 has one with a deformed hand.", 
                "id": "CrustyCaretaker"
            }, 
            {
                "adjectives": [
                    "wrong"
                ], 
                "role": "Depraved Homosexual: Ray is so gay it hurts, even though he tries to deny it. He shows his depraved side when he rapes a Monster Clown puppet who really chose the wrong victim. It's played for laughs.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "wrong"
                ], 
                "role": "Ray from Scary Movie is so gay it hurts, even though he tries to deny it. He shows his depraved side when he rapes a Monster Clown puppet who really chose the wrong victim. It's played for laughs.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "own", 
                    "quadriplegic", 
                    "own"
                ], 
                "role": "Favors for the Sexy: Parodied. As soon as the sultry Theo enters the mansion's dinner room and catches the attention of all the guys in the room, she demands that they give her a chair. The more plain Cindy gets thrown out of her own chair and Theo ends up with about four places to sit, including the quadriplegic giving her his own wheelchair.", 
                "id": "FavorsForTheSexy"
            }, 
            {
                "adjectives": [
                    "own", 
                    "quadriplegic", 
                    "own"
                ], 
                "role": "Parodied in Scary Movie 2. As soon as the sultry Theo enters the mansion's dinner room and catches the attention of all the guys in the room, she demands that they give her a chair. The more plain Cindy gets thrown out of her own chair and Theo ends up with about four places to sit, including the quadriplegic giving her his own wheelchair.", 
                "id": "FavorsForTheSexy"
            }, 
            {
                "adjectives": [
                    "fourth"
                ], 
                "role": "Gag Penis: The fourth movie teaches us to never try swallowing all of the Viagra pills.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Movie 4 has one of the characters trying to kill himself using pills...only to find out that he had swallowed Viagra. Cue the growing erection.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [
                    "due", 
                    "many"
                ], 
                "role": "Scary Movie: Brenda's jock boyfriend. He doesn't explicitly come out of the closet until the end of the movie (and claims Situational Sexuality due to forced abstinence), but many unsubtle hints were dropped as a running joke.", 
                "id": "GymBunny"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Movie", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [], 
                "role": "Teeny Weenie:", 
                "id": "TeenyWeenie"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Parodied", 
                    "ghoul", 
                    "second"
                ], 
                "role": "Butterface: Parodied with the ghoul that attacks Shorty in the second film. At first he's horrified and it looks like she's strangling him, but he's actually having sex with her, solving the problem with a paper bag (\"No no, no kissing!\"). They're still together at the very end.", 
                "id": "ButterFace"
            }, 
            {
                "adjectives": [
                    "ghoul", 
                    "second"
                ], 
                "role": "Parodied with the ghoul that attacks Shorty in the second Scary Movie. At first he's horrified and it looks like she's strangling him, but he's actually having sex with her, solving the problem with a paper bag (\"No no, no kissing!\"). They're still together at the very end.", 
                "id": "ButterFace"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Movie series.\n Scary Movie: Shannon Elizabeth's character gets this, gunning for Rule of Funny and Rule of Sexy.\n Scary Movie 3: Has Pamela Anderson and Jenny Mc Carthy in schoolgirl outfits.", 
                "id": "CatholicSchoolGirlsRule"
            }, 
            {
                "adjectives": [
                    "final", 
                    "few", 
                    "comedic"
                ], 
                "role": "Cindy Campbell from the Scary Movie films is pretty much a sustained spoof of Final Girls.\n The slasher film final girl spoof was done a few decades previously (and just as, if not more, effectively) in 1982's Pandemonium, with the character of Candy, who was not only a comedic take on the Final Girl, but also on Carrie.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Played for laughs in Scary Movie 2. When the girls go all Angels Pose on the butler, Brenda goes crazy with a flurry of kicks...and burns her shoe off.", 
                "id": "KickChick"
            }, 
            {
                "adjectives": [], 
                "role": "Sassy Black Woman: Oh, Brenda...", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "third"
                ], 
                "role": "Parodied with Tabitha from the third Scary Movie movie.", 
                "id": "StringyHairedGhostGirl"
            }
        ]
    }, 
    "imdbid": "tt0175142", 
    "poster_url": "ScaryMovie.jpg", 
    "similar": [
        {
            "shared": [
                "TeenyWeenie", 
                "ButterFace", 
                "ArmouredClosetGay", 
                "KickChick"
            ], 
            "shared_count": 4, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "CrustyCaretaker", 
                "SassyBlackWoman", 
                "FinalGirl"
            ], 
            "shared_count": 3, 
            "id": "UrbanLegend", 
            "name": "Urban Legend", 
            "poster_url": "UrbanLegend.jpg"
        }, 
        {
            "shared": [
                "GagPenis", 
                "TeenyWeenie", 
                "SassyBlackWoman"
            ], 
            "shared_count": 3, 
            "id": "AustinPowers", 
            "name": "Austin Powers", 
            "poster_url": "AustinPowers.jpg"
        }, 
        {
            "shared": [
                "GagPenis", 
                "TeenyWeenie"
            ], 
            "shared_count": 2, 
            "id": "Unforgiven", 
            "name": "Unforgiven", 
            "poster_url": "Unforgiven.jpg"
        }, 
        {
            "shared": [
                "DepravedHomosexual", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "JeepersCreepers", 
            "name": "Jeepers Creepers", 
            "poster_url": "JeepersCreepers.jpg"
        }
    ], 
    "id": "ScaryMovie", 
    "name": "Scary Movie"
}