{
    "plot": "The Mystery Inc. gang have gone their separate ways and have been apart for two years, until they each receive an invitation to Spooky Island. Not knowing that the others have also been invited, they show up and discover an amusement park that affects young visitors in very strange ways. Fred, Daphne, Velma, Shaggy and Scooby soon realize that they cannot solve this mystery without help from each other.", 
    "genres": "Adventure, Comedy, Mystery", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "buck-toothed", 
                    "southern", 
                    "good", 
                    "other", 
                    "comedy"
                ], 
                "role": "Scooby-Dum from Scooby-Doo averts this trope. He is a buck-toothed hillbilly hailing from southern Georgia, and is Scooby's cousin. He is on good terms with his cousin and other people. Unfortunately, as his Meaningful Name suggests, he is also very dumb. He is considered The Scrappy (yes, they had more than just the Trope Namer) and has been given Chuck Cunningham Syndrome, possibly because the stereotype of a hillbilly being dumb (not to mention the stereotype of a hillbilly having buck teeth) is being played through him for comedy.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [
                    "good"
                ], 
                "role": "Crops up quite often in Scooby-Doo.\n A good way to pick out the villain half the time, come to think of it.\n Gravedigger Evallo von Meanskrieg a.k.a the Graveyard Ghoul in the Scooby-Doo! Mystery Incorporated episode \"The Gathering Gloom\".", 
                "id": "CrustyCaretaker"
            }, 
            {
                "adjectives": [
                    "first", 
                    "suspicious", 
                    "female"
                ], 
                "role": "Scooby-Doo examples:\n Shaggy and Scooby are forced to dress as women in the first episode of Scooby-Doo! Mystery Incorporated so the team can searched a suspicious location that was hiring female workers.\n In two of the Scooby-Doo DVD animated movies, Shaggy is dressed as Daphne and Scooby is dressed as Velma.\n The plot of Scooby-Doo in Arabian Nights centers around Shaggy disguising himself as a harem and then having the Caliph wanting to marry him. Shaggy has to pull a Scheherezade Gambit to get out of the wedding.", 
                "id": "DisguisedInDrag"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "In the Live-Action version of Scooby-Doo, Daphne has a moment where she's being held and fights her way out by beating up the one guard that's supposed to guard her.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "original"
                ], 
                "role": "In one episode of the original Scooby-Doo series, Velma and Daphne Dress up as belly dancers, but it's a bit weirder than you'd expect, especially if you regularly watch the show.", 
                "id": "BellyDancer"
            }, 
            {
                "adjectives": [
                    "early"
                ], 
                "role": "Daphne in the early days of Scooby-Doo.", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [
                    "original", 
                    "Danger-Prone"
                ], 
                "role": "Daphne getting abducted and tied up. Lampshaded in the original series; she's called \"Danger-Prone Daphne\" more than once.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "In Scooby-Doo, Daphne has a moment where she's being held and fights her way out by beating up the one guard that's supposed to keep her distressed.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Daphne walks around dressed in plenty of flattering dresses. And Velma finds herself in some revealing beach party gear. There's also a cameo from Pamela Anderson in a sheer white tank top.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "rock-band", 
                    "friendly", 
                    "environmental", 
                    "key", 
                    "titular"
                ], 
                "role": "The 1999 direct-to-video Scooby-Doo movie, Scooby-Doo! and the Witch's Ghost, features \"The Hex Girls\", a rock-band trio of friendly Goth girls. They identify themselves as \"Eco-Goths\", are deeply involved with environmental causes, and the lead singer's Wiccan background becomes key in dealing with the titular Witch's Ghost.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [
                    "recent"
                ], 
                "role": "Velma Dinkley in Scooby-Doo, at least after her subtle redesign in What's New, Scooby-Doo? and the more recent animated features. This to the point she wears one over her dress to the prom in Scooby-Doo! Mystery Incorporated.", 
                "id": "SweaterGirl"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Daphne", 
                "id": "TheChick"
            }, 
            {
                "adjectives": [], 
                "role": "Daphne Blake of Scooby-Doo. Subverted in the movie, where she's still The Chick of the group but has additionally Taken A Level In Badass. (Being played by Sarah Michelle Gellar pays off.) Since Daphne's a clear-cut Chick, Velma is The Smart Guy as another woman.", 
                "id": "TheChick"
            }, 
            {
                "adjectives": [], 
                "role": "Valley Girl: Daphne talks like this at the beginning but has dropped it when the gang reunite.", 
                "id": "ValleyGirl"
            }
        ]
    }, 
    "imdbid": "tt0267913", 
    "poster_url": "ScoobyDoo.jpg", 
    "similar": [
        {
            "shared": [
                "DamselInDistress", 
                "MsFanservice", 
                "BellyDancer", 
                "DisguisedInDrag"
            ], 
            "shared_count": 4, 
            "id": "WildWildWest", 
            "name": "Wild Wild West", 
            "poster_url": "WildWildWest.jpg"
        }, 
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "MsFanservice", 
                "TheChick"
            ], 
            "shared_count": 4, 
            "id": "AttackOfTheClones", 
            "name": "Attack of the Clones"
        }, 
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "MsFanservice", 
                "BellyDancer"
            ], 
            "shared_count": 4, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "MsFanservice", 
                "DamselInDistress"
            ], 
            "shared_count": 4, 
            "id": "BatmanForever", 
            "name": "Batman Forever", 
            "poster_url": "BatmanForever.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "TheChick", 
                "DisguisedInDrag"
            ], 
            "shared_count": 3, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }
    ], 
    "id": "ScoobyDoo", 
    "name": "Scooby-Doo"
}