{
    "plot": "Joe McBeth is a hard-working but unambitious doofus who toils at a hamburger stand alongside his wife Pat, who has a significant edge in the brains department. Pat is convinced she could do a lot better with the place than their boss Norm Duncan is doing, so she works up a plan to usurp Norm, convincing Mac to rob the restaurant's safe and then murder Norm, using the robbery as a way of throwing the police off their trail. Though two stoners and a would-be fortune teller warn Mac that bad luck awaits him, he gathers his courage and goes through with his wife's scheme. At first, things seem to have gone just as Pat hoped, and after Norm's sons sell the restaurant to the McBeths (they pay for it with the money they stole from Norm), business takes off. But vegetarian police detective McDuff is convinced there's foul play at the new center of the fast food universe, and when the McBeths fear that fry cook Banco knows more than he's letting on, Mac takes charge in the plotting department and decides there may be more dead meat on the menu.", 
    "genres": "Comedy, Crime", 
    "release_year": "2001", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "strong"
                ], 
                "role": "Lady Macbeth: Pat plays a particularly strong one.", 
                "id": "LadyMacBeth"
            }
        ]
    }, 
    "imdbid": "tt0265713", 
    "poster_url": "ScotlandPA.jpg", 
    "similar": [
        {
            "shared": [
                "LadyMacBeth"
            ], 
            "shared_count": 1, 
            "id": "TheGhost1963", 
            "name": "The Ghost", 
            "poster_url": "TheGhost1963.jpg"
        }, 
        {
            "shared": [
                "LadyMacBeth"
            ], 
            "shared_count": 1, 
            "id": "TheMaster", 
            "name": "The Master", 
            "poster_url": "TheMaster.jpg"
        }, 
        {
            "shared": [
                "LadyMacBeth"
            ], 
            "shared_count": 1, 
            "id": "Elizabeth", 
            "name": "Elizabeth", 
            "poster_url": "Elizabeth.jpg"
        }, 
        {
            "shared": [
                "LadyMacBeth"
            ], 
            "shared_count": 1, 
            "id": "BatmanAndRobin", 
            "name": "Batman & Robin", 
            "poster_url": "BatmanAndRobin.jpg"
        }, 
        {
            "shared": [
                "LadyMacBeth"
            ], 
            "shared_count": 1, 
            "id": "TheChroniclesOfRiddick", 
            "name": "The Chronicles of Riddick", 
            "poster_url": "TheChroniclesOfRiddick.jpg"
        }
    ], 
    "id": "ScotlandPA", 
    "name": "Scotland PA"
}