{
    "plot": "Sidney Prescott, now the author of a self-help book, returns home to Woodsboro on the last stop of her book tour. There she reconnects with Sheriff Dewey and Gale, who are now married, as well as her cousin Jill and her Aunt Kate. Unfortunately, Sidney's appearance also brings about the return of Ghostface, putting Sidney, Gale, and Dewey, along with Jill, her friends, and the whole town of Woodsboro in danger.", 
    "genres": "Horror, Mystery", 
    "release_year": "2011", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "along", 
                    "straight", 
                    "perpetual", 
                    "third", 
                    "become", 
                    "fourth"
                ], 
                "role": "In Scream 4, the character of Jill Roberts takes this trope and puts it through the ringer. She was the killer all along, and planned to frame somebody else for it so that she can come out looking like the Final Girl and ride the publicity to book deals and talk show appearances, following in the footsteps of her older cousin Sidney.\n Sidney herself evolves from a straight, if lampshaded, example into a deconstruction as the series progresses. Her life comes to be defined by her \"perpetual victimhood,\" with all of the effects that this would have on her. By the third film, she's effectively become a hermit, working from home under a fake name while suffering recurring nightmares about being murdered by Ghostface. She gets better by the fourth film, though, given the passage of time, the settling of her family drama, and presumably, years of therapy.\n Scream 4 actually features a group of film junkies debating the trope at one point. One of them mentions that virgins can die now, which prompts one of the girls to say something about not getting to live as long as her two friends.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "Lad-ette", 
                    "snarky", 
                    "tomboyish", 
                    "first", 
                    "timid"
                ], 
                "role": "The Lad-ette: Kirby, a brash, snarky, tomboyish horror buff who makes the first move on a timid boy she's into.", 
                "id": "TheLadette"
            }, 
            {
                "adjectives": [], 
                "role": "In Scream 4, we hear a lot about a Noodle Incident in which Trevor declared his love for Jill, they had sex and then he \"just goes out with someone else\". Jill absolutely refuses to forgive him, no matter how much he tries to apologize. And right after she reveals herself as the killer, she shoots Trevor in the groin as retaliation.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt1262416", 
    "poster_url": "Scream4.jpg", 
    "similar": [
        {
            "shared": [
                "WomanScorned", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "Shrooms", 
            "name": "Shrooms", 
            "poster_url": "Shrooms.jpg"
        }, 
        {
            "shared": [
                "TheLadette", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "Scream", 
            "name": "Scream", 
            "poster_url": "Scream.jpg"
        }, 
        {
            "shared": [
                "TheLadette", 
                "WomanScorned"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "TheLadette", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "SororityRow", 
            "name": "Sorority Row", 
            "poster_url": "SororityRow.jpg"
        }, 
        {
            "shared": [
                "WomanScorned"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "Scream4", 
    "name": "Scream 4"
}