{
    "plot": "When Mr. Dashwood dies, he must leave the bulk of his estate to the son by his first marriage, which leaves his second wife and their three daughters (Elinor, Marianne, and Margaret) in straitened circumstances. They are taken in by a kindly cousin, but their lack of fortune affects the marriageability of both practical Elinor and romantic Marianne. When Elinor forms an attachment for the wealthy Edward Ferrars, his family disapproves and separates them. And though Mrs. Jennings tries to match the worthy (and rich) Colonel Brandon to her, Marianne finds the dashing and fiery John Willoughby more to her taste. Both relationships are sorely tried.", 
    "genres": "Drama, Romance", 
    "release_year": "1995", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "long", 
                    "torrential", 
                    "believable", 
                    "ill", 
                    "much", 
                    "effective"
                ], 
                "role": "Ill Girl: Marianne, after taking a long walk in a torrential downpour (more believable than the book's version, where she falls deathly ill from moping about in a damp garden). It's much more effective, to the point that some people remember that having happened in the book - Emma Thompson on the DVD mentions having been very flattered when a fan told her that scene (Marianne walking to see Willoughby's house in the rain) was her favourite one in the book, since it meant Thompson had captured Austen's style perfectly.", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [
                    "late", 
                    "favorite", 
                    "later"
                ], 
                "role": "Gender flipped in the film adaptation of Sense and Sensibility; Edward, when he finds Elinor weeping as her sister plays their late father's favorite song, gives her a monogrammed handkerchief to wipe her eyes and tells her to keep it. It shows up later after she finds out he's engaged to someone else.", 
                "id": "TheLadysFavour"
            }, 
            {
                "adjectives": [
                    "Gender-flipped", 
                    "late", 
                    "favorite"
                ], 
                "role": "The Lady's Favour: Gender-flipped with Edward and Elinor; he gives her his handkerchief when she cries while listening to Marianne play their late father's favorite song, and tells her to keep it. Later, after she knows about his engagement to Lucy, she's seen holding and staring at the token.", 
                "id": "TheLadysFavour"
            }
        ]
    }, 
    "imdbid": "tt0114388", 
    "poster_url": "SenseAndSensibility.jpg", 
    "similar": [
        {
            "shared": [
                "TheLadysFavour"
            ], 
            "shared_count": 1, 
            "id": "XMen1", 
            "name": "X-Men", 
            "poster_url": "XMen1.jpg"
        }, 
        {
            "shared": [
                "TheLadysFavour"
            ], 
            "shared_count": 1, 
            "id": "Stargate", 
            "name": "Stargate", 
            "poster_url": "Stargate.jpg"
        }, 
        {
            "shared": [
                "IllGirl"
            ], 
            "shared_count": 1, 
            "id": "Innerspace", 
            "name": "Innerspace", 
            "poster_url": "Innerspace.jpg"
        }, 
        {
            "shared": [
                "IllGirl"
            ], 
            "shared_count": 1, 
            "id": "WutheringHeights", 
            "name": "Wuthering Heights", 
            "poster_url": "WutheringHeights.jpg"
        }, 
        {
            "shared": [
                "IllGirl"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "SenseAndSensibility", 
    "name": "Sense and Sensibility"
}