{
    "plot": "After moving in together in an impossibly beautiful New York apartment, Carrie Bradshaw and Mr. Big make a rather arbitrary decision to get married. The wedding itself proves to be anything but a hasty affair--the guest list quickly blooms from 75 to 200 guests, and Carrie's simple, label-less wedding gown gives way to an enormous creation that makes her look like a gigantic cream puff. An upcoming photo spread in Vogue puts the event--which will take place at the New York Public Library--squarely in the public eye. Meanwhile, Carrie's girlfriends--Samantha, the sexpot; Charlotte, the sweet naïf; and Miranda, the rigid perfectionist--could not be happier. At least, they couldn't be happier for Carrie. Charlotte still has the unrealized hope of getting pregnant. Samantha is finding a loving, committed relationship more grueling than she could have imagined. Miranda unwittingly lets her own unhappiness--created when Steve admits to cheating on her just once--spoil Carrie's. After a heated encounter with Steve, she happens to spot Mr. Big and tells him he's crazy to get married. She's really only thinking of her own marriage. But her angry remark gets Mr. Big to thinking.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Several", 
                    "well-hung", 
                    "trouble", 
                    "top"
                ], 
                "role": "Bigger Is Better in Bed: Several episodes mention this, but it's notably subverted in one where Samantha thinks she's going to have the best sex of her life with a well-hung man, and finds out she actually doesn't enjoy it. Played straight (with an inversion) on another occasion, also with Samantha. She dates a guy who is not well endowed, and has trouble enjoying sex with him as well. Apparently, Samantha needs her guys to be right at the top of the bell curve in terms of size.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [], 
                "role": "Camp Gay: Stanford and Anthony.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [
                    "flamboyant", 
                    "willing"
                ], 
                "role": "Camp Straight: Charlotte dates an incredibly flamboyant straight guy, and thinks she's found the best of both worlds when it comes to men. But in the end she realized she wanted to be with a guy who's willing to step on a spider for her, and not stand on a chair screaming like a girl.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "new"
                ], 
                "role": "On a Sex and the City episode, Charlotte becomes best buds with a pastry chef — she thinks she's his new Fag Hag till he kisses her.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "Dogged"
                ], 
                "role": "Dogged Nice Guy: Skipper", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "later", 
                    "calender-full", 
                    "fat"
                ], 
                "role": "Firemen Are Hot: Played straight and later averted (i.e., a calender-full of dancing mounds of muscle juxtaposed with a bunch of fat, hairy dudes eating chips).", 
                "id": "FiremenAreHot"
            }, 
            {
                "adjectives": [
                    "firefighter-themed", 
                    "full", 
                    "old", 
                    "distasteful", 
                    "shallow", 
                    "hypersexual", 
                    "entire"
                ], 
                "role": "Subverted in Sex and the City. After attending a firefighter-themed stripper auction, Samantha goes to meet one of the sexy firemen at his work. Instead of finding a harem of buff men, she walks in to a lounge full of old guys with beer bellies watching TV. This is distasteful enough for the shallow, hypersexual Samantha; but it gets worse.  While she's seducing the sexy fireman, the fire alarm goes off, leaving her standing partially naked while the entire fire brigade pushes around her to get into their trucks.", 
                "id": "FiremenAreHot"
            }, 
            {
                "adjectives": [
                    "straight"
                ], 
                "role": "Discussed on Sex and the City. When asked why gay guys spend so much time at the gym, one of the women says it's because of the possibility of having sex, and points out that if straight guys had the opportunity to have sex at the gym, they'd go more often.", 
                "id": "GymBunny"
            }, 
            {
                "adjectives": [
                    "serious"
                ], 
                "role": "Lady Killer In Love: On the sparse times where Samantha pursues a serious relationship.", 
                "id": "LadyKillerInLove"
            }, 
            {
                "adjectives": [
                    "other", 
                    "formal", 
                    "social", 
                    "old"
                ], 
                "role": "Man in a Kilt: Trey's wedding and during other formal occasions in his social setting, which is old money New York family of Scottish descent.", 
                "id": "ManInAKilt"
            }, 
            {
                "adjectives": [
                    "Blair-freakin'-Underwood"
                ], 
                "role": "In season six, Miranda's boyfriend Robert (played by Blair-freakin'-Underwood)", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Right Through His Pants", 
                "id": "RightThroughHisPants"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "This popped up a few times in Sex and the City when the actress in the scene refused to get undressed for the camera.", 
                "id": "RightThroughHisPants"
            }, 
            {
                "adjectives": [
                    "naked"
                ], 
                "role": "Shirtless Scene: Happens a lot, but Smith is probably the most naked man on this show.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "otherwise-perfect"
                ], 
                "role": "A story arc in one season of Sex and the City dealt with Samantha's frustration that her otherwise-perfect boyfriend was underendowed, and her skittishness about how to tell him. It finally ended (along with the relationship) when she blurted it out during couples counseling.", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [], 
                "role": "Teeny Weenie: An arc during one season dealt with Samantha's frustrations that an otherwise ideal partner was underendowed, and how she couldn't tell him. It ended (along with the relationship) when she blurted it out during couples counseling.", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [
                    "many", 
                    "female", 
                    "such", 
                    "hot", 
                    "casual"
                ], 
                "role": "The Casanova: Too many to count. Heck, there are even female examples — such as Samantha who loves hot, steamy, casual sex.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [], 
                "role": "The Charmer", 
                "id": "TheCharmer"
            }, 
            {
                "adjectives": [
                    "particular"
                ], 
                "role": "The Loins Sleep Tonight: Trey in particular.", 
                "id": "TheLoinsSleepTonight"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "lucky", 
                    "major"
                ], 
                "role": "Sex and the City: Carrie Bradshaw is lucky if she can brew a pot of coffee. Thankfully all her major love interests know their way around the kitchen.", 
                "id": "FeminineWomenCanCook"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Housewife: Charlotte after her first wedding.", 
                "id": "HouseWife"
            }, 
            {
                "adjectives": [], 
                "role": "Lady in Red: Samantha wears tight red dresses very often.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [], 
                "role": "Lipstick Lesbian: Charlotte wants to get in with a posse of them in one episode. Maria, Samantha's Portuguese lover from season 4 (and therefore Samantha, for a time).", 
                "id": "LipstickLesbian"
            }, 
            {
                "adjectives": [
                    "male", 
                    "upbeat", 
                    "long", 
                    "much", 
                    "music"
                ], 
                "role": "Carrie on Sex and the City dates a male version for a while. Raymond is a charming, upbeat jazz musician, but Carrie eventually learns that he can't focus on anything for very long (as if he had a form of ADHD) and doesn't have much depth beyond his love of music.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "first", 
                    "cold", 
                    "old", 
                    "thirty-something", 
                    "own", 
                    "drive"
                ], 
                "role": "Sex and the City's Bunny, mother of Charlotte's first husband Trey. To the point where she saw nothing wrong with barging into their bedroom in the middle of the night to rub Vick's on his chest (he had a cold), or in the morning to wake him up as though he were ten years old instead of thirty-something (gets even worse when you realize that she had to get out of her own bed, leave her place and drive over to their place to do this). Not until she walks in on them having sex does it finally dawn on her how out of line her behavior is.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "with-"
                ], 
                "role": "Old Maid: All the girls, but they still get laid a lot and find guys all the time. The main overriding concern is whether they'll find someone to stay with- or whether this is something they even want.", 
                "id": "OldMaid"
            }, 
            {
                "adjectives": [
                    "traditional", 
                    "religious", 
                    "first"
                ], 
                "role": "Shiksa Goddess: Charlotte converts to Judaism so that Harry would marry her, leading to some frustration on her part when she ends up being more traditional and religious than he is. Before Harry, she was this to a Hasidic artist she slept with in the first season.", 
                "id": "ShiksaGoddess"
            }, 
            {
                "adjectives": [], 
                "role": "Sex and the City: One of Samantha's Guys of the Week would refuse to have sex while his basketball team was playing. Sam tried to indulge his fandom, but when he turned out to have a team for every season, she walked away.", 
                "id": "SportsWidow"
            }, 
            {
                "adjectives": [], 
                "role": "Sports Widow: One of Samantha's Guys of the Week refuses to have sex while his basketball team is playing. Sam tries to indulge his fandom, but when he turns out to have a team for every season, she walks away.", 
                "id": "SportsWidow"
            }, 
            {
                "adjectives": [], 
                "role": "Carrie from Sex and the City.", 
                "id": "TheFashionista"
            }
        ]
    }, 
    "imdbid": "tt1000774", 
    "poster_url": "SexAndTheCity.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "RightThroughHisPants", 
                "DoggedNiceGuy", 
                "TeenyWeenie", 
                "SportsWidow"
            ], 
            "shared_count": 5, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "TheFashionista", 
                "CampStraight", 
                "DoggedNiceGuy", 
                "ShirtlessScene", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 5, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "LadyInRed", 
                "MrFanservice", 
                "ShirtlessScene"
            ], 
            "shared_count": 4, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "RightThroughHisPants", 
                "ShirtlessScene", 
                "CampStraight"
            ], 
            "shared_count": 4, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "DoggedNiceGuy", 
                "FiremenAreHot", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 4, 
            "id": "TheNuttyProfessor", 
            "name": "The Nutty Professor", 
            "poster_url": "TheNuttyProfessor.jpg"
        }
    ], 
    "id": "SexAndTheCity", 
    "name": "Sex and the City"
}