{
    "plot": "Gal, Deedee, Aitch and Jackie, having left behind respective lives of ill-repute, bask in the sun of Spain and in the most essential brand of leisure. A hazy yarn of barbecues, beer and botched hunting expeditions make up their retirements, until a sudden and unforeseen disruption emerges from their past. Enter the childishly violent and hilariously edgy Don Logan. Through a series of side-splitting negotiations and irrevocable acts, retired crook Gal is forced to shake off the rust and accept one last mission, put forth by the menacing Logan, his ex-mentor. A heist of legendary proportion and personal implications, this job should make for one hell of an encore.", 
    "genres": "Crime, Drama, Romance", 
    "release_year": "2000", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "ancient"
                ], 
                "role": "Gayngster: Teddy Bass, who attends orgies \"like in ancient Rome.\"", 
                "id": "Gayngster"
            }, 
            {
                "adjectives": [
                    "Roman-style", 
                    "wealthy", 
                    "powerful"
                ], 
                "role": "Teddy Bass, \"Mr. Black Magic\" himself, from Sexy Beast. Teddy attends Roman-style orgies to meet wealthy and powerful men and steal from them.", 
                "id": "Gayngster"
            }, 
            {
                "adjectives": [
                    "sophisticated", 
                    "well-dressed"
                ], 
                "role": "Gentleman Thief: Teddy is a sophisticated and well-dressed man who is apparently known by the London elite well enough to get invited to their orgies.", 
                "id": "GentlemanThief"
            }, 
            {
                "adjectives": [
                    "He-Man", 
                    "happy", 
                    "resentful"
                ], 
                "role": "He-Man Woman Hater: Don throws all manner of sexist abuse at Jackie and Deedee, calling them whores and the like. While he merely hates anyone who is happy while he isn't, Don is particularly resentful that Aitch is with Jackie and he's actually scared of Deedee.", 
                "id": "HeManWomanHater"
            }, 
            {
                "adjectives": [
                    "fit", 
                    "popular"
                ], 
                "role": "Lady Killer In Love: Hinted at in Gal Dove's past. Don says he used to be a very fit and handsome man, called \"Dove the Love,\" and very popular with the ladies until he surprised everyone and married Dee Dee, with whom he is still in love.", 
                "id": "LadyKillerInLove"
            }, 
            {
                "adjectives": [
                    "powerful", 
                    "straight-laced", 
                    "same"
                ], 
                "role": "Straight Gay: Harry, a powerful and straight-laced banker who attends the same orgies as Teddy.", 
                "id": "StraightGay"
            }
        ]
    }, 
    "imdbid": "tt0203119", 
    "poster_url": "SexyBeast.jpg", 
    "similar": [
        {
            "shared": [
                "Gayngster", 
                "HeManWomanHater", 
                "StraightGay"
            ], 
            "shared_count": 3, 
            "id": "MillersCrossing", 
            "name": "Miller's Crossing", 
            "poster_url": "MillersCrossing.jpg"
        }, 
        {
            "shared": [
                "Gayngster", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "VictorVictoria", 
            "name": "Victor/Victoria"
        }, 
        {
            "shared": [
                "Gayngster", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "HeManWomanHater"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "GentlemanThief"
            ], 
            "shared_count": 1, 
            "id": "Popeye", 
            "name": "Popeye", 
            "poster_url": "Popeye.jpg"
        }
    ], 
    "id": "SexyBeast", 
    "name": "Sexy Beast"
}