{
    "plot": "After a fateful mistake costing his career, an ex-soccer player bum meets a shaolin kung fu student trying to spread the word of kung fu. The ex-soccer player helps reconcile with his five brothers, and teaches them soccer, adding shaolin kung fu as a twist.", 
    "genres": "Action, Comedy, Sport", 
    "release_year": "2001", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Double", 
                    "terrible", 
                    "streetwalker-thick", 
                    "second"
                ], 
                "role": "Beautiful All Along: Double Subverted. Mui, originally a rather ugly girl with terrible acne, gets a makeover in hopes of attracting Sing. She ends up with streetwalker-thick makeup, hair straight out of The Eighties and shoulder pads. Eventually she goes through a second transformation where she gives up the makeup, shaves her head bald... and looks better than ever, in time for a Heroic Second Wind against Team Evil.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "terrible", 
                    "bad", 
                    "streetwalker-thick", 
                    "big", 
                    "second", 
                    "bad", 
                    "common", 
                    "physical", 
                    "memorable", 
                    "famous", 
                    "female", 
                    "famous", 
                    "Chinese", 
                    "real", 
                    "final"
                ], 
                "role": "Shaolin Soccer subverts this not once but twice. The heroine, originally a rather ugly girl with terrible skin, gets a makeover in the hopes of attracting the hero, but the result is almost as bad; she ends up with streetwalker-thick makeup, '80s big hair and shoulder pads. Eventually she goes through a second transformation where she gives up on the makeup, etc., and shaves her head bald — and looks better than ever (one wonders what happened to the bad skin).\n This is rather common in Stephen Chow movies, in that almost all of his love interests have either physical flaws, or are characteristically flawed. One of the most memorable moments in Chow's movies before he became vastly famous was the ending scene of God of Cookery, where the comically homely female street chef got an extreme makeover after he alleged death. The actress playing the role, however, is a famous Chinese pop star in real life, so her final appearance in the movie actually had her to do away with her faux ugly makeup.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "female", 
                    "facial"
                ], 
                "role": "Girls with Moustaches: Two of the female soccer players have fake facial hair.", 
                "id": "GirlsWithMoustaches"
            }, 
            {
                "adjectives": [
                    "female", 
                    "facial", 
                    "all-male"
                ], 
                "role": "Two female soccer players have fake facial hair in Shaolin Soccer, presumably because it's ostensibly an all-male league.", 
                "id": "GirlsWithMoustaches"
            }
        ]
    }, 
    "imdbid": "tt0286112", 
    "poster_url": "ShaolinSoccer.jpg", 
    "similar": [
        {
            "shared": [
                "BeautifulAllAlong", 
                "GirlsWithMoustaches"
            ], 
            "shared_count": 2, 
            "id": "TheFlintstones", 
            "name": "The Flintstones", 
            "poster_url": "TheFlintstones.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "KuchKuchHotaHai", 
            "name": "Kuch Kuch Hota Hai", 
            "poster_url": "KuchKuchHotaHai.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "CaptainEO", 
            "name": "Captain EO", 
            "poster_url": "CaptainEO.jpg"
        }
    ], 
    "id": "ShaolinSoccer", 
    "name": "Shaolin Soccer"
}