{
    "plot": "After finally catching serial killer and occult \"sorcerer\" Lord Blackwood, legendary sleuth Sherlock Holmes and his assistant Dr. Watson can close yet another successful case. But when Blackwood mysteriously returns from the grave and resumes his killing spree, Holmes must take up the hunt once again. Contending with his partner's new fiancée and the dimwitted head of Scotland Yard, the dauntless detective must unravel the clues that will lead him into a twisted web of murder, deceit, and black magic - and the deadly embrace of temptress Irene Adler.", 
    "genres": "Action, Adventure, Crime", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bash Brothers: Holmes and Watson basically all the time.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "magical", 
                    "ritual"
                ], 
                "role": "Bastard Bastard: Blackwood was conceived out of wedlock during a \"magical\" ritual.", 
                "id": "BastardBastard"
            }, 
            {
                "adjectives": [
                    "magical", 
                    "childbirth", 
                    "several", 
                    "British", 
                    "former", 
                    "facial"
                ], 
                "role": "Played with by Lord Henry Blackwood in Sherlock Holmes, who was conceived out of wedlock during a magical ritual. His mother dies during childbirth, he goes on to murder several people (including his father), and tries to sieze control of the British Empire by making the world fear him. However, Holmes mentions that he's a former member of the House of Lords, so he may not have suffered some of the prejudices normally associated with bastards.\n His parentage was kept secret. Holmes only figured it out by comparing his facial features to that of the Lord Chief Justice and noticed a family resemblance.", 
                "id": "BastardBastard"
            }, 
            {
                "adjectives": [
                    "main"
                ], 
                "role": "Sherlock Holmes has Sherlock and Dr. Watson.\n With the twist that Sherlock, the main character, is pretty much the foil.", 
                "id": "BromanticFoil"
            }, 
            {
                "adjectives": [
                    "happy"
                ], 
                "role": "Crazy Jealous Guy: Holmes is not happy that Mary is diverting Watson's attentions from their partnership.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "eponymous"
                ], 
                "role": "The 2009 Guy Ritchie Sherlock Holmes film portrayed the eponymous character as this when it comes to his best friend Dr. Watson's engagement to Mary Morstan.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "drunk/wasted/stoned", 
                    "eccentric"
                ], 
                "role": "Sherlock Holmes is quite cultured; he just refuses to live up to the image and prefers the drunk/wasted/stoned eccentric genius style.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "half-naked", 
                    "blue"
                ], 
                "role": "Also, half-naked, rather built Robert Downey Jr... wearing badly applied blue eyeshadow and lipstick.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [
                    "paper-thin"
                ], 
                "role": "In Sherlock Holmes: A Game of Shadows, Holmes makes use of the paper-thin disguise variation. Mainly for laughs.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [], 
                "role": "Gentleman Adventurer: Holmes and Watson.", 
                "id": "GENTLEMANADVENTURER"
            }, 
            {
                "adjectives": [
                    "first", 
                    "complete"
                ], 
                "role": "Men Can't Keep House: The first time we see Holmes' apartment, it is a darkened disheveled mess, complete with bullet holes in the walls. This trope is indirectly discussed when Mrs. Hudson enters and Holmes teases her for not making her rounds more frequently.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [
                    "first", 
                    "complete"
                ], 
                "role": "The first time we see Holmes' apartment in Sherlock Holmes, it is a darkened disheveled mess, complete with bullet holes in the walls. This trope is indirectly discussed when Mrs. Hudson enters and Holmes teases her for not making her rounds more frequently.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "accurate"
                ], 
                "role": "All over the place in Guy Ritchie's Sherlock Holmes adaptation, which would have been accurate for the period.", 
                "id": "WaistcoatOfStyle"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "brief"
                ], 
                "role": "Action Girl: Irene Adler. Sim. Technically Mary as well, if only for brief moment of awesome.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "sexual", 
                    "other", 
                    "second", 
                    "cast", 
                    "actual", 
                    "only", 
                    "first", 
                    "romantic", 
                    "romantic"
                ], 
                "role": "The trailers for Sherlock Holmes focused on the sexual subtext between their Hotter and Sexier versions of Holmes and Watson with other characters commenting that they should get a room, and the trailers for the second one focused on Holmes trying out crossdressing and flirting with Watson and so on. All the cast interviews emphasised it, too. This subtext is in the actual films, but goes absolutely nowhere - the only payoff of it in the first is a scene with Holmes talking to Irene in a way that can be interpreted as either romantic for her or romantic for Watson.", 
                "id": "BaitAndSwitchLesbians"
            }, 
            {
                "adjectives": [], 
                "role": "Alice Faulkner in Sherlock Holmes.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Alice Faulkner.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Femme Fatale: Irene Adler.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "forth", 
                    "out-of-focus"
                ], 
                "role": "A jarring example near the beginning of Sherlock Holmes, cutting quickly back and forth between Robert Downey, Jr. and Rachel McAdams where he was shot without blur, but she and her surroundings were slightly out-of-focus.", 
                "id": "GaussianGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Irene Adler toward the end of the 2009 Sherlock Holmes movie.\n In \"A Scandal in Bohemia,\" Adler disguised herself by wearing men's clothing in order to inconspicuously follow Holmes and Watson back to Baker Street. She describes the suit as her \"walking clothes\" and implies that she does so frequently to avoid notice.", 
                "id": "HotChickInABadassSuit"
            }, 
            {
                "adjectives": [
                    "casual"
                ], 
                "role": "In Sherlock Holmes: A Game of Shadows, Mycroft's casual nudity would not have counted as Fanservice... had the character been played by anybody but Stephen Fry.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "second"
                ], 
                "role": "Kicking Ass in All Her Finery: Irene Adler. Could also be said of Simza in the second film, especially after she starts wearing Watson's bowler hat.", 
                "id": "KickingAssInAllHerFinery"
            }, 
            {
                "adjectives": [
                    "sure"
                ], 
                "role": "Neutral Female: Averted. When Watson pins an assassin, Mary makes sure to grab his gun and hold it against his head.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [
                    "one-shot", 
                    "fiancée", 
                    "few"
                ], 
                "role": "Sherlock Holmes (2009) has all of two women as more than one-shot characters: Watson's fiancée and Holmes' Love Interest, Irene Adler, who is demoted from being one of the few people ever to outwit Sherlock to being Moriarty's lackey. After  being Stuffed into the Fridge in Game Of Shadows her replacement is involved in the plot because of her brother.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Averted in SherlockHolmes were Holmes drops the handcuff key down between Irene Adler's bosoms for her to fish around for.", 
                "id": "Ptitleba4e2b2g"
            }, 
            {
                "adjectives": [], 
                "role": "The Muse: Watson claims Irene is this for Holmes.", 
                "id": "TheMuse"
            }
        ]
    }, 
    "imdbid": "tt0988045", 
    "poster_url": "SherlockHolmes.jpg", 
    "similar": [
        {
            "shared": [
                "MenCantKeepHouse", 
                "FemmeFatale", 
                "ShirtlessScene", 
                "NeverASelfMadeWoman", 
                "NeutralFemale", 
                "ActionGirl", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 7, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "CrazyJealousGuy", 
                "KickingAssInAllHerFinery", 
                "HotChickInABadassSuit", 
                "BashBrothers", 
                "NeverASelfMadeWoman", 
                "DisguisedInDrag"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "WaistcoatOfStyle", 
                "ShirtlessScene", 
                "HotChickInABadassSuit", 
                "ActionGirl", 
                "BashBrothers"
            ], 
            "shared_count": 5, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "Ptitleba4e2b2g", 
                "GaussianGirl", 
                "NeverASelfMadeWoman", 
                "MenCantKeepHouse", 
                "DisguisedInDrag"
            ], 
            "shared_count": 5, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "DamselInDistress", 
                "NeverASelfMadeWoman", 
                "ShirtlessScene", 
                "BaitAndSwitchLesbians"
            ], 
            "shared_count": 5, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }
    ], 
    "id": "SherlockHolmes", 
    "name": "Sherlock Holmes"
}