{
    "plot": "She's All That is your typical high school prom king and queen story and the run in defending the star status in the upcoming election. High school hottie, Zack Siler is dumped by his prom-queen girlfriend, the equally attractive and extremely popular, Taylor Vaughan who fell for a second-hand world reject TV soap star who she met over the spring break. Having been publicly dumped, Zack defends his discomposure by stating that Taylor is all make-up and wonder-bra and he can make any ordinary girl a prom queen with a similar package. His high-school buddy, Dean Sampson, engages him in a bet following this statement and picks the geeky looking Laney Boggs out of the crowd as the girl Zack must transform into the new prom queen. Zack agrees since he has no option, but as time passes and Laney begins to transform, Zack begins to find her attractive. While all that falls beautifully in place, it's not your typical fairy-tale. Throw in Dean Sampson to complicate the situation, as when he first made the bet he never thought that Zack could rise to the challenge but looking at how Laney has transformed, it looks like Zack could be on a winning streak.", 
    "genres": "Comedy, Romance", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Big Man on Campus", 
                "id": "BigManOnCampus"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: Dean fits best, but Zack has his moments, too.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "many", 
                    "own", 
                    "many"
                ], 
                "role": "Alpha Bitch: Taylor Vaughan. Emphasis on bitch. It’s actually hinted in dialogue many times throughout the film that no one — not even her own Girl Posse — can abide her. Indeed, by the end of the movie many of her friends seem to be quite firmly on Laney's side.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Beautiful All Along: One of the trope definers.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Lady in Red: Taylor and Laney at Preston's Wild Teen Party.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [], 
                "role": "Missing Mom", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0160862", 
    "poster_url": "ShesAllThat.jpg", 
    "similar": [
        {
            "shared": [
                "BeautifulAllAlong", 
                "LadyInRed", 
                "JerkJock", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "JerkJock", 
                "AlphaBitch", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "TheCraft", 
            "name": "The Craft", 
            "poster_url": "TheCraft.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "AlphaBitch", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "BigManOnCampus", 
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "TheBreakfastClub", 
            "name": "The Breakfast Club", 
            "poster_url": "TheBreakfastClub.jpg"
        }, 
        {
            "shared": [
                "BigManOnCampus", 
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "AllTheBoysLoveMandyLane", 
            "name": "All the Boys Love Mandy Lane", 
            "poster_url": "AllTheBoysLoveMandyLane.jpg"
        }
    ], 
    "id": "ShesAllThat", 
    "name": "She's All That"
}