{
    "plot": "A murderous TV repairman, Horace Pinker is killing people in a small town left, right and center. He eventually finds the home of Lt. Parker, who is investigating his crimes, and savagely murders Parker's wife, son and daughter. His other son, Jonathan has a strange connection to Pinker through his dreams, and he directs his father to Pinker's business, where a small group of officers enter. Pinker escapes in a horrific spree, killing four officers and then targeting Jonathan's girlfriend, Alison. Another dream leads Jonathan and his dad to a residence where they catch Pinker in in the act of kidnapping. Pinker is arrested after a fight with Jonathan and sentenced to die in the electric chair. When executed, Pinker - who supposedly had given his soul to the devil in exchange for the power to come back as an energy source - takes over people's bodies and continues committing murders, until Jonathan devises a plan to bring Pinker into the real world, and then cut off his power source...", 
    "genres": "Comedy, Horror, Thriller", 
    "release_year": "1989", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "adoptive"
                ], 
                "role": "Archnemesis Dad: Horace Pinker reveals during his execution that Jonathan is actually his son and that he killed his mom. For trying to stop him, Pinker has apparently made it his life's goal to destroy his son and brutally murder everyone he loves, including his adoptive family and his girlfriend.", 
                "id": "ArchnemesisDad"
            }, 
            {
                "adjectives": [
                    "psychotic", 
                    "adoptive"
                ], 
                "role": "In Shocker, the psychotic killer Horace Pinker reveals during his execution that Jonathan is actually his son and that he killed his mom. For trying to stop him, Pinker has apparently made it his life's goal to destroy his son and brutally murder everyone he loves, including his adoptive family and his girlfriend.", 
                "id": "ArchnemesisDad"
            }, 
            {
                "adjectives": [
                    "team-mate"
                ], 
                "role": "Scary Black Man: Jonathan's football team-mate who seems to have a thing about breaking people's necks.", 
                "id": "ScaryBlackMan"
            }
        ]
    }, 
    "imdbid": "tt0098320", 
    "poster_url": "Shocker.jpg", 
    "similar": [
        {
            "shared": [
                "ScaryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "KissOfTheSpiderWoman", 
            "name": "Kiss of the Spider Woman", 
            "poster_url": "KissOfTheSpiderWoman.jpg"
        }, 
        {
            "shared": [
                "ScaryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "TheIcePirates", 
            "name": "The Ice Pirates", 
            "poster_url": "TheIcePirates.jpg"
        }, 
        {
            "shared": [
                "ScaryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "ScaryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "ConanTheDestroyer", 
            "name": "Conan The Destroyer"
        }, 
        {
            "shared": [
                "ScaryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "RobinHoodPrinceOfThieves", 
            "name": "Robin Hood: Prince of Thieves", 
            "poster_url": "RobinHoodPrinceOfThieves.jpg"
        }
    ], 
    "id": "Shocker", 
    "name": "Shocker"
}