{
    "plot": "Detective Chris Kenner was orphaned as a child as his father was in the service and was killed and lived in Japan. Now he is on the trail of ruthless Yakuza leader named Yoshido, who helped establish a small Japanese area in Los Angeles and is now running a drug ring disguised as a brewery. However, Kenner must team up with a Japanese-American detective named Johnny Murata, and he also must protect a witness named Minako who would testify against Yoshido. But what Kenner will soon discover that he will be in a lot more than what he bargained for.", 
    "genres": "Action, Comedy, Crime", 
    "release_year": "1991", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "complimentary"
                ], 
                "role": "Bigger Is Better in Bed: According to Murata, Kenner has \"the biggest dick I've ever seen,\" said with a complimentary tone.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [
                    "complimentary", 
                    "sexual"
                ], 
                "role": "Showdown in Little Tokyo. According to Murata, Kenner has \"the biggest dick I've ever seen,\" said with a complimentary tone. Unsurprisingly, he's portrayed as a sexual dynamo.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [], 
                "role": "Gag Penis: They actually halt an action scene just so Murata can tell Kenner \"Just in case we get killed, I wanted to tell you, you have the biggest dick I've ever seen on a man.\" He also jokingly notes that its size scared him.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [], 
                "role": "Showdown in Little Tokyo. They actually halt an action scene just so Brandon Lee can tell Dolph Lundgren \"Just in case we get killed, I wanted to tell you, you have the biggest dick I've ever seen on a man.\" He also jokingly notes that its size scared him.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [
                    "electric", 
                    "final"
                ], 
                "role": "In Showdown in Little Tokyo, Kenner (Dolph Lundgren) spends the gunfight at his home, the electric torture scene and the final sword fight with Yoshida continuously shirtless. Many of the Yakuza are also shirtless a lot of the time to show off their gang tattoos.", 
                "id": "WalkingShirtlessScene"
            }, 
            {
                "adjectives": [
                    "electric", 
                    "final"
                ], 
                "role": "Walking Shirtless Scene: Kenner spends the gunfight at his home, the electric torture scene and the final sword fight with Yoshida continuously shirtless. Many of the Yakuza are also shirtless a lot of the time to show off their gang tattoos.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "alive"
                ], 
                "role": "Damsel in Distress: After Yoshida recaptures Minako he takes her with him as a hostage. He eventually ties her up covered in gasoline and tries to burn her alive in front of Kenner.", 
                "id": "DamselInDistress"
            }
        ]
    }, 
    "imdbid": "tt0102915", 
    "poster_url": "ShowdownInLittleTokyo.jpg", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "Neighbors2014", 
            "name": "Neighbors", 
            "poster_url": "Neighbors2014.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "DamselInDistress"
            ], 
            "shared_count": 2, 
            "id": "ClashOfTheTitans", 
            "name": "Clash of the Titans", 
            "poster_url": "ClashOfTheTitans.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "DamselInDistress"
            ], 
            "shared_count": 2, 
            "id": "Tarzan", 
            "name": "Tarzan", 
            "poster_url": "Tarzan.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "DamselInDistress"
            ], 
            "shared_count": 2, 
            "id": "HouseOfWax", 
            "name": "House of Wax", 
            "poster_url": "HouseOfWax.jpg"
        }, 
        {
            "shared": [
                "GagPenis", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "Mash", 
            "name": "M*A*S*H"
        }
    ], 
    "id": "ShowdownInLittleTokyo", 
    "name": "Showdown in Little Tokyo"
}