{
    "plot": "The \"Cotton Blossom\", owned by the Hawk family, is the show boat where everyone comes for great musical entertainment down south. Julie Laverne and her husband are the stars of the show. After, a snitch on board calls the local police that Julie (who's half- African-American) is married to a whiteman, they are forced to leave the show boat. The reason being, that down south interracial marriages are forbidden. Magnolia Hawk, Captain Andy Hawks daughter, becomes the new show boat attraction and her leading man is Gaylord Ravenal, a gambler. The two instantly fall in love, and marry, without Parthy Hawks approval. Magnolia and Gaylord leave the, \"Cotton Blossom\", for a whirl wind honeymoon and being to live in a Pl: fantasy world. Magnolia soon faces reality quickly, that gambling means more to Gaylord than anything else. Magnolia confront Gaylord and after he gambles away their fortune he leaves her - not knowing she is pregnant. Magnolia is left penniless and pregnant, and is left to fend for herself, and make a new start.", 
    "genres": "Drama, Family, Musical", 
    "release_year": "1951", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "on-stage"
                ], 
                "role": "Parthenia Hawks in Show Boat (played on-stage by Edna May Oliver and in film by Helen Westley and Agnes Moorehead)", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [], 
                "role": "Queenie from Show Boat, originally portrayed in blackface.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [
                    "nice"
                ], 
                "role": "Spoiled Sweet:  Kim, born to finer things in life, is a genuinely nice person from childhood and beyond.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0044030", 
    "poster_url": "ShowBoat.jpg", 
    "similar": [
        {
            "shared": [
                "SpoiledSweet", 
                "GrandeDame", 
                "SassyBlackWoman"
            ], 
            "shared_count": 3, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "SassyBlackWoman"
            ], 
            "shared_count": 2, 
            "id": "MaidInManhattan", 
            "name": "Maid In Manhattan", 
            "poster_url": "MaidInManhattan.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "GrandeDame"
            ], 
            "shared_count": 2, 
            "id": "TheWomen", 
            "name": "The Women", 
            "poster_url": "TheWomen.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "SassyBlackWoman"
            ], 
            "shared_count": 2, 
            "id": "OliverAndCompany", 
            "name": "Oliver & Company"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "SassyBlackWoman"
            ], 
            "shared_count": 2, 
            "id": "Cinderella", 
            "name": "Cinderella", 
            "poster_url": "Cinderella.jpg"
        }
    ], 
    "id": "ShowBoat", 
    "name": "Show Boat"
}