{
    "plot": "When a green ogre named Shrek discovers his swamp has been 'swamped' with all sorts of fairytale creatures by the scheming Lord Farquaad, Shrek sets out with a very loud donkey by his side to 'persuade' Farquaad to give Shrek his swamp back. Instead, a deal is made. Farquaad, who wants to become the King, sends Shrek to rescue Princess Fiona, who is awaiting her true love in a tower guarded by a fire-breathing dragon. But once they head back with Fiona, it starts to become apparent that not only does Shrek, an ugly ogre, begin to fall in love with the lovely princess, but Fiona is also hiding a huge secret.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Prince Charming of Shrek.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "villainous"
                ], 
                "role": "Shrek\n Prince Charming. Also a villainous hunk.\n Shrek in his human form.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "selfish", 
                    "evil"
                ], 
                "role": "Inverted in the Shrek sequels, as Prince Charming is vain, selfish and in Shrek the Third, arguably evil.", 
                "id": "PrinceCharming"
            }, 
            {
                "adjectives": [], 
                "role": "In Shrek 2, Prince Charming was supposed to marry Fiona, but his personality did not endear him to her.", 
                "id": "PrinceCharmless"
            }, 
            {
                "adjectives": [
                    "fat", 
                    "green", 
                    "strong"
                ], 
                "role": "Shrek may be a fat green ogre, but boy is he strong.", 
                "id": "StoutStrength"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "reasonable", 
                    "true"
                ], 
                "role": "Shrek has Princess Fiona. She seems to be every cliché about a Princess in need of rescue, until she meets somebody REALLY ANNOYING. She goes downright Trinity when she's in a situation that's at all reasonable to handle herself.\n She didn't stay because she was an unarmoured woman, she stayed because she wanted to. She could only find true love by being rescued.\n Shrek Forever After gives us an Alternate Timeline where Shrek never came. Fiona saved herself and became a resistance fighter.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "definite", 
                    "such", 
                    "kung", 
                    "other", 
                    "good", 
                    "second"
                ], 
                "role": "Princess Fiona from the Shrek movies shows definite badass tendencies, such as fighting off bandits with kung fu and headbutting Prince Charming. In Shrek Forever After, Alternate Universe Fiona gets tired of waiting to be rescued, so she breaks out and becomes leader of La Résistance. The other princesses in Shrek the Third Took a Level in Badass to fight Prince Charming. Especially Snow White, who uses her power to summon woodland creatures to assault Charming's minions. Also, the Queen shows Fiona from which side of the family she got her fighting skills by headbutting through two walls. She doesn't feel so good after the second wall, though. Understandable since she's getting on in years.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "true", 
                    "true", 
                    "straight", 
                    "beautiful"
                ], 
                "role": "Subverted in Shrek when beautiful human Princess Fiona is transformed by a kiss into her true form, an Ogre. Arguably, the words of her curse can be interpreted to mean she would transform into the form of her true love.\n Also played straight: Shrek finds Ogre!Fiona beautiful.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "usual"
                ], 
                "role": "Fiona of Shrek is still fairly pretty for an ogress, despite indulging in the usual icky ogre habits.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "reasonable", 
                    "true"
                ], 
                "role": "Shrek has Princess Fiona. She seems to be every cliché about a Princess in need of rescue, until she meets somebody REALLY ANNOYING. She goes downright Trinity when she's in a situation that's at all reasonable to handle herself. She didn't stay because she was an unarmoured woman; she stayed because she wanted to. She could only find true love by being rescued. Shrek Forever After gives us an Alternate Timeline where Shrek never came. Fiona saved herself and became a resistance fighter.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Female Monster Surprise: Donkey realizes as Dragon moves out of the shadows that she's a female dragon, thanks to her eyelashes and lipstick. He's surprised for a moment, but uses this to keep flattering her so she won't kill him.", 
                "id": "FemaleMonsterSurprise"
            }, 
            {
                "adjectives": [
                    "smooth-talk", 
                    "female"
                ], 
                "role": "In Shrek, Donkey is confronted by a dragon on a collapsing walkway and attempts to smooth-talk his way out, before realizing that the dragon is female, and she thinks that he's hitting on her. He goes with it.", 
                "id": "FemaleMonsterSurprise"
            }, 
            {
                "adjectives": [
                    "stereotypical"
                ], 
                "role": "In Shrek, Princess Fiona struggles with her role as a stereotypical fairytale princess.", 
                "id": "FemininityFailure"
            }, 
            {
                "adjectives": [], 
                "role": "Girl in the Tower: Lampshaded", 
                "id": "GirlInTheTower"
            }, 
            {
                "adjectives": [
                    "quite", 
                    "single"
                ], 
                "role": "Shrek - Princess Fiona takes out Robin Hood and a squad of merry men single-handedly while wearing her signature green princess dress. She's quite put out when a single lock of hair is out of place after the dust settles.", 
                "id": "KickingAssInAllHerFinery"
            }, 
            {
                "adjectives": [
                    "playable"
                ], 
                "role": "Red is portrayed this way whenever she's a playable character in a Shrek video game. Namely Shrek 2: The Video Game, Shrek Super Slam, and Shrek: Smash n Crash Racing.", 
                "id": "LittleRedFightingHood"
            }
        ]
    }, 
    "imdbid": "tt0126029", 
    "poster_url": "Shrek.jpg", 
    "similar": [
        {
            "shared": [
                "PrinceCharmless", 
                "CampStraight", 
                "BadassPrincess", 
                "KickingAssInAllHerFinery", 
                "FemininityFailure"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PrinceCharmless", 
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "KickingAssInAllHerFinery", 
                "BadassPrincess"
            ], 
            "shared_count": 5, 
            "id": "Spaceballs", 
            "name": "Spaceballs", 
            "poster_url": "Spaceballs.jpg"
        }, 
        {
            "shared": [
                "PrinceCharmless", 
                "DamselOutOfDistress", 
                "Hunk", 
                "KickingAssInAllHerFinery", 
                "BadassPrincess"
            ], 
            "shared_count": 5, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "PrinceCharmless", 
                "BeautifulAllAlong", 
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "Hunk"
            ], 
            "shared_count": 5, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }, 
        {
            "shared": [
                "PrinceCharmless", 
                "BadassDamsel", 
                "DamselOutOfDistress"
            ], 
            "shared_count": 3, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }
    ], 
    "id": "Shrek", 
    "name": "Shrek"
}