{
    "plot": "Against medical advice and without the knowledge of her husband Pat Solatano Sr., caring Dolores Solatano discharges her adult son, Pat Solatano Jr., from a Maryland mental health institution after his minimum eight month court ordered stint. The condition of the release includes Pat Jr.'s moving back in with his parents in their Philadelphia home. Although Pat Jr.'s institutionalization was due to his beating up the lover of his wife Nikki, he was diagnosed with bipolar disorder. Nikki has since left him and has received a restraining order against him. Although he is on medication (which he doesn't take because of the way it makes him feel) and has mandatory therapy sessions, Pat Jr. feels like he can manage on the outside solely by healthy living and looking for the \"silver linings\" in his life. His goals are to get his old job back as a substitute teacher, but more importantly reunite with Nikki. He finds there are certain instances where he doesn't cope well, however no less so than some others who have never been institutionalized, such as his Philadelphia Eagles obsessed OCD father who has resorted to being a bookie to earn a living, his best friend Ronnie who quietly seethes over the control wielded by his wife Veronica, and Veronica's widowed sister, Tiffany Maxwell, a recovering sex addict. In their fragile mental states, Pat Jr. and Tiffany embark on a love/hate friendship based primarily on what help the other can provide in achieving their individual goals. But they may reevaluate their goals as their relationship progresses.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Crazy Jealous Guy\\Mad Love: Pat regarding Nikki.", 
                "id": "CrazyJealousGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Broken Bird: Tiffany. Pat practically mentions this trope by name when he's describing her.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [], 
                "role": "Widow Woman: Tiffany.", 
                "id": "WidowWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in Black: Tiffany most of the time.", 
                "id": "WomanInBlack"
            }
        ]
    }, 
    "imdbid": "tt1045658", 
    "poster_url": "SilverLiningsPlaybook.jpg", 
    "similar": [
        {
            "shared": [
                "WomanInBlack", 
                "BrokenBird"
            ], 
            "shared_count": 2, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "Super", 
            "name": "Super", 
            "poster_url": "Super.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "ThePiano", 
            "name": "The Piano", 
            "poster_url": "ThePiano.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "TwinPeaksFireWalkWithMe", 
            "name": "Twin Peaks: Fire, Walk with Me", 
            "poster_url": "TwinPeaksFireWalkWithMe.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "CrazyJealousGuy"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }
    ], 
    "id": "SilverLiningsPlaybook", 
    "name": "Silver Linings Playbook"
}