{
    "plot": "Four tales of crime adapted from Frank Miller's popular comics, focusing around a muscular brute who's looking for the person responsible for the death of his beloved Goldie, a man fed up with Sin City's corrupt law enforcement who takes the law into his own hands after a horrible mistake, a cop who risks his life to protect a girl from a deformed pedophile, and a hitman looking to make a little cash.", 
    "genres": "Crime, Thriller", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "11-year-old"
                ], 
                "role": "That Yellow Bastard gives us the page quote for this trope. Police Detective John Hartigan saved 11-year-old Nancy Callahan from being raped and murdered by Roark, Jr., then was framed for the rape and spent eight years in prison. After Hartigan is released, Roark gets a hold of Nancy again and tortures her. Hartigan doesn't take it well.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [], 
                "role": "Battle Butler: Manute.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [], 
                "role": "Crazy Jealous Guy: Jackie Boy", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "well-read", 
                    "intelligent"
                ], 
                "role": "Dwight and Wallace from Sin City are both very well-read and enjoy the arts. A villain example would be Manute who speaks well and is obviously quite intelligent.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "likely", 
                    "former", 
                    "willing", 
                    "real", 
                    "one-shot"
                ], 
                "role": "Dirty Coward: The Yellow Bastard both before and after his transformation is more likely to run away from a fight than stay. Hartigan's former partner Bob is also quite cowardly since he is more willing to turn on his partner and threaten a child than he is about catching the real Big Bad. Shlubb and Klump can be pretty cowardly. Especially in the presence of Dwight since he beat up both of them throughout the one-shot The Babe Wore Red.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "light"
                ], 
                "role": "Jerk Jock: The story Just Another Saturday Night has a group of jerk jocks from a fraternity. This being Sin City, they don't stop at just being jerks, though. They like to light homeless people on fire.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "athletic", 
                    "messy", 
                    "only"
                ], 
                "role": "Sort of applies to Roark Junior/Yellow Bastard from the Sin City story \"That Yellow Bastard,\" who, while not particularly athletic, certainly believed he had the right to rape anybody he felt like, and was protected by his U.S. Senator daddy. \"I can do whatever I want, whenever I want, however I want it!\" A particularly messy death really was the only way to deal with him, as getting shot in the groin by the Anti-Hero didn't make him change his ways one iota.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [], 
                "role": "Knight in Shining Armor: The Salesman approaches a women outside of a party and tells here that he has come to help her face her troubles, and that he loves her. Then he subverts it. He was never there to be her shining knight; she hired him to kill her in a delicate fashion because a mob figure threatened to brutally murder her after she broke up with him.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [
                    "whole", 
                    "polite", 
                    "stoic", 
                    "One-Man"
                ], 
                "role": "Wallace from Sin City has the whole look, combined with a very calm, polite, stoic demeanor. He would be a Hippie Jesus if he wasn't a One-Man Army.", 
                "id": "LooksLikeJesus"
            }, 
            {
                "adjectives": [
                    "male", 
                    "due", 
                    "male"
                ], 
                "role": "Mr. Fanservice: While the series is known for its alluring female characters, almost every male protagonist has a nude scene and there are plenty of shirtless scenes as well. Not to be outdone, while the movie avoids Male Frontal Nudity due to Double Standards in the movie industry, the male leads are played by the likes of Bruce Willis and Clive Owen.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "main", 
                    "long", 
                    "entire", 
                    "single", 
                    "ex-boyfriend", 
                    "long"
                ], 
                "role": "In the Sin City story The Big Fat Kill, the main character Dwight starts the story in the buff since he's over at his girlfriend's house where they are post-coital. Her ex-boyfriend comes over to start trouble and he has enough time to pull on a pair of pants and throw on his long coat but does not wear a shirt under it Since the entire story takes place over the course of a single night, he has this look throughout the miniseries.\n The film version averts this since he starts the story wearing a pair of pants so he has less clothes to put on when Shelly's ex-boyfriend pops in. He ends up wearing a shirt under his long coat.", 
                "id": "NoShirtLongJacket"
            }, 
            {
                "adjectives": [], 
                "role": "No Shirt, Long Jacket: Dwight in Big Fat Kill.", 
                "id": "NoShirtLongJacket"
            }, 
            {
                "adjectives": [
                    "crime/political"
                ], 
                "role": "Sin City gives us the Yellow Bastard, the heir to the Roark crime/political family, who is appropriately enough named Junior.", 
                "id": "OverlordJr"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Black Man: Manute.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "The men in Sin City once sent a priest to Claudia's hen night. The women mistook him for a stripper.", 
                "id": "SexyPriest"
            }, 
            {
                "adjectives": [], 
                "role": "Yellow Bastard from Sin City was a Spoiled Brat with a dose of Dirty Coward.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "sadistic", 
                    "powerful", 
                    "evil", 
                    "carte"
                ], 
                "role": "The Yellow Bastard from Sin City fits this trope and then some. As the son of a sadistic United States Senator and heir to the most powerful (and evil) family in Basin City, Roark Junior has carte blanche to do whatever the hell he feels like with impunity — including preying on children.", 
                "id": "TheEvilPrince"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "other", 
                    "such"
                ], 
                "role": "Ava Lord from Sin City turns out to be one, though she's not above having other people do her dirty work (such as Dwight McCarthy, who she tricks into murdering her innocent husband so that she can get her hands on all his money).", 
                "id": "BlackWidow"
            }, 
            {
                "adjectives": [], 
                "role": "Miho often acts as a bodyguard to Dwight in Sin City.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [], 
                "role": "Daddy's Girl: In the appropriately titled, Daddy's Little Girl.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "obvious"
                ], 
                "role": "The Sin City short story \"Daddy's Little Girl\" takes this to the obvious extreme.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Ava Lord from the Sin City story \"A Dame to Kill For\".", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [], 
                "role": "Sin City: Silent Night has an inversion. Marv goes undercover as a \"customer\" in order to infiltrate a sex ring and rescue a little girl.", 
                "id": "DirtyHarriet"
            }, 
            {
                "adjectives": [
                    "Disposable", 
                    "other", 
                    "due"
                ], 
                "role": "Disposable Sex Worker: Somewhat averted. Goldie's death in The Hard Goodbye is used to set the plot in motion, but she is portrayed posthumously as a person of value, especially to Marv and her sister. In other stories, the prostitutes of Old Town tend to avoid getting offed by psychos due to their firepower.", 
                "id": "DisposableSexWorker"
            }, 
            {
                "adjectives": [
                    "first", 
                    "entire", 
                    "large"
                ], 
                "role": "Played straight and subverted by the first Sin City story \"The Hard Goodbye,\" in which the death of a prostitute in the opening pages kicks off the plot. It turns out that the killers targeted prostitutes because nobody cared about them, but Marv decides to bring down the entire operation to avenge the murdered call girl who showed him a little kindness.\n The rest of the series mainly averts this. The girls of Old Town can typically take care of themselves often carry very large firearms. It's also implied the cops don't investigate cases where the victim was a prostitute, precisely because they know the girls of Old Town will do it instead. In fact, the cops generally won't even go into Old Town; they've ceded the area to the girls, who police it quite ably themselves.", 
                "id": "DisposableSexWorker"
            }, 
            {
                "adjectives": [], 
                "role": "Goldie in Sin City: The Hard Goodbye exists to be murdered and start Marv's Roaring Rampage of Revenge.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Miho combines this with The Voiceless.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "due", 
                    "noirish", 
                    "female", 
                    "forth", 
                    "triumphant"
                ], 
                "role": "Not surprisingly, due to its noirish roots, Sin City has quite a few. Almost every female character counts, and Dwight is the one that gets in trouble with them as they tend to go back and forth between Damsel in Distress and The Vamp. The most triumphant example from the series is in The Babe Wore Red. Dwight said it best:", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [], 
                "role": "Both Shellie and Gail have performed this role for Dwight McCarthy in Sin City. Gail does get her hands dirty from time to time, though.", 
                "id": "GirlFriday"
            }, 
            {
                "adjectives": [
                    "sassy"
                ], 
                "role": "Shellie from Sin City is sassy but meek enough to qualify.", 
                "id": "GirlNextDoor"
            }, 
            {
                "adjectives": [
                    "standard", 
                    "large", 
                    "evil"
                ], 
                "role": "Maxine in Sin City is your standard Sin City woman with large breasts and is an evil scientist working for an assassin's guild to boot.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "eponymous", 
                    "red"
                ], 
                "role": "Lady in Red: Goldie And the eponymous 'Babe' from The Babe Wore Red The girl from The Customer is Always Right sequence in the movie (the opening sequence) wears a red dress, though it was not red in the comics.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [], 
                "role": "Lucille from Sin City.", 
                "id": "LipstickLesbian"
            }, 
            {
                "adjectives": [
                    "comparable"
                ], 
                "role": "Sin City started out by playing this straight, but with each book the women got less and less curvy. All, that is, but for Nancy, who was comparable to Jessica Rabbit in every appearence she had. And how.", 
                "id": "MostCommonSuperpower"
            }, 
            {
                "adjectives": [
                    "much", 
                    "violent"
                ], 
                "role": "Miho in Sin City is a much more violent version of this trope.", 
                "id": "MysteriousWaif"
            }, 
            {
                "adjectives": [
                    "perky", 
                    "fashionable"
                ], 
                "role": "Mariah is the Colonel's perky assassin in Sin City that is both fashionable and a Deadpan Snarker.", 
                "id": "PerkyFemaleMinion"
            }, 
            {
                "adjectives": [
                    "manipulative", 
                    "criminal"
                ], 
                "role": "Ava Lord of Sin City takes this Up to Eleven and turns out to be  manipulative and pure evil as well. She ends up tricking Dwight into killing her husband so she can not only get his estate but his criminal organization as well.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "Many", 
                    "comic", 
                    "standard"
                ], 
                "role": "Many of them paraded through Old Town in Sin City looking like dominatrices and acting the part when messed with. The comic version depicted standard streetwalkers outside of the neighborhood as well.", 
                "id": "Streetwalker"
            }, 
            {
                "adjectives": [
                    "skin-tight", 
                    "genetic", 
                    "female"
                ], 
                "role": "Sin City has an organization for assassins called The Guild. There are three women who fit this mold: Mariah, Blue Eyes, and Maxine.\n Mariah wears skin-tight outfits and seems to enjoy torture. She seduces a teenage boy in one part of the story and, in the climax, threatens to make the hero star in a Snuff Film.\n Blue Eyes is a seductress that uses her sexuality to lure her targets in and kill them (she seems to be at least somewhat caring, though.)\n Maxine also wears skintight outfits and enjoys performing genetic surgery and drug experiments on victims captured by The Guild. She also keeps her female hostage in the nude for some reason.", 
                "id": "TheBaroness"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "own", 
                    "greedy", 
                    "old", 
                    "first", 
                    "Lampshaded-slash-deconstructed", 
                    "evil", 
                    "late"
                ], 
                "role": "Ava Lord from the Sin City story \"A Dame to Kill For\" was an evil (by her own admission) and greedy seductress who manipulated her old lover, Dwight McCarthy, through a Wounded Gazelle Gambit into murdering her husband so she could get her hands on all his money, and then tried to kill him once he had outlived his usefulness to her. As Manute, her Dragon (who would later show up in \"The Big Fat Kill\"), explains, Dwight is not the first man she has destroyed with her deadly wiles. Lampshaded-slash-deconstructed in her admission, as she points out that \"evil ruthless seductress\" is so cliche nobody believes she can be one...until it's too late.", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [
                    "much"
                ], 
                "role": "The Vamp: Ava Lord. Very much Ava Lord. Also, Blue Eyes, Mariah, and \"Daddy's Little Girl\" to a lesser degrees.", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Wendy and Goldie.", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt0401792", 
    "poster_url": "SinCity.jpg", 
    "similar": [
        {
            "shared": [
                "CulturedBadass", 
                "CrazyJealousGuy", 
                "DaddysGirl", 
                "NoShirtLongJacket", 
                "SissyVillain", 
                "DirtyCoward", 
                "OverlordJr", 
                "TheVamp", 
                "BodyguardBabes", 
                "TheBaroness"
            ], 
            "shared_count": 10, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "BattleButler", 
                "JerkJock", 
                "KnightInShiningArmor", 
                "TheBaroness", 
                "SissyVillain", 
                "DirtyCoward", 
                "HotScientist"
            ], 
            "shared_count": 8, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "BattleButler", 
                "FemmeFatale", 
                "TheBaroness", 
                "PerkyFemaleMinion", 
                "DecoyDamsel", 
                "BodyguardBabes", 
                "MrFanservice"
            ], 
            "shared_count": 7, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "DirtyHarriet", 
                "JerkJock", 
                "FemmeFatale", 
                "TheBaroness", 
                "DisposableWoman", 
                "EmotionlessGirl", 
                "HotScientist"
            ], 
            "shared_count": 7, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "FemmeFatale", 
                "TheBaroness", 
                "MrFanservice", 
                "DirtyCoward", 
                "HotScientist"
            ], 
            "shared_count": 6, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }
    ], 
    "id": "SinCity", 
    "name": "Sin City"
}