{
    "plot": "1927 Hollywood. Monumental Pictures' biggest stars, glamorous on-screen couple Lina Lamont and Don Lockwood, are also an off-screen couple if the trade papers and gossip columns are to be believed. Both perpetuate the public perception if only to please their adoring fans and bring people into the movie theaters. In reality, Don barely tolerates her, while Lina, despite thinking Don beneath her, simplemindedly believes what she sees on screen in order to bolster her own stardom and sense of self-importance. R.F. Simpson, Monumental's head, dismisses what he thinks is a flash in the pan: talking pictures. It isn't until The Jazz Singer (1927) becomes a bona fide hit which results in all the movie theaters installing sound equipment that R.F. knows Monumental, most specifically in the form of Don and Lina, have to jump on the talking picture bandwagon, despite no one at the studio knowing anything about the technology. Musician Cosmo Brown, Don's best friend, gets hired as Monumental's ideas man and musical director. And by this time, Don has secretly started dating Kathy Selden, a chorus girl who is trying to make in big in pictures herself. Don and Kathy's relationship is despite their less than friendly initial meeting. Cosmo and Kathy help Don, who had worked his way up through the movie ranks to stardom, try make the leap to talking picture stardom, with Kathy following along the way. However, they have to overcome the technological issues. But the bigger problem is Lina, who will do anything to ensure she also makes the successful leap into talking pictures, despite her own inabilities and at anyone and everyone else's expense if they get in her way, especially Kathy as Don's off screen girlfriend and possibly his new talking picture leading lady.", 
    "genres": "Comedy, Musical, Romance", 
    "release_year": "1952", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "original"
                ], 
                "role": "Dastardly Whiplash: The villain of the original cut of The Dueling Cavalier. \"Pierre is miles away, you wench!\"", 
                "id": "DastardlyWhiplash"
            }, 
            {
                "adjectives": [], 
                "role": "Ladykiller in Love: Don.", 
                "id": "LadyKillerInLove"
            }, 
            {
                "adjectives": [], 
                "role": "The Charmer: Cosmo at the party.", 
                "id": "TheCharmer"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "adorable", 
                    "short"
                ], 
                "role": "A nameless and utterly adorable Singin' in the Rain fan, in the short Moses.", 
                "id": "CuteGhostGirl"
            }, 
            {
                "adjectives": [
                    "shiny"
                ], 
                "role": "In Singin' in the Rain's \"Broadway Melody\" sequence, Cyd Charisse's character regularly flirts with the hapless lead male, only to be swayed back to her thug boyfriend by some shiny piece of jewelry he dangles in front of her.", 
                "id": "DistractedByTheLuxury"
            }, 
            {
                "adjectives": [
                    "overenthusiastic"
                ], 
                "role": "Fangirl: A crowd of them rip apart Don's clothing at the beginning of the movie. The fans at the red carpet are also hilariously overenthusiastic.", 
                "id": "Fangirl"
            }, 
            {
                "adjectives": [
                    "notable"
                ], 
                "role": "Most of the women in Singin' in the Rain, with the notable exception of Lina.", 
                "id": "TheFlapper"
            }, 
            {
                "adjectives": [], 
                "role": "Singin' in the Rain", 
                "id": "TheFlapper"
            }, 
            {
                "adjectives": [
                    "green", 
                    "white", 
                    "virginal", 
                    "ballet-dancing"
                ], 
                "role": "Woman in White: Cyd Charrise's dancer swaps her green cocktail dress for a white gown in the casino (\"Broadway Melody\"). Don's character enters a dream sequence where he imagines her a virginal, ballet-dancing beauty.... But she hasn't really changed.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0045152", 
    "poster_url": "SinginInTheRain.jpg", 
    "similar": [
        {
            "shared": [
                "LadyKillerInLove", 
                "TheCharmer"
            ], 
            "shared_count": 2, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "TheCharmer", 
                "WomanInWhite"
            ], 
            "shared_count": 2, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "LadyKillerInLove", 
                "TheCharmer"
            ], 
            "shared_count": 2, 
            "id": "TheATeam", 
            "name": "The A-Team", 
            "poster_url": "TheATeam.jpg"
        }, 
        {
            "shared": [
                "LadyKillerInLove", 
                "TheCharmer"
            ], 
            "shared_count": 2, 
            "id": "MansfieldPark", 
            "name": "Mansfield Park", 
            "poster_url": "MansfieldPark.jpg"
        }, 
        {
            "shared": [
                "TheCharmer", 
                "WomanInWhite"
            ], 
            "shared_count": 2, 
            "id": "Rebecca", 
            "name": "Rebecca", 
            "poster_url": "Rebecca.jpg"
        }
    ], 
    "id": "SinginInTheRain", 
    "name": "Singin' in the Rain"
}