{
    "plot": "In 1939, an intrepid reporter in New York City makes a connection between the story she's covering-- of famous scientists suddenly disappearing around the world, and a recent attack on the city by giant robots. Determined to find the solution to these happenings, she seeks the help of her ex-boyfriend, the captain of a mercenary legion of pilots. The two are investigating the case when the robots attack the city again, though in a stroke of luck, Sky Captain's right hand man is able to locate their source. They then set off on an adventure in search of the evil mastermind behind these schemes, who is bent on creating a utopia and destroying the current world.", 
    "genres": "Action, Adventure, Mystery", 
    "release_year": "2004", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Commander Francesca \"Franky\" Cook of the Royal Navy, who sports an Eyepatch of Power. She is also part of a Love Triangle in the movie. There's also the Mysterious Woman, a silent but deadly woman who controls Totenkopf's machines and turns out to be a Robot Girl.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "all-girl"
                ], 
                "role": "Frankie (deliciously played by Angelina Jolie) in Sky Captain and the World of Tomorrow... oh, and her all-girl squadron, too!!", 
                "id": "BikerBabe"
            }, 
            {
                "adjectives": [
                    "Used", 
                    "first", 
                    "other"
                ], 
                "role": "Used in the first shot of the love interest in Sky Captain and the World of Tomorrow. (On the other hand, much of the film seems to be shot like this...)", 
                "id": "GaussianGirl"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scoop: Polly.", 
                "id": "HotScoop"
            }, 
            {
                "adjectives": [], 
                "role": "There's also the Mysterious Woman, a silent but deadly woman who controls Totenkopf's machines and turns out to be a Robot Girl.", 
                "id": "MysteriousWoman"
            }
        ]
    }, 
    "imdbid": "tt0346156", 
    "poster_url": "SkyCaptainAndTheWorldOfTomorrow.jpg", 
    "similar": [
        {
            "shared": [
                "GaussianGirl", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheMaskOfZorro", 
            "name": "The Mask of Zorro", 
            "poster_url": "TheMaskOfZorro.jpg"
        }, 
        {
            "shared": [
                "GaussianGirl", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "BikerBabe"
            ], 
            "shared_count": 2, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "GaussianGirl", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheLordOfTheRings", 
            "name": "The Lord of the Rings", 
            "poster_url": "TheLordOfTheRings.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "HotScoop"
            ], 
            "shared_count": 2, 
            "id": "HighStakes", 
            "name": "High Stakes", 
            "poster_url": "HighStakes.jpg"
        }
    ], 
    "id": "SkyCaptainAndTheWorldOfTomorrow", 
    "name": "Sky Captain and the World of Tomorrow"
}