{
    "plot": "When Bond's latest assignment goes gravely wrong and agents around the world are exposed, MI6 is attacked forcing M to relocate the agency. These events cause her authority and position to be challenged by Gareth Mallory (Ralph Fiennes), the new Chairman of the Intelligence and Security Committee. With MI6 now compromised from both inside and out, M is left with one ally she can trust: Bond. 007 takes to the shadows - aided only by field agent, Eve (Naomie Harris) - following a trail to the mysterious Silva (Javier Bardem), whose lethal and hidden motives have yet to reveal themselves.", 
    "genres": "Action, Adventure", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Beard: Bond sports one that's just out of Perma Stubble through part of the film.", 
                "id": "BadAssBeard"
            }, 
            {
                "adjectives": [
                    "double-barreled"
                ], 
                "role": "Badass Grandpa: Kincade, an Old Retainer who takes out a number of Silva's mooks with a double-barreled shotgun.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "prolonged"
                ], 
                "role": "Beard of Sorrow: Bond grew a Badass Beard during a prolonged Heroic BSOD.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [], 
                "role": "In Skyfall, Bond gets one when he goes MIA after M gives the order to leave Bond to die.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "like", 
                    "major"
                ], 
                "role": "Cool Old Guy: Kincade, who is kind of like Alfred Pennyworth, but packing major heat.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "spectacular", 
                    "typical", 
                    "first"
                ], 
                "role": "Skyfall features an oddly lisping and bleach blonde Silva menacingly rubbing Bond's thighs. The most spectacular part of this scene, however, is Bond's reaction. With typical unruffled Bond demeanour, he says, \"What makes you think this is my first time?\"", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "psychological"
                ], 
                "role": "Gay Bravado: Silva and Bond (maybe). Bond isn't impressed, so Silva goes for something more...psychological.", 
                "id": "GayBravado"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed", 
                    "recent"
                ], 
                "role": "Sharp-Dressed Man: Reflecting Bond's Character Development and adjustment into being 007 over the recent films, he seems to be getting into doing his job in nice suits.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "several"
                ], 
                "role": "Shirtless Scene: Bond has several.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [], 
                "role": "Raoul Silva (as played by Javier Bardem), the antagonist of Skyfall. He even actively fuels the Foe Yay between him and 007.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Sissy Villain: Silva.", 
                "id": "SissyVillain"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: MI6 field agent Eve. Bonus points for her being  Miss Moneypenny.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "ex-Sex", 
                    "pleasant"
                ], 
                "role": "Broken Bird: Severine, an ex-Sex Slave controlled by Big Bad Silva. Her smile as Bond gets under her veneer is not pleasant.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "booby", 
                    "own", 
                    "lousy", 
                    "booby-trapping"
                ], 
                "role": "Cool Old Lady: M gets in on the action, firing guns and wiring up the chandelier in Skyfall into a booby trap for Silva. By her own admission, she's \"a lousy shot\", but hey, booby-trapping the chandelier was pretty awesome by itself.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "Disposable", 
                    "half-dozen", 
                    "disposable"
                ], 
                "role": "Disposable Woman: Severine appears for all of a half-dozen scenes before Silva shoots her in the head. This shows how disposable Silva considers everyone and everything, a dark mirror to M's pragmatism.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "'That", 
                    "good"
                ], 
                "role": "Not really. In Skyfall when Silva kills Severine, Bond doesn't seem to care. His only response is 'That was a waste of perfectly good scotch'. And he slept with her.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "Sévérine", 
                    "Asian", 
                    "terrified", 
                    "non-combatant", 
                    "former"
                ], 
                "role": "Depressingly subverted in Skyfall with Sévérine, the lover of the Big Bad who looks like an Asian version of The Baroness (to the point where her actress drew inspiration from Xenia Onatopp), but is actually a terrified non-combatant former Sex Slave who tries to Heel-Face Turn to get away from Silva and  ends up with a bullet hole in the face for her trouble.", 
                "id": "DragonLady"
            }, 
            {
                "adjectives": [
                    "third", 
                    "dead", 
                    "new", 
                    "ambiguous"
                ], 
                "role": "Girl of the Week: Eve, Severine and an unnamed third girl in the Bahamas. By the end of the film, Severine is dead, and Eve Moneypenny becomes the new M's secretary. Bond and Eve may or may not have slept together; it's ambiguous.", 
                "id": "GirlOfTheWeek"
            }, 
            {
                "adjectives": [], 
                "role": "Iron Lady: M.", 
                "id": "IronLady"
            }
        ]
    }, 
    "imdbid": "tt1074638", 
    "poster_url": "Skyfall.jpg", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa", 
                "BadAssBeard", 
                "CoolOldGuy", 
                "SharpDressedMan", 
                "ShirtlessScene", 
                "BrokenBird", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "BadAssBeard", 
                "DragonLady", 
                "CoolOldGuy", 
                "CoolOldLady", 
                "SissyVillain", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "IronLady", 
                "SissyVillain", 
                "CoolOldLady", 
                "CoolOldGuy"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "CoolOldLady", 
                "ActionGirl", 
                "CoolOldGuy"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "BadassGrandpa", 
                "BrokenBird", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "XMenDaysOfFuturePast", 
            "name": "X-Men: Days of Future Past", 
            "poster_url": "XMenDaysOfFuturePast.jpg"
        }
    ], 
    "id": "Skyfall", 
    "name": "Skyfall"
}