{
    "plot": "Located in the US Rust Belt, Charlestown is home of the hapless Chiefs, a losing Federal League hockey team whose games are poorly attended. To make money, the team's unknown owner makes its manager, Joe McGrath, do cheesy publicity much to the players' chagrin. Rumors abound among the players that if the local mill closes, the team will fold. Just before the official announcement is made, the team's aging player/coach, Reggie Dunlop, does get wind that the mill is indeed closing and that this season will be the team's last. Beyond efforts to reconcile with his wife Francine, who loves Reggie but doesn't love his career, Reggie begins to focus on how to renew interest in the team for a possible sale as he knows if the team folds, his hockey career is over. Without telling anyone of his plan, he begins a rumor that the owner is negotiating a sale with a city in Florida. He also decides that \"goon\" hockey - most especially using the untapped talents of the recently acquired childlike but quietly menacing Hanson brothers - is the way to renew local interest. It works as the team begins to attract new fans, sell out games, sell out away games attended largely by their groupies, and win, which does fuel the rumor of a sale. The one team member who doesn't like this new style is Ned Braden, a college graduate who plays the game solely because he loves it. His hockey career is against the wishes of his tomboyish wife, Lily, who hates everything about Charlestown and being a hockey wife. Reggie's goal of winning the league championship and having the team sold takes a turn when he finally meets the team's owner and discovers the owner's motivations. Ned, with his own views of what is right and wrong in hockey, may come up with an unexpected way to achieve all their goals.", 
    "genres": "Comedy, Drama, Sport", 
    "release_year": "1977", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "single", 
                    "single"
                ], 
                "role": "Moe from Slap Shot. Every single thing he says has to do with sex and he has pictures from nudie mags taped to his locker. Yet he is never seen with a single woman at any point in the film. The weird goalie with a thick Quebec accent does better than Moe.", 
                "id": "CasanovaWannabe"
            }
        ]
    }, 
    "imdbid": "tt0076723", 
    "poster_url": "SlapShot.jpg", 
    "similar": [
        {
            "shared": [
                "CasanovaWannabe"
            ], 
            "shared_count": 1, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }, 
        {
            "shared": [
                "CasanovaWannabe"
            ], 
            "shared_count": 1, 
            "id": "StarWreck", 
            "name": "Star Wreck"
        }, 
        {
            "shared": [
                "CasanovaWannabe"
            ], 
            "shared_count": 1, 
            "id": "JohnDiesAtTheEnd", 
            "name": "John Dies at the End", 
            "poster_url": "JohnDiesAtTheEnd.jpg"
        }, 
        {
            "shared": [
                "CasanovaWannabe"
            ], 
            "shared_count": 1, 
            "id": "HallPass", 
            "name": "Hall Pass", 
            "poster_url": "HallPass.jpg"
        }, 
        {
            "shared": [
                "CasanovaWannabe"
            ], 
            "shared_count": 1, 
            "id": "Shame", 
            "name": "Shame", 
            "poster_url": "Shame.jpg"
        }
    ], 
    "id": "SlapShot", 
    "name": "Slap Shot"
}