{
    "plot": "Using his own terminology, Billy Pilgrim is \"unstuck in time\", which means he is moving between different points in his life uncontrollably, although he is aware of it at certain of those points as witnessed by the letter to the editor he writes to the Ilium Daily News about his situation. Primarily, he is moving between three general time periods and locations. The first is his stint as a GI during WWII, when, as a pacifist, he was acting as assistant chaplain for his squad. This time is largely as a POW, where he was in Dresden the day of the bombing, spending it with among others an older compassionate GI named Edgar Derby, and a brash loudmouth GI named Paul Lazzaro. The second is his life as an optometrist in Ilium in upstate New York, eventually married to the wealthy and overbearing Valencia Merble, and having two offspring, Robert, who would spend his teenaged years as a semi-delinquent, and Barbara, who would end up much like her mother. And the third is as an abductee on the planet Tralfamadore, along with his devoted dog Spot, and Hollywood starlet Montana Wildhack - who was not averse to taking off her clothes to further her career - the Tralfamadorians who have put them on display. The more time he spends on Tralfamadore, the more he understands the meaning of what is happening to him.", 
    "genres": "Comedy, Drama, Fantasy", 
    "release_year": "1972", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "O'Hare", 
                    "young", 
                    "literal", 
                    "old", 
                    "old"
                ], 
                "role": "Child Soldiers: Mrs. O'Hare more or less considers young enlisted men to be this. We get to see more literal examples from the Germans who have a 12 year old scout and a 16 year old prison guard. The Children's Crusade is also discussed at one point.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "Quintessential", 
                    "British", 
                    "British"
                ], 
                "role": "Quintessential British Gentleman: The British prisoners are so friendly, even the German guards like them.", 
                "id": "QuintessentialBritishGentleman"
            }
        ]
    }, 
    "imdbid": "tt0069280", 
    "poster_url": "SlaughterhouseFive.jpg", 
    "similar": [
        {
            "shared": [
                "QuintessentialBritishGentleman"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "ChildSoldiers"
            ], 
            "shared_count": 1, 
            "id": "Downfall", 
            "name": "Downfall"
        }, 
        {
            "shared": [
                "ChildSoldiers"
            ], 
            "shared_count": 1, 
            "id": "TheStraightStory", 
            "name": "The Straight Story", 
            "poster_url": "TheStraightStory.jpg"
        }, 
        {
            "shared": [
                "ChildSoldiers"
            ], 
            "shared_count": 1, 
            "id": "Soldier", 
            "name": "Soldier", 
            "poster_url": "Soldier.jpg"
        }, 
        {
            "shared": [
                "QuintessentialBritishGentleman"
            ], 
            "shared_count": 1, 
            "id": "BottleShock", 
            "name": "Bottle Shock", 
            "poster_url": "BottleShock.jpg"
        }
    ], 
    "id": "SlaughterhouseFive", 
    "name": "Slaughterhouse-Five"
}