{
    "plot": "After his wife Maggie passes away, Sam Baldwin and his 8-year-old son Jonah relocate from Chicago to Seattle to escape the grief associated with Maggie's death. Eighteen months later Sam is still grieving and can't sleep. Although Jonah misses his mother, he wants his father to get a new wife despite Sam having not even contemplated dating again. On Christmas Eve, Sam (on Jonah's initiative) ends up pouring his heart out on a national radio talk show about his magical and perfect marriage to Maggie, and how much he still misses her. Among the many women who hear Sam's story and fall in love with him solely because of it is Annie Reed, a Baltimore-based newspaper writer. Annie's infatuation with Sam's story and by association Sam himself is despite being already engaged. But Annie's relationship with her straight-laced fiancé Walter is unlike her dream love life in the movie An Affair to Remember (1957). She even writes to Sam proposing they meet atop the Empire State Building on Valentine's Day. Back in Seattle, Sam has received hundreds of letters from women wanting to meet him. Jonah is excited by one letter in particular from Baltimore and will do whatever he needs to to get his father and Annie together. However, old fashioned Sam wants his future love life to be based on meeting a woman the traditional way and he, in turn, becomes infatuated with an unknown woman he spots a few times in Seattle. Will magic happen twice in Sam's life, and if so will it be with this unknown woman or Annie?", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1993", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Missing Mom", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "new", 
                    "new"
                ], 
                "role": "Sleepless In Seattle: Jonah's mother died more or less recently, which prompts him to find his dad a new wife and himself a new mother.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0108160", 
    "poster_url": "SleeplessInSeattle.jpg", 
    "similar": [
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "IndependenceDay", 
            "name": "Independence Day", 
            "poster_url": "IndependenceDay.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Epic", 
            "name": "Epic"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "StarTrekInsurrection", 
            "name": "Star Trek: Insurrection", 
            "poster_url": "StarTrekInsurrection.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "SleeplessInSeattle", 
    "name": "Sleepless In Seattle"
}