{
    "plot": "A partially handicapped man named Karl is released from a mental hospital, about 20 years after murdering his mother and another person. Karl is often questioned if he will ever kill again, and he shrugs in response saying there is no reason to. Now out of the mental institution, Karl settles in his old, small hometown, occupying himself by fixing motors. After meeting a young boy named Frank, who befriends him, Karl is invited to stay at Frank's house with his mother Linda, who views Karl as a strange but kind and generous man. However, Linda's abusive boyfriend, Doyle, sees things differently in the way rules ought to be run- normally insulting Linda's homosexual friend Vaughan as well as Karl's disabilities, and having wild parties with his friends. As Karl's relationship with Frank grows, he is watchful of Doyle's cruel actions.", 
    "genres": "Drama", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "late"
                ], 
                "role": "Straight Gay: Vaughan, played by the late John Ritter, who once played a man acting like he was gay. Averted with Albert Sellers, who despite having only a couple of lines, surely shows his personality.", 
                "id": "StraightGay"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Mama Bear: Linda. Unfortunately, Doyle's sheer meanness and stubbornness prevents her protectiveness from working very well.", 
                "id": "MamaBear"
            }
        ]
    }, 
    "imdbid": "tt0117666", 
    "poster_url": "SlingBlade.jpg", 
    "similar": [
        {
            "shared": [
                "StraightGay", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "TheLincolnLawyer", 
            "name": "The Lincoln Lawyer", 
            "poster_url": "TheLincolnLawyer.jpg"
        }, 
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "SweetHome", 
            "name": "Sweet Home"
        }, 
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "SouthParkBiggerLongerAndUncut", 
            "name": "South Park: Bigger, Longer & Uncut", 
            "poster_url": "SouthParkBiggerLongerAndUncut.jpg"
        }, 
        {
            "shared": [
                "MamaBear"
            ], 
            "shared_count": 1, 
            "id": "PokemonZoroarkMasterOfIllusions", 
            "name": "Pokémon: Zoroark: Master of Illusions"
        }
    ], 
    "id": "SlingBlade", 
    "name": "Sling Blade"
}