{
    "plot": "15-year-old Alan Abernathy, the son of a toy store owner, tries out some new action figures: The Commando Elite vs. The Gorgonites. But three months ago, a toy company believes it is onto something when it employs the latest government military technology in a series of action figures, enabling them to talk. They underestimate the power of the special micro chips they've employed, however, as the two opposing sides of the toy line start thinking for themselves and engaging in real combat! The Commando Elite vow to wipe out the Gorgonites in a suburban neighborhood. Alan, his neighbor Christy Fimple, (on whom he has a massive crush) with the help of the kind Gorgonites, must protect his home and family from the Commandos.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "final"
                ], 
                "role": "Armoured Closet Toy: Chip Hazard clearly knows how he works, but loudly proclaims that \"Everything else is just a toy\" and completely rejects Archer's Not So Different speech in the final act.", 
                "id": "ArmouredClosetGay"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "moped"
                ], 
                "role": "A variation with a moped rather than a car in Small Soldiers. Christy drives herself and Alan (and Archer in his backpack) away with the Commandos chasing after them. After they've been dispatched, Alan and Archer invoke the trope.", 
                "id": "WomenDrivers"
            }
        ]
    }, 
    "imdbid": "tt0122718", 
    "poster_url": "SmallSoldiers.jpg", 
    "similar": [
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "FourLions", 
            "name": "Four Lions", 
            "poster_url": "FourLions.jpg"
        }, 
        {
            "shared": [
                "WomenDrivers"
            ], 
            "shared_count": 1, 
            "id": "Popeye", 
            "name": "Popeye", 
            "poster_url": "Popeye.jpg"
        }, 
        {
            "shared": [
                "WomenDrivers"
            ], 
            "shared_count": 1, 
            "id": "QueenOfOuterSpace", 
            "name": "Queen Of Outer Space", 
            "poster_url": "QueenOfOuterSpace.jpg"
        }, 
        {
            "shared": [
                "WomenDrivers"
            ], 
            "shared_count": 1, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }, 
        {
            "shared": [
                "ArmouredClosetGay"
            ], 
            "shared_count": 1, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }
    ], 
    "id": "SmallSoldiers", 
    "name": "Small Soldiers"
}