{
    "plot": "The first, and by far most memorable full-length animated feature from the Disney Studios, \"Snow White and the Seven Dwarfs\" may have been superseded technically by many of the films that followed it. But its simple story of a charming little princess saved from the evil deeds of her wicked step-mother, the queen, by a group of seven adorable dwarfs made history when it was first released in December, 1937 and has since become an incomparable screen classic.", 
    "genres": "Animation, Family, Fantasy", 
    "release_year": "1937", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "dead", 
                    "spiteful"
                ], 
                "role": "Both Snow White's and Cinderella's fathers are dead, and the two only have their spiteful stepmothers.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Grumpy in Snow White and the Seven Dwarfs. He begrudges having Snow stay in the Dwarves' home and teases the others for giving in to her charms so easily. He softens up eventually, however, and when word comes that she might be in danger, he's the one who leads the charge.", 
                "id": "HeManWomanHater"
            }, 
            {
                "adjectives": [
                    "He-Man"
                ], 
                "role": "He-Man Woman Hater: Grumpy starts out as a misogynist. By the end of the film, he's arguably the one who loves Snow White the most.", 
                "id": "HeManWomanHater"
            }, 
            {
                "adjectives": [
                    "white"
                ], 
                "role": "By the end of Snow White and the Seven Dwarfs The Prince has arrived to take Snow White away on his white horse.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [
                    "white"
                ], 
                "role": "Knight In Shining Armour: By the end of the movie the Prince has arrived to take Snow White away on his white horse.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [], 
                "role": "Men Can't Keep House: And HOW.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [
                    "comic"
                ], 
                "role": "According to two 1940s comic stories, Queen Grimhilde had one of these for a brother.", 
                "id": "TheEvilPrince"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Princess Snow White — Snow White and the Seven Dwarfs (1937)", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Evil Matriarch", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "beautiful"
                ], 
                "role": "The Evil Queen from Snow White and the Seven Dwarfs, who wants to kill Snow White to remain the most beautiful woman in the land.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "God Save Us from the Queen!: Especially if they're all like this one...", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "witch-queen", 
                    "14-year-old", 
                    "other"
                ], 
                "role": "Snow White and the Seven Dwarfs: The unnamed witch-queen note  Traditionally known as Grimhilde, tried to murder a 14-year-old girl for being pretty, among other things.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Witch: The Queen. Unfortunately for her after she drank the potion she has this look no more.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [
                    "magical", 
                    "second", 
                    "Second-best", 
                    "good"
                ], 
                "role": "Queen Grimhilde, the evil stepmother of Snow White, uses magical spells and artifacts to get her way, and according to the Magic Mirror is second only to Snow White in beauty. Second-best isn't good enough for her, though.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [
                    "interested", 
                    "interested"
                ], 
                "role": "Funnily enough, Snow White and the Seven Dwarfs could be said to invert this trope. Pure-hearted Snow White is more interested in men (she spends most of the movie fantasizing of reuniting with her prince) than her stepmother, the Queen, who is more interested in her looks than anything.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [
                    "unclear"
                ], 
                "role": "Snow White is taken care of by her step-mother. It is unclear what happened to her parents.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Princess Classic", 
                "id": "PrincessClassic"
            }, 
            {
                "adjectives": [], 
                "role": "Smitten Teenage Girl: Snow White, obviously.", 
                "id": "SmittenTeenageGirl"
            }, 
            {
                "adjectives": [], 
                "role": "In Snow White and the Seven Dwarfs, Snow White takes up this role after being taken in by the dwarves.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [], 
                "role": "Team Mom: Snow White to the dwarfs; scarcely have they agreed to let her stay than she starts taking charge of the place.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [
                    "'magic", 
                    "white"
                ], 
                "role": "Snow White and the Seven Dwarfs: Snow White accepts a 'magic wishing' apple from an Obviously Evil crone and uses it to wish a prince on a white horse.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "ultimate", 
                    "primary", 
                    "intrinsic", 
                    "powerful", 
                    "paltry", 
                    "mere", 
                    "physical", 
                    "aware", 
                    "painful", 
                    "top", 
                    "evil", 
                    "stole", 
                    "'it", 
                    "due", 
                    "ancient", 
                    "mythological", 
                    "biological", 
                    "step-mother", 
                    "physical", 
                    "magic"
                ], 
                "role": "The ultimate example may be the Wicked Queen from Snow White; moreso in the Disney version, whose character design was reputedly based on Katharine Hepburn. This example also illustrates the primary paradox intrinsic to this trope: Why would an intelligent, powerful woman like the Queen be so crazily obsessed over something as seemingly paltry as mere physical appearance? Sure, vanity might explain part of it, but to go so far as to seek the death of a rival (who is not even aware of her grudge), and undergo a painful transformation to disguise herself so that she could personally carry out a murder plot? Seems a bit over the top, but then again, that's the warping nature of evil for you.\n In an anime adaptation, she wants to steal Snow White's body instead. And it's revealed that she's not actually the Queen, but stole her body instead when she was a child. She (or even 'it') may have spent generations Body Surfing from beauty queen to beauty queen...\n In some of the earliest versions of the tale, the Wicked Queen fears Snow White's maturing beauty because it symbolizes her impending death due to an ancient mythological trope that a person's child is his or her replacement — and she is Snow White's biological mother (not step-mother). So her efforts to kill Snow White are not based on physical vanity, but on a desperate hunger for immortality.\n In Snow White & the Huntsman, Wicked Queen Ravenna is using magic to maintain her youth and beauty, and taking Snow White's heart will allow her to live as a beauty forever. It's never really explained why.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [], 
                "role": "Vain Sorceress: Guess.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [
                    "impressive", 
                    "classic", 
                    "physical", 
                    "whole", 
                    "'hook-nosed"
                ], 
                "role": "In Snow White and the Seven Dwarfs, Queen Grimhilde transforms herself into a very impressive Hag of a witch, including all the classic physical features, in order to pull one over on Snow White. Interestingly she was originally a Vain Sorceress who put on the whole 'hook-nosed woman' look as a disguise.", 
                "id": "WickedWitch"
            }, 
            {
                "adjectives": [], 
                "role": "Wicked Witch: Take a guess...", 
                "id": "WickedWitch"
            }
        ]
    }, 
    "imdbid": "tt0029583", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "VainSorceress", 
                "KnightInShiningArmor", 
                "EvilMatriarch", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "WickedWitch"
            ], 
            "shared_count": 8, 
            "id": "Tangled", 
            "name": "Tangled", 
            "poster_url": "Tangled.png"
        }, 
        {
            "shared": [
                "KnightInShiningArmor", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "WickedWitch", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "KnightInShiningArmor", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EvilMatriarch", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "Cinderella", 
            "name": "Cinderella", 
            "poster_url": "Cinderella.jpg"
        }, 
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "VainSorceress", 
                "EverythingsBetterWithPrincesses", 
                "EvilMatriarch", 
                "HotWitch"
            ], 
            "shared_count": 5, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "SnowWhiteAndTheSevenDwarfs", 
    "name": "Snow White and the Seven Dwarfs"
}