{
    "plot": "A band of bullfighting dwarfs save the life of a young woman with amnesia. They end up taking her under their wing when they find out that she has seemingly natural skills as a bullfighter, upon which they can capitalize not only for their act but for her own personal gain. As she does not know her name or background, the dwarfs coin her Blancanieves, after the famed fairy tale. What they are all unaware of is that she is really Carmen, the daughter of the once great matador, Antonio Villalta. On the day Carmen was born, her father suffered a career ending accident, and her mother died in childbirth. Her father quickly remarried his nurse, the evil Encarna. Although raised by her grandmother during her early years, Carmen, following the death of her grandmother, went to live with Encarna while an adolescent, Encarna who treated her as a slave. Carmen eventually found her disabled father, who was hidden away and treated poorly by Encarna. In the meantime, Encarna was cavorting with the household chauffeur while living off her husband's riches. Antonio did pass along to Carmen the art of bullfighting. As Blancanieves teeters on the brink of fame as a matador, her life may be placed in jeopardy if Encarna learns who she is, as Encarna believed Carmen was dead since she was the one who ordered her murder at the hands of the chauffeur.", 
    "genres": "Drama, Fantasy", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Hunk: Chris Hemsworth as the Huntsman.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice: Chris Hemsworth (the Huntsman) and Sam Claflin (William).", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "actual"
                ], 
                "role": "Princely Young Man: William is advertised as \"The Prince\" in the movie posters, but he is a Duke's son, not an actual prince.", 
                "id": "PrincelyYoungMan"
            }, 
            {
                "adjectives": [
                    "Sensitive", 
                    "cynical", 
                    "coarse", 
                    "heartbroken", 
                    "inconsolable", 
                    "near-suicidal", 
                    "disheartened", 
                    "drunk"
                ], 
                "role": "Sensitive Guy and Manly Man: The Huntsman and William switch roles during the movie. At the beginning, The Huntsman is cynical, macho, and somewhat coarse, while William shows more refined emotions, especially whenever Snow White is concerned. However, The Huntsman is visibly more heartbroken than William over Snow White's death. Played with especially in the death scene and afterward; William panics and is completely inconsolable, but the Huntsman, despite his emotions, calls for a healer. William wants to go on a near-suicidal charge with disheartened soldiers, using Snow White's death as a rallying point; the Huntsman gets really, really drunk.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [], 
                "role": "The Good King: Snow White's father is said to have been this.", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Snow White.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Badass Princess: Snow White and Ravenna.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Princess Snow White in Snow White & the Huntsman takes command of the Duke's army and leads them into battle against her stepmother, Queen Ravenna.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "several"
                ], 
                "role": "Black Widow: Ravenna marries the king and kills him on their wedding night. She claims to have done this several times before.", 
                "id": "BlackWidow"
            }, 
            {
                "adjectives": [
                    "queen", 
                    "bed"
                ], 
                "role": "Queen Ravenna of Snow White & the Huntsman, who marries Snow Whites father the king to become queen, and kills him in bed so she can rule his kingdom.", 
                "id": "BlackWidow"
            }, 
            {
                "adjectives": [
                    "Evil/Blond", 
                    "first"
                ], 
                "role": "Blondes are Evil/Blond Guys Are Evil: Queen Ravenna and her brother Finn. Ravenna deliberately plays up Hair of Gold, Heart of Gold when first introduced, though.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Everything Is Better With Princesses: It's still a fairy tale after all.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Evil Matriarch: The Queen is technically Snow's stepmother after all.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "near-classic"
                ], 
                "role": "God Save Us from the Queen!: Queen Ravenna seems to be a near-classic evil queen.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "psychotic", 
                    "young"
                ], 
                "role": "Queen Ravenna in Snow White & the Huntsman, a thoroughly psychotic Smug Snake who murdered her way to the throne and steals the youth and beauty from younger women so that she might stay young and pretty forever.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Witch: Ravenna.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [
                    "gorgeous", 
                    "beautiful", 
                    "long"
                ], 
                "role": "Snow White & the Huntsman has Queen Ravenna (played by the gorgeous Charlize Theron) who is a Statuesque Stunner with a beautiful face and long blond hair, the Fairest of Them All. She uses a lot of dark magic to ensure and protect her position as a queen.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [], 
                "role": "Ice Queen: Queen Ravenna. As the Big Bad, she never gets defrosted.", 
                "id": "IceQueen"
            }, 
            {
                "adjectives": [
                    "many", 
                    "foreign"
                ], 
                "role": "In Snow White & the Huntsman, Snow White is given the Joan of Arc treatment in many ways. She acts as a symbol of resistance to a foreign usurper, fights in plate armour, and is considered something of a living saint.", 
                "id": "JeanneDArchetype"
            }, 
            {
                "adjectives": [
                    "many", 
                    "foreign"
                ], 
                "role": "Jeanne d'Archétype: Snow White is given the Joan of Arc treatment in many ways. She acts as a symbol of resistance to a foreign usurper, fights in plate armour, and is considered something of a living saint.", 
                "id": "JeanneDArchetype"
            }, 
            {
                "adjectives": [], 
                "role": "Lady of War: Snow White becomes one to take back her kingdom.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [], 
                "role": "Light Feminine and Dark Feminine: Snow White and Ravenna.", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "clear"
                ], 
                "role": "Mama Bear: Ravenna's and Finn's mom invoked dark powers to protect her children. But whenever she intended for her daughter to become a monster it is not clear.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Kristen Stewart and Charlize Theron both.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Spirited Young Lady: Snow White.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [
                    "High"
                ], 
                "role": "The High Queen: Snow White's mother. Snow White herself becomes one in the ending.", 
                "id": "TheHighQueen"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy Princess: As a child, Snow White likes climbing trees and playing with boys.", 
                "id": "TomboyPrincess"
            }, 
            {
                "adjectives": [
                    "magic"
                ], 
                "role": "In Snow White & the Huntsman, Wicked Queen Ravenna is using magic to maintain her youth and beauty, and taking Snow White's heart will allow her to live as a beauty forever. It's never really explained why.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [], 
                "role": "Vain Sorceress: Ravenna.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [], 
                "role": "Wicked Stepmother: Only barely. Ravenna did marry the king before she took over.", 
                "id": "WickedStepmother"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in Black: Ravenna, in most of the movie. Part of being a foil to a girl named Snow White and all.", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [
                    "white", 
                    "later", 
                    "white", 
                    "white"
                ], 
                "role": "Woman in White: Snow White. The Resistance dresses Snow White in a white gown when she's in her coma/death. When Snow White later wakes she gives the Resistance a Rousing Speech while wearing this white gown. Ravenna also has a moment where she submerges herself in a white liquid and emerges white from head to toe.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [], 
                "role": "World's Most Beautiful Woman: Snow White. Played with in that the movie emphasizes that this a combination of both her inner and outer beauty.", 
                "id": "WorldsMostBeautifulWoman"
            }, 
            {
                "adjectives": [
                    "married", 
                    "other"
                ], 
                "role": "And now it's all gone to hell with the revelation that Kristen cheated on Robert with the married director of Snow White & the Huntsman. Even when it takes TWO to tango and cheat, all of the heat has gone towards Stewart and not towards the other dude, paired up with the already existing fangirl misogyny.", 
                "id": "YokoOhNo"
            }
        ]
    }, 
    "imdbid": "tt1854513", 
    "similar": [
        {
            "shared": [
                "SpiritedYoungLady", 
                "EverythingsBetterWithPrincesses", 
                "SensitiveGuyAndManlyMan", 
                "HotWitch", 
                "GodSaveUsFromTheQueen", 
                "TomboyPrincess", 
                "LightFeminineAndDarkFeminine", 
                "Hunk", 
                "IceQueen", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 11, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MamaBear", 
                "EverythingsBetterWithPrincesses", 
                "TomboyPrincess", 
                "TheGoodKing", 
                "MrFanservice", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 8, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "YokoOhNo", 
                "TheHighQueen", 
                "Hunk", 
                "WomanInWhite", 
                "SensitiveGuyAndManlyMan", 
                "LadyOfWar", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 8, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "MamaBear", 
                "WickedStepmother", 
                "EverythingsBetterWithPrincesses", 
                "WomanInWhite", 
                "GodSaveUsFromTheQueen", 
                "WomanInBlack", 
                "LightFeminineAndDarkFeminine"
            ], 
            "shared_count": 8, 
            "id": "SnowWhiteATaleOfTerror", 
            "name": "Snow White: A Tale of Terror", 
            "poster_url": "SnowWhiteATaleOfTerror.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "EverythingsBetterWithPrincesses", 
                "WomanInWhite", 
                "GodSaveUsFromTheQueen", 
                "LadyOfWar", 
                "TheHighQueen", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }
    ], 
    "id": "SnowWhiteAndTheHuntsman", 
    "name": "Snow White & the Huntsman"
}