{
    "plot": "Based somewhat more authentically on the Grimm Brothers' story of a young woman who is unliked by her stepmother, the film includes the talking mirror, a poisoned apple, and some ruffian gold (not diamond) miners (and they aren't dwarfs or cute). It takes place at the time of the Crusades, and depicts the attitudes of the wealthy and the peasant classes toward one another.", 
    "genres": "Fantasy, Horror", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Distressed Dude: Frederich towards the end.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Frederich goes out into the storm on his horse to find Lilli when he hears she's missing.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Shirtless Scene: The miners work in the mine shirtless. Will also gets another later on.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "injury"
                ], 
                "role": "Daddy's Girl: In a change from the Grimm tale and the Disney film, not only does her father feature in the story, but Lilli is his pet. His not taking action to save his daughter from his wife is thoroughly justified by Claudia's manipulation and a timely injury.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "injury"
                ], 
                "role": "In a change from both the Grimm tale and the Disney film, not only does her father feature in the story, but Lilli is his pet in Snow White: A Tale of Terror. His not taking action to save his daughter from his wife is thoroughly justified by Claudia's manipulation and a timely injury.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "original"
                ], 
                "role": "Everything's Better with Princesses: Inverted. Snow White was a princess in the original fairytale but is simply a daughter of a nobleman here.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "little"
                ], 
                "role": "Subverted in Snow White: A Tale of Terror. The protagonist Liliana is not a princess but merely the daughter of a nobleman. Notably when she hides with the miners, they mockingly call her princess because of her attitude. Eventually calling her \"little princess\" morphs into a term of endearment for all of them.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "queen"
                ], 
                "role": "God Save Us from the Queen!: Technically not a queen, but Claudia is still a noblewoman.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [], 
                "role": "Lady of Black Magic: Claudia's mother is implied to have been one.", 
                "id": "LadyOfBlackMagic"
            }, 
            {
                "adjectives": [
                    "young", 
                    "virginal", 
                    "sexual", 
                    "manipulative"
                ], 
                "role": "Light Feminine and Dark Feminine: Lilli is young, virginal and innocent (if bratty). Claudia is sexual and manipulative.", 
                "id": "LightFeminineAndDarkFeminine"
            }, 
            {
                "adjectives": [
                    "dead"
                ], 
                "role": "Mama Bear:  Claudia is going to protect that baby. Even though he's been dead.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Lilli's mother dies at her birth in Snow White: A Tale of Terror.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Missing Mom: Lilli's mother dies at her birth.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "nice", 
                    "sweet"
                ], 
                "role": "Played with in Snow White A Taleof Terror. Lilli is nice to the servants and looks like a sweet girl, but she treats her stepmother very badly.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "nice"
                ], 
                "role": "Spoiled Sweet: Played with. Lilli is nice to the servants but treats Claudia very badly.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "original", 
                    "physical", 
                    "magic", 
                    "beautiful"
                ], 
                "role": "Like the original tale, in Snow White: A Tale of Terror Claudia is enamored with her physical appearance to the point that the magic mirror shows her to be beautiful in moments when she's not.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [
                    "original", 
                    "physical", 
                    "magic", 
                    "beautiful"
                ], 
                "role": "Vain Sorceress: Like the original tale, Claudia is enamored with her physical appearance to the point that the magic mirror shows her to be beautiful in moments when she's not.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [
                    "Double", 
                    "nice", 
                    "friendly"
                ], 
                "role": "Wicked Stepmother: Double subverted as Claudia is quite nice and friendly to Lilli when she arrives. Lilli's mistreatment of her as well as her miscarriage sends Claudia over the edge to become the wicked stepmother.", 
                "id": "WickedStepmother"
            }, 
            {
                "adjectives": [
                    "black", 
                    "noteworthy", 
                    "next", 
                    "white"
                ], 
                "role": "Woman in Black: Claudia tends to wear black when she is doing witchcraft. The most noteworthy instance, though, is when she is disguised as a crone, especially as she is sitting next to Lilli who is wearing white.", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [], 
                "role": "Lilli appears at a party in pure white gown in Snow White A Taleof Terror, which is visually striking as no one else does this. Plot-wise, it also spurs memories of her mother (it was her gown once), which makes her father nostalgic and sends her stepmother straight into labor.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in White: Lilli appears at a party in pure white gown, which is visually striking as no one else does this. Plot-wise, it also spurs memories of her mother, which makes her father nostalgic and sends Claudia straight into labor.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0119227", 
    "poster_url": "SnowWhiteATaleOfTerror.jpg", 
    "similar": [
        {
            "shared": [
                "VainSorceress", 
                "MamaBear", 
                "WickedStepmother", 
                "EverythingsBetterWithPrincesses", 
                "WomanInWhite", 
                "GodSaveUsFromTheQueen", 
                "WomanInBlack", 
                "LightFeminineAndDarkFeminine"
            ], 
            "shared_count": 8, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "EverythingsBetterWithPrincesses", 
                "WomanInWhite", 
                "WomanInBlack", 
                "DistressedDude", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "SpoiledSweet", 
                "EverythingsBetterWithPrincesses", 
                "WomanInBlack", 
                "LightFeminineAndDarkFeminine", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "EverythingsBetterWithPrincesses", 
                "ShirtlessScene", 
                "WomanInWhite", 
                "GodSaveUsFromTheQueen", 
                "DistressedDude"
            ], 
            "shared_count": 6, 
            "id": "MirrorMirror", 
            "name": "Mirror, Mirror"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "MamaBear", 
                "DaddysGirl", 
                "PapaWolf", 
                "LightFeminineAndDarkFeminine", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }
    ], 
    "id": "SnowWhiteATaleOfTerror", 
    "name": "Snow White: A Tale of Terror"
}