{
    "plot": "SON OF RAMBOW is the name of the home movie made by two little boys with a big video camera and even bigger ambitions. Set on a long English summer in the early '80s, SON OF RAMBOW is a comedy about friendship, faith and the tough business of growing up. We see the story through the eyes of Will, the eldest son of a fatherless Plymouth Brethren family. The Brethren regard themselves as God's 'chosen ones' and their strict moral code means that Will has never been allowed to mix with the other 'worldlies,' listen to music or watch TV, until he finds himself caught up in the extraordinary world of Lee Carter, the school terror and maker of bizarre home movies. Carter exposes Will to a pirate copy of Rambo: First Blood and from that moment Will's mind is blown wide open and he's easily convinced to be the stuntman in Lee Carters' diabolical home movie. Will's imaginative little brain is not only given chance to flourish in the world of film making, but is also very handy when it comes to dreaming up elaborate schemes to keep his partnership with Lee Carter a secret from the Brethren community. Will and Carter's complete disregard for consequences and innocent ambition means that the process of making their film is a glorious roller-coaster that eventually leads to true friendship. They start to make a name for themselves at school as movie makers but when popularity descends on them in the form of the Pied Piper-esque French exchange student, Didier Revol, their unique friendship and their precious film are pushed, quite literally, to breaking point.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "French", 
                    "beautiful"
                ], 
                "role": "Didier Revol the French exchange student in Son of Rambow is so beautiful that Even the Guys Want Him.", 
                "id": "PrettyBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Catholic Schoolgirls Rule - \"St. Mary's is just down the road, and they're all Catholic!\"", 
                "id": "CatholicSchoolGirlsRule"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Mom - Mary Proudfoot.", 
                "id": "HotMom"
            }
        ]
    }, 
    "imdbid": "tt0845046", 
    "poster_url": "SonOfRambow.jpg", 
    "similar": [
        {
            "shared": [
                "PrettyBoy", 
                "HotMom"
            ], 
            "shared_count": 2, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "PrettyBoy"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CatholicSchoolGirlsRule"
            ], 
            "shared_count": 1, 
            "id": "AssassinationOfAHighSchoolPresident", 
            "name": "Assassination Of A High School President", 
            "poster_url": "AssassinationOfAHighSchoolPresident.jpg"
        }, 
        {
            "shared": [
                "PrettyBoy"
            ], 
            "shared_count": 1, 
            "id": "Stargate", 
            "name": "Stargate", 
            "poster_url": "Stargate.jpg"
        }, 
        {
            "shared": [
                "CatholicSchoolGirlsRule"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }
    ], 
    "id": "SonOfRambow", 
    "name": "Son of Rambow"
}