{
    "plot": "On board a train en route to Los Angeles, runaway bride Remember Steddon, believing now that she married in haste, abandons her husband, Owen Scudder, not knowing at the time that Scudder had previously married and murdered solely for money. Unprepared to be on her own, Mem, as she is known to her friends, accidentally stumbles across the outdoor set of a Hollywood movie directed by Frank Claymore. Mem is welcomed onto the set by the cast and crew. But as the shooting moves on, Mem decides to pursue other avenues, as she had been taught by her conservative parents that movie acting was a disreputable occupation. But needing work, Mem decides to try her hand at being an actress. This task is easier said than done, until she runs across Claymore again, he who is determined to make her a star. As her movie stardom does indeed rise, so does the admiration of adoration of legions, including her director Claymore, and her leading man Tom Holby. A further consequence of her stardom is that her parents and Scudder find out where she is. The scandal of being married to a known murderer may jeopardize Mem's budding career.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1923", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "The Bluebeard: How Owen makes a living, by marrying women and murdering them for insurance.", 
                "id": "TheBlueBeard"
            }
        ]
    }, 
    "imdbid": "tt0014497", 
    "similar": [
        {
            "shared": [
                "TheBlueBeard"
            ], 
            "shared_count": 1, 
            "id": "CriminallyInsane", 
            "name": "Criminally Insane", 
            "poster_url": "CriminallyInsane.jpg"
        }, 
        {
            "shared": [
                "TheBlueBeard"
            ], 
            "shared_count": 1, 
            "id": "TheScreamingSkull", 
            "name": "The Screaming Skull", 
            "poster_url": "TheScreamingSkull.jpg"
        }, 
        {
            "shared": [
                "TheBlueBeard"
            ], 
            "shared_count": 1, 
            "id": "TheAmazingSpiderMan", 
            "name": "The Amazing Spider-Man", 
            "poster_url": "TheAmazingSpiderMan.jpg"
        }, 
        {
            "shared": [
                "TheBlueBeard"
            ], 
            "shared_count": 1, 
            "id": "ShadowOfADoubt", 
            "name": "Shadow of a Doubt", 
            "poster_url": "ShadowOfADoubt.jpg"
        }, 
        {
            "shared": [
                "TheBlueBeard"
            ], 
            "shared_count": 1, 
            "id": "TheNightOfTheHunter", 
            "name": "The Night of the Hunter", 
            "poster_url": "TheNightOfTheHunter.jpg"
        }
    ], 
    "id": "SoulsForSale", 
    "name": "Souls For Sale"
}