{
    "plot": "Swackhammer, owner of the amusement park planet Moron Mountain is desperate get new attractions and he decides that the Looney Tune characters would be perfect. He sends his diminutive underlings to get them to him, whether Bugs Bunny & Co. want to go or not. Well armed for their size, Bugs Bunny is forced to trick them into agreeing to a competition to determine their freedom. Taking advantage of their puny and stubby legged foes, the gang selects basketball for the surest chance of winning. However, the Nerdlucks turn the tables and steal the talents of leading professional basketball stars to become massive basketball bruisers known as the Monstars. In desperation, Bugs Bunny calls on the aid of Micheal Jordan, the Babe Ruth of Basketball, to help them have a chance at winning their freedom.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "'No"
                ], 
                "role": "Space Jam: In a Getting Crap Past the Radar moment, a shrink asks Patrick Ewing if he is having this problem during the Basketball Jones segment. He angrily responds with a 'No!'", 
                "id": "TheLoinsSleepTonight"
            }, 
            {
                "adjectives": [
                    "'Basketball", 
                    "'No"
                ], 
                "role": "The Loins Sleep Tonight: In a Getting Crap Past the Radar moment during the 'Basketball Jones' scene, a shrink asks Patrick Ewing if he is having this problem. He angrily responds with a 'No!'", 
                "id": "TheLoinsSleepTonight"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "few", 
                    "notable", 
                    "gender-neutral", 
                    "comic", 
                    "well-received"
                ], 
                "role": "Lola Bunny. She basically existed because of how few notable female Looney Tunes there were (having Granny play basketball would be pushing suspension of disbelief, and Petunia Pig is seriously obscure). They found a gender-neutral niche for her in the comic books, and eventually turned her into a Cloud Cuckoolander and Stalker with a Crush for The Looney Tunes Show.\n Ironically, the character introduced solely to be Daffy Duck's girlfriend, Tina, is the Affirmative Action Girl for The Looney Tunes Show itself — and is more well-received than this incarnation of Lola.", 
                "id": "AffirmativeActionGirl"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Hello, Nurse!: Lola's appearance has all the toons (and Jordan) pause momentarily, but Bugs... never quite recovers from seeing her the first time.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Lola Bunny◊. See Hello, Nurse!.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "girl", 
                    "only", 
                    "so..Fish"
                ], 
                "role": "The Chick: Lola Bunny. The only girl on the team and the only one that's not wacky. note  Michael stands out because he's not a toon, and so..Fish out of Water wacky.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0117705", 
    "poster_url": "SpaceJam.jpg", 
    "similar": [
        {
            "shared": [
                "TheChick", 
                "AffirmativeActionGirl", 
                "HelloNurse"
            ], 
            "shared_count": 3, 
            "id": "ToyStory2", 
            "name": "Toy Story 2", 
            "poster_url": "ToyStory2.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "MsFanservice", 
                "HelloNurse"
            ], 
            "shared_count": 3, 
            "id": "SuckerPunch", 
            "name": "Sucker Punch", 
            "poster_url": "SuckerPunch.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "MsFanservice", 
                "AffirmativeActionGirl"
            ], 
            "shared_count": 3, 
            "id": "SnowDay", 
            "name": "Snow Day", 
            "poster_url": "SnowDay.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "HelloNurse"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "HelloNurse"
            ], 
            "shared_count": 2, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }
    ], 
    "id": "SpaceJam", 
    "name": "Space Jam"
}