{
    "plot": "Bomber terrorist's elevator plan backfires, so he rigs a bomb to a LA city bus. The stipulation is: once armed, the bus must stay above 50 mph to keep from exploding. Also if LAPD Officer tries to unload any passengers off, Payne will detonate it. Joe Morton co-stars as Jack's superior, and Jeff Daniels supports Jack helping him try to defuse the bomb.", 
    "genres": "Action, Crime, Thriller", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "former", 
                    "due", 
                    "ineligible"
                ], 
                "role": "Lawman Gone Bad: Howard Payne was a former member of the Atlanta PD bomb squad, who turned Mad Bomber after  being forcibly retired, due to an accident which injured his hand. But he was ineligible to collect his pension. Howard did not take this well.", 
                "id": "LawmanGoneBad"
            }, 
            {
                "adjectives": [
                    "former", 
                    "due", 
                    "ineligible"
                ], 
                "role": "Speed: Howard Paine (Dennis Hopper) was a former member of the LAPD bomb squad, who turned Mad Bomber after  being forcibly retired, due to an accident which injured his hand. But he was ineligible to collect his pension. Howard did not take this well.", 
                "id": "LawmanGoneBad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "white", 
                    "cast", 
                    "easy"
                ], 
                "role": "Early in Speed, the SWAT team are rescuing people from an office building elevator that's about to drop. As they help one woman in a business suit down, her skirt rides up revealing a white thong. Everybody in the elevator is credited at the end of the cast credits as \"Elevator Passengers\", but there's no easy way to tell which actress this is.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "white", 
                    "cast", 
                    "easy"
                ], 
                "role": "Fanservice Extra: When the SWAT team are rescuing people from an office building elevator that's about to drop, one of the passengers is a brunette in a brown business suit. As they help her down, her skirt rides up revealing a white thong. Everybody in the elevator is credited at the end of the cast credits as \"Elevator Passengers\", so there's no easy way to tell which actress this is. Although, someone on IMDB believes that it's Paige Goodman.", 
                "id": "FanserviceExtra"
            }
        ]
    }, 
    "imdbid": "tt0111257", 
    "poster_url": "Speed.jpg", 
    "similar": [
        {
            "shared": [
                "FanserviceExtra", 
                "LawmanGoneBad"
            ], 
            "shared_count": 2, 
            "id": "MadMax", 
            "name": "Mad Max", 
            "poster_url": "MadMax.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "LawmanGoneBad"
            ], 
            "shared_count": 2, 
            "id": "XxX", 
            "name": "xXx", 
            "poster_url": "XxX.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "StarTrekIIITheSearchForSpock", 
            "name": "Star Trek III: The Search for Spock", 
            "poster_url": "StarTrekIIITheSearchForSpock.jpg"
        }, 
        {
            "shared": [
                "LawmanGoneBad"
            ], 
            "shared_count": 1, 
            "id": "TheDarkKnight", 
            "name": "The Dark Knight", 
            "poster_url": "TheDarkKnight.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "ConanTheBarbarian2011", 
            "name": "Conan the Barbarian ", 
            "poster_url": "ConanTheBarbarian2011.jpg"
        }
    ], 
    "id": "Speed", 
    "name": "Speed"
}