{
    "plot": "Annie Porter, the woman who was held on a bus with a bomb attached to it that will go off if it slows down. She dated the cop who saved her but broke up with him because he was constantly putting his life in danger. She would then date a guy named Alex who is also a cop but told her that he does a mundane assignment. But she eventually learns that he works for the same unit that the other guy worked for and is also addicted to danger. She wants to break up with but he surprises her with a cruise. She agrees to go. And he's planning to propose to her. But when he notice another passenger act peculiarly, he can't help but try to find out what's up with him. He's Geiger, a computer man who designed the ship's systems, who was fired. He then takes over the ship's systems and sets it on a course that will send it into a tanker. Alex tries to stop him.", 
    "genres": "Action, Crime, Romance", 
    "release_year": "1997", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "many", 
                    "vital", 
                    "first", 
                    "wisecracking", 
                    "much"
                ], 
                "role": "Faux Action Girl: Annie turns into this, which is one of its many complaints. Annie is a vital part to everyone's survival in the first movie as she's driving the bus, but without that premise in this film, she just turns into a wisecracking, frazzled heroine without much to do.", 
                "id": "FauxActionGirl"
            }
        ]
    }, 
    "imdbid": "tt0120179", 
    "poster_url": "Speed2CruiseControl.jpg", 
    "similar": [
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "ShrekTheThird", 
            "name": "Shrek the Third", 
            "poster_url": "ShrekTheThird.jpg"
        }, 
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "TheBladeMaster", 
            "name": "The Blade Master"
        }, 
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "ResidentEvilDegeneration", 
            "name": "Resident Evil Degeneration"
        }, 
        {
            "shared": [
                "FauxActionGirl"
            ], 
            "shared_count": 1, 
            "id": "Sheena", 
            "name": "Sheena", 
            "poster_url": "Sheena.jpg"
        }
    ], 
    "id": "Speed2CruiseControl", 
    "name": "Speed 2: Cruise Control"
}