{
    "plot": "Haghi is a criminal mastermind whose ubiquitous spy operation is always several steps ahead of the police and the government's secret service. Enter Agent 326, the daring and dashing young man, who thinks his disguise as a dirty, bearded vagrant is fooling the unknown mastermind and his minions. But Haghi is well aware of 326's existence and what he looks like. Enter Sonya, a Russian lady in Haghi's employ. Haghi wants Sonya to subvert the efforts of the government agent, but doesn't count on her falling in love with him. Meanwhile, Haghi is anxious to get his hands on a Japanese peace treaty in the possession of the cunning Doctor Masimoto, whose mistress is also in his employ.", 
    "genres": "Romance, Thriller", 
    "release_year": "1928", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "High"
                ], 
                "role": "High Heel-Face Turn: Sonia, sent to spy on #326, falls in love with him instead, and eventually works for the good guys against Haghi.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "first", 
                    "good", 
                    "evil"
                ], 
                "role": "In Spies, a silent film that plays like a James Bond flick 30 years before the first James Bond flick, the lady spy from the Nebulous Evil Organization falls in love with the good guy spy that she was supposed to be a Honey Pot for. She refuses to betray him to her evil boss, and eventually helps to bring the evil boss down.", 
                "id": "HighHeelFaceTurn"
            }
        ]
    }, 
    "imdbid": "tt0019415", 
    "similar": [
        {
            "shared": [
                "HighHeelFaceTurn"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn"
            ], 
            "shared_count": 1, 
            "id": "NorthByNorthwest", 
            "name": "North by Northwest", 
            "poster_url": "NorthByNorthwest.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn"
            ], 
            "shared_count": 1, 
            "id": "IronSky", 
            "name": "Iron Sky", 
            "poster_url": "IronSky.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn"
            ], 
            "shared_count": 1, 
            "id": "TheHudsuckerProxy", 
            "name": "The Hudsucker Proxy", 
            "poster_url": "TheHudsuckerProxy.jpg"
        }
    ], 
    "id": "Spies", 
    "name": "Spies"
}