{
    "plot": "Gregorio and Ingrid are the two greatest secret agents the world has ever known: masters of disguise, mavens of invention, able to stop wars before they even start. Working for separate countries, they are sent to eliminate their most dangerous enemy...each other. But in an exotic corner of the world when they finally come face to face, they fall in love instead and embark on the most dangerous mission they have ever faced: raising a family. Now nine years later, after their retirement, having exchanged the adventure of espionage for parenthood, Gregorio and Ingrid Cortez are called back in to action. When their former colleagues, the world's most formidable spies, start disappearing one by one, the Cortez's are forced to take on techno-wizard Fegan Floop and his evil, egg-headed sidekick, Minion. But when the unthinkable happens and they too disappear, unfortunately there are only two people in the world who can rescue them...their kids.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Badass Mustache - When Antonio Banderas is in \"spy\" mode, he wears a (fake) moustache. When he's in \"dad\" mode, he has no moustache. Fake Uncle Felix does things the other way round.", 
                "id": "BadAssMustache"
            }, 
            {
                "adjectives": [], 
                "role": "Badass Grandpa: Again, Grandpa is Ricardo Montalbán - what did you expect?", 
                "id": "BadassGrandpa"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Mom: Ingrid Cortez and Marissa Wilson.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "third"
                ], 
                "role": "Chickification: Carmen in the third film.", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [
                    "Girlish", 
                    "operate"
                ], 
                "role": "Girlish Pigtails: Gerti Giggles has these, with operate as Helicopter Hair.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [
                    "only", 
                    "unusual", 
                    "only"
                ], 
                "role": "In fact, the only villains to not end up on the good side are Mr. Lisp, Ms. Gradenko, and Tick Tock. Given the High Heel-Face Turn trope, it's unusual because out of all the villains in the series, the only female is one of the three who don't get redeemed.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "female", 
                    "first", 
                    "few"
                ], 
                "role": "Inverted in Spy Kids. The only female villain in the series (Teri Hatcher's character in the first movie) is one of the few to not be redeemed.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "second"
                ], 
                "role": "Manic Pixie Dream Girl: Subverted. Carmen is attracted to Gary Giggles in the second movie, insisting that she could \"change him\", and her giving up on this is played as Character Development. Needless to say, shipping ensued anyway.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "Pregnant", 
                    "fourth", 
                    "big", 
                    "bad"
                ], 
                "role": "Pregnant Badass: Marissa, in the beginning of the fourth film, big time. She keeps fighting the bad guys, even after she starts feeling contractions.", 
                "id": "PregnantBadass"
            }, 
            {
                "adjectives": [
                    "pregnant", 
                    "several"
                ], 
                "role": "Spy Kids: All The Time in the World opens with a heavily pregnant Marissa taking down several mooks and catching the Timekeeper. Right after her waters have broken.", 
                "id": "PregnantBadass"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Demetra, again. Carmen also counts.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0227538", 
    "poster_url": "SpyKids.jpg", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa", 
                "TheChick", 
                "BadAssMustache", 
                "Chickification"
            ], 
            "shared_count": 4, 
            "id": "LegendsOfTheFall", 
            "name": "Legends Of The Fall"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "ActionMom", 
                "TheChick", 
                "GirlishPigtails"
            ], 
            "shared_count": 4, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "TheChick", 
                "BadAssMustache", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "Tombstone", 
            "name": "Tombstone", 
            "poster_url": "Tombstone.jpg"
        }, 
        {
            "shared": [
                "Chickification", 
                "GirlishPigtails", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "Chickification", 
                "TheChick"
            ], 
            "shared_count": 3, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }
    ], 
    "id": "SpyKids", 
    "name": "Spy Kids"
}