{
    "plot": "Lt. Commander Data was taking part in an operation the Federation has with a race known as the Son'a to observe another race known as the Ba'ku. They are wearing stealth suits so that the Ba'ku cannot see them. But suddenly, Data rips off his stealth suit, reveals himself and exposes everyone. Picard is them contacted by Admiral Dougherty who tells Picard that Data has to be stopped even if it means destroying him. Picard requests permission to try and stop him without doing that, he succeeds. He then tries to find out what happened to Data. That's when they discover a plot by the Son'a and the Federation to remove the Ba'ku from the planet because they want to tap the radiation being emitted by the nearby planet's rings which have regenerative properties. Picard then airs his objections to Dougherty who tells him that everything they are doing is within the Federation guidelines. That's when Picard steps down as Captain and decides to help the Ba'ku. Data, Crusher, Worf and Troi join him, while Riker and LaForge try to get the Federation to reconsider. When Ru'afo, the leader of the Son'a, learns of what Picard is doing, he decides to remove the Ba'ku even if it means eliminating them.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "final"
                ], 
                "role": "When she recognized Gallatin as Gal'na, Anij says she helped his mother to bathe him when he was a child and she stills speaks of him. In the final scene, we see the reunion of the mother and the son, but there’s no trace of the father.", 
                "id": "DisappearedDad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Artim’s", 
                    "close"
                ], 
                "role": "There’s no trace of Artim’s mom and Anij seems relatively close to him.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0120844", 
    "poster_url": "StarTrekInsurrection.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "IndependenceDay", 
            "name": "Independence Day", 
            "poster_url": "IndependenceDay.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Epic", 
            "name": "Epic"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "NowAndThen", 
            "name": "Now And Then", 
            "poster_url": "NowAndThen.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "TheSwanPrincess", 
            "name": "The Swan Princess", 
            "poster_url": "TheSwanPrincess.jpg"
        }
    ], 
    "id": "StarTrekInsurrection", 
    "name": "Star Trek: Insurrection"
}