{
    "plot": "Following Kirk's encounter with Khan that left the Enterprise severely damaged and Spock dead, they return to Starfleet so that Enterprise could be repaired. Kirk's hoping to go back to the newly-created Genesis planet where he laid Spock to rest. But upon arriving, he is told that the Enterprise will not be repaired and that Genesis has become a delicate matter and until it is resolved, no one is allowed to go there or talk about it. McCoy is also acting strangely and is later detained when he starts talking about Genesis. Kirk is visited by Spock's father Sarek, who tells him that he betrayed Spock because being placed on Genesis was not what he would have wanted. He tells Kirk he is supposed to bring Spock's body along with his soul or katra as the Vulcans call it which he passes onto someone, and bring it to Vulcan for the final rites. Sarek assumes Kirk would have it but he does not. Kirk then thinks that Spock may have passed it someone else and realizes McCoy is the one who has which is why he is acting weird. Sarek tells Kirk he must bring both Spock's body and McCoy who has his soul to Vulcan so that they could be at peace. Kirk asks permission but his request is refused. Kirk then along with the others decides to take the Enterprise and proceed to Genesis to get Spock's body. But what they do not know is that the Klingons, who upon learning of Genesis, sets out to get it, so they go there and destroy the science vessel sent to evaluate Genesis. They capture Lieutenant Saavik and Kirk's son David who go to the planet and discover that Spock was somehow regenerated and that the planet is aging rapidly.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "1984", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "female", 
                    "Fal-Tor-Pan"
                ], 
                "role": "Fanservice Extra: All the female vulcan acolytes during the Fal-Tor-Pan ritual are wearing... somewhat sheer outfits, and apparently no bra from the looks of it.", 
                "id": "FanserviceExtra"
            }
        ]
    }, 
    "imdbid": "tt0088170", 
    "poster_url": "StarTrekIIITheSearchForSpock.jpg", 
    "similar": [
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "ConanTheBarbarian2011", 
            "name": "Conan the Barbarian ", 
            "poster_url": "ConanTheBarbarian2011.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "JoeDirt", 
            "name": "Joe Dirt", 
            "poster_url": "JoeDirt.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "ClassOf1984", 
            "name": "Class Of", 
            "poster_url": "ClassOf1984.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "TheNuttyProfessor", 
            "name": "The Nutty Professor", 
            "poster_url": "TheNuttyProfessor.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "RedHeat", 
            "name": "Red Heat", 
            "poster_url": "RedHeat.jpg"
        }
    ], 
    "id": "StarTrekIIITheSearchForSpock", 
    "name": "Star Trek III: The Search for Spock"
}