{
    "plot": "The time is the 24th century and the ship is the newly-commissioned Enterprise-E. Its captain, Jean-Luc Picard, has been ordered not to interfere in a battle between a Borg Cube and ships from the Federation. However, seeing the Federation is about to lose, Picard ignore his orders and takes command of the defending fleet. With his knowledge of the Cube's weak spot, they destroy it. However, a small part of it escapes and plots a course directly for Earth. The Enterprise chases it and enters a time distortion created by the Borg. They end up in the mid-21st century, and their only chance of stopping the Borg from assimilating Earth is to help Zefram Cochrane make his famous first faster-than-light travel to the stars.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "In Star Trek: First Contact holodeck gangster Nicky the Nose has two flapper girls rubbing his shoulders.", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Dude: Data is captured early on by the Borg and held in engineering.", 
                "id": "DistressedDude"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "hive"
                ], 
                "role": "Star Trek: First Contact: The Borg Queen, who is probably a “queen” as a reference to queen ants , queen bees, and queen termites, since The Borg operate with a hive mind. She and her kind try to assimilate every living being the come across.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "new", 
                    "new"
                ], 
                "role": "Woman Scorned: The Borg Queen, oh so much.  It's revealed that part of the plot was a revenge against Picard for not being her consort. When Picard offers to be her consort once again, she accepts, and practically giggles when Data won't leave that she has a new consort, and Picard is no longer needed. Except as a new Borg drone, that is.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0117731", 
    "poster_url": "StarTrekFirstContact.jpg", 
    "similar": [
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "WomanScorned"
            ], 
            "shared_count": 2, 
            "id": "TheLionInWinter", 
            "name": "The Lion in Winter", 
            "poster_url": "TheLionInWinter.jpg"
        }, 
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "DistressedDude"
            ], 
            "shared_count": 2, 
            "id": "MirrorMirror", 
            "name": "Mirror, Mirror"
        }, 
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "DistressedDude"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteATaleOfTerror", 
            "name": "Snow White: A Tale of Terror", 
            "poster_url": "SnowWhiteATaleOfTerror.jpg"
        }, 
        {
            "shared": [
                "WomanScorned", 
                "DistressedDude"
            ], 
            "shared_count": 2, 
            "id": "Audition", 
            "name": "Audition", 
            "poster_url": "Audition.jpg"
        }, 
        {
            "shared": [
                "WomanScorned", 
                "DistressedDude"
            ], 
            "shared_count": 2, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }
    ], 
    "id": "StarTrekFirstContact", 
    "name": "Star Trek: First Contact"
}