{
    "plot": "James T. Kirk who after rescuing Mr. Spock and bringing him to Vulcan where he is fully restored, is now the most hated man in the universe, because he disobeyed his superiors, killed a Klingon crew and took their ship. After three months on Vulcan, Kirk decides to return to Earth to face the consequences of his actions along with his crew who aided him. Also accompanying them is Mr. Spock, who is still trying to understand his human side. What they don't know is that an alien probe approaches Earth and is emitting a signal that nullifies all power systems. And it is now vaporizing the planet's oceans covering the planet in a cloud that covers the earth cutting them off from the sun - the planet's main source of energy. The President of the Federation sends a transmission telling everyone about what is happening and to stay away from Earth. Kirk upon hearing it, checks out the probe's transmission and Spock postulates that the alien is not hostile merely unaware that its transmissions are disruptive. Spock thinks it's trying to communicate with another species other than man. And upon analyzing it, Spock learns that the probe is sending the songs of whales, specifically humpback whales. The only problem is that the species has been extinct for two centuries. With little choice, Kirk decides to get some humpback whales from the only place they can from Earth in the past so that they can communicate with the probe. So they travel through time and arrive in the late 20th century. And they discover a pair of humpback whales in San Francisco. So Kirk and Spock set out to find them. While Scotty, McCoy and Sulu try to find the materials they need to make a whale tank. And also the ship's dilithium crystals are failing. So Uhura and Chekov try to find a nuclear reactor so that they can drain some radiation which they hope can restore the ship's power. And they have to contend with the ways of the 20th century.", 
    "genres": "Action, Adventure, Comedy", 
    "release_year": "1986", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Black Boss Lady: Audiences applauded when Madge Sinclair appeared as the (unnamed) Captain of the Saratoga at the beginning of the film.", 
                "id": "BlackBossLady"
            }, 
            {
                "adjectives": [
                    "meant", 
                    "20th-century", 
                    "kid", 
                    "over-the-top", 
                    "impossible"
                ], 
                "role": "In Star Trek IV, Sulu (George Takei) was meant to have a chance encounter, while walking around 20th-century San Francisco, with a kid who would turn out to be his ancestor. Unfortunately, the kid who was to play the part had what Shatner described (in Star Trek Movie Memories) as \"the most over-the-top stage mom\" he had ever encountered, and she ended up making her kid so stressed out that she made it effectively impossible to actually film the scenes.", 
                "id": "StageMom"
            }
        ]
    }, 
    "imdbid": "tt0092007", 
    "poster_url": "StarTrekIVTheVoyageHome.jpg", 
    "similar": [
        {
            "shared": [
                "StageMom"
            ], 
            "shared_count": 1, 
            "id": "BarbieInAChristmasCarol", 
            "name": "Barbie in A Christmas Carol"
        }, 
        {
            "shared": [
                "BlackBossLady"
            ], 
            "shared_count": 1, 
            "id": "Dredd", 
            "name": "Dredd", 
            "poster_url": "Dredd.jpg"
        }, 
        {
            "shared": [
                "StageMom"
            ], 
            "shared_count": 1, 
            "id": "DropDeadGorgeous", 
            "name": "Drop Dead Gorgeous"
        }, 
        {
            "shared": [
                "StageMom"
            ], 
            "shared_count": 1, 
            "id": "CampNowhere", 
            "name": "Camp Nowhere", 
            "poster_url": "CampNowhere.jpg"
        }, 
        {
            "shared": [
                "StageMom"
            ], 
            "shared_count": 1, 
            "id": "TheUglyDucklingAndMe", 
            "name": "The Ugly Duckling and Me"
        }
    ], 
    "id": "StarTrekIVTheVoyageHome", 
    "name": "Star Trek IV: The Voyage Home"
}