{
    "plot": "The Federation along with a group of scientists are working on Project Genesis, which is to bring a dead planet to life. So far the preliminary experiments have been a success. Now for the next phase which is to actually bring a planet to life, a dead planet is required. So the Federation sends a starship, the USS Reliant to find one and its first officer is Commander Pavel Chekov. They come across what appears to be a dead planet in the Ceti Alpha system. But the sensors detect something which makes it not a dead planet. But the Captain thinks maybe they can remove it, so he and Chekov go and investigate. But they find what appears to be a lifepod. When Chekov sees something, he tells the Captain they should leave, but they are captured by the inhabitants. When they meet the leader, Chekov recognizes him as Khan Noonien Singh, the genetic superman from late 20th century whom Kirk found 15 years ago. Khan tried to take over the Enterprise and kill Kirk, but Kirk subdued him and left him on Ceti Alpha V. Khan reveals that Ceti Alpha VI exploded shortly after they were left and the force shifted Ceti Alpha V's orbit which turned the planet into a wasteland. Khan deduces that Chekov and the Captain thought they were on Ceti Alpha VI. When he asks them why they are there, they don't answer, and Khan puts wormlike creatures in them, which makes them susceptible to suggestion. Upon learning why there are there, Khan takes over the Reliant, tries to steal Genesis and have revenge on Kirk. He starts by making Chekov contact the scientist in charge of Genesis and telling her that Kirk has ordered him to take possession of Genesis. She then calls Kirk who has no knowledge of what she is talking about but before they can talk any further, they lose contact. Admiral James T. Kirk is attended by Mr. Spock, who is now in command of the Enterprise, and is taking some cadets on a training cruise. But now he tells them they have to investigate what is happening. So they go and meet the Reliant, that's when Khan attacks the Enterprise crippling it. Khan then calls Kirk and demands that Kirk turn himself and all data on Genesis. Kirk uses the time to come with a counter move which he executes. So while Khan repairs the Reliant, Kirk heads off to find the Genesis scientists.", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "1982", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Battle Butler: Joachim.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "real"
                ], 
                "role": "The supports of Khan in Star Trek II: The Wrath of Khan were Chippendale dancers in real life, which explains why they look like that.", 
                "id": "ChippendalesDancers"
            }, 
            {
                "adjectives": [
                    "former"
                ], 
                "role": "Star Trek II: The Wrath of Khan: Khan blamed Kirk for the death of his wife while his people were marooned. He expressed his bitterness enough to make it an overshadowing motivation. Despite his loathing for Kirk and all of Starfleet, he wears a Starfleet badge around his neck - because Marla McGivers was a former Starfleet officer.", 
                "id": "CrusadingWidower"
            }, 
            {
                "adjectives": [
                    "Badass/Wicked", 
                    "23rd"
                ], 
                "role": "Cultured Badass/Wicked Cultured: Apparently even in the 23rd century there will be villains that read and quote Herman Melville.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Disappeared Dad: Kirk knew about David, but kept his distance because of Carol's wishes.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "next"
                ], 
                "role": "Kirk's son, David Marcus was like this until the events of Star Trek II came about. David despises his dad for abandoning the family, but Kirk patches things up with him in the end. Then  David gets killed in the next film. Oh well.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice: Khan has a lot of really pretty boys in his crew. And he's not exactly hard on the eyes himself!", 
                "id": "MrFanservice"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "double", 
                    "motive", 
                    "original", 
                    "many", 
                    "unable", 
                    "due", 
                    "due", 
                    "bad", 
                    "ill"
                ], 
                "role": "Marla McGivers is given this role in Star Trek II. This served the double purpose of giving Khan a motive for vengeance against Kirk and eliminating her character. In the original episode she was introduced in she was not there solely to die, but died offscreen and before the action begins in the movies, and to many viewers who may not have seen that episode of TOS Khan's Dead Wife would only be a name and an implication. The meta reason this happened was that Madlyn Rhue was unable to reprise the role due due to her suffering from multiple sclerosis. This usually wouldn't stop Star Trek from using a character but Nicholas Meyer thought it would be in bad taste to recast a terminally ill actress.", 
                "id": "DisposableWoman"
            }
        ]
    }, 
    "imdbid": "tt0084726", 
    "poster_url": "StarTrekIITheWrathOfKhan.jpg", 
    "similar": [
        {
            "shared": [
                "BattleButler", 
                "DisappearedDad", 
                "CrusadingWidower", 
                "MrFanservice", 
                "ChippendalesDancers"
            ], 
            "shared_count": 5, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "BattleButler", 
                "CulturedBadass", 
                "DisposableWoman", 
                "MrFanservice"
            ], 
            "shared_count": 4, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "DisappearedDad", 
                "CrusadingWidower", 
                "MrFanservice"
            ], 
            "shared_count": 4, 
            "id": "Inception", 
            "name": "Inception", 
            "poster_url": "Inception.jpg"
        }, 
        {
            "shared": [
                "CrusadingWidower", 
                "DisposableWoman", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "TheFugitive", 
            "name": "The Fugitive", 
            "poster_url": "TheFugitive.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CrusadingWidower", 
                "DisposableWoman"
            ], 
            "shared_count": 3, 
            "id": "StarTrek", 
            "name": "Star Trek", 
            "poster_url": "StarTrek.jpg"
        }
    ], 
    "id": "StarTrekIITheWrathOfKhan", 
    "name": "Star Trek II: The Wrath of Khan"
}