{
    "plot": "In 1928, in Egypt, a strange device is found by an expedition. In the present days, the outcast linguist Dr. Daniel Jackson is invited by a mysterious woman to decipher an ancient hieroglyph in a military facility. Soon he finds that the device was developed by an advanced civilization and opens a portal to teletransport to another planet. Dr. Jackson is invited to join a military team under the command of Colonel Jonathan 'Jack' O'Neil that will explore the new world. They find a land that recalls Egypt and humans in a primitive culture that worship and are slaves to Ra, the God of the Sun. But soon they discover the secret of the mysterious \"stargate\".", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Absent-Minded"
                ], 
                "role": "Absent-Minded Professor: Daniel.", 
                "id": "AbsentMindedProfessor"
            }, 
            {
                "adjectives": [
                    "nearby"
                ], 
                "role": "Dr. Daniel Jackson in Stargate. He sets a cup of coffee on the edge of a staircase he's walking by, leaves papers scattered everywhere, writes on whatever is nearby...", 
                "id": "AbsentMindedProfessor"
            }, 
            {
                "adjectives": [
                    "Bishōnen"
                ], 
                "role": "Bishōnen: Ra. (Which led to some Viewer Gender Confusion.)", 
                "id": "Bishonen"
            }, 
            {
                "adjectives": [
                    "Brought-out-of-retirement", 
                    "'that", 
                    "military", 
                    "wrong", 
                    "new", 
                    "suicide"
                ], 
                "role": "Brought-out-of-retirement Jack in the Stargate movie started out as this trope, especially to the kids of Abydos. As well as the Death Seeker with some Knight Templar and 'that military guy who always follows his orders even if they're wrong'...they got a new actor and changed his character a lot for the show. Apparently Daniel gave him an epiphany.\n Yeah...jut look at season one or two Jack and go, \"there's a guy who tried to commit suicide by nuke a couple years ago.\" Break your brain.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "same", 
                    "delicate", 
                    "make-up", 
                    "heavy", 
                    "creepy"
                ], 
                "role": "Ra in Stargate is supposedly the same entity as the Egyptian god of the Sun. He has very delicate feminine features and wears make-up, including heavy eye-lines. His voice is disturbing and he's creepy as hell.", 
                "id": "PrettyBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "gorgeous", 
                    "first", 
                    "whole", 
                    "human", 
                    "ancient", 
                    "other", 
                    "two-bit"
                ], 
                "role": "In the film Stargate, Daniel Jackson ends up with a gorgeous human from another planet for a wife. She's also intelligent and feisty, and affects the plot by rallying her people to drive off the alien overlords. However, in the first episode of the series Stargate SG-1, she gets captured as a host for the Big Bad aliens, setting Daniel's motivation as finding a way to rescue her. But over the course of the series he attracts flocks of alien babes, and in the midst of not refusing their attentions he never seems to remember his wedding vows. To make it worse, when the writers finally remember that he has a wife waiting for him, they spend one whole episode detailing how he finds her and she dies. Now that his motivation is gone, does Daniel quit the team? For about five minutes.\n She was not an alien. She was a human descended from a group of proto-Egyptians kidnapped thousands of years ago to serve as slaves for Ra. Also, who in their right mind would want to give up an amazing career studying living offshoots of ancient cultures on other planets to go back to a job where EVERY SINGLE PERSON in academia thinks the character is a two-bit hack?", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [], 
                "role": "In the film Stargate Daniel Jackson gets married to the Abydos chief's daughter.", 
                "id": "TheChiefsDaughter"
            }, 
            {
                "adjectives": [
                    "old", 
                    "gon", 
                    "O'Neil", 
                    "O'Neil"
                ], 
                "role": "In Stargate, the old lady, Catherine, gives Daniel a trinket she found at the dig site, getting from him the promise that he'll bring it back to her. We all know this means he's not gonna die... but there's a slight twist at the end when he stays behind, but gives the trinket to O'Neil to return - and since O'Neil pretended that Daniel had died, it's sorta like this trope was averted, at least from the point of view of the characters on Earth.\n In Stargate SG-1, Daniel gets the trinket back when Catherine dies at the end of season 8.", 
                "id": "TheLadysFavour"
            }
        ]
    }, 
    "imdbid": "tt0111282", 
    "poster_url": "Stargate.jpg", 
    "similar": [
        {
            "shared": [
                "PrettyBoy", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisposableWoman", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "PrettyBoy", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "TheLordOfTheRings", 
            "name": "The Lord of the Rings", 
            "poster_url": "TheLordOfTheRings.jpg"
        }, 
        {
            "shared": [
                "DisposableWoman", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "TopGun", 
            "name": "Top Gun", 
            "poster_url": "TopGun.jpg"
        }, 
        {
            "shared": [
                "DisposableWoman", 
                "PrettyBoy"
            ], 
            "shared_count": 2, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }
    ], 
    "id": "Stargate", 
    "name": "Stargate"
}