{
    "plot": "On the day of James Kirk's birth, his father dies on his ship in a last stand against a mysterious alien time-traveling vessel looking for Ambassador Spock, who, in this time, is also a child on Vulcan disdained by his neighbors for his half-human heritage. Twenty-five years later, Kirk has grown into a young troublemaker. Challenged by Captain Christopher Pike to realize his potential in Starfleet, he comes to annoy instructors like young Commander Spock. Suddenly, there is an emergency at Vulcan and the newly commissioned USS Enterprise is crewed with promising cadets like Nyota Uhura, Hikaru Sulu, Pavel Chekov and even Kirk himself, thanks to Leonard McCoy's medical trickery. Together, this crew will have an adventure in the final frontier where the old legend is altered forever as a new version of it begins.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "father-figure"
                ], 
                "role": "A Father to His Men: Pike is something of a father-figure to Kirk.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "young", 
                    "willing"
                ], 
                "role": "In Star Trek, Captain Pike is practically young Jim Kirk's \"Well Done, Son\" Guy.\n And in Star Trek: The Original Series, Spock was willing to risk his life out of loyalty to Captain Pike.\n Even better - Spock ends up risking Kirk's life out of loyalty to Captain Pike. Now that's something.\n In the sequel, Big Bad John Harrison is this, as part of his motivation is to save his crew. He even calls them his family", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "Spock-Prime"
                ], 
                "role": "Spock-Prime gets one when he bails Kirk out on the ice planet Delta Vega.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [], 
                "role": "Bash Brothers: When Kirk and Spock beam onto the Narada and start shooting up everything in sight.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [], 
                "role": "The 2009 Star Trek Film, when Kirk and Spock beam onto the Narada and start shooting up everything in sight.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "pushy"
                ], 
                "role": "Jim Kirk in the reboot Star Trek franchise may flirt with any women he sees but he is never overly pushy with them. He also treats Uhura, Spock's girlfriend, respectfully and even apologizes to her when there was a moment he was frustrated with Spock.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Spock Prime Captain Pike definitely qualifies.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "recent"
                ], 
                "role": "Spock Prime. from the most recent Star Trek movie. Also Captain Pike.\n Scotty, who's at least 10-15 years older than most of the crew onboard Enterprise.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "due"
                ], 
                "role": "Crusading Widower: Nero carries out his plot due to believing that the Federation let Romulus be destroyed, killing pretty much everyone he loved in the process.", 
                "id": "CrusadingWidower"
            }, 
            {
                "adjectives": [
                    "old", 
                    "new/different/whatever"
                ], 
                "role": "The 2009 Star Trek had Nero, who lost his family and planet in the old timeline, and is out for revenge in the new/different/whatever one.", 
                "id": "CrusadingWidower"
            }, 
            {
                "adjectives": [
                    "awesome"
                ], 
                "role": "Disappeared Dad: Kirk's father dies in an extremely awesome Heroic Sacrifice.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Dude: Pike", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "whole", 
                    "willing"
                ], 
                "role": "In Star Trek, George Kirk is quite fetching. Plus, he has that whole Heroic Sacrifice thing going for him, being willing to give his life for his wife, newborn son, and crew.\n Leonard \"Bones\" McCoy.", 
                "id": "HotDad"
            }, 
            {
                "adjectives": [
                    "general"
                ], 
                "role": "The scene with Uhura undressing while Kirk hides under the bed, and Kirk's general clotheslessness in same. Strangely though Kirk manages to avoid ripping his shirt.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [], 
                "role": "In Star Trek, Kirk is the Hunter, determined to prove himself. Spock's the Lord, being buffeted between his human and Vulcan nature. And McCoy is the Prophet, as the oldest of the three.", 
                "id": "TheThreeFacesOfAdam"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "clear", 
                    "original", 
                    "subsequent"
                ], 
                "role": "Star Trek: Despite having been a clear Bridge Bunny in the original TV series (and subsequent movies), Uhura in the 2009 reboot of Star Trek is portrayed as smart, competent, and an aversion to this trope.", 
                "id": "BridgeBunnies"
            }, 
            {
                "adjectives": [
                    "other", 
                    "likely"
                ], 
                "role": "Victoria Kati Ahart starts out as one in the Star Trek fanfic Safe and Sound, being one of Khan's followers and all, but she gets better as the story goes on. By extension the other woman follower, Cleopatra Suzette Ling, is most likely one too, but doesn't get the chance to show off her skills like Victoria does.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "Disposable", 
                    "Straight"
                ], 
                "role": "Disposable Woman: Straight example:  Amanda, Spock's mother, died just to twist the knife of angst deeper for Spock.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "emotional"
                ], 
                "role": "In the 2009 Star Trek film, Spock's mother (along with his entire planet; but losing his mother seems to hit him harder) is killed off to cause him emotional trauma and contribute to his character development.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "Green-Skinned"
                ], 
                "role": "Green-Skinned Space Babe: Gaila, Uhura's Orion roommate, another Continuity Nod.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "other", 
                    "appeared"
                ], 
                "role": "Star Trek (2009). Kirk appears in bed with Uhura's roommate, an Orion girl named Gaila, who has been told off by Uhura before about bringing men back to their quarters. At least one other appeared in the film.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "Disposable"
                ], 
                "role": "Missing Mom: Spock's mother is a Disposable Woman who dies nanoseconds before being beamed to safety aboard the Enterprise... and that way lay \"emotionally compromised\".", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "birth"
                ], 
                "role": "In the Star Trek fanfic Written in the Stars, Fem!Kirk's Prime counterpart remained on duty as Captain throughout her pregnancy, and then gave birth in the middle of a battle against the Klingons. Damn.", 
                "id": "PregnantBadass"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Uhura", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0796366", 
    "poster_url": "StarTrek.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "CoolOldGuy", 
                "HotDad", 
                "BashBrothers", 
                "DarkActionGirl", 
                "TheThreeFacesOfAdam", 
                "AFatherToHisMen", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "MissingMom", 
                "DisappearedDad", 
                "BadassGrandpa", 
                "ShirtlessScene", 
                "BashBrothers"
            ], 
            "shared_count": 5, 
            "id": "TheBoondockSaints", 
            "name": "The Boondock Saints", 
            "poster_url": "TheBoondockSaints.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "GreenSkinnedSpaceBabe", 
                "CoolOldGuy", 
                "DarkActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "Ben10", 
            "name": "Ben 10"
        }, 
        {
            "shared": [
                "MissingMom", 
                "DisposableWoman", 
                "PregnantBadass", 
                "HotDad", 
                "BashBrothers"
            ], 
            "shared_count": 5, 
            "id": "PacificRim", 
            "name": "Pacific Rim", 
            "poster_url": "PacificRim.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "ShirtlessScene", 
                "CoolOldGuy", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "StarTrek", 
    "name": "Star Trek"
}