{
    "plot": "The passage from this world to the fantasy kingdom of Stormhold is through a breach in a wall beside an English village. In the 1800s, a boy becomes a man when he ventures through the breach in pursuit of a fallen star, to prove his love for the village beauty. The star is no lump of rock, it's a maiden, Yvaine. Tristan, the youth, is not the only one looking for her: three witches, led by Lamia, want her heart to make them young; and, the sons of the dead king of Stormhold want her because she holds a ruby that will give one of them title to the throne. Assisting Tristan are his mother, the victim of a spell, and a transvestite pirate of the skies. Will Tristan win his true love?", 
    "genres": "Adventure, Family, Fantasy", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Badass Grandpa: The old man guarding the Wall apparently has had a lot of time to practice (having been there for 80 years).", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [], 
                "role": "Camp Gay: Captain Shakespeare of the Caspartine", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: Humphrey.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [], 
                "role": "Macho Camp: Captain Shakespeare.", 
                "id": "MachoCamp"
            }, 
            {
                "adjectives": [
                    "private", 
                    "much", 
                    "undeniable", 
                    "competent"
                ], 
                "role": "Stardust has Captain Shakespeare, hiding inside a Transparent Closet. Granted, in private he's very much a Camp Gay, but it's undeniable that he's Badass and a very competent pirate.", 
                "id": "MachoCamp"
            }, 
            {
                "adjectives": [], 
                "role": "Evil Prince: Septimus.", 
                "id": "TheEvilPrince"
            }, 
            {
                "adjectives": [
                    "evil"
                ], 
                "role": "Stardust has a bunch of evil princes; most notably Septimus.", 
                "id": "TheEvilPrince"
            }, 
            {
                "adjectives": [], 
                "role": "Walking Shirtless Scene: Primus, considering he's murdered while in the bath - and ghosts stay the way they were when they died.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "male", 
                    "same", 
                    "competent", 
                    "heroic"
                ], 
                "role": "Tristan in Stardust is a male example, as he gets a makeover in the mundane sense from the Camp Gay Captain Shakespeare. At the same time, he becomes a more competent and heroic character.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "sweet", 
                    "evil", 
                    "surrounded", 
                    "vindictive", 
                    "later", 
                    "vindictive", 
                    "shrewd", 
                    "other", 
                    "such"
                ], 
                "role": "In the movie Stardust all the princes (save one) are evil, but their sister the princess is as sweet as can be. The book avoided this. She wasn't exactly evil, but growing up surrounded by vindictive princes and later a vindictive witch made her very shrewd and cold-hearted. In both versions, she is the hero's mother. Possibly justified in that the princes were expected to kill each other off until there was only one left to inherit the throne. Since girls couldn't rule the kingdom, there was no reason for the princess to be involved in such scheming. Yvaine also bypasses princess and  goes straight to Queen when she marries Tristan.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "deflate", 
                    "much"
                ], 
                "role": "Gag Boobs: Lamia's breasts suddenly deflate after she uses too much magic.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "duh"
                ], 
                "role": "Lady of Black Magic: Lamia, well duh.", 
                "id": "LadyOfBlackMagic"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Stardust: Tristan Thorn's mother is missing. She's a Damsel in Distress on the other side of the wall. She is a rare example of the type of Missing Mom who is rescued and returns for the Happy Ending.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Victoria goes from Spoiled Sweet in the book to a Spoiled Brat (or Rich Bitch)", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "youthful", 
                    "main", 
                    "magic"
                ], 
                "role": "In Stardust, the witches' motivation for cutting out the Star's heart is to regain youth permanently and to a notably lesser extent, to become more powerful. There is a Lampshade Hanging on the trope, as the witch assigned to catch the star keeps using magic to keep a youthful appearance, and even though her sisters also desire youth, they scold her for wasting it. There's even a scene where the main witch notices something on her face and uses magic to remove it... and one of her boobs immediately sags. She fixes it with another spell.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [], 
                "role": "Vain Sorceress: Lamia and her sisters' motivation.", 
                "id": "VainSorceress"
            }
        ]
    }, 
    "imdbid": "tt0486655", 
    "poster_url": "Stardust.jpg", 
    "similar": [
        {
            "shared": [
                "MachoCamp", 
                "WalkingShirtlessScene", 
                "CampGay", 
                "SpoiledSweet", 
                "EverythingsBetterWithPrincesses", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "LadyOfBlackMagic", 
                "VainSorceress", 
                "EverythingsBetterWithPrincesses", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "SnowWhiteATaleOfTerror", 
            "name": "Snow White: A Tale of Terror", 
            "poster_url": "SnowWhiteATaleOfTerror.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "WalkingShirtlessScene", 
                "EverythingsBetterWithPrincesses", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "TheEvilPrince", 
                "VainSorceress", 
                "EverythingsBetterWithPrincesses", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "SnowWhiteAndTheSevenDwarfs", 
            "name": "Snow White and the Seven Dwarfs"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "EverythingsBetterWithPrincesses", 
                "AdrenalineMakeover", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Tarzan", 
            "name": "Tarzan", 
            "poster_url": "Tarzan.jpg"
        }
    ], 
    "id": "Stardust", 
    "name": "Stardust"
}