{
    "plot": "In the distant future high school kids are encouraged to become citizens by joining the military. What they don't know is that they'll soon be engaged in a full scale war against a planet of alien insects. The fight is on to ensure the safety of humanity.", 
    "genres": "Action, Sci-Fi", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "In Starship Troopers LT Raschyk demands the best, and gives the best (it's implied the \"beer and entertainment\" isn't something most platoons receive).", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "blink-and-you-miss-it", 
                    "new", 
                    "young", 
                    "inevitable", 
                    "acceptable"
                ], 
                "role": "Child Soldiers: In a blink-and-you-miss-it scene, we're shown Rico's new troops. They're all teenagers, some of them look as young as 14 years old. They're not shown again for the rest of the movie, presumably because showing the inevitable outcome wouldn't be acceptable.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "basic", 
                    "capable", 
                    "such"
                ], 
                "role": "Career Sergeant Zim in the movie version of Starship Troopers, arguably to the point of exaggeration. Nastier than most as during basic training he callously broke one recruit's arm and pinned another one's hand to a wall with a throwing knife. The reason he could get away with it is because the medics of the era are apparently capable of patching up such injuries completely without leaving so much as a scar. (The book version differs; see below.)", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [], 
                "role": "Drill Sergeant Nasty: Career Sergeant Zim, to the point of exaggeration. He casually breaks recruits' arms and throws knives into their hands as part of their training.", 
                "id": "DrillSergeantNasty"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "third", 
                    "only", 
                    "survive", 
                    "crash-landed"
                ], 
                "role": "At the end of the third film, Lola and Holly are the only ones who survive from the group that crash-landed on the planet.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "white", 
                    "general"
                ], 
                "role": "Appears in the Paul Verhoeven Starship Troopers film. Sky Marshal Dienes, a middle aged white male, is replaced by Sky Marshal Tahat Meru, a Hawaiian. Her attitude and general demeanour speaks to this trope.", 
                "id": "BlackBossLady"
            }, 
            {
                "adjectives": [], 
                "role": "Holly gets Covered in Gunge in Marauder. All of her except her head, so her face and hair remain clean.", 
                "id": "BridgeBunnies"
            }, 
            {
                "adjectives": [
                    "third", 
                    "such", 
                    "inspirational"
                ], 
                "role": "Sky Marshall Omar Anoke (of all people) from the third Starship Troopers movie is a rare male example. As such, he depends more on inspirational rhetoric than sex appeal but still fulfills his role in the Propaganda Machine perfectly.", 
                "id": "GlamorousWartimeSinger"
            }, 
            {
                "adjectives": [
                    "female", 
                    "sexual"
                ], 
                "role": "Starship Troopers has a scene where the all the Roughnecks (male and female) are taking a shower naked with no signs of sexual arousal or interest whatsoever.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "Self-Made", 
                    "close", 
                    "own", 
                    "military"
                ], 
                "role": "Never a Self-Made Woman: Zigzagged; Dizzy joins the infantry just to be close to Johnny, but Carmen's desire to become a Fleet pilot is entirely her own and motivates Johnny to join the military.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "second", 
                    "only", 
                    "alive"
                ], 
                "role": "At the end of the second film, Sahara is the only soldier from the outpost who makes it out alive, with Dax opting for a Heroic Sacrifice and others having been killed by Dax and Sahara after they were infected with the Control Bug.", 
                "id": "PregnantBadass"
            }, 
            {
                "adjectives": [
                    "female", 
                    "rough", 
                    "male"
                ], 
                "role": "Dizzy Flores from Starship Troopers the toughest female character in the movie, she can beat most men in armed combat and arm wrestling, loves playing rough sports, enjoys drinking with her male friends, and engages in sex with Johnny Rico.", 
                "id": "TheLadette"
            }
        ]
    }, 
    "imdbid": "tt0120201", 
    "poster_url": "StarshipTroopers.jpg", 
    "similar": [
        {
            "shared": [
                "GlamorousWartimeSinger", 
                "ActionGirl", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "ActionGirl", 
                "InnocentFanserviceGirl"
            ], 
            "shared_count": 3, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "ChildSoldiers", 
                "AFatherToHisMen"
            ], 
            "shared_count": 3, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "ChildSoldiers", 
                "AFatherToHisMen"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "PregnantBadass", 
                "ActionGirl", 
                "AFatherToHisMen"
            ], 
            "shared_count": 3, 
            "id": "Dune", 
            "name": "Dune", 
            "poster_url": "Dune.jpg"
        }
    ], 
    "id": "StarshipTroopers", 
    "name": "Starship Troopers"
}