{
    "plot": "When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis. With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one-man weapon of mass destruction. As our heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "In the sequel, Big Bad John Harrison is this, as part of his motivation is to save his crew. He even calls them his family", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [], 
                "role": "Badass Baritone: Benedict Cumberbatch's \"John Harrison\" delivers Badass Boasts in a deep, bass voice.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [], 
                "role": "Star Trek Into Darkness: Benedict Cumberbatch's John Harrison delivers Badass Boasts in a deep, chilling bass voice.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [
                    "dead"
                ], 
                "role": "Papa Wolf: Weirdly enough, Harrison. He's completely bent on recovering and protecting the rest of his people, and his Roaring Rampage of Revenge is mostly because he thinks they're all dead  (twice). He even refers to them as his family - see Even Evil Has Loved Ones.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "fic"
                ], 
                "role": "Lucille Harewood, the girl shown at the beginning of Star Trek Into Darkness, becomes this in the fic Safe and Sound, after Khan's blood turns her into an augment. Although because she's still only eight, she does need a bit of help on occasion.", 
                "id": "ExtraordinarilyEmpoweredGirl"
            }, 
            {
                "adjectives": [
                    "implied", 
                    "Sharp-eyed"
                ], 
                "role": "Averted in Star Trek Into Darkness, this time with Kirk actually ending up with an implied threesome with two alien cat girls.\n Sharp-eyed viewers can spot an Orion woman in the crowd in San Fransisco.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "Green-Skinned", 
                    "implied", 
                    "Sharp-eyed"
                ], 
                "role": "Green-Skinned Space Babe: Averted this time with Kirk actually ending up with an implied threesome with two alien cat girls. Sharp-eyed viewers can spot an Orion woman in the crowd in San Fransisco.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "complete", 
                    "extra"
                ], 
                "role": "In Star Trek Into Darkness, we have Dr. Carol Marcus complete with a Lingerie Scene for extra fanservice.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "Hot", 
                    "notable"
                ], 
                "role": "Ms. Fanservice: Hot Scientist Carol Marcus played by Hello, Nurse! actress Alice Eve. This definitely plays out in one notable scene.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt1408101", 
    "poster_url": "StarTrekIntoDarkness.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "GreenSkinnedSpaceBabe", 
                "HotScientist", 
                "BadassBaritone"
            ], 
            "shared_count": 4, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "HotScientist", 
                "BadassBaritone", 
                "AFatherToHisMen"
            ], 
            "shared_count": 3, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MsFanservice", 
                "HotScientist"
            ], 
            "shared_count": 3, 
            "id": "JohnCarter", 
            "name": "John Carter", 
            "poster_url": "JohnCarter.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HotScientist", 
                "BadassBaritone"
            ], 
            "shared_count": 3, 
            "id": "PacificRim", 
            "name": "Pacific Rim", 
            "poster_url": "PacificRim.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }
    ], 
    "id": "StarTrekIntoDarkness", 
    "name": "Star Trek Into Darkness"
}