{
    "plot": "As the Clone Wars sweep through the galaxy, the heroic Jedi Knights struggle to maintain order and restore peace. More and more systems are falling prey to the forces of the dark side as the Galactic Republic slips further and further under the sway of the Separatists and their never-ending droid army. Anakin Skywalker and his Padawan learner Ahsoka Tano find themselves on a mission with far-reaching consequences, one that brings them face-to-face with crime lord Jabba the Hutt. But Count Dooku and his sinister agents, including the nefarious Asajj Ventress, will stop at nothing to ensure that Anakin and Ahsoka fail at their quest. Meanwhile, on the front lines of the Clone Wars, Obi-Wan Kenobi and Master Yoda lead the massive clone army in a valiant effort to resist the forces of the dark side ...", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "such", 
                    "accelerated", 
                    "young"
                ], 
                "role": "Jedi Padawans such as Ahsoka Tano of Star Wars: The Clone Wars could very much be considered this. Ahsoka is only fourteen or fifteen and yet leads troops into battle and gets into the thick of the fighting herself. Their talent with the force and training from childhood makes even the Padawans very deadly warriors.\n When Kamino comes under attack, the clone cadets take up arms to defend their home. Thanks to their accelerated growth, they're about as half as young as they look.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "later", 
                    "romantic", 
                    "mite"
                ], 
                "role": "Not at all repressed, but Ziro the Hutt of Star Wars: The Clone Wars was apparently a Camp Gay gangster/nightclub owner, at least until a later story arc revealed his romantic relationship with Femme Fatale Sy Snootles, making him Camp Straight. However, Hutts being hermaphrodites, their definition of gay or straight may be a mite fuzzy in either case.", 
                "id": "Gayngster"
            }, 
            {
                "adjectives": [], 
                "role": "Boba Fett in Star Wars: The Clone Wars oh so very much. Eventually he becomes a leader of a group of older bounty hunters.", 
                "id": "YoungGun"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Star Wars: The Clone Wars features the Night Sisters of Dathomir.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [
                    "Padmé", 
                    "fifth", 
                    "final"
                ], 
                "role": "Star Wars: The Clone Wars: Padmé's relationship with Ahsoka seems to be like this.\n Ahsoka's relationship with the Jedi younglings in the Young Jedi story arc in the fifth and final season also seems to be like this, considering that she is their chaperone.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "'Magical", 
                    "similar", 
                    "own"
                ], 
                "role": "Star Wars: The Clone Wars has Asajj Ventress. The only reason she fought for the Separatists seemed to be her starving for Dooku's approval, her greatest fear is being left with nothing, and she gradually turned away from the Dark Side, after Dooku abandoned her. The 'Magical Girl' she's foiling is Ahsoka, a jedi padawan with similar approval seeking from her own master.", 
                "id": "DarkMagicalGirl"
            }, 
            {
                "adjectives": [
                    "full", 
                    "Twi'lek", 
                    "other", 
                    "Fanservice-y", 
                    "outright", 
                    "first", 
                    "blue", 
                    "bad"
                ], 
                "role": "Star Wars: The Clone Wars is full of them. The above mentioned Twi'lek females appear in practically every other episode, often wearing very Fanservice-y outfits, even if they're not outright club dancers or slaves. The two Ms. Fanservice characters, Aayla Secura and Su Lawquane, are both Twi'leks. Then there's Ahsoka Tano, a teenage Togruta who for the first two and half seasons was running around in a tiny tubetop, Assajj Ventress who just loves to show off her legs, and Luminara Unduli and her padawan Barriss Offee, who are literally Green Skinned Space Babes (though their outfits are much more concealing). Then there's senator Chu chi a blue skinned Pantoran diplomat, and her outfits aren't bad either.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "elaborate", 
                    "able", 
                    "green", 
                    "magical", 
                    "subtle", 
                    "such", 
                    "hulking", 
                    "nigh-unstoppable", 
                    "primal"
                ], 
                "role": "The Nightsister shaman and leader Mother Talzin from Star Wars: The Clone Wars wears a rather elaborate dress, her motivations and goals remained a secret, and while she's also able conjure green force lightning, or use magical Deflector Shields, she mainly uses more \"subtle\" techniques, such as transforming Savage Opress into a hulking, nigh-unstoppable avatar of primal anger, and torturing Count Dooku from millions of lightyears away with a Voodoo Doll. She also possesses Voice of the Legion.", 
                "id": "LadyOfBlackMagic"
            }, 
            {
                "adjectives": [], 
                "role": "Ahsoka kriffing Tano.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Ahsoka Tano from Star Wars: The Clone Wars.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Asajj Ventress in Star Wars: The Clone Wars.", 
                "id": "TheBaroness"
            }
        ]
    }, 
    "imdbid": "tt1185834", 
    "poster_url": "StarWarsTheCloneWars.jpg", 
    "similar": [
        {
            "shared": [
                "LittleMissBadass", 
                "TheBaroness", 
                "PluckyGirl", 
                "ChildSoldiers"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "LittleMissBadass", 
                "PluckyGirl", 
                "ChildSoldiers"
            ], 
            "shared_count": 3, 
            "id": "KickAss", 
            "name": "Kick-Ass", 
            "poster_url": "KickAss.jpg"
        }, 
        {
            "shared": [
                "TheBaroness", 
                "PluckyGirl", 
                "ChildSoldiers"
            ], 
            "shared_count": 3, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "LittleMissBadass", 
                "GreenSkinnedSpaceBabe", 
                "DarkMagicalGirl"
            ], 
            "shared_count": 3, 
            "id": "Ben10", 
            "name": "Ben 10"
        }, 
        {
            "shared": [
                "LittleMissBadass", 
                "AmazonBrigade"
            ], 
            "shared_count": 2, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }
    ], 
    "id": "StarWarsTheCloneWars", 
    "name": "Star Wars: The Clone Wars"
}