{
    "plot": "Loomis Crowley is testing the underground game Stay Alive with his friends Sarah and Rex. When the game is over, Loomis finds Rex and Sarah dead in their room, and he is pushed by a shadow from the staircase, breaking the banister and hanging the same way he died in the game. Loomis' sister, Emma, gives his game to his best friend, Hutch. They, and his friends Miller, Phineus with his sister October, Swink and Abigail play the game together. When Miller and Phineus die the same way they died in the game, the survivors disclose that the game is based on the life of the evil Countess Elizabeth Bathory. She was buried alive in the tower of her real state in the Geronge Plantation. With the police chasing them, and after the death of October, the survivors reach the house and try to find the corpse of the Countess to destroy her fiend.", 
    "genres": "Horror, Thriller", 
    "release_year": "2006", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Gamer Chick: October.", 
                "id": "GamerChick"
            }, 
            {
                "adjectives": [], 
                "role": "October in Stay Alive (2006).", 
                "id": "GamerChick"
            }, 
            {
                "adjectives": [
                    "single", 
                    "only", 
                    "fair", 
                    "effective", 
                    "last"
                ], 
                "role": "How about the mother of all idiot moves? When The Chick is alone with a single rose, one of the only things that can protect her from monsters, what does she do? Pick out all the petals while playing 'he loves me, he loves me not'. Moron. To be fair, it's shown that holding back a monster uses up the rose. Plucking the petals appears to make it less effective but makes the rose last longer.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0441796", 
    "poster_url": "StayAlive.jpg", 
    "similar": [
        {
            "shared": [
                "TheChick", 
                "GamerChick"
            ], 
            "shared_count": 2, 
            "id": "TheGamers", 
            "name": "The Gamers", 
            "poster_url": "TheGamers.jpg"
        }, 
        {
            "shared": [
                "TheChick"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "TheChick"
            ], 
            "shared_count": 1, 
            "id": "BarbieAFashionFairytale", 
            "name": "Barbie A Fashion Fairytale"
        }, 
        {
            "shared": [
                "TheChick"
            ], 
            "shared_count": 1, 
            "id": "SweetHome", 
            "name": "Sweet Home"
        }, 
        {
            "shared": [
                "TheChick"
            ], 
            "shared_count": 1, 
            "id": "WomanInTheMoon", 
            "name": "Woman in the Moon", 
            "poster_url": "WomanInTheMoon.jpg"
        }
    ], 
    "id": "StayAlive", 
    "name": "Stay Alive"
}