{
    "plot": "The Knables are having marriage problems: Roy is a lousy plumbing supplies salesman by day and couch potato by night, and his wife, Helen, is a successful senior product manager for a vitamin company. Roy watches too much TV every night and Helen just cannot stand it. Then one night, Helen offers Roy a night to save their relationship: a romantic getaway without phones, their children, and especially no TV. Unfortunately, when Roy's hooked on the big screen, there's no going back. This frustrates and angers her and Helen decides to smash the family console with one of Roy's trophies as a wake-up call to reality. A heartbroken-to-disoriented Roy then hears the doorbell and finds out that it's a mysterious salesman named Spike who offers him the \"ultimate getaway\" from all the hate, frustration, and failures: a new remote controller and a new state-of-the-art satellite TV. Roy accepts the new TV by signing a free trial contract not knowing that he just sold his soul to the devil himself. But later, Helen is both not impressed and steamed. After a fight outside, the \"dish\" activates. Roy and Helen try as hard as possible to escape, but it was too late for the force of gravity from the dish sucks them into the \"Cable Television World of Hell\" - all six hundred and sixty-six channels worth. Now they must survive through every episode of shows such as the game show \"You Can't Win\", the U.W.W.F. (Underworld Wrestling Federation) match, \"Northern Overexposure\", \"Driving Over Miss Daisy\" and a cartoon sequence called \"RoboCat\", \"Autopsies of the Rich and Famous\", \"Duane's Underworld\", \"HTV\", and \"Off With His Head\", all within 24 hours. If successful, they will return back to home, but if they fail, the devil keeps their souls forever. After they survived one day without harm, Roy gets sent back home while Spike hold Helen hostage. Now with the help of their children, Daryl, a communication whiz, and Diane, a fashion freak, Roy must re-enter the underworld of Hell Vision TV and save his wife, while keeping a distance from Spike. It is then that Roy will learn the hard way that there's more things in life than only a television. Like commitment. (Formerly written by Christopher Howell)", 
    "genres": "Comedy, Fantasy", 
    "release_year": "1992", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "previous"
                ], 
                "role": "Henpecked Husband: Murray Seidenbaum, a previous \"customer\".", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [], 
                "role": "Murray Seidenbaum in Stay Tuned.", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Extremely downplayed example. While Roy doesn't kick anyone's ass over it, he does express disgust towards Duane and Garf's fawning over his daughter, Diane (in a magazine).", 
                "id": "PapaWolf"
            }
        ]
    }, 
    "imdbid": "tt0105466", 
    "poster_url": "StayTuned.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "HenpeckedHusband"
            ], 
            "shared_count": 2, 
            "id": "WhiteFang", 
            "name": "White Fang", 
            "poster_url": "WhiteFang.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HenpeckedHusband"
            ], 
            "shared_count": 2, 
            "id": "BigBadWolves", 
            "name": "Big Bad Wolves", 
            "poster_url": "BigBadWolves.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "HenpeckedHusband"
            ], 
            "shared_count": 2, 
            "id": "Creepshow", 
            "name": "Creepshow", 
            "poster_url": "Creepshow.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }
    ], 
    "id": "StayTuned", 
    "name": "Stay Tuned"
}