{
    "plot": "Revolving around Truvy's Beauty Parlor in a small parish in modern-day Louisiana, STEEL MAGNOLIAS is the story of a close-knit circle of friends whose lives come together there. As the picture opens, we find Drum Eatenton shooting birds in the trees of his back yard in preparation for his daughter's wedding reception that afternoon. Shortly thereafter, M'Lynn and Shelby (Drum's wife and daughter) depart for Truvy's to get their hair done for the wedding. \"Just the sweetest thing,\" Annelle Depuy Desoto (who may or may not be married because her marriage may not be legal) is introduced to Truvy's customers as her new \"glamour technician.\" While in the chairs, the sour-tempered Ouiser Boudreaux shows up and entertains the assemblage with her barbs. It seems that the only one of the group who truly understands Ouiser is Clairee who is recently widowed and looking for a diversion. As she says, later in the picture, \"If you can't find anything good to say about anybody, come sit by me.\" Filled with humor and heartbreak, these \"Steel Magnolias\" make us laugh and cry as the realities of their lives in tiny Chiquapin Parish unfolds.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1989", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "several"
                ], 
                "role": "Fanservice Extra: Multiple male examples. The \"colour announcer\" scene... which just happened to be in a sports team's changing room, and thus meant the appearance of several naked men.", 
                "id": "FanserviceExtra"
            }
        ]
    }, 
    "imdbid": "tt0098384", 
    "poster_url": "SteelMagnolias.jpg", 
    "similar": [
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "StarTrekIIITheSearchForSpock", 
            "name": "Star Trek III: The Search for Spock", 
            "poster_url": "StarTrekIIITheSearchForSpock.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "ConanTheBarbarian2011", 
            "name": "Conan the Barbarian ", 
            "poster_url": "ConanTheBarbarian2011.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "JoeDirt", 
            "name": "Joe Dirt", 
            "poster_url": "JoeDirt.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "ClassOf1984", 
            "name": "Class Of", 
            "poster_url": "ClassOf1984.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "TheNuttyProfessor", 
            "name": "The Nutty Professor", 
            "poster_url": "TheNuttyProfessor.jpg"
        }
    ], 
    "id": "SteelMagnolias", 
    "name": "Steel Magnolias"
}