{
    "plot": "In Baltimore, the troublemaker and street dancer Tyler Gage lives with his foster parents in a lower class neighborhood. His best friends are Mac Carter and his little brother Skinny Carter and they used to hang around together, going to parties and stealing cars. After being expelled from a party, the trio breaks in the Maryland School of Arts and commits vandalism, destroying the stage. Tyler is arrested and sentenced to 200 hours of community service in the school and Director Gordon assigns him to help the janitor cleaning the place. One afternoon, the ballet dancer Nora Clark sees Tyler dancing in the parking area and when her partner Andrew has a strain and Tyler offers to help her in the choreography, she accepts the offer; they rehearsal and become close to each other while Tyler becomes friend of the students Miles Darby and Lucy Avila. When Andrew returns, Tyler that is known for quitting everything he starts gives up dancing and leaves Nora alone. After an incident, Tyler has to decide to follow his dream or return to his life of rebel loser.", 
    "genres": "Crime, Drama, Music", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Troubled, but Cute: Tyler Gage", 
                "id": "TroubledButCute"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Not so much in 3D; Natalie was Julian's sister AND she came to the Pirates to spy them. The misunderstanding is not being believed when she declared that she had defected for love.", 
                "id": "DefectingForLove"
            }, 
            {
                "adjectives": [], 
                "role": "Tom Boy: Andie West", 
                "id": "Tomboy"
            }
        ]
    }, 
    "imdbid": "tt0462590", 
    "poster_url": "StepUp.jpg", 
    "similar": [
        {
            "shared": [
                "Tomboy", 
                "TroubledButCute"
            ], 
            "shared_count": 2, 
            "id": "TheAviator", 
            "name": "The Aviator", 
            "poster_url": "TheAviator.jpg"
        }, 
        {
            "shared": [
                "Tomboy", 
                "TroubledButCute"
            ], 
            "shared_count": 2, 
            "id": "TheGirlWhoLeaptThroughTime", 
            "name": "The Girl Who Leapt Through Time", 
            "poster_url": "TheGirlWhoLeaptThroughTime.jpg"
        }, 
        {
            "shared": [
                "TroubledButCute"
            ], 
            "shared_count": 1, 
            "id": "Gunslinger", 
            "name": "Gunslinger", 
            "poster_url": "Gunslinger.gif"
        }, 
        {
            "shared": [
                "Tomboy"
            ], 
            "shared_count": 1, 
            "id": "ElDorado", 
            "name": "El Dorado", 
            "poster_url": "ElDorado.jpg"
        }, 
        {
            "shared": [
                "TroubledButCute"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "StepUp", 
    "name": "Step Up"
}