{
    "plot": "Bruno Anthony thinks he has the perfect plot to rid himself of his hated father and when he meets tennis player Guy Haines on a train, he thinks he's found the partner he needs to pull it off. His plan is relatively simple. Two strangers each agree to kill someone the other person wants disposed of. For example, Guy could kill his father and he could get rid of Guy's wife Miriam, freeing him to marry Anne Morton, the beautiful daughter of a U.S. Senator. Guy dismisses it all out of hand but but Bruno goes ahead with his half of the 'bargain' and disposes of Miriam. When Guy balks, Bruno makes it quite clear that he will plant evidence to implicate Guy in her murder if he doesn't get rid of his father. Guy had also made some unfortunate statements about Miriam after she had refused him a divorce. It all leads the police to believe Guy is responsible for the murder, forcing him to deal with Bruno's mad ravings.", 
    "genres": "Crime, Film-Noir, Thriller", 
    "release_year": "1951", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Absent-Minded"
                ], 
                "role": "Absent-Minded Professor: Collins, the drunken mathematician on the train. It's his forgetfulness that kills Guy's alibi.", 
                "id": "AbsentMindedProfessor"
            }, 
            {
                "adjectives": [], 
                "role": "The drunk mathematician in Strangers on a Train becomes a plot point—because of his forgetfulness, Guy is suspected of a murder he didn't commit.", 
                "id": "AbsentMindedProfessor"
            }, 
            {
                "adjectives": [
                    "unusual", 
                    "obessessive"
                ], 
                "role": "Bruno Antony, the villain from Strangers on a Train, has overtones of this trope, what with his unusual relationship to his mother and his obessessive attitude toward hero Guy Haines.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [], 
                "role": "Depraved Homosexual: If Bruno is gay he definitely fits this trope.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [], 
                "role": "Bruno Anthony, from Strangers on a Train, is another dark Hitchcock example.", 
                "id": "MommasBoy"
            }, 
            {
                "adjectives": [
                    "safe"
                ], 
                "role": "Bruno from Strangers on a Train, Brandon and Philip from Rope, Norman Bates from Psycho... it's safe to say that Alfred Hitchcock loved this trope.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Sissy Villain: Bruno", 
                "id": "SissyVillain"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Meganekko: Ann's younger sister, Barbara \"Babs\" Morton (played by Hitchcock's daughter Patricia).", 
                "id": "Meganekko"
            }
        ]
    }, 
    "imdbid": "tt0044079", 
    "poster_url": "StrangersOnATrain.jpg", 
    "similar": [
        {
            "shared": [
                "DepravedHomosexual", 
                "SissyVillain", 
                "MommasBoy"
            ], 
            "shared_count": 3, 
            "id": "NorthByNorthwest", 
            "name": "North by Northwest", 
            "poster_url": "NorthByNorthwest.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "SissyVillain", 
                "MommasBoy"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "MommasBoy", 
                "AbsentMindedProfessor"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "DepravedHomosexual", 
                "SissyVillain"
            ], 
            "shared_count": 2, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "SissyVillain"
            ], 
            "shared_count": 2, 
            "id": "BarbieInThePinkShoes", 
            "name": "Barbie In The Pink Shoes"
        }
    ], 
    "id": "StrangersOnATrain", 
    "name": "Strangers on a Train"
}