{
    "plot": "Shadoloo's leader, Vega (Bison in the English version), sponsors an unpublicized fighting tournament. Shotokan devotees Ryu and Ken revive their rivalry, while foolish former-Shotokan student Dan seeks revenge on Sagat, the man that killed his father. US Army Colonels Guile and Nash (AKA Charlie) attempt to stop Vega's ways, alongside countless other fighters fighting for their personal reasons. Did Ryu find the ultimate challenge? What happened to Nash? And what is the story behind the evil entity known as Gouki (Akuma in the English version)...?", 
    "genres": "Animation, Action, Fantasy", 
    "release_year": "1999", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Bodyguard Babes: While pretty much any member of the Bison Elite Guard (the Dolls) may qualify, Juni and Juli both serve this function in-game in the arcade mode of Alpha 3.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [], 
                "role": "Sakura Kasugano and Karin Kanzuki in Street Fighter Alpha. The storyline connecting them, and Karin herself, are Canon Immigrants from the Sakura Ganbaru! manga.", 
                "id": "SchoolgirlRival"
            }, 
            {
                "adjectives": [
                    "and/or"
                ], 
                "role": "Rose from Street Fighter Alpha is 5'10\" and her outfits always show off her legs and/or bust.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "old", 
                    "weird", 
                    "good"
                ], 
                "role": "Street Fighter Alpha 3 gives us Ingrid, a girl from the far future who talks like an old woman, weirds out someone as calm and collected as Rose (who actually refers to her as strange), and claims that  Bison stole her powers to create the Psycho Drive.\n Cammy \"Killer Bee\" White and the Dolls also come off as very weird, and there are REALLY good reasons for it. (Though Cammy manages to get better.)", 
                "id": "StrangeGirl"
            }
        ]
    }, 
    "imdbid": "tt0185708", 
    "similar": [
        {
            "shared": [
                "StrangeGirl", 
                "StatuesqueStunner"
            ], 
            "shared_count": 2, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "StrangeGirl", 
                "StatuesqueStunner"
            ], 
            "shared_count": 2, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "StatuesqueStunner"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "StatuesqueStunner"
            ], 
            "shared_count": 1, 
            "id": "ALeagueOfTheirOwn", 
            "name": "A League of Their Own", 
            "poster_url": "ALeagueOfTheirOwn.jpg"
        }, 
        {
            "shared": [
                "BodyguardBabes"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "StreetFighterAlpha", 
    "name": "Street Fighter Alpha"
}