{
    "plot": "Col. William Guile leads an army of soldiers into the country of Shadaloo to find traces to lead him to General M. Bison, who has captured many people including three missing soldiers. Among them is Carlos \"Charlie\" Blanka, in which Bison decides to turn into a hideous mutant. On the other hand, Chun Li is a reporter who seeks revenge against Bison for the death of her father years ago. Then two small time hustlers Ryu and Ken, are arrested along with Sagat, a powerful arms dealer and Vega for dealing of illegal weapons. Guile recruits them in order to find Bison's base. Now Guile, T. Hawk, Cammy, Ryu, Ken, Chun Li, Balrog and E. Honda have three days before Bison murders the hostages and takes over the world.", 
    "genres": "Action, Sci-Fi, Thriller", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Vega from the Street Fighter series.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [], 
                "role": "Amazon Chaser: Only briefly. When Chun-Li manages to get away after finding out Guile faked his death, he says \"what a woman\" in response to her being called crazy.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "beautiful", 
                    "narcissistic", 
                    "art◊", 
                    "pronounced", 
                    "other", 
                    "muscular"
                ], 
                "role": "Street Fighter:\n Vega, the Spanish ninja. It's even part of his character. Vega is a narcissist who believes his face to be extremely beautiful, and cannot stand the ugly. Part of it comes from traumatization as a child when his ugly father killed his beautiful mother. He also wears a mask, not to hide his identity, but to prevent his face from being scarred. Remy in Street Fighter III is even more of one (though he's not narcissistic like Vega).\n In the Alpha series, Ken becomes one of these, with long, flowing hair in a ponytail and a younger face (some pieces of art◊ for the game even show him with pronounced lips, a rarity for Street Fighter characters). However, the other games show him looking older and more muscular, with Perma Stubble.", 
                "id": "Bishonen"
            }, 
            {
                "adjectives": [
                    "ruffled", 
                    "polite", 
                    "sharp-dressed"
                ], 
                "role": "Pictured above: Dudley of the Street Fighter series defines this trope: you try kicking arse in a ruffled shirt and bowtie, and having tea whilst wearing gentlemen's sports gloves.\n Also, Eagle from Street Fighter. His batons are nothing to sneeze at, and he's also rather polite and sharp-dressed.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "good", 
                    "oppressive", 
                    "despite", 
                    "live"
                ], 
                "role": "Dumb Muscle: Zangief, to the point where he actually thought that Bison's group were the good guys, fighting against the evil, oppressive AN despite the fact that he knew Bison had taken hostages and was in the middle of ransoming them. And, of course, the scene with the TV, where he thinks changing the channel will make the exploding truck coming at them on live TV go away.", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [
                    "classic"
                ], 
                "role": "Dudley (and Eagle) — the classic Quintessential British Gentleman.", 
                "id": "QuintessentialBritishGentleman"
            }, 
            {
                "adjectives": [
                    "male", 
                    "British", 
                    "stereotypical", 
                    "British", 
                    "original", 
                    "similar", 
                    "much", 
                    "black", 
                    "curly", 
                    "stereotypical"
                ], 
                "role": "The Street Fighter series has two (of its three male British characters in the series; Birdie is more of a stereotypical British punk): Eagle from the the original Street Fighter, some ports of Street Fighter Alpha 3 and Capcom vs. SNK 2 is a man wearing a dress shirt and suspenders with a moustache who attacks with two clubs. Dudley from Street Fighter III wears a similar costume except with a bow tie and boxing gloves. He is very much like a mixture of Eagle and Balrog in that he is a gentlemanly Brit, but is also a black boxer. With his curly moustache and neat hair, he is definitely the more stereotypical of the two...and he can also somehow drink tea while wearing boxing gloves.", 
                "id": "QuintessentialBritishGentleman"
            }, 
            {
                "adjectives": [
                    "other", 
                    "archetypical"
                ], 
                "role": "Balrog (Mike Bison in Japan) and Birdie from Street Fighter play this straight. Dudley, on the other hand, is a subversion.\n While ethnically Thai, Sagat looks a LOT like a SBM in some official artworks and animated adaptations. Somewhat lampshaded in the English dub of Street Fighter IV, where Isaac Singleton Jr.'s voice work sounds a LOT like the archetypical Scary Black Man.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "former", 
                    "sensitive"
                ], 
                "role": "On the subject of Street Fighter, we have:\n Dudley and Balrog.\n Ken and Ryu. The former also plays the manly man to Sean's sensitive guy.\n Rufus and El Fuerte.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Twice for Ryu. When his shirt is ripped off by one of Sagat's lady followers before he fights Vega at the beginning and by himself when he fights Vega at the end.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "great", 
                    "traditional"
                ], 
                "role": "E. Honda and Rufus from the Street Fighter games. They're also Lightning Bruisers. Honda has moves which grant him great mobility, and Rufus is a bit more of a traditional Lightning Bruiser.", 
                "id": "StoutStrength"
            }, 
            {
                "adjectives": [
                    "face-protecting", 
                    "bad", 
                    "own"
                ], 
                "role": "Likewise, in Street Fighter, Ryu puts Vega off his game by holding his face-protecting metal mask in a furnace and leaving him with a burn on one cheek. Vega takes a bad landing on his own claw and dies shortly afterwards.", 
                "id": "TheFightingNarcissist"
            }, 
            {
                "adjectives": [
                    "sexy", 
                    "evil", 
                    "double", 
                    "iconic", 
                    "sure", 
                    "disturbing", 
                    "beautiful", 
                    "spare", 
                    "ever-loving", 
                    "bad", 
                    "quick", 
                    "face-protecting", 
                    "bad", 
                    "own"
                ], 
                "role": "Street Fighter's Vega/Balrog/Claw is the best example of this kind of character. Rich, sexy and evil beyond belief, he leads a double life of a nobleman by day and an assassin by night. In all of his battles he wears his iconic mask just to make sure nothing so much as scratches his perfect face. Not to mention he joined Shadaloo because he just really loves killing people. He has a disturbing fixation on both Chun-Li and Cammy, considering Chun-Li the perfect rival in beauty and technique, and because Cammy was made beautiful by Bison himself. The only reason he returns in IV is because he's looking for  the data on how to create spare bodies (AKA Seths) for Bison, which would theoretically allow him to live forever.\n This attitude backfires horribly for him in Street Fighter II: The Animated Movie, when he fights Chun-Li, who severely puts him off his game by just kicking the ever-loving shit out of his face. Things go from bad to worse for him pretty quick following that.\n Likewise, in Street Fighter, Ryu puts Vega off his game by holding his face-protecting metal mask in a furnace and leaving him with a burn on one cheek. Vega takes a bad landing on his own claw and dies shortly afterwards.", 
                "id": "TheFightingNarcissist"
            }, 
            {
                "adjectives": [
                    "prideful", 
                    "flashy"
                ], 
                "role": "Vega — the prideful, flashy matador.", 
                "id": "TheFightingNarcissist"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "few", 
                    "female", 
                    "muscular", 
                    "provide", 
                    "well-toned", 
                    "massive", 
                    "few", 
                    "such", 
                    "muscular", 
                    "modest", 
                    "and/or", 
                    "high", 
                    "solid", 
                    "muscular", 
                    "hard", 
                    "thong", 
                    "significant", 
                    "short"
                ], 
                "role": "Street Fighter has quite a few female characters that are very muscular and it doesn't seem to stop them from provide a lot of fanservice.\n Chun-li thanks to her legs which, [[depending on the game and official art, range from well-toned or massive pillars of muscle. Makes sense considering her fighting style is largely based on kicking. Her upper body is usually slender with a few exceptions such as in the Alpha series where she has muscular arms and abs. Most of her costumes are fairly modest but always designed to emphasize her legs either with tights and/or her of her dresses having waist high side slits.\n Cammy (usually) has slender build with solid muscular tone but it's hard to notice since the camera likes to take advantage of the fact that she fights in a thong leotard by focusing on her butt).\n As of Street Fighter IV, the likes of Ibuki and especially Makoto show off significant muscle definition along with dangerously short skirts in their schoolgirl uniforms.", 
                "id": "AmazonianBeauty"
            }, 
            {
                "adjectives": [
                    "martial", 
                    "instructor/master", 
                    "actual", 
                    "martial", 
                    "big"
                ], 
                "role": "In the Street Fighter 'verse there are two:\n The arcade version of Super Street Fighter IV portrays Chun-Li in this light towards Yun and Yang Lee. It should be noted that given the connections between Gen, Lee, Chun-Li's father, Chun-Li, and the Lee Bros. and the likening of a martial arts instructor/master to that of a father figure, Chun-Li is more or less their actual martial arts \"big sister\".\n Cammy can also be seen as this towards her fellow Dolls. Particularly, SSFIV has Cammy attempting to go all Sister Cub on newcomer Juri for savagely attacking and hospitalizing them, not to mention looking after a recovering Juni in her ending.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Estrogen Brigade: Invoked with Vega's female fans at the prize fight. One of them has a sign asking him to marry her, which she quickly discards after she sees Ryu.", 
                "id": "EstrogenBrigade"
            }, 
            {
                "adjectives": [], 
                "role": "Faux Action Girl: Bison accuses Chun-Li of being this,  but that was part of her plan.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [
                    "young"
                ], 
                "role": "Cammy and Rainbow Mika from the Street Fighter series have versions of this hairdo. While Cammy's braids seem to be there just to emphasize that she's young, Mika's twin tails seem to hint at her personality, which contrasts with her being one of the largest females, in more ways than one.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [
                    "possible", 
                    "Chun-Li", 
                    "effective", 
                    "particular", 
                    "crouch", 
                    "big"
                ], 
                "role": "Street Fighter\n The possible Trope Codifier: Chun-Li, pictured above.\n Strangely enough, she had some effective (and pretty hard) punches in both 2 and the Alpha games. It wasn't until 3 that her \"legs that took down an organization\" status really took hold, with most of her punches replaced by ineffective/silly looking chops or slaps. In particular, her crouch hard punch took a big hit.\n Elena from Street Fighter III takes it another step by not ever using her hands (being a Dance Battler and practitioner of Capoeira). She even throws with her legs.\n Newcomer Juri in Super Street Fighter IV, is a Tae Kwon Do prodigy. She even manages Ki Attacks with her feet. Her fierce punch command is also a kick.\n Blair Dame from Street Fighter EX.", 
                "id": "KickChick"
            }, 
            {
                "adjectives": [], 
                "role": "Rose from Street Fighter. Her standard outfit is an evening dress with pumps and a Scarf of Asskicking. It doesn't deter her in the slightest. (and in some Street Fighter IV ports, you can download even prettier dresses for her.)", 
                "id": "KickingAssInAllHerFinery"
            }, 
            {
                "adjectives": [
                    "creator/true", 
                    "god-like"
                ], 
                "role": "Ingrid of the Street Fighter series (though she debuted in Capcom Fighting Jam) definitely counts. It's implied that she is the creator/true owner of Bison's Psycho Power (and by extension, Rose's Soul Power) and she seems to be Immortal, with the power to Time Travel at her leisure. Supplemental materials for Street Fighter X Tekken also credits her as the creator of Pandora, the god-like object that everyone's fighting over.", 
                "id": "LittleMissAlmighty"
            }, 
            {
                "adjectives": [
                    "wealthy", 
                    "legitimate", 
                    "Sakura-focused", 
                    "comic", 
                    "last", 
                    "real", 
                    "martial"
                ], 
                "role": "Karin Kanzuki from Street Fighter. Despite being wealthy to extremes (she uses her wealth to try to cheat Sakura out of a legitimate competition in the Sakura-focused UDON comic mini-series and can casually arrive to a fight via helicopter), she is talented enough to last in a real fight using her family's martial arts.", 
                "id": "Ojou"
            }, 
            {
                "adjectives": [
                    "usual"
                ], 
                "role": "Street Fighter managed to get by for 21 years without, but finally gave in, featuring them in one of the stages of Street Fighter IV alongside the usual round indicator.", 
                "id": "PitGirls"
            }, 
            {
                "adjectives": [
                    "first", 
                    "non-fighting", 
                    "Hot-Blooded", 
                    "non-girlfriend", 
                    "little", 
                    "mere"
                ], 
                "role": "Chun Li. Oh my, Chun Li. The first Action Girl in fighting game history simply can't be less. Followed by Cammy White, \"Rainbow\" Mika Nanakawa, Sakura Kasugano, Karin Kanzuki, Elena, Ibuki, Maki Genryusai, Makoto, Rose, Ingrid...\n In regards to non-fighting female charas, Yun's Hot-Blooded \"non-girlfriend\" Houmei is this; considering how calm she is when around her, her little sister Shaomei might count too. Eliza Masters can be considered to be an Older and Wiser version: we don't see a lot of her but she's almost always smiling and patient, and the mere fact that she's Happily Married to a dude who's very often fighting out there implies that she's got quite the patience.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "female", 
                    "long", 
                    "and/or", 
                    "ridiculous"
                ], 
                "role": "Street Fighter\n Elena from Street Fighter III is the tallest female in the series at 6'0\", and wears next to nothing.\n Depending on the Artist, Chun-Li's long stems qualify her as well, and even her official height tends to fluctuate.\n Rose from Street Fighter Alpha is 5'10\" and her outfits always show off her legs and/or bust.\n Street Fighter IV's C. Viper is 5'9\", with a suit that shows off her cleavage to ridiculous levels.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "raven-haired"
                ], 
                "role": "Rose — the smoking hot, immaculately dressed, raven-haired latina beauty.", 
                "id": "TheFashionista"
            }, 
            {
                "adjectives": [
                    "tag-team", 
                    "short-haired", 
                    "straightforward", 
                    "tall"
                ], 
                "role": "In Street Fighter\n Rainbow Mika's tag-team partner is named yamato nadeshiko, and she's a short-haired brunette fighter.\n The most straightforward example is Hokuto from the Street Fighter EX continuity. She's calm, cool, very tall and pretty and the Onee-sama to her sister Nanase, as well as a Lady of War when she fights.", 
                "id": "YamatoNadeshiko"
            }
        ]
    }, 
    "imdbid": "tt0111301", 
    "poster_url": "StreetFighter.jpg", 
    "similar": [
        {
            "shared": [
                "AmazonChaser", 
                "KickingAssInAllHerFinery", 
                "ShirtlessScene", 
                "FauxActionGirl", 
                "YamatoNadeshiko", 
                "PluckyGirl"
            ], 
            "shared_count": 6, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "AmazonChaser", 
                "GirlishPigtails", 
                "KickingAssInAllHerFinery", 
                "SensitiveGuyAndManlyMan", 
                "CoolBigSis", 
                "PluckyGirl"
            ], 
            "shared_count": 6, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "TheFightingNarcissist", 
                "PluckyGirl", 
                "SensitiveGuyAndManlyMan", 
                "KickingAssInAllHerFinery"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "EstrogenBrigade", 
                "ShirtlessScene", 
                "SensitiveGuyAndManlyMan", 
                "KickingAssInAllHerFinery", 
                "ScaryBlackMan"
            ], 
            "shared_count": 5, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "TheFashionista", 
                "StatuesqueStunner", 
                "GirlishPigtails", 
                "PluckyGirl", 
                "Ojou"
            ], 
            "shared_count": 5, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }
    ], 
    "id": "StreetFighter", 
    "name": "Street Fighter"
}