{
    "plot": "St Trinians proudly continues to represent the unacceptable face of British education. When the new Minister of Education announces he will personally sort the place out he doesn't realise either the enormity of the task or that the headmistress is an old flame. The school is anyway threatened with closure by their bank; with the staff clearly a waste of space the girls realise the responsibility to save the day falls on them. Perhaps a painting popularised by Scarlett Johansson might be the way out?", 
    "genres": "Comedy", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "He-Man", 
                    "entire"
                ], 
                "role": "He-Man Woman Hater: In the 2009 film, an entire organization exists for hating women. Both Lord and Sir Piers Pomfrey's motivations are solely because of this as well.", 
                "id": "HeManWomanHater"
            }, 
            {
                "adjectives": [], 
                "role": "Captain Romney Carlton-Ricketts (Blue Murder at St. Trinian's)", 
                "id": "QuintessentialBritishGentleman"
            }, 
            {
                "adjectives": [
                    "Quintessential", 
                    "British"
                ], 
                "role": "Quintessential British Gentleman: Captain Romney Carlton-Ricketts in Blue Murder at St Trinian's, played by Terry-Thomas.", 
                "id": "QuintessentialBritishGentleman"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "fourth", 
                    "entire"
                ], 
                "role": "Amazon Brigade: The field hockey team. In the older movies, it would be the fourth formers. Can be applied to pretty much the entire group when they get going.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [], 
                "role": "The St Trinians' field hockey team.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [
                    "rapid-fire", 
                    "standard"
                ], 
                "role": "Beautiful All Along: In the 2007 film, Annabelle's rapid-fire montage of makeovers twists and subverts this trope before ending in a standard expression that puts her in Posh Totty territory.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "Catholic", 
                    "British"
                ], 
                "role": "Catholic Schoolgirls Rule: St. Trinian's isn't Catholic but the trope still applies (\"St. Trinian's Girl\" is the British name for this trope).", 
                "id": "CatholicSchoolGirlsRule"
            }, 
            {
                "adjectives": [
                    "certain", 
                    "fit", 
                    "other", 
                    "British", 
                    "legal"
                ], 
                "role": "After a certain age, girls in any of the incarnations of St Trinians fit this trope to a tee. Although it should be noted that this, like some of the other British examples listed on this page, features girls of 17 (the heavily sexualised Trinian's girls are Sixth Form students), and are therefore of legal age in Britain (Age of consent is 16 in the UK).", 
                "id": "FilleFatale"
            }, 
            {
                "adjectives": [], 
                "role": "Fille Fatale: The Posh Totties run a phone-sex operation.", 
                "id": "FilleFatale"
            }, 
            {
                "adjectives": [], 
                "role": "Little Miss Badass: The lower year girls.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Pirate Girl: Pirate Fritton from St Trinian's 2: The Legend of Fritton's Gold.  The entire school briefly borrows a pirate ship in order to get the proof Shakespeare was a girl.", 
                "id": "PirateGirl"
            }, 
            {
                "adjectives": [
                    "main", 
                    "several", 
                    "male", 
                    "male", 
                    "dead"
                ], 
                "role": "Sweet Polly Oliver: Half the main case of St. Trinian's 2 dress as guys to infiltrate a boy's school. Disturbingly, several of the girls look more convincing as guys than some of the male actors cast to play the male students, including one who comes off as a dead ringer for Leonardo DiCaprio, and another who is so handsome as a boy one of the St. Trinian's girls accidentally takes a shine to \"him\" before realising who she is.", 
                "id": "SweetPollyOliver"
            }
        ]
    }, 
    "imdbid": "tt0964587", 
    "poster_url": "StTrinians.jpg", 
    "similar": [
        {
            "shared": [
                "LittleMissBadass", 
                "AmazonBrigade", 
                "CatholicSchoolGirlsRule", 
                "HeManWomanHater"
            ], 
            "shared_count": 4, 
            "id": "KillBill", 
            "name": "Kill Bill", 
            "poster_url": "KillBill.jpg"
        }, 
        {
            "shared": [
                "AmazonBrigade", 
                "CatholicSchoolGirlsRule", 
                "SweetPollyOliver", 
                "PirateGirl"
            ], 
            "shared_count": 4, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "FilleFatale", 
                "CatholicSchoolGirlsRule"
            ], 
            "shared_count": 2, 
            "id": "Election", 
            "name": "Election", 
            "poster_url": "Election.jpg"
        }, 
        {
            "shared": [
                "FilleFatale", 
                "LittleMissBadass"
            ], 
            "shared_count": 2, 
            "id": "TheProfessional", 
            "name": "The Professional", 
            "poster_url": "TheProfessional.jpg"
        }, 
        {
            "shared": [
                "FilleFatale", 
                "CatholicSchoolGirlsRule"
            ], 
            "shared_count": 2, 
            "id": "Trainspotting", 
            "name": "Trainspotting", 
            "poster_url": "Trainspotting.jpg"
        }
    ], 
    "id": "StTrinians", 
    "name": "St. Trinian's"
}