{
    "plot": "N/A", 
    "genres": "Action", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "own", 
                    "such"
                ], 
                "role": "Super Sentai has its own share as well, such as Captain Marvelous and Joe Gibken.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "likely"
                ], 
                "role": "Super Sentai finally got around to using a samurai theme in 2009 with Samurai Sentai Shinkenger.\n Shinkenger inevietably got its American counterpart as Power Rangers Samurai; but even before then, Power Rangers Ninja Storm had a Green Samurai Ranger, even though the Sentai character he was based on was a ninja rather than a samurai.\n In Mighty Morphin' Power Rangers there was a Monster of the Week called the Samurai Fanman, who likely fit the Trope In Name Only.", 
                "id": "Samurai"
            }, 
            {
                "adjectives": [
                    "Several", 
                    "Don/Gai", 
                    "Marvelous/Joe"
                ], 
                "role": "Several Super Sentai shows had these:\n Choujin Sentai Jetman: Raita & Gai\n Gosei Sentai Dairanger: Daigo & Shouji\n Mirai Sentai Timeranger: Sion & Domon\n Juken Sentai Gekiranger: Ken & Gou\n Engine Sentai Go-onger: Hant & Gunpei\n Kaizoku Sentai Gokaiger (two of each): Don/Gai & Marvelous/Joe\n Ressha Sentai Tokkyuger: Tokkati and Hikari, respectively. Right is a mixture of both.", 
                "id": "SensitiveGuyAndManlyMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Female Yellow Rangers. If a team includes two females, the Female Yellow Ranger will usually be the Tomboy half of the Tomboy and Girly Girl.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "original", 
                    "Japanese", 
                    "forth", 
                    "first"
                ], 
                "role": "Speaking of original Japanese versions, Super Sentai started the practice with Choudenshi Bioman, but from then it swings back and forth between playing the trope straight and averting it (of the 28 seasons since then, 13 ran on The Smurfette Principle). Engine Sentai Go-onger played with this by starting off only with Saki Rouyama (Go-on Yellow), then introducing Miu Sutou (Go-on Silver), the first ever female Ranger with Sixth Ranger status.", 
                "id": "AffirmativeActionGirl"
            }, 
            {
                "adjectives": [
                    "whole", 
                    "fond"
                ], 
                "role": "Super Sentai as a whole is rather fond of this trope with Tsuruhime from Ninja Sentai Kakuranger,  Natsuki from GoGo Sentai Boukenger,  Kaoru from Samurai Sentai Shinkenger, and Ahim from Kaizoku Sentai Gokaiger.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "common", 
                    "male", 
                    "hot", 
                    "human", 
                    "monster-ness", 
                    "attractive", 
                    "few", 
                    "rare"
                ], 
                "role": "A common trope with Super Sentai and Power Rangers villainesses. The majority of villain teams are 3-4 male People in Rubber Suits and one hot (and very human) Dark Chick whose monster-ness clearly appears to be worn and not integral. Of Power Rangers series, every season has one except Zeo, Mystic Force, Samurai, and Megaforce - which all still have attractive female villainesses, just of the Rubber Suit variety.\n There were even a few Monsters of the Week who might qualify, including Madame Woe, but they tended to be rare.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "female", 
                    "Five-Man", 
                    "long", 
                    "last"
                ], 
                "role": "Super Sentai\n The only female in the Five-Man Band of Kyoryu Sentai Zyuranger is Princess Mei. The rest of them are titled are Warriors... well, except Geki, who is a Prince.\n Natsuki Mamiya from GoGo Sentai Boukenger is also a Princess of a Lost Civilization of Lemuria. Except that her kingdom's long gone, buried in the water.\n Kaizoku Sentai Gokaiger also has Princess Ahim de Famille, who's... actually the last survivor of her destroyed clan.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "various", 
                    "cute", 
                    "earth", 
                    "same", 
                    "willing", 
                    "appropriate", 
                    "willing", 
                    "close", 
                    "such", 
                    "formal", 
                    "polite"
                ], 
                "role": "Crops up in various Super Sentai series as well. Kotoha from Samurai Sentai Shinkenger is probably one of the best fits. A cute, retiring pollyanna who is associated with the earth element. Especially when contrasted with Shinken Pink Mako who leans more to the Lady of War. Power Rangers Samurai being a Shot for Shot Remake of Shinkenger means the same goes for Emily.\n While Ahim aka Gokai Pink from Kaizoku Sentai Gokaiger normally goes Guns Akimbo she is in her Gokaiger form, when untransformed she is just as willing to kick your ass when she feels appropriate and is quite willing to mix it up by getting in close when using Ranger keys with more close combat oriented powers such as Denzi Pink. And she happens to be the girliest Ranger in franchise history; a princess from a world destroyed by the villains pre-series, wearing a pink dress most of the time and being extremely formal and polite even when informing you that if you do not back off, asskicking shall commence.", 
                "id": "GirlyBruiser"
            }, 
            {
                "adjectives": [
                    "male", 
                    "major", 
                    "key"
                ], 
                "role": "Speaking of Super Sentai, in Zyuden Sentai Kyoryuger,  Candelila (assuming Luckyuro is male, at least) went through a series of Heel Realizations and epiphanies (with major key factors like Nobuharu/Kyoryu Blue having faith in her and Aigaron Taking the Bullet for her) towards the end of the series.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "male", 
                    "complete", 
                    "own", 
                    "special"
                ], 
                "role": "Super Sentai and Power Rangers usually have an episode a season where the male Rangers get into trouble and the girls become the episode's focus as they team up to bail them out.\n Tokusou Sentai Dekaranger's \"Twin Cam Angels,\" Jasmine and Umeko, become this in some episodes (complete with their own special end title.)\n Power Rangers RPM even named their girl-power episode \"The Dome Dolls\".", 
                "id": "LovelyAngels"
            }, 
            {
                "adjectives": [
                    "kid", 
                    "main", 
                    "racing-themed", 
                    "magical", 
                    "cat/car-based", 
                    "odd"
                ], 
                "role": "Even Super Sentai has an example. Gekisou Sentai Carranger, the parody series, had the kid sister of the series' main villainess transforming into White Racer, a racing-themed magical girl, to occasionally help out the heroes. Also, she had a cat/car-based mecha. Carranger was an odd year.", 
                "id": "MagicalGirl"
            }, 
            {
                "adjectives": [
                    "single", 
                    "other", 
                    "social", 
                    "female", 
                    "female", 
                    "single"
                ], 
                "role": "Any Super Sentai team where The Smurfette Principle is a tomboy technically qualifies, like Yuuri from Mirai Sentai Timeranger. Any Super Sentai with a single female member is pretty much this by default, since the team always hangs out together, she'll always be hanging out with 4 other guys. Occasionally she'll have a social life or at least another non hero female friend, but usually she won't. In comparison teams with 2 female members will often have the two girls hanging together more often than with the males. This often makes the two female members treated as a unit during their focus episodes meaning single heroines on the squad tend to get developed better.", 
                "id": "OneOfTheBoys"
            }, 
            {
                "adjectives": [
                    "Many", 
                    "'em", 
                    "different", 
                    "pair", 
                    "likely", 
                    "due", 
                    "perky"
                ], 
                "role": "Many Super Sentai series have one. Mele was preceded by Shizuka, who was preceded by Nai and Mea.\n The Power Rangers version has 'em, but in different characters. Mele and Shizuka become the femmes fatale Camille and Miratrix, and Necrolai doesn't turn into a pair of Perky Goths likely due to budget. However, Power Rangers Ninja Storm has Marah and Kapri, the Big Bad's perky evil teen nieces.", 
                "id": "PerkyFemaleMinion"
            }, 
            {
                "adjectives": [], 
                "role": "Super Sentai example: Miyuki, aka MagiMother from Mahou Sentai Magi Ranger. However, after she falls in battle, her daughter Urara takes her position.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [
                    "respective"
                ], 
                "role": "The Chick: Pink or White Rangers; usually the token female, or the Girly Girl half of the Tomboy and Girly Girl. The more developed examples may serve as The Heart of their respective teams.", 
                "id": "TheChick"
            }, 
            {
                "adjectives": [
                    "such", 
                    "Juri/Oh", 
                    "Mako/Shinken"
                ], 
                "role": "Some Super Sentai females have been this, such as Juri/Oh Yellow and Mako/Shinken Pink.", 
                "id": "TomboyWithAGirlyStreak"
            }, 
            {
                "adjectives": [
                    "mechanic", 
                    "tall", 
                    "long-haired", 
                    "anime", 
                    "example-in-training", 
                    "tall", 
                    "long-haired", 
                    "sweet", 
                    "male", 
                    "single", 
                    "guardian", 
                    "actual", 
                    "former", 
                    "busy", 
                    "Ren/Go-on", 
                    "male", 
                    "polite", 
                    "mature", 
                    "responsible", 
                    "call", 
                    "Naoki/Blue", 
                    "due", 
                    "comedic", 
                    "main", 
                    "domestic"
                ], 
                "role": "Swan Shiratori, Tokusou Sentai Dekaranger's mechanic, fits this description perfectly, though not being as tall or long-haired as most anime examples.\n The following season Mahou Sentai Magiranger yields a better example, Ozu Miyuki, literally the mother of the core 5 Rangers. Even her superhero identity is named MagiMother. MagiBlue, Urara is an example-in-training and tall, long-haired, sweet Team Dad Makito has elements of a male version.\n Juuken Sentai Gekiranger. Masashi Miki, a single mother of one and more of a guardian and mentor to the Rangers than the actual grandmaster ShaFu, was a former Sukeban delinquent in her teen years.\n Defied by Ran, whose mother wants her to become a yamato nadeshiko and to that end tries to arrange a marriage for her. After the Gekirangers spend the episode trying to foil this plan, Ran finally gives up and explains that she is too busy saving the world to get married.\n Explicitly stated as the dream of Mako in Samurai Sentai Shinkenger (she even has a character song about it!) but unfortunately her cooking skills leave a lot to be desired.\n Engine Sentai Go-onger has Ren/Go-on Blue, a male example: tall, polite, the most mature and responsible of the bunch, and the one who does all the team's cooking. His teammates even call him \"mother.\"\n Gekisou Sentai Carranger's Naoki/Blue Racer is a downplayed version due to the comedic nature of the show and the Jerk Ass behaviour of the main characters - but he has the modest, polite, calm and domestic side down perfectly.", 
                "id": "YamatoNadeshiko"
            }
        ]
    }, 
    "imdbid": "tt2210717", 
    "similar": [
        {
            "shared": [
                "HighHeelFaceTurn", 
                "TeamMom", 
                "TheChick", 
                "SensitiveGuyAndManlyMan", 
                "CuteMonsterGirl"
            ], 
            "shared_count": 5, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "TeamMom", 
                "TomboyWithAGirlyStreak", 
                "TheChick", 
                "GirlyBruiser"
            ], 
            "shared_count": 5, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "YamatoNadeshiko", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "SensitiveGuyAndManlyMan", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 4, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "SensitiveGuyAndManlyMan", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 4, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }
    ], 
    "id": "SuperSentai", 
    "name": "Super Sentai"
}