{
    "plot": "In Taeter City everything is managed by the iron fist of dictatorship members: THE AUTORITY. They use a special radio wave system called Zeed that lets them distinguish criminals from typical law abiding citizens. These special radio waves alter the demented brain of criminals, forcing them to commit suicide in horrible ways. A special police corps called The Biker's retrieves their corpses and delivers them to massive slaughterhouses. These supply the mega fast food chains with the human flesh products they need to feed the masses, non-stop. Here there are no criminals, no crimes, no riots, no crisis... until now. The Zeed system is no longer functioning the way it is supposed to: the criminals are no longer killing themselves; the radio waves are making them stronger! Follow the crazy mission of three Biker officers (Razor, Shock and Wank) charged with managing this chaotic situation. We give you: an 80's movie vibe, insane technology, manga style, crazy action, adrenaline, violence, blood, blood and again blood. A new Splatter Sci-Fi genre has risen!", 
    "genres": "Action, Horror, Sci-Fi", 
    "release_year": "2012", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Boobs of Steel — Razor has a lot of cleavage", 
                "id": "BoobsOfSteel"
            }
        ]
    }, 
    "imdbid": "tt2306836", 
    "similar": [
        {
            "shared": [
                "BoobsOfSteel"
            ], 
            "shared_count": 1, 
            "id": "DungeonsAndDragonsWrathOfTheDragonGod", 
            "name": "Dungeons & Dragons: Wrath of the Dragon God", 
            "poster_url": "DungeonsAndDragonsWrathOfTheDragonGod.jpg"
        }, 
        {
            "shared": [
                "BoobsOfSteel"
            ], 
            "shared_count": 1, 
            "id": "Pocahontas", 
            "name": "Pocahontas", 
            "poster_url": "Pocahontas.jpg"
        }, 
        {
            "shared": [
                "BoobsOfSteel"
            ], 
            "shared_count": 1, 
            "id": "RacketGirls", 
            "name": "Racket Girls", 
            "poster_url": "RacketGirls.jpg"
        }, 
        {
            "shared": [
                "BoobsOfSteel"
            ], 
            "shared_count": 1, 
            "id": "Comic8", 
            "name": "Comic 8"
        }, 
        {
            "shared": [
                "BoobsOfSteel"
            ], 
            "shared_count": 1, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "TaeterCity", 
    "name": "Taeter City"
}