{
    "plot": "Seventeen year-old Kim is the pride and joy of her father Bryan Mills. Bryan is a retired agent who left the Central Intelligence Agency to be near Kim in California. Kim lives with her mother Lenore and her wealthy stepfather Stuart. Kim manages to convince her reluctant father to allow her to travel to Paris with her friend Amanda. When the girls arrive in Paris they share a cab with a stranger named Peter, and Amanda lets it slip that they are alone in Paris. Using this information an Albanian gang of human traffickers kidnaps the girls. Kim barely has time to call her father and give him information. Her father gets to speak briefly to one of the kidnappers and he promises to kill the kidnappers if they do not let his daughter go free. The kidnapper wishes him \"good luck,\" so Bryan Mills travels to Paris to search for his daughter and her friend.", 
    "genres": "Action, Thriller", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old", 
                    "very"
                ], 
                "role": "Badass Grandpa: Well, Badass Dad if you want to get technical. It's never specified how old Bryan is, but Liam Neeson is pushing 60, and Bryan's age is mentioned to be a factor, but he can still waste a dozen villains half his age without breaking a sweat, and it's only near the very end of the movie that he starts visibly feeling the strain.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "young"
                ], 
                "role": "Dirty Coward: The young \"recruiter\" guy, Peter.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "first", 
                    "annoyed", 
                    "strict", 
                    "hand-to-hand", 
                    "long"
                ], 
                "role": "In the 2008 Liam Neeson film Taken, Neeson's character Bryan Mills comes across as this at first, with the rules he tries to impose for his daughter's safety. She's annoyed by them and thinks he's too strict, as does his ex-wife. Shortly after, he is proven right when he has to storm his way through the Paris Underworld to try and save his daughter from sex-traders. Mills, an ex-CIA agent, fights off thugs left and right with mostly hand-to-hand combat and even ties one of the unfortunate traders to a chair, sticks a long nail into each leg, hooks a jumper cable to each leg nail and to the house's wiring, and shocks him so he reveals who he and his group sold his daughter to. After the interrogation, he leaves him in the chair, to have volts and volts of electricity flow through his body until \"it is shut off for lack of payment on the bill.\" Mills did say that he would kill him after finding him, and kill him he did!", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "Overprotective"
                ], 
                "role": "Overprotective Dad: Heavily justified.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "other", 
                    "first"
                ], 
                "role": "Papa Wolf: All those other tropes on this page having \"Trope Name: The Movie\"? They're not. The first movie is Papa Wolf: The Movie.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "only", 
                    "boat"
                ], 
                "role": "Scary Black Man: He appears just long enough to get his ass completely kicked by Bryan. Also one of the mooks; he is the only mook on the boat to give Bryan any trouble.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "The Patriarch: Murad (the elder Albanian with a beard).", 
                "id": "ThePatriarch"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Poor Kim. After her ordeal, she'll never disobey her father again.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "Disposable", 
                    "whole"
                ], 
                "role": "Disposable Woman: The whole plot revolves around this; the reason Kim exists is so that she can be kidnapped, giving her father an excuse to show what a Badass he is.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "human", 
                    "give", 
                    "sympathetic", 
                    "first", 
                    "dead", 
                    "bad", 
                    "important"
                ], 
                "role": "This is the entire plot of Taken. The whole reason Kimmy exists is so that she can be kidnapped by a human trafficking ring and, by doing so, give her father a sympathetic excuse to prove what a Bad Ass he is.\n Also seen with Kimmy's friend Amanda. Her only roles are to encourage Kimmy to go in the first place and  to be found dead by Byran to show how the bad guys are monsters and thus how much more important it is for Bryan to find her ASAP.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "Rich", 
                    "good", 
                    "due", 
                    "bad", 
                    "spiteful", 
                    "manipulative", 
                    "unsuccessful", 
                    "new", 
                    "Abusive", 
                    "odd", 
                    "other", 
                    "likely", 
                    "aspiring-to-be-singer", 
                    "later", 
                    "lucrative", 
                    "vocal"
                ], 
                "role": "Rich Bitch: Lenore, Bryan's ex-wife. She has good reason for not liking Bryan, mainly that he wasn't around due to his career taking out very bad people in the CIA, but she winds up looking spiteful and manipulative instead. She repeatedly tries to distance her daughter from Bryan (thankfully unsuccessful) and flaunt the fact that her new husband is richer and can afford nicer things for Kim. This invokes Disproportionate Retribution when you consider the fact that the woman yells at Bryan for trying to give his daughter a gift on her birthday (an Abusive Parent might deserve that treatment, not a guy who simply worked odd hours). And then children of divorce often play one against the other, so their daughter likely played off the tension to get more out of both of them. Pop star Sheerah initially seems like this when, upon being asked by Bryan if she can give his aspiring-to-be-singer daughter any tips, she responds, \"Tell her to pick another career.\" It's later revealed after Bryan saves Sheerah from an attacker that she meant it as a warning, as a lucrative career in the music industry is \"not what everyone thinks it is\". She ends up giving the number of her vocal coach and her manager to Bryan when he simply responds, \"That's what she wants.\"", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "multi-millionare", 
                    "step-dad", 
                    "real", 
                    "step-dad"
                ], 
                "role": "Spoiled Sweet: Kimmy is certainly spoiled by her multi-millionare step-dad, but she doesn't short her real dad on some love and hugs at her birthday party (Her scream of joy at the step-dad's pony gift was louder, but she wasn't faking with the karaoke machine from Bryan). This is also in contrast to her mom trying to trivialize his presence.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0936501", 
    "poster_url": "Taken.jpg", 
    "similar": [
        {
            "shared": [
                "DirtyCoward", 
                "BadassGrandpa", 
                "DisposableWoman", 
                "ScaryBlackMan", 
                "RichBitch"
            ], 
            "shared_count": 5, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "SpoiledSweet", 
                "DamselInDistress", 
                "ScaryBlackMan"
            ], 
            "shared_count": 4, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "OverprotectiveDad", 
                "ScaryBlackMan", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "ToKillAMockingbird", 
            "name": "To Kill a Mockingbird", 
            "poster_url": "ToKillAMockingbird.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "BadassGrandpa", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "NextAvengersHeroesOfTomorrow", 
            "name": "Next Avengers: Heroes of Tomorrow"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "DisposableWoman", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "TheDarkKnight", 
            "name": "The Dark Knight", 
            "poster_url": "TheDarkKnight.jpg"
        }
    ], 
    "id": "Taken", 
    "name": "Taken"
}