{
    "plot": "After receiving the healing powers from a magical flower, the baby Princess Rapunzel is kidnapped from the palace in the middle of the night by Mother Gothel. Mother Gothel knows that the flower's magical powers are now growing within the golden hair of Rapunzel, and to stay young, she must lock Rapunzel in her hidden tower. Rapunzel is now a teenager and her hair has grown to a length of 70-feet. The beautiful Rapunzel has been in the tower her entire life, and she is curious of the outside world. One day, the bandit Flynn Ryder scales the tower and is taken captive by Rapunzel. Rapunzel strikes a deal with the charming thief to act as her guide to travel to the place where the floating lights come from that she has seen every year on her birthday. Rapunzel is about to have the most exciting and magnificent journey of her life.", 
    "genres": "Animation, Comedy, Family", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "alive", 
                    "infant"
                ], 
                "role": "Played with in Tangled. Rapunzel grew up thinking Mother Gothel is her only parent. In reality both of her parents are alive, but she was kidnapped as an infant and raised by her kidnaper.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "other", 
                    "able", 
                    "mortal", 
                    "would-be"
                ], 
                "role": "Distressed Dude: It's always Flynn who has to be rescued by Rapunzel, not the other way round. Even when Rapunzel gets Bound and Gagged toward the end of the film, she's able to save Flynn from his mortal knife wound by working off her gag and begging Mother Gothel to let her heal him, which gives Flynn a chance to pull off his would-be Heroic Sacrifice.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "other", 
                    "able", 
                    "mortal", 
                    "would-be"
                ], 
                "role": "In Tangled, it's always Flynn who has to be rescued by Rapunzel, not the other way round! Even when Rapunzel gets Bound and Gagged toward the end of the film, she's able to save Flynn from his mortal knife wound by working off her gag and begging Mother Gothel to let her heal him, which gives Flynn a chance to pull off his would-be Heroic Sacrifice.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [], 
                "role": "Flynn Rider from Tangled starts out as this.", 
                "id": "GentlemanThief"
            }, 
            {
                "adjectives": [
                    "white"
                ], 
                "role": "Knight In Shining Armour: Eugene gallantly races on the white Maximus over the bridge to rescue Princess Rapunzel.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [
                    "white", 
                    "visual", 
                    "symbolic", 
                    "selfish"
                ], 
                "role": "Tangled has Flynn Rider gallantly racing on the white Maximus over the bridge to rescue lost princess Rapunzel, which is not only a visual shout-out to this trope, but symbolic of his Character Development from selfish rogue to something closer to this trope.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [
                    "fictional"
                ], 
                "role": "Flynn Rider in Tangled — at least he tries. The fictional character he modeled himself on actually was.", 
                "id": "TheCharmer"
            }, 
            {
                "adjectives": [], 
                "role": "Rapunzel's father from Tangled has little screen time, but the kingdom of Corona is doing well.", 
                "id": "TheGoodKing"
            }, 
            {
                "adjectives": [
                    "common", 
                    "celebrate", 
                    "good", 
                    "first"
                ], 
                "role": "The Good King: By the way the common people celebrate, it is implied that Rap's parents are good rulers. However, when they meet Rap and Eugene for the first time, they are both not wearing their crowns. They are just being parents at the time.", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "gear", 
                    "cast-iron"
                ], 
                "role": "Action Girl: Rapunzel. All the gear she needs to be made of this trope is her hair and a cast-iron frying pan.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Rapunzel from Tangled.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "blonde"
                ], 
                "role": "Tangled gives us an exaggeration of sorts, where Rapunzel's hair is blonde BECAUSE of her healing powers, that come from the sun.", 
                "id": "BlondesAreWitches"
            }, 
            {
                "adjectives": [], 
                "role": "Rapunzel from Tangled.", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Inverted by Tangled: Mother Gothel sets up a situation where Rapunzel is the damsel, and she the rescuer, to lure her back.", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [
                    "original", 
                    "ordinary", 
                    "long-lost", 
                    "peasant"
                ], 
                "role": "Everything's Better with Princesses: Rapunzel in the original tale is not a princess. She's just an ordinary peasant girl. The film upgrades her to a long-lost princess. Also, showing how prevalent this trope is, the prince from the tale was turned into a peasant thief.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Princess Rapunzel — Tangled (2010)", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Mother Gothel from Tangled.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "Girl in the Tower: Obviously.", 
                "id": "GirlInTheTower"
            }, 
            {
                "adjectives": [
                    "Tangled"
                ], 
                "role": "Pictured above: Tangled, Disney's take on \"Rapunzel\".", 
                "id": "GirlInTheTower"
            }, 
            {
                "adjectives": [], 
                "role": "Rapunzel from Tangled though she doesn't discover that she's a badass until she leaves her tower at age 18. To make the example even more pronounced her weapons of choice are her 70 feet of hair and a frying pan.", 
                "id": "GirlyBruiser"
            }, 
            {
                "adjectives": [], 
                "role": "Rapunzel of Tangled wears a purple and lavender dress.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [], 
                "role": "Mother Gothel from Tangled has an air of this trope to herself. However, the cut verse of \"Mother Knows Best\" is basically a tribute to Jewish mothers is fiction.", 
                "id": "JewishMother"
            }, 
            {
                "adjectives": [
                    "due"
                ], 
                "role": "One of the Boys: Rapunzel for the Snuggly Duckling thugs, mainly due to what kind of boys the thugs are.", 
                "id": "OneOfTheBoys"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: Hmmm, who could that be?", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Rapunzel from Tangled", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "recent", 
                    "due", 
                    "well-rounded", 
                    "same"
                ], 
                "role": "Interestingly, two of Disney's most recent princesses, Rapunzel and Anna, are actually a lot closer to the Princess Classic standard than the Rebellious Princesses of its Renaissance films, due to them basically growing up sheltered. This in no way stops either of them from having well-rounded personalities or being Badass Princesses at the same time.", 
                "id": "PrincessClassic"
            }, 
            {
                "adjectives": [
                    "Proper", 
                    "resilient"
                ], 
                "role": "Proper Lady: The Queen. She is more emotionally resilient, or at least better at looking the part. She's also the one who literally pulls Eugene into the group hug at the end, when he hesitates.", 
                "id": "ProperLady"
            }, 
            {
                "adjectives": [], 
                "role": "Rapunzel from Tangled. She's pretty good about following Mother Gothel's orders, but she's even better at finding loopholes around those rules.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [
                    "confident", 
                    "capable", 
                    "classic"
                ], 
                "role": "Tangled: Rapunzel is more confident and capable than the classic archetype, but fits as a result of being cut off from the world.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "naive", 
                    "vulnerable"
                ], 
                "role": "The Ingenue: While Rapunzel shares some of these traits (being locked in a tower all her life), Mother Gothel constantly belittles Rapunzel that she's naive, vulnerable, and helpless without her.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "magical", 
                    "young", 
                    "beautiful"
                ], 
                "role": "Mother Gothel in Tangled completely embodies this trope, hoarding a magical healing flower to keep herself young and beautiful for centuries, and then kidnapping baby Rapunzel and raising her in a tower for 18 years when the flower's power is transferred to her. In addition she often puts down Rapunzel and compliments herself.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [
                    "wicked", 
                    "adoptive"
                ], 
                "role": "Wicked Stepmother: Technically, a wicked adoptive mother.", 
                "id": "WickedStepmother"
            }, 
            {
                "adjectives": [
                    "sure"
                ], 
                "role": "Mother Gothel from Tangled might count - we're not entirely sure she's a witch.", 
                "id": "WickedWitch"
            }
        ]
    }, 
    "imdbid": "tt0398286", 
    "poster_url": "Tangled.png", 
    "similar": [
        {
            "shared": [
                "VainSorceress", 
                "KnightInShiningArmor", 
                "PluckyGirl", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "DistressedDude", 
                "ActionGirl"
            ], 
            "shared_count": 9, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "TheCharmer", 
                "CuteClumsyGirl", 
                "PluckyGirl", 
                "TheIngenue", 
                "ActionGirl"
            ], 
            "shared_count": 8, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "GirlInTheTower", 
                "KnightInShiningArmor", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "TheGoodKing", 
                "WickedWitch"
            ], 
            "shared_count": 8, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "VainSorceress", 
                "KnightInShiningArmor", 
                "EvilMatriarch", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "TheIngenue", 
                "WickedWitch"
            ], 
            "shared_count": 8, 
            "id": "SnowWhiteAndTheSevenDwarfs", 
            "name": "Snow White and the Seven Dwarfs"
        }, 
        {
            "shared": [
                "VainSorceress", 
                "SpiritedYoungLady", 
                "WickedStepmother", 
                "EverythingsBetterWithPrincesses", 
                "TheGoodKing", 
                "EvilMatriarch", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "Tangled", 
    "name": "Tangled"
}