{
    "plot": "Sergeant Major Zak Carey is serving what is his final tour of duty at an Army base in Clemens, Georgia. Zak doesn't like the way the Army keeps the base and the bar is not what he's accustomed to. So he goes off base to get a beer. When he goes to the bar one of the local prostitutes tries to come on to Zak but Zak turns her down. That's when the deputy who appears to be her pimp beating her up. That's when Zak strikes him. Later he learns that the Sheriff is corrupt and takes what happened to the Deputy as an attack on him and tries to get Zak but the Army backs him and Zak is not intimidated. That's when they arrest his son on trumped up drug charges. Before Zak can fix it, his wife tries to get a lawyer for their son but this only pushes the Sheriff to send their son to a prison farm. With no other recourse Zak gets into his own vintage Sherman Tank and busts his son out and they try to make it to the state line so that they can expose the Sheriff.", 
    "genres": "Action, Drama, Comedy", 
    "release_year": "1984", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "other"
                ], 
                "role": "A Father to His Men: And to his kid, and to other people's kids.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "Sergeant-Major", 
                    "bad", 
                    "forcing", 
                    "recently-purchased", 
                    "Sergeant-Major"
                ], 
                "role": "Corrupt Hick: Sergeant-Major Zack Carey note Played by James Garner gets on the bad side of one of these, who ends up framing his son for drug possession and cheating him out of his retirement money and forcing him to sell his recently-purchased boat. Garner's character, however, is a Sergeant-Major in the Army — literally almost a Retired Badass- - and owns a fully restored, fully armed WWII Sherman tank. Hilarity Ensues.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [
                    "bad"
                ], 
                "role": "Tank: Major Zak Carey [note Played by James Garner gets on the bad side of one of these, who ends up framing his son for drug possession and cheating him out of his retirement money. Garner's character, however, is a Sergeant Major in the Army — literally almost a Retired Badass- - and owns a fully restored, fully armed WWII Sherman tank. Hilarity Ensues.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [], 
                "role": "Good Ol' Boy: Cyrus. The trope is even referenced by name.", 
                "id": "GoodOlBoy"
            }, 
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Papa Wolf: Shown zealously earlier on, then taken Up to Eleven later.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Hooker with a Heart of Gold: Sarah.", 
                "id": "HookerWithAHeartOfGold"
            }
        ]
    }, 
    "imdbid": "tt0088224", 
    "poster_url": "Tank.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "CorruptHick", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 3, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "GoodOlBoy", 
                "CorruptHick"
            ], 
            "shared_count": 2, 
            "id": "EasyRider", 
            "name": "Easy Rider", 
            "poster_url": "EasyRider.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "CorruptHick"
            ], 
            "shared_count": 2, 
            "id": "TheQuickAndTheDead", 
            "name": "The Quick and the Dead", 
            "poster_url": "TheQuickAndTheDead.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "Soldier", 
            "name": "Soldier", 
            "poster_url": "Soldier.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "CorruptHick"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }
    ], 
    "id": "Tank", 
    "name": "Tank"
}