{
    "plot": "The movie is about the life of Tarzan. Tarzan was a small orphan who was raised by an ape named Kala since he was a child. He believed that this was his family, but on an expedition Jane Porter is rescued by Tarzan. He then finds out that he's human. Now Tarzan must make the decision as to which family he should belong to...", 
    "genres": "Animation, Adventure, Drama", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "adorable"
                ], 
                "role": "Mr. Fanservice: Tarzan, who can seamlessly cross from being undeniably badass to just plain adorable whenever he's with Jane. His choice of wardrobe also helps too. Ms. Fanservice: Some of Jane's outfits. Particularly at the end of the movie.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Kerchak, to his herd, and at the end, to Tarzan.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "The Patriarch: Kerchak, so much.", 
                "id": "ThePatriarch"
            }, 
            {
                "adjectives": [
                    "titular"
                ], 
                "role": "Tarzan, especially when the titular hero is an adult man.", 
                "id": "WalkingShirtlessScene"
            }, 
            {
                "adjectives": [], 
                "role": "Walking Shirtless Scene: Tarzan. Walking pant-less, too.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "large", 
                    "loose", 
                    "loose", 
                    "animal"
                ], 
                "role": "Jane Porter's clothes and hair change in Tarzan over the course of the film. It starts with her wearing her hair in a bun and in a large yellow dress. When she brings Tarzan back her hair is loose, and she starts wearing a shirt and skirt and occasionally goes barefoot. When she falls in love she's wearing loose fitting clothing, and by the end of the film she's wearing animal skin like Tarzan.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "close"
                ], 
                "role": "Daddy's Girl: Jane and her father are very close.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Jane Porter in Tarzan gets along amazingly well with her goofy scientist father, Archimedes.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "weak", 
                    "Fish", 
                    "dangerous", 
                    "such"
                ], 
                "role": "Damsel in Distress: Jane at first. She's an example of that trope played right. She doesn't need to be saved because she's dumb or particularly weak, but because she's a Fish out of Water in a very dangerous environment in a time period when women weren't prepared by society for such situations.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "'Lady"
                ], 
                "role": "Everything's Better with Princesses: Refreshingly averted somewhat. As Tarzan in the novels and possibly Disney World is a Lord, making Jane by marriage a 'Lady' in title. Even if he isn't a lord in the Disney World, Jane is still a lady as Tarzan is \"Lord of the Jungle\".", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Missing Mom: Archimedes references her once while Jane is excitedly recapping her swing through the trees with Tarzan while chased by raging babboons.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Tarzan's loving mother and father are killed by a leopard. And there is no mother for Jane Porter, who's been raised by her father.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Some of Jane's outfits. Particularly at the end of the movie.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Nubile Savage: Tarzan, although his hair hangs in messy dreadlocks from lack of haircuts and no combing.", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [
                    "same"
                ], 
                "role": "Tarzan, from the movie of the same name. He figured out shaving by himself.", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [
                    "intelligent", 
                    "artistic"
                ], 
                "role": "Jane Porter in Tarzan might have tried to be a \"proper lady\" back in England, but she's intelligent and artistic, and while she has a Damsel in Distress scene early on, she quickly adapts to life in the jungle after that.", 
                "id": "SpiritedYoungLady"
            }
        ]
    }, 
    "imdbid": "tt0120855", 
    "poster_url": "Tarzan.jpg", 
    "similar": [
        {
            "shared": [
                "DaddysGirl", 
                "AdrenalineMakeover", 
                "PapaWolf", 
                "EverythingsBetterWithPrincesses", 
                "MrFanservice", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "EverythingsBetterWithPrincesses", 
                "MsFanservice", 
                "MrFanservice", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "EverythingsBetterWithPrincesses", 
                "MsFanservice", 
                "MrFanservice", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "WalkingShirtlessScene", 
                "DamselInDistress", 
                "MsFanservice", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "ClashOfTheTitans", 
            "name": "Clash of the Titans", 
            "poster_url": "ClashOfTheTitans.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "WalkingShirtlessScene", 
                "EverythingsBetterWithPrincesses", 
                "MsFanservice", 
                "MrFanservice"
            ], 
            "shared_count": 5, 
            "id": "JohnCarter", 
            "name": "John Carter", 
            "poster_url": "JohnCarter.jpg"
        }
    ], 
    "id": "Tarzan", 
    "name": "Tarzan"
}