{
    "plot": "Navy SEAL Lieutenant A.K. Waters and his elite squadron of tactical specialists are forced to choose between their duty and their humanity, between following orders by ignoring the conflict that surrounds them, or finding the courage to follow their conscience and protect a group of innocent refugees. When the democratic government of Nigeria collapses and the country is taken over by a ruthless military dictator, Waters, a fiercely loyal and hardened veteran is dispatched on a routine mission to retrieve a Doctors Without Borders physician, Dr. Lena Kendricks. Dr. Kendricks, an American citizen by marriage, is tending to the victims of the ongoing civil war at a Catholic mission in a remote village. When Waters arrives, however, Dr. Kendricks refuses to leave unless he promises to help deliver the villagers to political asylum at the nearby border. If they are left behind, they will be at the mercy of the enormous rebel army. Waters is under strict orders from his commanding officer Captain Bill Rhodes to remain disengaged from the conflict. But as he and his men witness the brutality of the rebels first-hand, they are won over to Dr. Kendricks' cause and place their lives at risk by agreeing to escort the villagers on a perilous trek through the dense jungle. As they move through the countryside on foot, Waters' team, experts at evasion and concealment, are inexplicably and ferociously pursued by an army of rebels. They are confounded until they discover that, among the refugees, is the sole survivor of the country's previous ruling family, whom the rebels have been ordered to eliminate at all costs. Waters and his small band of soldiers must weigh the life of one man against their own and the refugees they feel obliged to protect.", 
    "genres": "Action, Drama, Thriller", 
    "release_year": "2003", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "The Chick: Kendricks", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0314353", 
    "poster_url": "TearsOfTheSun.jpg", 
    "similar": [
        {
            "shared": [
                "TheChick"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "TheChick"
            ], 
            "shared_count": 1, 
            "id": "BarbieAFashionFairytale", 
            "name": "Barbie A Fashion Fairytale"
        }, 
        {
            "shared": [
                "TheChick"
            ], 
            "shared_count": 1, 
            "id": "SweetHome", 
            "name": "Sweet Home"
        }, 
        {
            "shared": [
                "TheChick"
            ], 
            "shared_count": 1, 
            "id": "WomanInTheMoon", 
            "name": "Woman in the Moon", 
            "poster_url": "WomanInTheMoon.jpg"
        }, 
        {
            "shared": [
                "TheChick"
            ], 
            "shared_count": 1, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }
    ], 
    "id": "TearsOfTheSun", 
    "name": "Tears of the Sun"
}