{
    "plot": "A real-life dramatic series where boyfriends/girlfriends travel to a romantic place to quiz and fascinate the strengths of their relationships. Once the location has been selected, the couples were then introduced to singles and then break-up with their former partners until the last day of their stay. Throughout the run, they each had the chance to answer questions pertaining to themselves and their recent dating partner. It's here where they will find out if what they believe what their dream date is the one they really want.", 
    "genres": "Reality-TV", 
    "release_year": "2001–2003", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "only", 
                    "upper-upper", 
                    "sympathetic"
                ], 
                "role": "Camp Gay - Joshua.  Bury Your Gays - He's the only casualty among the castaways. He lost the will to live after Ricardo chose to be with Bambi/Pura. Pet Homosexual - Tries to be this to the \"upper-upper\" Suzanne/Serafina.  Suzanne/Serafina is somewhat sympathetic as they watch Ricardo flirt with Bambi/Pura. Otherwise, she condescends to him as she does everyone else.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [
                    "Dogged"
                ], 
                "role": "Dogged Nice Guy - He stowed away on the yacht to be with Dina/Virginia.", 
                "id": "DoggedNiceGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "big-time"
                ], 
                "role": "Femme Fatale - Azenith/Cristina. \"I'm a big-time bitch... people think lowly of you because they believe your main tool is your body. But they're wrong. It's your brains!\"", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "High"
                ], 
                "role": "High Heel-Face Turn - In the remake, Cristina left Tonio and a life of crime for Umberto and respectability.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "Rich", 
                    "deserted", 
                    "later"
                ], 
                "role": "Rich Bitch - Suzanne/Serafina. She bullies Maria/Nympha even when her wealth is meaningless on a deserted island.  Maria/Nympha later gets her revenge.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "next"
                ], 
                "role": "Stage Mom - Nenuca pushes Bambi/Pura into joining beauty contests to replenish the family coffers.  In the remake Pura manages to get her to back off: when asked to join another contest, she replies, \"There won't be a next time.\" She then shows off an engagement ring.", 
                "id": "StageMom"
            }, 
            {
                "adjectives": [], 
                "role": "The Ingenue - Dina, renamed as Virginia in the 2011 film.  Nature Adores a Virgin - Alfredo, despite losing his virginity to Suzanne/Serafina, still prefers to be with her. He successfully wooed her back after coronation night.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "Azenith/Cristina", 
                    "good", 
                    "virginal", 
                    "influential"
                ], 
                "role": "The Vamp - Azenith/Cristina planned to win the contest by being \"a crook; a damn good crook.\"  It didn't work. Suzanne/Serafina was better at vampiness. Not only did she seduce the virginal Alfredo, she won the contest in the remake with the help of influential family friends.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0273025", 
    "similar": [
        {
            "shared": [
                "TheIngenue", 
                "DoggedNiceGuy", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "Bridesmaids", 
            "name": "Bridesmaids", 
            "poster_url": "Bridesmaids.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "FemmeFatale", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "TheIngenue", 
                "DoggedNiceGuy", 
                "TheVamp"
            ], 
            "shared_count": 3, 
            "id": "ThePictureOfDorianGray", 
            "name": "The Picture of Dorian Gray", 
            "poster_url": "ThePictureOfDorianGray.jpg"
        }, 
        {
            "shared": [
                "TheIngenue", 
                "CampGay", 
                "TheVamp"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TheVamp", 
                "CampGay", 
                "FemmeFatale"
            ], 
            "shared_count": 3, 
            "id": "TheBigLebowski", 
            "name": "The Big Lebowski", 
            "poster_url": "TheBigLebowski.jpg"
        }
    ], 
    "id": "TemptationIsland", 
    "name": "Temptation Island"
}