{
    "plot": "Biopic of Temple Grandin, an autistic woman who overcame the limitations imposed on her by her condition to become a Ph.D. and expert in the field of animal husbandry. She developed an interest in cattle early in life while spending time at her Aunt and Uncle's ranch. She did not speak until age four and had difficulty right through high school, mostly in dealing with people. Her mother was very supportive as were some of her teachers. She is noted for creating her 'hug box', widely recognized today as a way of relieving stress in autistic children, and her humane design for the treatment of cattle in processing plants, which have been the subject of several books and won an award from PETA. Today, she is a professor at Colorado State University and well-known speaker on autism and animal handling.", 
    "genres": "Biography, Drama", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "male", 
                    "other"
                ], 
                "role": "Disappeared Dad: Temple's father only briefly mentioned; the psychologist who diagnosed Temple asks to talk to Mrs. Grandin's husband, and she merely replies that he's very busy. Also at one moment when Mrs. Grandin is on the phone, a male voice from the other room says, \"Who is it?\" We can only assume that it's Mr. Grandin. In Real Life, Temple's father wanted her to be institutionalized and Mrs. Grandin refused to let that happen. He divorced Mrs. Grandin over their disagreement on how to handle Temple.", 
                "id": "DisappearedDad"
            }
        ]
    }, 
    "imdbid": "tt1278469", 
    "poster_url": "TempleGrandin.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "TheFog", 
            "name": "The Fog", 
            "poster_url": "TheFog.jpg"
        }
    ], 
    "id": "TempleGrandin", 
    "name": "Temple Grandin"
}