{
    "plot": "Piper moves to Santa Cruz, California to go to the Institute of Art. When she was 15 she gave birth to a daughter, but had to put her up for adoption because she was too young to raise her. Years later she sees an article about a girl she thinks is her daughter, who lives in Santa Cruz, and applies for a job in a sandwich shop. As she works there she gets to know the staff. Tish is a babe, she tries to seduce every guy who comes into the shop, and she goes home with those who flirt back. Jen, a computer nerd who has a love affair online with a guy who calls himself fuzzy22. She's not as pretty as Tish and she struggles with self-confidence. And there's a crazy haired guy called Priestly; he's not like other guys and dresses different then everyone because he refuses to be \"another clone\". Piper's boss is a really nice guy named Trucker, who's in love with a woman who owns the store across the street. The audience goes through the sandwich shop crew's personal struggles as they help each other through it all.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "black"
                ], 
                "role": "In Ten Inch Hero, Priestly wears one with a black t-shirt saying \"Surf naked\".", 
                "id": "ManInAKilt"
            }, 
            {
                "adjectives": [
                    "other", 
                    "pair"
                ], 
                "role": "Man in a Kilt: Priestly gets mocked for, among other things, wearing one by a pair of teenage boys. He turns it around on them.", 
                "id": "ManInAKilt"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Tish", 
                    "loyal"
                ], 
                "role": "Good Bad Girl: Tish unapologetically enjoys flirting and having sex, but she's a loyal friend to the others in the sandwich shop.", 
                "id": "GoodBadGirl"
            }
        ]
    }, 
    "imdbid": "tt0829297", 
    "poster_url": "TenInchHero.jpg", 
    "similar": [
        {
            "shared": [
                "GoodBadGirl"
            ], 
            "shared_count": 1, 
            "id": "SnowCake", 
            "name": "Snow Cake", 
            "poster_url": "SnowCake.jpg"
        }, 
        {
            "shared": [
                "GoodBadGirl"
            ], 
            "shared_count": 1, 
            "id": "Kids", 
            "name": "Kids", 
            "poster_url": "Kids.jpg"
        }, 
        {
            "shared": [
                "GoodBadGirl"
            ], 
            "shared_count": 1, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }, 
        {
            "shared": [
                "ManInAKilt"
            ], 
            "shared_count": 1, 
            "id": "TheFlintstones", 
            "name": "The Flintstones", 
            "poster_url": "TheFlintstones.jpg"
        }, 
        {
            "shared": [
                "GoodBadGirl"
            ], 
            "shared_count": 1, 
            "id": "LaBoheme", 
            "name": "La Boheme"
        }
    ], 
    "id": "TenInchHero", 
    "name": "Ten Inch Hero"
}