{
    "plot": "Adapted from William Shakespeare's play \"The Taming of the Shrew,\" 10 Things I Hate About You starts off with Cameron, new student at Padua High, sitting in the office of the quirky guidance counselor Ms. Perky. He is then shown around the school by Michael, who will become his best friend. During his tour is when Cameron first sees Bianca Stratford, a beautiful sophomore with one problem: she isn't allowed to date. And neither is her \"shrew\" sister, Katarina, a senior who loves indie rock and feminist prose and hates conformity. But Kat and Bianca's father alters his house rule: now, Bianca can date... as long as Kat has a date, too. Now, in order for Cameron to date Bianca, he has to find someone to date Kat. So Michael helps him enlist the help of pretty-boy/jerk/model Joey Donner, tricking him into thinking that *he* will get to take Bianca out if he pays someone to take out Kat. His choice: Patrick Verona, a bad-boy with a mysterious reputation--some say he ate a live duck once, others that he lit a state trooper on fire, and even more claim that he had a brief porn career. Will Patrick win Kat's heart? Will Cameron win Bianca's? Or will everything hit the fan...?", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "righteous", 
                    "black", 
                    "black"
                ], 
                "role": "Angry Black Man: The English teacher Mr. Morgan, sort of. Lampshaded with the White Rastas when they try to join in on Mr. Morgan's righteous indignation about the lack of black authors on the school curriculum, only to be reminded they're not actually black.", 
                "id": "AngryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Patrick to Kat in 10 Things I Hate About You.", 
                "id": "HandsomeDevil"
            }, 
            {
                "adjectives": [
                    "obstetrician", 
                    "shrewish", 
                    "romantic", 
                    "little"
                ], 
                "role": "In 10 Things I Hate About You, Kat and Bianca's father is an obstetrician who obsesses about his daughters' chastity. Unlike in the play Taming of the Shrew from which the film is loosely adapted, his motivation for requiring his shrewish daughter to enter a romantic relationship first is that he hopes both will remain chaste. Although he's a little too late in one case...", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "Overprotective", 
                    "whole", 
                    "natal"
                ], 
                "role": "Overprotective Dad: in addition to the whole Missing Mom thing, he's also a natal specialist who evidently deals with a lot of teenagers.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [], 
                "role": "Pretty Boy: Patrick's prettyness gets lampshaded in the movie.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [], 
                "role": "Cameron James (Joseph Gordon-Levitt) and Patrick Verona (Heath Ledger) in 10 Things I Hate About You.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [], 
                "role": "Teeny Weenie: Joey, apparently. Kat threatens to reveal this to the cheerleading team if he tells anyone that he slept with her.", 
                "id": "TeenyWeenie"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Alpha Bitch / Lovable Alpha Bitch: Chastity", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "Asian"
                ], 
                "role": "Asian Airhead: Dawn", 
                "id": "AsianAirhead"
            }, 
            {
                "adjectives": [], 
                "role": "Granola Girl: Kat", 
                "id": "GranolaGirl"
            }, 
            {
                "adjectives": [
                    "few", 
                    "overprotective", 
                    "original", 
                    "present", 
                    "dead"
                ], 
                "role": "Missing Mom: Kat and Bianca's mother is absent, and only gets a mention whenever Bianca puts on a set of her pearls before going out. She gets a few more mentions, the implication being that she left the family, and that left the dad feeling out of control, explaining why he's so overprotective of his daughters. She seemed to have been a character in an older version of the script. Whether she left in a taxi or a hearse is never established, but frankly it doesn't change much. In the original script, their mother was present, but spent all of her time at the computer writing romance novels. All of the gags surrounding Ms. Perky's novels originally belonged to Mrs. Stratford. In the series, she's dead.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "drunk", 
                    "little-girlish"
                ], 
                "role": "Unsexy variation in 10 Things I Hate About You: Patrick sits Kat down on the swings when she's drunk at the Wild Teen Party and tries to keep her from passing out. She ends up throwing up on him.\n Later, there's a scene where Kat looks down from her bedroom window to see Bianca sitting on a tire swing, dressed in notably little-girlish clothes, and decides to go to the prom so Bianca can, too.", 
                "id": "SwingLowSweetHarriet"
            }, 
            {
                "adjectives": [], 
                "role": "The Cheerleader: Bianca, Chastity, Dawn etc.", 
                "id": "TheCheerleader"
            }
        ]
    }, 
    "imdbid": "tt0147800", 
    "poster_url": "TenThingsIHateAboutYou.jpg", 
    "similar": [
        {
            "shared": [
                "TheCheerleader", 
                "SensitiveGuyAndManlyMan", 
                "AngryBlackMan", 
                "AlphaBitch"
            ], 
            "shared_count": 4, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan", 
                "AngryBlackMan", 
                "AsianAirhead", 
                "TeenyWeenie"
            ], 
            "shared_count": 4, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan", 
                "AngryBlackMan", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan", 
                "AngryBlackMan", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "TwentyOneJumpStreet", 
            "name": "21 Jump Street", 
            "poster_url": "TwentyOneJumpStreet.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad", 
                "PrettyBoy", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "LesMiserables", 
            "name": "Les Misérables"
        }
    ], 
    "id": "TenThingsIHateAboutYou", 
    "name": "10 Things I Hate About You"
}