{
    "plot": "N/A", 
    "genres": "Short, Action", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "same"
                ], 
                "role": "Terminator: The Sarah Connor Chronicles has the same Disappeared Dad as The Movie from which it spawned.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Sun's father has nothing on Lunar's father, who stalks Nagasumi like Terminator for being around Lunar and later for accidentally touching Lunar's butt.", 
                "id": "OverprotectiveDad"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Sarah Connor, T-X and Blair Williams.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "birth"
                ], 
                "role": "Sarah Connor in the Terminator movies and The Sarah Connor Chronicles, a case where she didn't start out as an Action Girl, but definitely became one after she gave birth to John.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "simple", 
                    "young", 
                    "own", 
                    "own", 
                    "mild-mannered", 
                    "bad", 
                    "first", 
                    "few", 
                    "full-fledged"
                ], 
                "role": "Terminator: Sarah Connor is a simple young woman who has a waitress job at a family restaurant. By her own admission, she can't even balance her own checkbook. She's meek, and mild-mannered, but smart enough to know bad things are happening when people with her name start dying. Then Kyle shows up. Once she's done being scared to death of him, they fall in love, and by the time the movie ends, she's got the first few experience points toward taking her level in badass. By the time of the sequel she's a full-fledged Mama Bear you don't want to mess with.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "female", 
                    "capable", 
                    "sudden", 
                    "laughing", 
                    "other", 
                    "second", 
                    "real", 
                    "same", 
                    "eighth", 
                    "tight", 
                    "white", 
                    "visible", 
                    "next", 
                    "casual", 
                    "internal", 
                    "few", 
                    "deliberate", 
                    "inexplicable", 
                    "scary", 
                    "momentary", 
                    "nervous", 
                    "normal"
                ], 
                "role": "Cameron, the female Terminator of The Sarah Connor Chronicles fits this quite accurately, though she is quite capable of simulating human emotions when she needs to. The rather sudden shift from emotionless blankness to a laughing, smiling teenage girl is....creepy.\n Of course, some of us have a reaction other than fear.\n Cameron's creepy stoicism gets played brilliantly in the premiere for the second season, when John is trying to remove her processor chip after it gets damaged and she goes berserk. She slowly switches from an emotionless, Implacable killer to begging and pleading with John to not remove the chip, even going as far as to cry out that she loves him. The simulated emotion is disturbingly real, and even more so because the audience and John know it's simulated yet real. And according to Summer Glau, who plays Cameron, that might not have been simulated...\n This is further pronounced in the same season's eighth episode. Before Cameron enters John's room to discourage him from seeing Riley, she removes her jacket, leaving her in shorts and a tight white shirt with a visible red bra underneath. She then lies on his bed next to him. The audience and John know that neither of these actions is casual, but a calculated decision by Cameron's internal logic. It is this knowledge that creates the tension in the ensuing exchange.\n Prior to this, there are a very few but very deliberate moments where Cameron shows inexplicable emotion - for example, when she hits Charley with a Death Glare for calling her a \"very scary robot\" in \"Dungeons & Dragons\", and a momentary tightening of her lips and nervous flicker of her eyes in \"Vick's Chip\" when John is removing her processor.\n Then it gets completely inverted in \"Allison from Palmdale,\" where Cameron adopts the personality and memories of Allison, a girl her personality was based around. Seeing Cameron suddenly acting like a normal person, showing honest emotions, just amplifies the creepy factor.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "female-modeled", 
                    "full", 
                    "Terminator-verse", 
                    "aware", 
                    "physical", 
                    "clear"
                ], 
                "role": "The Terminator spin-off The Sarah Connor Chronicles features Cameron, a female-modeled Terminator who doesn't always wear a full set of clothes. Like all Terminators, she also has no qualms with kicking ass while in the buff. In the Terminator-verse, you can't take anything with you, so you're Naked on Arrival. It turns out that Cameron is in fact very aware of the effect she has on others while wearing scanty clothes. More than once she's used her physical body to manipulate people around her. Then again, she also nonchalantly strips in front of John in the series finale, so it's quite clear that she simply doesn't care what others are seeing.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Sarah Connor from the Terminator franchise has aspects of this.", 
                "id": "JeanneDArchetype"
            }, 
            {
                "adjectives": [
                    "physical", 
                    "due", 
                    "scary", 
                    "other"
                ], 
                "role": "In Terminator: The Sarah Connor Chronicles, Cameron certainly fits a number of the characteristics, especially in regards to her absolute calm, feminine grace, and physical ability. Though in her case, much of it is due to the fact that she is also a very scary robot.\n But don't let her catch you calling her that...\n Weaver fits the trope even better in personality and dress sense. Being a Bullet Proof Fashion Plate also helps. Although we don't see her fighting very often, because she could probably curb-stomp all of the other characters at once.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "T-X", 
                    "able", 
                    "breast", 
                    "male"
                ], 
                "role": "Terminator 3 lampshades this since the T-X is able to adjust its breast size and shape to better win over male humans.", 
                "id": "MostCommonSuperpower"
            }, 
            {
                "adjectives": [
                    "fourth", 
                    "major"
                ], 
                "role": "Also prominent in the fourth Terminator movie, which has three major female Characters; Marcus' love interest, John's girlfriend, and a mute little girl who is treated like some kind of pet for Kyle.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "attractive", 
                    "future"
                ], 
                "role": "Cameron from Terminator: The Sarah Connor Chronicles. Counts also as Emotionless Girl. It is strongly hinted that Cameron was made to be attractive deliberately. Her appearance was based on a resistance fighter named Allison Young, who was implied to know future John Connor personally.", 
                "id": "RobotGirl"
            }
        ]
    }, 
    "imdbid": "tt1994570", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "ActionMom", 
                "OverprotectiveDad", 
                "LadyOfWar", 
                "NeverASelfMadeWoman"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "AdrenalineMakeover", 
                "JeanneDArchetype", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "ActionMom", 
                "ActionGirl", 
                "InnocentFanserviceGirl", 
                "RobotGirl"
            ], 
            "shared_count": 4, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "NeverASelfMadeWoman", 
                "ActionGirl", 
                "RobotGirl"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "ActionGirl", 
                "InnocentFanserviceGirl"
            ], 
            "shared_count": 3, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }
    ], 
    "id": "Terminator", 
    "name": "Terminator"
}