{
    "plot": "The bane of adolescent Bart Collins' existence is the piano lessons he is forced to take under the tutelage of Dr. Terwilliker, the only person he admits he detests because of his dictatorial nature. Bart feels Dr. Terwilliker has undue influence for these lessons on his widowed mother, Heloise Collins. The one person who sympathizes with Bart, although quietly on the sidelines, is the Collins' plumber, August Zabladowski. Bart hates his life associated with the piano so much he often daydreams when he practices and even during his lessons. His latest dream has him imprisoned in the fantastical Terwilliker Institute in the day before its grand opening. Terwilliker's second in command at the Institute is his mother, although she has been hypnotized into her position, which will also soon be as Mrs. Dr. Terwilliker. Bart tries to convince Mr. Zabladowski, who is there to install the Institute's plumbing, to save his mother and himself from Terwilliker. Bart also hopes that Zabladowski will become his father instead of Dr. Terwilliker. But Bart wants more than anything to ruin the Institute's grand opening, which has at its core Bart and 499 other boys like him playing one large piano simultaneously to a tune composed and directed by the evil Dr. T.", 
    "genres": "Family, Fantasy, Music", 
    "release_year": "1953", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "eponymous"
                ], 
                "role": "The eponymous villain in The 5,000 Fingers Of Dr. T.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "bare-chested", 
                    "song", 
                    "freaky", 
                    "simple", 
                    "unflappable"
                ], 
                "role": "In The 5,000 Fingers Of Dr. T has the bare-chested elevator operator in the executioner's hood. Those EYES! And the song was freaky, too, as he talked about the \"assorted simple tortures\" awaiting the prisoners in the dungeon. Even the normally unflappable Mr. Zabladowski was visibly unnerved by him.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "fabulous"
                ], 
                "role": "Dr. Terwilliker in The 5,000 Fingers Of Dr. T. Even though he's intent on marrying Bartholomew's mother, you can clearly see he's very swishy. Especially during the fabulous dress-up song.", 
                "id": "SissyVillain"
            }
        ]
    }, 
    "imdbid": "tt0045464", 
    "poster_url": "The5000FingersOfDrT.jpg", 
    "similar": [
        {
            "shared": [
                "SissyVillain", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "SissyVillain"
            ], 
            "shared_count": 2, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "SissyVillain"
            ], 
            "shared_count": 2, 
            "id": "WarriorsOfVirtue", 
            "name": "Warriors of Virtue", 
            "poster_url": "WarriorsOfVirtue.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "NoMoreBaths", 
            "name": "No More Baths", 
            "poster_url": "NoMoreBaths.jpg"
        }
    ], 
    "id": "The5000FingersOfDrT", 
    "name": "The 5,000 Fingers Of Dr. T"
}