{
    "plot": "When virtually all of the residents of Piedmont, New Mexico, are found dead after the return to Earth of a space satellite, the head of the US Air Force's Project Scoop declares an emergency. Many years prior to this incident, a group of eminent scientists led by Dr. Jeremy Stone advocated for the construction of a secure laboratory facility that would serve as a base in the event an alien biological life form was returned to Earth from a space mission. Stone and his team - Drs. Dutton, Leavitt and Hall - go to the facility, known as Wildfire, and try to first isolate the life form while determining why two people from Piedmont (an old wino and a six-month-old baby) survived. The scientists methodically study the alien life form unaware that it has already mutated and presents a far greater danger in the lab, which is equipped with a nuclear self-destruct device should it manage to escape.", 
    "genres": "Sci-Fi, Thriller", 
    "release_year": "1971", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Hot", 
                    "memorable"
                ], 
                "role": "Hot Scientist: Noticeably averted. The lone female is in her fifties and overweight. And, it must be said, one of the most memorable characters in the movie, snarking delightfully with all her might.", 
                "id": "HotScientist"
            }
        ]
    }, 
    "imdbid": "tt0066769", 
    "poster_url": "TheAndromedaStrain.jpg", 
    "similar": [
        {
            "shared": [
                "HotScientist"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "HotScientist"
            ], 
            "shared_count": 1, 
            "id": "Innerspace", 
            "name": "Innerspace", 
            "poster_url": "Innerspace.jpg"
        }, 
        {
            "shared": [
                "HotScientist"
            ], 
            "shared_count": 1, 
            "id": "AgentForHARM", 
            "name": "Agent for H.A.R.M.", 
            "poster_url": "AgentForHARM.jpg"
        }, 
        {
            "shared": [
                "HotScientist"
            ], 
            "shared_count": 1, 
            "id": "Sphere", 
            "name": "Sphere", 
            "poster_url": "Sphere.jpg"
        }, 
        {
            "shared": [
                "HotScientist"
            ], 
            "shared_count": 1, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }
    ], 
    "id": "TheAndromedaStrain", 
    "name": "The Andromeda Strain"
}