{
    "plot": "Space travel has become a dirty way of life dominated by derelicts, grease monkeys, thieves, and hard-boiled interplanetary traders such as Samuel Curtis, an astronaut from Earth who deals in a rare goods, living or otherwise. His mission begins with the unlikely delivery of a cat to a small outer-belt asteroid saloon where he meets his former dance partner, and renowned interplanetary fruit thief, the Blueberry Pirate. As payment for his delivery of the cat, Curtis receives a homemade cloning device already in the process of creating a creature most rare in this space quadrant... a Real Live Girl. At the suggestion of the Blueberry Pirate, Curtis takes the Real Live Girl to Jupiter where women have long been a mystery. There, he proposes a trade with the owner of Jupiter: the Real Live Girl clone for the Boy Who Actually Saw A Woman's Breast. The Boy Who Actually Saw A Woman's Breast is regarded as royalty on the all-male mining planet of Jupiter because of his unique and exotic contact with a woman. It is Curtis' intention to take The Boy to Venus and trade him for the remains of Johnny R., a man who spent his lifetime serving as a human stud for the Southern belles of Venus, a planet populated only by women. Upon returning Johnny R's body to his bereaved family on earth, Curtis will receive a handsome reward. It all seems simple enough. But while hashing out the plan with the Blueberry Pirate, Curtis is spotted by his nemesis, Professor Hess. Possessed by an enigmatic obsession with Curtis, Heiss is capable of killing without reason, unless his intended victim is someone with whom he has unresolved issues. Heiss has been pursuing Samuel Curtis throughout the solar system in order that he might forgive him, then kill him. Along the way, Heiss has executed each and every individual to come into contact with Curtis. Unaware of this danger, Curtis sets forth on his mission. After retrieving The Boy Who Actually Saw A Woman's Breast from Jupiter, Curtis is contacted by Professor Heiss, who makes his intentions known. Fearful, Curtis and The Boy look for a place to hide. They come across a primitive space station constructed by Nevada State silver miners from the late 1800s. Inside they discover a small group of miners still alive, their bodies crippled and deformed by space atrophy. Unable to return home for fear that Earth's gravity would kill them, two of the miners mated and give birth to a boy known as Bodysuit. He has been raised in a suit of hydraulics to simulate Earth's gravity with the intention of eventually sending him home. In trade for supplies and sanctuary, Curtis agrees to deliver Bodysuit to Earth. Once they land on the lush planet of Venus, the terrain dramatically changes, and Curtis is inspired by a plan. And it may just happen that in a solar system ruled by commerce and danger, sometimes good can prevail.", 
    "genres": "Musical, Comedy, Sci-Fi", 
    "release_year": "2001", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Knight Errant: Curtis.", 
                "id": "KnightErrant"
            }, 
            {
                "adjectives": [
                    "rich", 
                    "male", 
                    "gender-decisive"
                ], 
                "role": "Mr. Seahorse: The rich have only been having male children (via gender-decisive drugs) in order to perpetuate their dynasties and so are in danger of dying out. Doctors Fred and Edward come up with a solution by combining their DNA to create their son, Fredward.", 
                "id": "MisterSeahorse"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "all-male", 
                    "sole"
                ], 
                "role": "No Woman's Land: The entire planet of Jupiter is an all-male mining Company Town whose sole entertainment is listening to The Boy Who Saw A Breast describe (\"briefly and arrogantly\") his encounter with said body part.", 
                "id": "NoWomansLand"
            }
        ]
    }, 
    "imdbid": "tt0243759", 
    "similar": [
        {
            "shared": [
                "KnightErrant", 
                "MisterSeahorse"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "NoWomansLand"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "NoWomansLand"
            ], 
            "shared_count": 1, 
            "id": "Django", 
            "name": "Django", 
            "poster_url": "Django.jpg"
        }, 
        {
            "shared": [
                "MisterSeahorse"
            ], 
            "shared_count": 1, 
            "id": "X-Men", 
            "name": "X-Men", 
            "poster_url": "X-Men.jpg"
        }, 
        {
            "shared": [
                "NoWomansLand"
            ], 
            "shared_count": 1, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }
    ], 
    "id": "TheAmericanAstronaut", 
    "name": "The American Astronaut"
}