{
    "plot": "The Addams step out of Charles Addams' cartoons. They live with all of the trappings of the macabre (including a detached hand for a servant) and are quite wealthy. Added to this mix is a crooked accountant and his loan shark and a plot to slip in the shark's son into the family as their long lost Uncle Fester. Can the false Fester find his way into the vault before he is discovered?", 
    "genres": "Comedy, Fantasy", 
    "release_year": "1991", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Lurch from The Addams Family.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "other", 
                    "eccentric", 
                    "attentive", 
                    "various"
                ], 
                "role": "Gomez Addams, on the other hand, had eccentric habits and interests and could lean towards Cloud Cuckoolander tendencies at times, but was still depicted as a selfless, loving and attentive husaband and father. In addition to being Happily Married, he and his wife Morticia usually worked together to solve various family problems.", 
                "id": "BumblingDad"
            }, 
            {
                "adjectives": [
                    "much", 
                    "other", 
                    "major", 
                    "attentive"
                ], 
                "role": "Surprisingly, this trope is much less prevalent than in other major sitcoms. Gomez is still an intelligent and attentive husband and father, and not a Bumbling Dad.", 
                "id": "BumblingDad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "similar"
                ], 
                "role": "An episode of The Addams Family had something similar to this with Pugsley's teacher.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "This being The Addams Family, once everyone understands the depths of her issues they all start to really empathize with her and regret not really getting to know her.", 
                "id": "BlackWidow"
            }, 
            {
                "adjectives": [
                    "delight"
                ], 
                "role": "Wednesday forcing a smile in Addams Family Values evokes horror in onlookers, yet the camp counselors cluelessly delight in finally getting her to smile.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "all-natural", 
                    "preservative-free", 
                    "highly-processed", 
                    "real"
                ], 
                "role": "Played with in The Addams Family. A Girl Scout insists she only eats all-natural, preservative-free foods while debating purchasing some of Wednesday's lemonade... and then offers to sell them highly-processed Girl Scout cookies. Wednesday's priceless rebuttal: \"Are they made from real girl scouts?\"", 
                "id": "GranolaGirl"
            }, 
            {
                "adjectives": [
                    "respectable"
                ], 
                "role": "Subverted in Addams Family Values; the family finally finds a nanny who will put up with the children because she wants to marry Fester, then kill him, for his money.\n Being the Addams Family, they consider this a very respectable lifestyle and are mainly irritated with her choice of Pastels as a color palette.", 
                "id": "MagicalNanny"
            }, 
            {
                "adjectives": [
                    "Gordon/Fester", 
                    "fair", 
                    "many"
                ], 
                "role": "Gordon/Fester's mother Margaret in The Addams Family. Although to be fair, she's not actually his mother; she just took him in after finding him unconscious and amnesiac many years ago..", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "Perky Goth: Gomez is a male example. Wednesday was this in the TV show. The movies made her darker and gloomier. The 90s animated series combined these portrayals somewhat.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "perky", 
                    "first", 
                    "male", 
                    "popular", 
                    "manic", 
                    "perky", 
                    "certain", 
                    "Thousand-Yard", 
                    "traditional", 
                    "perky", 
                    "elegant"
                ], 
                "role": "The entire Addams Family are perky goths. However, the perkiest character by far (in the film and television versions at least) is Gomez Addams, possibly the first male Perky Goth in popular culture — if you equate \"manic\" with \"perky\".\n Wednesday Addams averts this; while she does take pleasure in certain activities, her Thousand-Yard Stare and Dramatic Deadpan are pretty much traditional goth.\n Morticia is also not particularly perky, though she's not the depressed sort of goth, being more refined and elegant.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [], 
                "role": "Ladles and gentlethings, give it up for Wednesday Addams! Just don't ask her to smile. Unless it's Wednesday from the '60s show, in which case she's a Perky Goth.", 
                "id": "StrangeGirl"
            }, 
            {
                "adjectives": [
                    "vague", 
                    "good", 
                    "karate"
                ], 
                "role": "In The Addams Family, Morticia's older sister (also played by Caroline Jones in the series; seen for about two seconds in the movies) fits much of this trope. She wears flowers in her hair (if you try to pluck one, her leg lifts up); she's vague at least, though not babbly; and she's very good at karate, not noticing that it hurts when she flips men to the ground. Oh, did I mention her name is Ophelia?", 
                "id": "TheOphelia"
            }, 
            {
                "adjectives": [], 
                "role": "The Ophelia: Morticia's older sister in the TV series (established in the episode \"Morticia's Romance\", which deals with Gomez and Morticia meeting right before his Arranged Marriage - to Ophelia). Unsurprisingly, she's named Ophelia and has long, flowing hair.", 
                "id": "TheOphelia"
            }
        ]
    }, 
    "imdbid": "tt0101272", 
    "poster_url": "TheAddamsFamily.jpg", 
    "similar": [
        {
            "shared": [
                "BattleButler", 
                "EmotionlessGirl", 
                "BlackWidow"
            ], 
            "shared_count": 3, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "EmotionlessGirl", 
                "StrangeGirl", 
                "GranolaGirl"
            ], 
            "shared_count": 3, 
            "id": "Hanna", 
            "name": "Hanna", 
            "poster_url": "Hanna.jpg"
        }, 
        {
            "shared": [
                "StrangeGirl", 
                "EmotionlessGirl"
            ], 
            "shared_count": 2, 
            "id": "Beetlejuice", 
            "name": "Beetlejuice", 
            "poster_url": "Beetlejuice.jpg"
        }, 
        {
            "shared": [
                "GranolaGirl", 
                "BumblingDad"
            ], 
            "shared_count": 2, 
            "id": "BeforeSunrise", 
            "name": "Before Sunrise", 
            "poster_url": "BeforeSunrise.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "BumblingDad"
            ], 
            "shared_count": 2, 
            "id": "TheFlintstones", 
            "name": "The Flintstones", 
            "poster_url": "TheFlintstones.jpg"
        }
    ], 
    "id": "TheAddamsFamily", 
    "name": "The Addams Family"
}