{
    "plot": "In 1921, in London, the arrogant and skeptical Florence Cathcart is famous for exposing hoaxes and helping the police to arrest con artists. The stranger Robert Mallory tells her that the headmaster of a boarding school in Rookford had invited her to travel to Cumbria to investigate a ghost that is frightening the pupils to death. He also tells that many years ago there was a murder in the estate and recently pupil Walter Portman had died. The reluctant Florence finally accepts to go to Cumbria. On arrival, she is welcomed by governess Maud and the boy Thomas Hill. Soon Florence discovers what had happened to Walter and then the students, teachers and staff are released on vacation, and Florence remains alone with Robert, Maud and Tom in the school. Florence is ready to leave the boarding school when strange things happen, leaving Florence scared.", 
    "genres": "Horror, Thriller", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "many", 
                    "middle-aged"
                ], 
                "role": "Disappeared Dad - being set immediately after World War One, there's a reason why there aren't many middle-aged men picking up their children from school", 
                "id": "DisappearedDad"
            }
        ]
    }, 
    "imdbid": "tt1687901", 
    "poster_url": "TheAwakening.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "TheFog", 
            "name": "The Fog", 
            "poster_url": "TheFog.jpg"
        }
    ], 
    "id": "TheAwakening", 
    "name": "The Awakening"
}