{
    "plot": "Do we control our destiny, or do unseen forces manipulate us? A man glimpses the future Fate has planned for him and realizes he wants something else. To get it, he must pursue across, under and through the streets of modern-day New York the only woman he's ever loved. On the brink of winning a seat in the U.S. Senate, ambitious politician David Norris (Damon) meets beautiful contemporary ballet dancer Elise Sellas (Emily Blunt) - a woman like none he's ever known. But just as he realizes he's falling for her, mysterious men conspire to keep the two apart. David learns he is up against the agents of Fate itself - the men of The Adjustment Bureau - who will do everything in their considerable power to prevent David and Elise from being together. In the face of overwhelming odds, he must either let her go and accept a predetermined path...or risk everything to defy Fate and be with her.", 
    "genres": "Romance, Sci-Fi, Thriller", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Sharp-Dressed"
                ], 
                "role": "Sharp-Dressed Man: All of the bureaucrats. David, much of the time.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "eponymous", 
                    "complete"
                ], 
                "role": "The Adjustment Bureau: All the members of the eponymous organisation wear fifties-style suits, complete with Nice Hats.", 
                "id": "SharpDressedMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Elise in The Adjustment Bureau is made of this trope. She meets the hero in the men's washroom when she is hiding from security from having crashed a wedding, later she drops his phone into his coffee on purpose.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "many", 
                    "following", 
                    "own", 
                    "emotional", 
                    "well-being", 
                    "main", 
                    "second", 
                    "impulsive", 
                    "kooky", 
                    "successful", 
                    "speech-making", 
                    "buttoned-up", 
                    "more-successful-than-usual"
                ], 
                "role": "Manic Pixie Dream Girl: Elise is made of this trope. They meet  in the men's washroom when she is hiding from security from having crashed a wedding, drops his phone into his coffee on purpose, and is a dancer. While Elise certainly has many MPDG trappings, she may just scrape a subversion of this trope by dint of the following: firstly, she has dreams and a life of her own which don't involve the emotional well-being of the main male character; second, her job in the story is not to loosen David up - he is already impulsive to a fault and their relationship is not one of Elise shaking up David's staid life with her kooky charm. They both share a goofy sense of humour from the outset and don't feel the need to change anything about the other. Elise does inspire David to some particularly successful impromptu speech-making when they first meet, but this is not actually a break from a previously buttoned-up personality for him, just a more-successful-than-usual deployment of his existing impulsiveness.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt1385826", 
    "poster_url": "TheAdjustmentBureau.jpg", 
    "similar": [
        {
            "shared": [
                "SharpDressedMan", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Tombstone", 
            "name": "Tombstone", 
            "poster_url": "Tombstone.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "PulpFiction", 
            "name": "Pulp Fiction", 
            "poster_url": "PulpFiction.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }
    ], 
    "id": "TheAdjustmentBureau", 
    "name": "The Adjustment Bureau"
}