{
    "plot": "Retired madame Adelaide Bonfamille enjoys the good life in her Paris villa with even classier cat Duchess and three kittens: pianist Berlioz, painter Toulouse and sanctimonious Marie. When loyal butler Edgar overhears her will leaves everything to the cats until their death, he drugs and kidnaps them. However retired army dogs make his sidecar capsize on the country. Crafty stray cat Thomas O'Malley takes them under his wing back to Paris. Edgar tries to cover his tracks and catch them at return, but more animals turn on him, from the cart horse Frou-Frou to the tame mouse Roquefort and O'Malley's jazz friends.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "1970", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Cool Old Guy: George Hautecourt", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "O'Malley", 
                    "different", 
                    "O'Malley", 
                    "absent", 
                    "likely", 
                    "well-bred", 
                    "other", 
                    "different", 
                    "black", 
                    "dominant", 
                    "male", 
                    "easy", 
                    "white", 
                    "different", 
                    "recessive", 
                    "different"
                ], 
                "role": "Disappeared Dad: The father of the kittens is never seen or mentioned, although they express hope that O'Malley will take up the job which he does. Given the different looks and ages of Berlioz and Toulouse, there was probably more than one father actually. That's how it usually is with cats. Interesting to note: A sequel storybook was written sometime in the 80s. It obviously takes place after the movie as the geese sisters show up. But, O'Malley is completely absent from the story. As Duchess is a pedigreed queen, it's likely that Madame had her bred to an equally well-bred tom belonging to some other high-society Kind Hearted Cat Lover. That still doesn't account for the kittens' different colors. In cats, black and orange fur are both dominant genes carried on the X chromosome, so a male can only carry (and pass on) one or the other. Marie's easy to account for (white fur is a completely different gene, and recessive), but Berlioz and Toulouse have to have different fathers.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "O'Malley"
                ], 
                "role": "The Aristocats: The kittens' father is never mentioned, but it really doesn't matter once O'Malley shows up.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "O'Malley", 
                    "British", 
                    "geese"
                ], 
                "role": "Distressed Dude: O'Malley bravely dives into the water to save Marie, but it backfires when he himself can't swim back to shore and has to be rescued by two very British geese. Or, alternatively, from said geese.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "Russian"
                ], 
                "role": "Husky Russkie: The Russian cat.", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [
                    "Russian"
                ], 
                "role": "The Russian alleycat in The Aristocats.", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [
                    "O'Malley", 
                    "quick"
                ], 
                "role": "Papa Wolf: O'Malley is quick to jump into this role whenever one of Duchess's kittens (usually Marie) is in danger.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "O'Malley", 
                    "later", 
                    "true"
                ], 
                "role": "The Casanova: Implied with O'Malley, who lathers Duchess in praise like a pro. He later seems surprised by how true his comments were.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "old", 
                    "full-on", 
                    "happy"
                ], 
                "role": "Madame from The Aristocats is a mild example, being an old lady who owns a family of cats and makes them the beneficiaries of her will. One could argue that she goes full-on Crazy Cat Lady at the end of the film, when she decides to adopt all the stray cats in Paris. And this is supposed to be a happy ending.", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Duchess and Marie both fall under this trope.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "impressive", 
                    "cat"
                ], 
                "role": "Duchess in The Aristocats. Made more impressive by the fact that she's a cat.", 
                "id": "HarpOfFemininity"
            }
        ]
    }, 
    "imdbid": "tt0065421", 
    "poster_url": "TheAristocats.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "TheCasanova", 
                "DamselInDistress", 
                "CoolOldGuy"
            ], 
            "shared_count": 4, 
            "id": "TheRocketeer", 
            "name": "The Rocketeer", 
            "poster_url": "TheRocketeer.jpg"
        }, 
        {
            "shared": [
                "DistressedDude", 
                "DamselInDistress", 
                "HarpOfFemininity", 
                "CoolOldGuy"
            ], 
            "shared_count": 4, 
            "id": "DjangoUnchained", 
            "name": "Django Unchained", 
            "poster_url": "DjangoUnchained.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DamselInDistress", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "TheSwanPrincess", 
            "name": "The Swan Princess", 
            "poster_url": "TheSwanPrincess.jpg"
        }
    ], 
    "id": "TheAristocats", 
    "name": "The Aristocats"
}