{
    "plot": "Nick Fury is director of S.H.I.E.L.D, an international peace keeping agency. The agency is a who's who of Marvel Super Heroes, with Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When global security is threatened by Loki and his cohorts, Nick Fury and his team will need all their powers to save the world from disaster.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "notable"
                ], 
                "role": "Pretty much everyone in The Avengers. Black Widow and Hawkeye constantly  once Hawkeye is back on the Avengers' side, Thor and Captain America, and Thor and the Hulk are particularly notable.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "'Old", 
                    "'born"
                ], 
                "role": "In The Avengers, the Badass Bystander who stood up to Loki who was only credited as 'Old German' after Loki's 'born to be ruled' speech''.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "good", 
                    "artistic", 
                    "polite", 
                    "lip-raped", 
                    "later", 
                    "hyperactive", 
                    "only", 
                    "shot", 
                    "anti-aircraft"
                ], 
                "role": "From The Avengers, [[´Captain America: The First Avenger the good Captain America]] qualifies. He's less uppercrust and more the ideal American Boy Next Door type; however, he makes up for that with his keen intelligence and artistic talent. He's unfailingly polite to every woman he meets - he shields Black Widow instead of himself or Hawkeye during battle, and he pretty much gets lip-raped by a random secretary because he can't figure out how to turn down her advances without being rude. He will do anything to help a friend, even go on what basically amounts to a suicide mission, alone. The only time we see him drinking heavily is when said friend dies later on - and even then, his hyperactive metabolism won't let him get drunk. He plays The Spock to Iron Man's The McCoy (and challenges Iron Man to a one-on-one fistfight, not over a woman, but because Tony's being the consummate douchebag we all know and love). And the only time we hear him swear is when he's vehemently ordering his love interest (who outranks him) to get the hell outta Dodge before she's shot down by anti-aircraft artillery. Damn.", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "snarky"
                ], 
                "role": "The Avengers gives us the Odd Friendship variant on this trope when introverted, tormented Bruce Banner and snarky show-off Tony Stark hit it off as soon as they meet.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [], 
                "role": "He's also like this in The Avengers.", 
                "id": "StoutStrength"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "helpless"
                ], 
                "role": "Black Widow's introduction scene in The Avengers. As Joss Whedon commented, \"This is my entire career in one scene: Look, she's helpless! No, she's kicking their asses!\"", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [
                    "favorite", 
                    "tactic"
                ], 
                "role": "The Avengers reveals that this is a favorite tactic of Natasha Romanoff/Black Widow.", 
                "id": "DeliberatelyDistressedDamsel"
            }, 
            {
                "adjectives": [
                    "unfair", 
                    "entire", 
                    "strong", 
                    "muscular", 
                    "virile", 
                    "tight-fitting"
                ], 
                "role": "The Avengers. All of them. Special mention goes to Mark Ruffalo's Shirtless Scene, who already won the Estrogen Brigade over with his Stoic Woobie performance. It's almost unfair — the guys just get Scarlett Johansson, while the girls get an entire team of strong, muscular, virile men in either tight-fitting or sleeveless costumes.", 
                "id": "EstrogenBrigade"
            }
        ]
    }, 
    "imdbid": "tt0848228", 
    "poster_url": "TheAvengers.jpg", 
    "similar": [
        {
            "shared": [
                "EstrogenBrigade", 
                "BashBrothers", 
                "CoolOldGuy", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 4, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "BashBrothers", 
                "SensitiveGuyAndManlyMan", 
                "CoolOldGuy", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "EstrogenBrigade", 
                "StoutStrength", 
                "SensitiveGuyAndManlyMan"
            ], 
            "shared_count": 3, 
            "id": "StreetFighter", 
            "name": "Street Fighter", 
            "poster_url": "StreetFighter.jpg"
        }, 
        {
            "shared": [
                "EstrogenBrigade", 
                "SensitiveGuyAndManlyMan", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "BashBrothers", 
                "CoolOldGuy", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 3, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }
    ], 
    "id": "TheAvengers", 
    "name": "The Avengers"
}