{
    "plot": "Brothers - older Stephen and three years junior Bloom - have been con artists since they were kids. Stephen is the mastermind, for who the intricacy of the story used in the con is as important as the positive outcome of the swindle. Bloom is the main character of Stephen's stories, the character he considers the anti-hero. As adults, they travel the world and never enlist the same people twice in their cons, except for their consistent sidekick, the mysterious and primarily silent Bang Bang, a Japanese woman who just appeared in their lives one day and who has a penchant for blowing things up. As Bloom hits his mid-thirties, he wants to quit the business as he is losing his own identity to that of the characters he portrays; he doesn't know anymore what is real and what is make-believe. Stephen talks him into one last con, the mark to be the eccentric, lonely but beautiful New Jersey heiress, Penelope Stamp. Penelope's primary past-time in life is to, as she calls it, \"borrow hobbies\": when she sees something she likes, she learns how to do it solely through reading books. As the brothers go through their final con on Penelope, three main problems may occur to thwart the plan. First, the brothers' former mentor and now arch enemy, Diamond Dog, may exact his long awaited revenge on the brothers. Second, Penelope may end up being more unpredictable than all their former marks. And third, Bloom, who has let love slip by in his life, may fall for Penelope. But through the process, no one ever really knows who is conning who.", 
    "genres": "Adventure, Comedy, Drama", 
    "release_year": "2008", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Bang-Bang", 
                    "Asian"
                ], 
                "role": "Action Girl: Bang-Bang, the \"muscle\" of the group, is a slender Asian woman who shows a proficiency with firearms and explosives.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Strange Girl: Penelope embodies this trope.", 
                "id": "StrangeGirl"
            }
        ]
    }, 
    "imdbid": "tt0844286", 
    "poster_url": "TheBrothersBloom.jpg", 
    "similar": [
        {
            "shared": [
                "StrangeGirl", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "Beetlejuice", 
            "name": "Beetlejuice", 
            "poster_url": "Beetlejuice.jpg"
        }, 
        {
            "shared": [
                "StrangeGirl", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "StrangeGirl", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "Hanna", 
            "name": "Hanna", 
            "poster_url": "Hanna.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "ToTheLimit", 
            "name": "To The Limit", 
            "poster_url": "ToTheLimit.jpg"
        }, 
        {
            "shared": [
                "ActionGirl"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "TheBrothersBloom", 
    "name": "The Brothers Bloom"
}