{
    "plot": "Twenty-eight-year-old Tom leads a life that might be termed as criminal. In doing so, he follows in the footsteps of his father, who made his money from dirty, and sometimes brutal, real estate deals. Tom is a pretty hard-boiled guy but also strangely considerate as far as his father is concerned. Somehow he appears to have arrived at a critical juncture in his life when a chance encounter prompts him to take up the piano and become a concert pianist, like his mother. He senses that this might be his final opportunity to take back his life. His piano teacher is a Chinese piano virtuoso who has recently come to live in France. She doesn't speak a lick of French so music becomes the only language they have in common. Before long, Jacques' bid to be a better person means that he begins to yearn for true love. But, when he finally has the chance of winning his best friend's wife, his passion only succeeds in scaring her. And then, one day, his dubious past comes to light...", 
    "genres": "Action, Crime, Drama", 
    "release_year": "2005", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Missing Mom: Tom's mother died ten years earlier. It is in part to reconnect with her memory that he starts practicing the piano again.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0411270", 
    "poster_url": "TheBeatThatMyHeartSkipped.jpg", 
    "similar": [
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "IndependenceDay", 
            "name": "Independence Day", 
            "poster_url": "IndependenceDay.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Epic", 
            "name": "Epic"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "StarTrekInsurrection", 
            "name": "Star Trek: Insurrection", 
            "poster_url": "StarTrekInsurrection.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "TheBeatThatMyHeartSkipped", 
    "name": "The Beat That My Heart Skipped"
}