{
    "plot": "Evan Treborn grows up in a small town with his single, working mother and his friends. He suffers from memory blackouts where he suddenly finds himself somewhere else, confused. Evan's friends and mother hardly believe him, thinking he makes it up just to get out of trouble. As Evan grows up he has fewer of these blackouts until he seems to have recovered. Since the age of seven he has written a diary of his blackout moments so he can remember what happens. One day at college he starts to read one of his old diaries, and suddenly a flashback hits him like a brick!", 
    "genres": "Sci-Fi, Thriller", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "subtle", 
                    "full", 
                    "frat-boy", 
                    "future", 
                    "very", 
                    "clean-shaven"
                ], 
                "role": "Beard of Sorrow: It's subtle, but there. In the futures that Evan loses Kayleigh in he's always grown out a full beard. When he's still with her in the \"frat-boy\" future he's shaved it down to a goatee, but it isn't until the very end of the movie, when he's put her being a part of his life behind him that he's clean-shaven.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "full", 
                    "frat-boy", 
                    "future", 
                    "very", 
                    "clean-shaven"
                ], 
                "role": "In The Butterfly Effect it's subtly used, but there. In the futures that Evan loses Kayleigh in he's always grown out a full beard. When he's still with her in the \"frat-boy\" future he's shaved it down to a goatee, but it isn't until the very end of the movie, when he's put her being a part of his life behind him that he's clean-shaven.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "hot", 
                    "obese"
                ], 
                "role": "Evan's roommate Thumper in The Butterfly Effect, who's seen making out with an array of hot girls despite being an obese guy in goth clothing.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "hot", 
                    "obese"
                ], 
                "role": "Kavorka Man: Evan's roommate Thumper, who's seen making out with an array of hot girls despite being an obese guy in goth clothing.", 
                "id": "KavorkaMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Hooker with a Heart of Gold: Deconstructed.", 
                "id": "HookerWithAHeartOfGold"
            }
        ]
    }, 
    "imdbid": "tt0289879", 
    "poster_url": "TheButterflyEffect.jpg", 
    "similar": [
        {
            "shared": [
                "BeardOfSorrow", 
                "KavorkaMan", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "KavorkaMan"
            ], 
            "shared_count": 2, 
            "id": "WhenHarryMetSally", 
            "name": "When Harry Met Sally", 
            "poster_url": "WhenHarryMetSally.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "HeavyRain", 
            "name": "Heavy Rain"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "TheCommitments", 
            "name": "The Commitments", 
            "poster_url": "TheCommitments.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "Purgatory", 
            "name": "Purgatory", 
            "poster_url": "Purgatory.jpg"
        }
    ], 
    "id": "TheButterflyEffect", 
    "name": "The Butterfly Effect"
}