{
    "plot": "They were five students with nothing in common, faced with spending a Saturday detention together in their high school library. At 7 a.m., they had nothing to say, but by 4 p.m., they had bared their souls to each other and become good friends. To the outside world they were simply a Brain, an Athlete, a Basket Case, a Princess, and a Criminal, but to each other, they would always be the Breakfast Club.", 
    "genres": "Comedy, Drama", 
    "release_year": "1985", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "top"
                ], 
                "role": "Big Man on Campus: Andy, who is trying to emulate his father that demands that Andy always be at the top.", 
                "id": "BigManOnCampus"
            }, 
            {
                "adjectives": [
                    "stereotypical", 
                    "clear", 
                    "guilty"
                ], 
                "role": "Andy Clark from The Breakfast Club acts like this, but he turns out to be a deconstruction. He only participates in the stereotypical behavior of beating up a nerd because he's pressured by his father. In the Saturday detention, it's made clear that he feels genuinely guilty over it.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "painful", 
                    "terrible", 
                    "real", 
                    "upset", 
                    "angry"
                ], 
                "role": "Jerk Jock: Deconstructed through Andy. He feels like he has to be an asshole and a bully to the weaker students because his father expects that behavior out of him. When he plays a humiliating and painful prank on another kid, he feels terrible about it afterward, but his dad is only upset that he got caught. Before revealing why he's in detention he is possibly the kindest of the characters, sticking up for Claire and Brian when Bender picks on them, showing real concern for Alison when she is upset and even regrets accusing John of lying about his abuse and he sees how angry it made him.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "able", 
                    "first", 
                    "scared", 
                    "debatable", 
                    "able"
                ], 
                "role": "Miles Gloriosus: Bender. He puts out an image of toughness but Andy is able to take him down with ease. Even when Bender pulls a knife and casually talks about killing Andy, he's slowly backing away from the fight. Confirmed when Principal Vernon challenges Bender to a fight, asking repeatedly for Bender to throw the first punch, while he just sits there looking like a scared puppy. The scene with Bender and Vernon is debatable: Vernon wanted to be able to claim Bender had assaulted him, and Bender knew it. Hell, Vernon had literally just pointed out that no one would take Bender's word over his; his plan was obvious. Also, given Bender's upbringing, him getting into anykind of altercation with Andy would just result in him having to deal with his father the minute he finds out and thats something he doesn't want to deal with.", 
                "id": "MilesGloriosus"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "empty", 
                    "snobbish"
                ], 
                "role": "Claire, the Alpha Bitch, is a Type A Stepford Smiler who feels that her life is empty, and that her parents only use her as a tool in their endless arguments. And she's hardly the \"queen bee\"—in fact, it's peer pressure that essentially molded her into the snobbish bitch that she is, and she feels miserably forced into it.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "Brian"
                ], 
                "role": "Education Mama: Brian's parents are a nasty case of this.", 
                "id": "EducationMama"
            }, 
            {
                "adjectives": [
                    "Brian", 
                    "cynical", 
                    "poor", 
                    "academic"
                ], 
                "role": "The Breakfast Club: Brian's parents may be the nastiest, most cynical example of this trope on celluloid. Emotionally, they treat the poor kid like garbage, apparently don't care about his  suicidal tendencies, and it is strongly implied they are living vicariously through his academic achievements. Damn.", 
                "id": "EducationMama"
            }, 
            {
                "adjectives": [
                    "Brian"
                ], 
                "role": "Brian's mother from The Breakfast Club, who vicariously lives through Brian's school achievements while treating him like crap.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "Allison Reynolds probably isn't this, but likes to tell people she is.", 
                "id": "GoodBadGirl"
            }, 
            {
                "adjectives": [
                    "miserable", 
                    "due"
                ], 
                "role": "Claire from The Breakfast Club. In fact, her bitchiness comes less from herself and more from peer pressure, and it's shown that deep down she's miserable due to it.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [
                    "Lovable"
                ], 
                "role": "Lovable Alpha Bitch: Claire.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [
                    "topic"
                ], 
                "role": "Discussed in The Breakfast Club, where the topic of sex is brought up between Allison and Claire.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [
                    "Non-concealment"
                ], 
                "role": "Non-concealment example: \"I wanna see what Claire can do.\"", 
                "id": "Ptitleba4e2b2g"
            }, 
            {
                "adjectives": [
                    "academic"
                ], 
                "role": "Male example: \"Andrew! You've got to be NUMBER ONE! I won't tolerate any losers in this family! WIN, WIN WIN!\"\n While we're on the subject of The Breakfast Club, Brian's parents live vicariously off of his academic achievements.", 
                "id": "StageMom"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "Stage Mom: Andrew's dad was a male example.", 
                "id": "StageMom"
            }, 
            {
                "adjectives": [
                    "academic"
                ], 
                "role": "While we're on the subject of The Breakfast Club, Brian's parents live vicariously off of his academic achievements.", 
                "id": "StageMom"
            }
        ]
    }, 
    "imdbid": "tt0088847", 
    "poster_url": "TheBreakfastClub.jpg", 
    "similar": [
        {
            "shared": [
                "AlphaBitch", 
                "BigManOnCampus", 
                "JerkJock", 
                "LovableAlphaBitch", 
                "StageMom"
            ], 
            "shared_count": 5, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "TheHotChick", 
            "name": "The Hot Chick", 
            "poster_url": "TheHotChick.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "EducationMama", 
                "BigManOnCampus", 
                "JerkJock"
            ], 
            "shared_count": 3, 
            "id": "DeadPoetsSociety", 
            "name": "Dead Poets Society", 
            "poster_url": "DeadPoetsSociety.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }
    ], 
    "id": "TheBreakfastClub", 
    "name": "The Breakfast Club"
}