{
    "plot": "Dave Bannion is an upright cop on the trail of a vicious gang he suspects holds power over the police force. Bannion is tipped off after a colleague's suicide and his fellow officers' suspicious silence lead him to believe that they are on the gangsters' payroll. When a bomb meant for him kills his wife instead, Bannion becomes a furious force of vengeance and justice, aided along the way by the gangster's spurned girlfriend Debbie. As Bannion and Debbie fall further and further into the Gangland's insidious and brutal trap, they must use any means necessary (including murder) to get to the truth.", 
    "genres": "Crime, Film-Noir, Thriller", 
    "release_year": "1953", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Dark Mistress: Debby either doesn't realize or doesn't care that her boyfriend Vince is a violent psychopath. Until he turns on her, that is.", 
                "id": "DarkMistress"
            }, 
            {
                "adjectives": [
                    "vicious"
                ], 
                "role": "In The Big Heat, The Dragon's girlfriend starts out as the ditzy type, ignoring her boyfriend's vicious tendencies. Until he turns on her, that is.", 
                "id": "DarkMistress"
            }, 
            {
                "adjectives": [
                    "Disposable", 
                    "nice", 
                    "bad", 
                    "bad"
                ], 
                "role": "Disposable Woman: Gosh, isn't Mrs. Bannion sweet and nice and pretty? Too bad she has to get blown up by a car bomb just to give her husband extra motivation to get the bad guys.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "sure", 
                    "extra-motivated"
                ], 
                "role": "Jocelyn Brando's character in The Big Heat is one of these, offed just to make sure her cop husband is extra-motivated to take down the mob.", 
                "id": "DisposableWoman"
            }
        ]
    }, 
    "imdbid": "tt0045555", 
    "poster_url": "TheBigHeat.jpg", 
    "similar": [
        {
            "shared": [
                "DisposableWoman"
            ], 
            "shared_count": 1, 
            "id": "KamenRider", 
            "name": "Kamen Rider"
        }, 
        {
            "shared": [
                "DisposableWoman"
            ], 
            "shared_count": 1, 
            "id": "Stargate", 
            "name": "Stargate", 
            "poster_url": "Stargate.jpg"
        }, 
        {
            "shared": [
                "DisposableWoman"
            ], 
            "shared_count": 1, 
            "id": "TheDarkKnight", 
            "name": "The Dark Knight", 
            "poster_url": "TheDarkKnight.jpg"
        }, 
        {
            "shared": [
                "DarkMistress"
            ], 
            "shared_count": 1, 
            "id": "DrMabuseTheGambler", 
            "name": "Dr. Mabuse, the Gambler", 
            "poster_url": "DrMabuseTheGambler.jpg"
        }, 
        {
            "shared": [
                "DarkMistress"
            ], 
            "shared_count": 1, 
            "id": "MysteryMen", 
            "name": "Mystery Men", 
            "poster_url": "MysteryMen.jpg"
        }
    ], 
    "id": "TheBigHeat", 
    "name": "The Big Heat"
}