{
    "plot": "The film deals with the situation of British prisoners of war during World War II who are ordered to build a bridge to accommodate the Burma-Siam railway. Their instinct is to sabotage the bridge but, under the leadership of Colonel Nicholson, they are persuaded that the bridge should be constructed as a symbol of British morale, spirit and dignity in adverse circumstances. At first, the prisoners admire Nicholson when he bravely endures torture rather than compromise his principles for the benefit of the Japanese commandant Saito. He is an honorable but arrogant man, who is slowly revealed to be a deluded obsessive. He convinces himself that the bridge is a monument to British character, but actually is a monument to himself, and his insistence on its construction becomes a subtle form of collaboration with the enemy. Unknown to him, the Allies have sent a mission into the jungle, led by Warden and an American, Shears, to blow up the bridge.", 
    "genres": "Adventure, Drama, War", 
    "release_year": "1957", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "French", 
                    "actual", 
                    "whole", 
                    "hospital"
                ], 
                "role": "A Father to His Men / An Officer and a Gentleman: Col. Nicholson. The character was based on French collaborateurs known to the author, while the actual colonel (Philip Toosey) was evidently above reproach. Even the Japanese second-in-command grew to respect him. Of course, the whole \"father to his men\" business is subverted when Nicholson drags sick men out of the hospital to work on the bridge.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [], 
                "role": "The Casanova: Shears, it seems.", 
                "id": "TheCasanova"
            }
        ]
    }, 
    "imdbid": "tt0050212", 
    "poster_url": "TheBridgeOnTheRiverKwai.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "CatherineTheGreat", 
            "name": "Catherine The Great", 
            "poster_url": "CatherineTheGreat.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "Apollo13", 
            "name": "Apollo 13", 
            "poster_url": "Apollo13.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "Dune", 
            "name": "Dune", 
            "poster_url": "Dune.jpg"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }
    ], 
    "id": "TheBridgeOnTheRiverKwai", 
    "name": "The Bridge on the River Kwai"
}