{
    "plot": "Two Irish brothers accidentally killed mafia thugs. They turned themselves in and were released as heroes. They then see it as a calling by God and started knocking off mafia gang members one by one. Willem Dafoe plays the detective trying to figure out the killings, but the closer he was to catching the Irish brothers, the more he thinks the brothers are doing the right thing.", 
    "genres": "Action, Crime, Thriller", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "first", 
                    "flirtatious", 
                    "awesome", 
                    "female", 
                    "big", 
                    "bad"
                ], 
                "role": "The Boondock Saints: When the Boston cops first notice Agent Paul Smecker's flirtatious behavior towards men and generally camp hand gestures, they start to laugh. Cue Smecker owning their asses for the rest of the movie. In fact, he gets progressively more camp and progressively more awesome, coming to the point where he  dresses up as a female hooker to infiltrate the big bad's mansion. He kills two goons and saves the heroes from their untimely demise.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [], 
                "role": "Badass Grandpa: Il Duce. Turns out to be the Saints' daddy. Technically, he isn't a grandpa though.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "literal"
                ], 
                "role": "And of course the literal brothers Connor and Murphy McManus in The Boondock Saints.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "long", 
                    "first"
                ], 
                "role": "The McManus Brothers evidently grew beards and long shaggy hair while hiding out in Ireland after the events of the first Boondock Saints film. Before returning to Boston, they shave and cut their hair.... then wonder why they did that, when now they match their wanted posters, and before they \"looked like Jesus Christ.\"", 
                "id": "BeardnessProtectionProgram"
            }, 
            {
                "adjectives": [
                    "last", 
                    "twenty-five", 
                    "sprung", 
                    "explosive"
                ], 
                "role": "The Boondock Saints had a father who  was in prison for the last twenty-five to thirty years because he was a deadly mafia assassin known as Il Duce. He gets sprung from prison by Yakavetta to take on the job of killing Rocco, who Yakavetta believes is behind the killings that the two protagonists are doing, and he ends up fighting both of his sons and Rocco in an explosive shootout. It is only when Yakavetta guns down Rocco himself and the Duke walks in on the brothers delivering the family prayer to him that he realizes exactly who the two men are and finishes the prayer himself, thus revealing to them that he is their father.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "feminine", 
                    "first", 
                    "eager", 
                    "good", 
                    "discretionary"
                ], 
                "role": "In The Boondock Saints, the character played by (not exactly feminine in any sense of the word) Willem Dafoe sneaks into a mobster household by putting on a wig and a dress. Despite the disguise being horribly unconvincing, the first man he meets nearly jumps on him. Subverted in that he appears too prepared for the role, too eager to engage in it, and too good at slipping into the character. He's never explicitly stated to be a Crossdresser, but he's certainly not the wholesome type, as evidenced by a discretionary cut when the flirtation with the mooks seem to be going to another level.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [], 
                "role": "Ivan Checkov from The Boondock Saints", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: —>  Il Duce: Easy boys... Daddy's working.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: When the twins awaken from the vision/dream they get one of these.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "tough", 
                    "straight", 
                    "detective", 
                    "Straight", 
                    "comfortable"
                ], 
                "role": "Ultimately averted by Willem Dafoe's character, FBI Agent Paul Smecker, in The Boondock Saints. He seems like a tough, straight detective, until he's seen in bed with another man. When the man wants to cuddle, he sneers, \"Cuddle, what a fag\", making it seem like he's a Straight Gay, but throughout the film he makes a number of campy flourishes. He occasionally lisps and minces for humor's sake, and at one point sits on pink divan while petting a pink feather boa. In the end, he seems rather comfortable dressing in drag for a disguise. \"Schmecker\" or \"Smecker\" are American Yiddish euphemisms for \"schmuck\", which means \"penis\", and is often used as an insult.", 
                "id": "StraightGay"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "The woman in the opening scenes of The Boondock Saints.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "subsequent", 
                    "'Rule", 
                    "'Untouched"
                ], 
                "role": "The Boondock Saints had an incident of this in the opening credits of the film: though Rosengurtle Baumgartner's sexuality is never brought up, her attire and mannerisms (and subsequent kicking of one of the brothers in the crotch for cracking jokes about her 'Rule of Thumb' rant) solidify her as a member of this trope. She also has a tattoo on her neck that reads 'Untouched by man'.", 
                "id": "ButchLesbian"
            }, 
            {
                "adjectives": [
                    "estranged", 
                    "ex-wife", 
                    "first", 
                    "ill-timed", 
                    "debatable"
                ], 
                "role": "Missing Mom: The condition of Murphy and Connor's mother  (and, presumably, Il Duce's estranged wife or possibly ex-wife) is never touched on in the released films. A deleted scene from the first film has the twins receiving an ill-timed phone call from her, but how that scene fits into canon is debatable.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "Special"
                ], 
                "role": "Ms. Fanservice: Special Agent Eunice Bloom, in the Old Western getup.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0144117", 
    "poster_url": "TheBoondockSaints.jpg", 
    "similar": [
        {
            "shared": [
                "MissingMom", 
                "DisappearedDad", 
                "BadassGrandpa", 
                "ShirtlessScene", 
                "BashBrothers"
            ], 
            "shared_count": 5, 
            "id": "StarTrek", 
            "name": "Star Trek", 
            "poster_url": "StarTrek.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad", 
                "ShirtlessScene", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ShirtlessScene", 
                "MsFanservice", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MissingMom", 
                "MsFanservice", 
                "BashBrothers"
            ], 
            "shared_count": 4, 
            "id": "ClashOfTheTitans", 
            "name": "Clash of the Titans", 
            "poster_url": "ClashOfTheTitans.jpg"
        }, 
        {
            "shared": [
                "MissingMom", 
                "DisappearedDad", 
                "DisguisedInDrag", 
                "BashBrothers"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }
    ], 
    "id": "TheBoondockSaints", 
    "name": "The Boondock Saints"
}