{
    "plot": "It is the year 2130 A.D. An Earth exploratory ship, the USS Palomino, discovers a black hole with a lost ship, the USS Cygnus, just outside its event horizon. Deciding to solve the mystery of the Cygnus are: the Palomino's Captain, Dan Holland; his First Officer, Lieutenant Charlie Pizer; journalist Harry Booth; scientist and ESP-sensitive Dr. Kate McCrae, whose father was the Cygnus's First Officer; Dr. Alex Durant, the expedition's civilian leader; and the robot known as V.I.N.CENT. The Palomino attempts a dangerous fly-by of the darkened ship. As they come within close range of it, the buffeting they experience (due to the black hole's gravity) suddenly ceases. They bring more instruments to bear on the derelict, but do not even realize the gravity-free zone is artificial; slipping outside it, they are almost drawn into the black hole, an abyss from which no one can escape. Matters worsen when Reinhardt holds the crew captive, after realizing that they can help him reach his goal. The squad must now figure out a way to flee from Reinhardt -- before it's too late.", 
    "genres": "Action, Adventure, Family", 
    "release_year": "1979", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "big", 
                    "ill-advised"
                ], 
                "role": "Dirty Coward:  Harry Booth. He talks big about trying to overpower Reinhardt's robots, take control of the Cygnus, and head back to Earth... but as soon as he finds out what actually happened to the rest of Reinhardt's crew, he immediately changes his mind (\"If they couldn't pull it off, what chance do we have?\")... which leads to his ill-advised attempt to steal the Palomino and make for Earth alone.", 
                "id": "DirtyCoward"
            }
        ]
    }, 
    "imdbid": "tt0078869", 
    "poster_url": "TheBlackHole.jpg", 
    "similar": [
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "ISpitOnYourGrave", 
            "name": "I Spit on Your Grave", 
            "poster_url": "ISpitOnYourGrave.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "WomanInTheMoon", 
            "name": "Woman in the Moon", 
            "poster_url": "WomanInTheMoon.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "TheKillerShrews", 
            "name": "The Killer Shrews", 
            "poster_url": "TheKillerShrews.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "TheVikings", 
            "name": "The Vikings", 
            "poster_url": "TheVikings.jpg"
        }, 
        {
            "shared": [
                "DirtyCoward"
            ], 
            "shared_count": 1, 
            "id": "EscapeFromLA", 
            "name": "Escape from L.A.", 
            "poster_url": "EscapeFromLA.jpg"
        }
    ], 
    "id": "TheBlackHole", 
    "name": "The Black Hole"
}