{
    "plot": "Paul and Eddie have just begun previews for the new Off-Broadway musical \"Adam and Steve Just the Way God Made 'Em.\" Their lives strangely mirror the characters they are playing. Paul is looking for the perfect man and Eddie is dealing with how his sexuality and faith can mix. After yet another disastrous dating experience, Paul has an epiphany. He is done dating and just wants to be a slut like the sexy chorus boys that share his dressing room. Eddie has to tell his parents that he's gay and is starring in a show that calls the bible the \"Breeder's Informational Book of Living Examples\". Eddie comes out to his family and Paul goes on Manhunt. Eddie's parents are destroyed by the news and Paul can't even have a good one-night stand. But after musical numbers with scantly clad tap dancing angels, a retelling of Genesis, tele-evangelists, a camp that attempts to turn gay kids straight, and a bunch of showtunes, everyone realizes that life gets better once they accept who they really are. And they are just the way God made 'em.", 
    "genres": "Comedy, Drama, Music", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Camp Gay - Every gay character in the musical. Including (and specially) the angels.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [], 
                "role": "Straight Gay - Most of the gay characters fall into this.", 
                "id": "StraightGay"
            }
        ]
    }, 
    "imdbid": "tt1332100", 
    "poster_url": "TheBigGayMusical.jpg", 
    "similar": [
        {
            "shared": [
                "CampGay", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "TheBirdcage", 
            "name": "The Birdcage", 
            "poster_url": "TheBirdcage.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "LatterDays", 
            "name": "Latter Days", 
            "poster_url": "LatterDays.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "AnotherGayMovie", 
            "name": "Another Gay Movie", 
            "poster_url": "AnotherGayMovie.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "InAndOut", 
            "name": "In And Out"
        }
    ], 
    "id": "TheBigGayMusical", 
    "name": "The Big Gay Musical"
}