{
    "plot": "On a journey to San Francisco, Richard, his father and cousin Emmeline find themselves on a ship about to explode. Rushed to a lifeboat with Paddy Button, the two children escape while their father (and uncle) are on another lifeboat. In the chaos following, the lifeboats are separated. Paddy, Richard and Emmeline find themselves with no food and no water stuck in the middle of nowhere. After some time, the three come across an uncharted paradise, where Paddy quickly teaches the children fishing, hunting and building. After maybe a month or two, Paddy gets very drunk off a barrel of rum found on the island when they first arrive, and drowns in the middle of the night. Emmeline and Richard, now alone and very scared, move location and rebuild their island home. Many years later, the two young teenagers have developed a very real home, but hormones and feelings between the two strain their friendship, until Richard, who is still very determined to reach San Francisco, is let down by Emmeline when a ship passes by the island and she does not light the signal fire. Throwing her out of the home they had built together, Emmeline attempts to survive on her own but is hurt. After Richard finds her dying, he realizes how he really feels for her and manages to save her. Nature runs its course and their friendship turns into love as the couple learn about the facts of life, when Emmeline has a baby and does not understand why.", 
    "genres": "Adventure, Drama, Romance", 
    "release_year": "1980", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Victorian"
                ], 
                "role": "Dick M is a Victorian one of these in H.D. Stacpoole's The Garden of God, sequel to The Blue Lagoon.", 
                "id": "SurferDude"
            }, 
            {
                "adjectives": [], 
                "role": "Walking Shirtless Scene", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Brooke Shields' hair was apparently glued to her breasts during some scenes of the 1980 film The Blue Lagoon in order to satisfy censors.", 
                "id": "GodivaHair"
            }, 
            {
                "adjectives": [
                    "inadvertant"
                ], 
                "role": "Godiva Hair: Emmeline. To the point (as pointed out by Roger Ebert) of Narm. The makeup artists had to glue Shield's hair to her chest to prevent any inadvertant nip slips.", 
                "id": "GodivaHair"
            }, 
            {
                "adjectives": [], 
                "role": "Godiva Hair: Emmeline. To the point (as pointed out by Roger Ebert) of Narm.", 
                "id": "GodivaHair"
            }
        ]
    }, 
    "imdbid": "tt0080453", 
    "poster_url": "TheBlueLagoon.jpg", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "SurferDude"
            ], 
            "shared_count": 2, 
            "id": "SurfNazisMustDie", 
            "name": "Surf Nazis Must Die", 
            "poster_url": "SurfNazisMustDie.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "GodivaHair"
            ], 
            "shared_count": 2, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "GodivaHair"
            ], 
            "shared_count": 1, 
            "id": "TheMaskOfZorro", 
            "name": "The Mask of Zorro", 
            "poster_url": "TheMaskOfZorro.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene"
            ], 
            "shared_count": 1, 
            "id": "TheBladeMaster", 
            "name": "The Blade Master"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene"
            ], 
            "shared_count": 1, 
            "id": "Neighbors2014", 
            "name": "Neighbors", 
            "poster_url": "Neighbors2014.jpg"
        }
    ], 
    "id": "TheBlueLagoon", 
    "name": "The Blue Lagoon"
}