{
    "plot": "Centuries ago, in the land of Prydain, a young man named Taran is given the task of protecting Hen Wen, a magical oracular pig, who knows the location of the mystical black cauldron. This is not an easy task, for The Evil Horned King will stop at nothing to get the cauldron.", 
    "genres": "Animation, Adventure, Family", 
    "release_year": "1985", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Coward/Lovable", 
                    "first"
                ], 
                "role": "Dirty Coward/Lovable Coward: Gurgi always ducks out at the first hint of trouble, much to Taran's fury... until he volunteers to give his life to stop the Cauldron Born.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "only", 
                    "faithful", 
                    "other"
                ], 
                "role": "Grumpy Old Man: Doli, in probably the only characterization completely faithful to the books other than the species switch from dwarf to fairy.", 
                "id": "GrumpyOldMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Red-Headed", 
                    "unpopular", 
                    "local", 
                    "red-gold", 
                    "last", 
                    "royal", 
                    "young", 
                    "first"
                ], 
                "role": "Everything's Better with Princesses: Eilonwy, the Red-Headed Stepchild of the Disney Princesses; this being one of the \"unpopular movies\" mentioned in the trope entry, you won't be seeing her plastered all over your local department store. For added hilarity, in the books, the character was described as having red-gold hair, while in the film it's Hair of Gold, Heart of Gold. This is brought up in the Disney Princess cosplay skit, in which all of the Disney Princesses meet onstage and argue. When Eilonwy introduces herself, everyone asks \"Who are you?\" When she mentions the film's name, they all say, \"Never heard of it!\" In the books, she is the last living member of the royal house of Llyr. She's actually the daughter of the Princess Angharad, who fell in love with a commoner and ran away from her royal family to marry him. Eilonwy was kidnapped from her parents and orphaned as a very young child. In the books, after the first adventure, she goes to live with Taran and Dallben at the farm Caer Dallben. Anyone who wants to belittle her calls her a \"scullery maid\", in reference to the chores she does there. The film reflects this point but fails to explain or develop it.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "Other", 
                    "jungle"
                ], 
                "role": "Other commonly forgotten Disney princesses (or queens) include Eilonwy, Tiger Lily, Kidagakash, Maid Marian (mentioned in the film to be King Richard's niece), and Nala (by marriage to Simba). If you stretch, you can also include Jane (queen of the jungle), Alice (who becomes a queen in the chess sense in Through the Looking Glass), Megara (who originally was a daughter of King Chreon), and Kida (daughter of the king for almost 10,000 years, and becomes queen in the end).", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "well-endowed", 
                    "bodacious"
                ], 
                "role": "Gag Boobs: Orwen of the Three witches, who is on the heavier side and well-endowed enough to lose a frog in her bodacious bosoms.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "white"
                ], 
                "role": "The Black Cauldron's Eilonwy wears dress that is a mixture of purple, pink, and white.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [
                    "Magical", 
                    "magic", 
                    "evident", 
                    "magical", 
                    "bauble", 
                    "original", 
                    "much", 
                    "magical", 
                    "long"
                ], 
                "role": "Magical Girl: Only a minor example; Eilonwy's magic is only evident in the magical bauble that accompanies her and is the reason the Horned King kidnapped her. In the original novel series, she performs much greater magical feats and in fact is descended from a long line of enchantresses.", 
                "id": "MagicalGirl"
            }, 
            {
                "adjectives": [
                    "Rebellious"
                ], 
                "role": "Rebellious Princess: Eilonwy.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "spooky", 
                    "common", 
                    "Indo-European", 
                    "overall"
                ], 
                "role": "The books and the characters were inspired by Welsh mythology. The three witches are based on the concept of the triple goddess- maiden, mother, and crone. (Groups of three spooky sisters are pretty common in Indo-European mythologies, overall...)", 
                "id": "TheHecateSisters"
            }, 
            {
                "adjectives": [
                    "much", 
                    "original"
                ], 
                "role": "The Black Cauldron: Princess Eilowny. Not as much as in the original book series (see below), but she still has her moments.", 
                "id": "TomboyPrincess"
            }, 
            {
                "adjectives": [
                    "original"
                ], 
                "role": "Tomboy Princess: Eilonwy, although heavily watered down from her original characterization, which fit this more.", 
                "id": "TomboyPrincess"
            }, 
            {
                "adjectives": [
                    "spooky", 
                    "common", 
                    "Indo-European", 
                    "overall"
                ], 
                "role": "Wicked Witch: 3 for the price of 1! In the books, they're forces of nature, the three fates of Greek mythology. The books and the characters were inspired by Welsh mythology. The three witches are based on the concept of the triple goddess- maiden, mother, and crone. (Groups of three spooky sisters are pretty common in Indo-European mythologies, overall...) And really, they're not all that wicked. Jerk Asses, yes, but they do  bring Gurgi back in exchange for the cauldron.", 
                "id": "WickedWitch"
            }
        ]
    }, 
    "imdbid": "tt0088814", 
    "poster_url": "TheBlackCauldron.jpg", 
    "similar": [
        {
            "shared": [
                "TomboyPrincess", 
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "WickedWitch", 
                "GracefulLadiesLikePurple"
            ], 
            "shared_count": 5, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "TomboyPrincess", 
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "GracefulLadiesLikePurple"
            ], 
            "shared_count": 4, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "WickedWitch", 
                "GracefulLadiesLikePurple"
            ], 
            "shared_count": 4, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess", 
                "GracefulLadiesLikePurple", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "TomboyPrincess", 
                "EverythingsBetterWithPrincesses", 
                "RebelliousPrincess"
            ], 
            "shared_count": 3, 
            "id": "Fantaghiro", 
            "name": "Fantaghiro"
        }
    ], 
    "id": "TheBlackCauldron", 
    "name": "The Black Cauldron"
}