{
    "plot": "Founded in 1910 just outside of the city limits of Gilbert located in Lanville County, Texas, the Chicken Ranch has for generations been known as the best whorehouse in Texas for its wholesome fun, strict moral code and cleanliness, all perpetuated by its original owner, Miss Wulla Jean. Seven years ago, Miss Wulla Jean passed on, leaving the Chicken Ranch to her favorite working girl, Miss Mona Stangley, who wants to keep the same traditions of Miss Wulla Jean. The Chicken Ranch has always had the unofficial blessing of the local authorities, who see the ranch providing an important community service, one which most in local authority have used at one time or another in their life. In fact, Miss Mona and Lanville County Sheriff Ed Earl Dodd have been in a relationship for years, Ed Earl who is Miss Mona's protector, albeit one with a hot temper and good ol' boy attitude that doesn't exactly match the needs of his law upholding position. That blessing may change when television personality and consumer watchdog, Melvin P. Thorpe, one of the most powerful men in the state, starts an on-air exposé of the illegal activities at the Chicken Ranch, the exposé which includes Ed Earl's role in letting it happen. Ed Earl and Miss Mona's relationship goes through some difficult times on how to deal with this issue, especially with the upcoming annual party night with the players following the Thanksgiving Day football game between the University of Texas and Texas A&M, this party which is arguably the Chicken Ranch's busiest night of the year and one filled with tradition for the ranch and the participating schools. Will the Chicken Ranch be able to remain open especially in light of a spineless Governor who sways to the direction of polls, and will Ed Earl and Miss Mona's relationship be able to withstand the pressure?", 
    "genres": "Comedy, Musical", 
    "release_year": "1982", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Hooker with a Heart of Gold: Mona", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [], 
                "role": "Miss Kitty: Mona", 
                "id": "MissKitty"
            }, 
            {
                "adjectives": [
                    "musical"
                ], 
                "role": "Mona Stangley in the musical The Best Little Whorehouse in Texas. (Played by Dolly Parton in the film version.)", 
                "id": "MissKitty"
            }
        ]
    }, 
    "imdbid": "tt0083642", 
    "poster_url": "TheBestLittleWhorehouseInTexas.jpg", 
    "similar": [
        {
            "shared": [
                "MissKitty", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "TheHouseOfTheSpirits", 
            "name": "The House of the Spirits", 
            "poster_url": "TheHouseOfTheSpirits.jpg"
        }, 
        {
            "shared": [
                "MissKitty", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "OnceUponATimeInTheWest", 
            "name": "Once Upon a Time in the West", 
            "poster_url": "OnceUponATimeInTheWest.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "Purgatory", 
            "name": "Purgatory", 
            "poster_url": "Purgatory.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "Django", 
            "name": "Django", 
            "poster_url": "Django.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 1, 
            "id": "McCabeAndMrsMiller", 
            "name": "McCabe & Mrs. Miller", 
            "poster_url": "McCabeAndMrsMiller.jpg"
        }
    ], 
    "id": "TheBestLittleWhorehouseInTexas", 
    "name": "The Best Little Whorehouse in Texas"
}