{
    "plot": "The Croods is a prehistoric comedy adventure that follows the world's first family as they embark on a journey of a lifetime when the cave that has always shielded them from danger is destroyed. Traveling across a spectacular landscape, the Croods discover an incredible new world filled with fantastic creatures -- and their outlook is changed forever.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "tall", 
                    "nimble", 
                    "capable", 
                    "straight", 
                    "bat-", 
                    "save/pry", 
                    "first", 
                    "certain", 
                    "several"
                ], 
                "role": "Amazon Chaser: Eep is almost as tall as Guy, possibly twice his weight, extremely fast and nimble and more than capable of kicking his ass (and does so repeatedly). Guy is absolutely fascinated with her. It's Zigzagged and Inverted before it's played straight though. Eep liked Guy pretty much off the bat- Grugg at one point had to save/pry Guy away from Eeps backbreaking grip-but Guy didn't return those affections at first. He spent most of the first half of the movie somewhat terrified of her and tried at least twice to get away. Doesn't help that she gets a tiny bit possessive at certain points and repeatedly manhandles him several times throughout the movie.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "same", 
                    "nimble", 
                    "capable"
                ], 
                "role": "In The Croods, Eep is almost the same height of Guy, possibly twice his weight, impossibly fast and nimble and more than capable of kicking his ass (and does so repeatedly). Guy is absolutely fascinated with her.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [], 
                "role": "Dumb Muscle: Thunk. Many believed that Grug is this but he's actually Smarter Than He Looks.", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [
                    "only", 
                    "male", 
                    "modern"
                ], 
                "role": "Mr. Fanservice: Guy, the only male with an \"modern human\" body design.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "Overprotective"
                ], 
                "role": "Overprotective Dad: Grug.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "safe", 
                    "instant", 
                    "imminent"
                ], 
                "role": "Papa Wolf: Grug outright states that it's his job to protect the family and keep them safe from danger. This comes to a head when he throws them all (including Guy) across the cliff to safety.  Shortly after, we can see that he's resigned himself to his fate, because as long as his family is safe, he's okay with dying. But the instant he thinks someone's in danger, he immediately comes up with a way to get back to them, because imminent death is no excuse for this man.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "Guy from The Croods.", 
                "id": "WalkingShirtlessScene"
            }, 
            {
                "adjectives": [], 
                "role": "Walking Shirtless Scene: Guy, though he's in a log for some amount of the film.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "broad", 
                    "heavy", 
                    "happy", 
                    "such"
                ], 
                "role": "Big Beautiful Woman: Ugga and Eep are designed as thick, broad and heavy set and they are perfectly happy as such.", 
                "id": "BigBeautifulWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Bratty Teenage Daughter: Eep, who thinks her family are a pain to be around, strains against her father's rules and sleeps alone while the others gather in a bundle.", 
                "id": "BrattyTeenageDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Never Mess with Granny: Gran is a lot tougher than she looks.", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Nubile Savage: Averted; see the Big Beautiful Woman description above. In fact, Guy probably follows this trope the closest out of all the other characters.", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [], 
                "role": "Team Mom: Ugga. Both literally and figuratively.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Ugga", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0481499", 
    "poster_url": "TheCroods.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "WalkingShirtlessScene", 
                "NubileSavage", 
                "MrFanservice"
            ], 
            "shared_count": 4, 
            "id": "Tarzan", 
            "name": "Tarzan", 
            "poster_url": "Tarzan.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "NubileSavage", 
                "NeverMessWithGranny", 
                "BigBeautifulWoman"
            ], 
            "shared_count": 4, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "TeamMom", 
                "AmazonChaser", 
                "TheChick"
            ], 
            "shared_count": 4, 
            "id": "KungFuPanda", 
            "name": "Kung Fu Panda", 
            "poster_url": "KungFuPanda.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "AmazonChaser", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "NubileSavage", 
                "OverprotectiveDad", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "TheFlintstones", 
            "name": "The Flintstones", 
            "poster_url": "TheFlintstones.jpg"
        }
    ], 
    "id": "TheCroods", 
    "name": "The Croods"
}