{
    "plot": "Pool hustler Fast Eddie Felson finds the young, promising pool player Vincent in a local bar and he sees in him a younger version of himself. To try and make it as in the old days, Eddie offers to teach Vincent how to be a hustler. After some hesitations Vincent accepts and Eddie takes him and Vincent's girlfriend Carmen on a tour through the country to work the pool halls. However, Vincent's tendency to show off his talent and by doing so warning off the players and losing money, soon leads to a confrontation with Eddie.", 
    "genres": "Drama, Sport", 
    "release_year": "1986", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "interested", 
                    "heavy"
                ], 
                "role": "Crazy Jealous Guy: Vincent exhibits signs of this whenever he gets the slightest hint that Carmen might be interested in someone else. During a hustle, when Eddie and Carmen were pretending to be a couple, Vincent was noticeably distracted by Eddie's heavy petting of her.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "interested", 
                    "heavy"
                ], 
                "role": "Vincent in The Color of Money exhibits signs of this whenever he gets the slightest hint that his girlfriend Carmen might be interested in someone else. During a hustle, when Eddie and Carmen were pretending to be a couple, Vincent was noticeably distracted by Eddie's heavy petting of her.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "black"
                ], 
                "role": "In The Color of Money, when Eddie takes Vincent and Carmen to a pool hall filled with black men, Vincent urges Carmen to return to the hotel, worried that she could get raped. Street Smart Carmen's insistence that she can take care of herself gets ignored.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Carmen in The Color of Money is a light version of this. She keeps herself looking nice, but she spends her time hanging around pool halls, smoking and drinking with the guys. She is also a lot more Street Smart than her boyfriend, Vincent.", 
                "id": "TheLadette"
            }, 
            {
                "adjectives": [
                    "Lad-ette", 
                    "attractive"
                ], 
                "role": "The Lad-ette: Carmen is a mild version of this. Though she enjoys looking attractive, she happily spends her time in pool halls, smoking and drinking with the guys while rounding up marks. She's also a lot more Street Smart than Vincent.", 
                "id": "TheLadette"
            }
        ]
    }, 
    "imdbid": "tt0090863", 
    "poster_url": "TheColorOfMoney.jpg", 
    "similar": [
        {
            "shared": [
                "CrazyJealousGuy", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "Super", 
            "name": "Super", 
            "poster_url": "Super.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "HorribleBosses", 
            "name": "Horrible Bosses", 
            "poster_url": "HorribleBosses.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "ConAir", 
            "name": "Con Air", 
            "poster_url": "ConAir.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "LayerCake", 
            "name": "Layer Cake", 
            "poster_url": "LayerCake.jpg"
        }
    ], 
    "id": "TheColorOfMoney", 
    "name": "The Color of Money"
}