{
    "plot": "Richard O'Barry was the man who captured and trained the dolphins for the television show Flipper (1964). O'Barry's view of cetaceans in captivity changed from that experience when as the last straw he saw that one of the dolphins playing Flipper - her name being Kathy - basically committed suicide in his arms because of the stress of being in captivity. Since that time, he has become one of the leading advocates against cetaceans in captivity and for the preservation of cetaceans in the wild. O'Barry and filmmaker 'Louie Psihoyos (I)' go about trying to expose one of what they see as the most cruel acts against wild dolphins in the world in Taiji, Japan, where dolphins are routinely corralled, either to be sold alive to aquariums and marine parks, or slaughtered for meat. The primary secluded cove where this activity is taking place is heavily guarded. O'Barry and Psihoyos are well known as enemies by the authorities in Taiji, the authorities who will use whatever tactic to expel the two from Japan forever. O'Barry, Psihoyos and their team covertly try to film as a document of conclusive evidence this cruel behavior. They employ among others Hollywood cameramen and deep sea free divers. They also highlight what is considered the dangerous consumption of dolphin meat (due to its high concentration of mercury) which is often sold not as dolphin meat, and the Japanese government's methodical buying off of poorer third world nations for their support of Japan's whaling industry, that support most specifically at the International Whaling Commission.", 
    "genres": "Documentary, Crime", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "great", 
                    "such", 
                    "compulsive", 
                    "adventurous", 
                    "Japanese"
                ], 
                "role": "Most accounts give the impression of a particularly great personality, such as being a \"compulsive listener\", coming to the rescue of a drunk woman who collapsed in the middle of a New York street, and recently making the extremely adventurous documentary The Cove, exposing the slaughter of dolphins by Japanese corporations, and winning an Oscar for it.", 
                "id": "KavorkaMan"
            }
        ]
    }, 
    "imdbid": "tt1313104", 
    "poster_url": "TheCove.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "TheCommitments", 
            "name": "The Commitments", 
            "poster_url": "TheCommitments.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "Popeye", 
            "name": "Popeye", 
            "poster_url": "Popeye.jpg"
        }
    ], 
    "id": "TheCove", 
    "name": "The Cove"
}