{
    "plot": "Teacher François Marin and his colleagues are preparing for another school year teaching at a racially mixed inner city high school in Paris. The teachers talk to each other about their prospective students, both the good and the bad. The teachers collectively want to inspire their students, but each teacher is an individual who will do things in his or her own way to achieve the results they desire. They also have differing viewpoints on the students themselves, and how best to praise and discipline them. The administration of the school tries to be as fair as possible, which includes having student representatives sit on the student evaluation committee. Marin's class this year of fourteen and fifteen year olds is no different than previous years, although the names and faces have changed. Marin tries to get through to his students, sometimes with success and sometimes resulting in utter failure. Even Marin has his breaking point, which may result in him doing things he would probably admit to himself are wrong. But after all is said and done, there is next year and another group of students.", 
    "genres": "Drama", 
    "release_year": "2008", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Education Mama: Inverted. Wei's parents are worried that he pushes himself too hard in his schoolwork", 
                "id": "EducationMama"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Esmeralda and her friend Khoumba to an extent.", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt1068646", 
    "poster_url": "TheClass.jpg", 
    "similar": [
        {
            "shared": [
                "EducationMama", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 2, 
            "id": "DragonBall", 
            "name": "Dragon Ball"
        }, 
        {
            "shared": [
                "EducationMama", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 2, 
            "id": "LittleWomen", 
            "name": "Little Women", 
            "poster_url": "LittleWomen.jpg"
        }, 
        {
            "shared": [
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 1, 
            "id": "KuchKuchHotaHai", 
            "name": "Kuch Kuch Hota Hai", 
            "poster_url": "KuchKuchHotaHai.jpg"
        }, 
        {
            "shared": [
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 1, 
            "id": "ALeagueOfTheirOwn", 
            "name": "A League of Their Own", 
            "poster_url": "ALeagueOfTheirOwn.jpg"
        }
    ], 
    "id": "TheClass", 
    "name": "The Class"
}