{
    "plot": "When the Pevensie family are evacuated out to the country, they are unaware of the adventure they will encounter. During a game of hide and seek, the youngest daughter, Lucy (Henley) discovers a wardrobe which transports her to the land of Narnia. Covered in snow, Narnia is full of weird and wonderful creatures, but is watched over by the evil White Witch, Jadis (Swinton). When all four Pevensie children end up through the wardrobe, they discover that it was meant to be, as two daughters of Eve and two sons of Adam must join with the mighty lion, Aslan (Neeson) to defeat the evil White Witch.", 
    "genres": "Adventure, Family, Fantasy", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "bad", 
                    "eponymous", 
                    "clean-shaven", 
                    "good"
                ], 
                "role": "In The Chronicles of Narnia: Prince Caspian the Telmarine aristocrats are bearded and bad, except for the eponymous Caspian, who is clean-shaven and a good guy.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "first", 
                    "Last"
                ], 
                "role": "The Chronicles of Narnia: Peter and Edmund in the first two books (and Susan in the films); Jill and Eustace in The Last Battle.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "Tirian"
                ], 
                "role": "Distressed Dude: In The Silver Chair,  Rilian is under the enchantment of the evil Lady of the Green Kirtle. Jill, Eustace, and Puddleglum rescue him. In The Last Battle, when Tirian accuses Shift of lying, the Calormenes tie him to a tree.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [], 
                "role": "In The Chronicles of Narnia, Peter and Edmund become Good Kings after the events of The Lion, the Witch, and the Wardrobe, with their sisters Susan and Lucy becoming High Queens. Prince Caspian also fits this trope after he comes to power.", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "first", 
                    "last", 
                    "minor", 
                    "later"
                ], 
                "role": "Susan, Lucy, and Aravis in The Chronicles of Narnia, though the first two are Queens and the last one is minor Calormen nobility (who later becomes Queen of Archeland).", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "first", 
                    "high", 
                    "female", 
                    "stereotypical", 
                    "classic"
                ], 
                "role": "The Chronicles of Narnia\n Averted when the two Pevensie girls, Susan and Lucy, become Queens of Narnia in the first book, bypassing Princess altogether.\n We get two quasi-princesses in The Horse and His Boy. Aravis and Lasaraleen are daughters of high ranking officials in Calormen, so they're not technically princesses (their title is \"Tarkheena\" - female equivalent to \"Tarkhan\") though Lasaraleen indeed acts like a stereotypical princess. Aravis  eventually marries the heir to the throne of Archenland, making her a princess in the classic sense and presumably eventually a Queen.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "later", 
                    "powerful", 
                    "other", 
                    "blatant", 
                    "Shasta/King", 
                    "prosperous", 
                    "certifiable"
                ], 
                "role": "The Chronicles of Narnia:\n In The Magician's Nephew, Jadis (who later becomes the White Witch) is the Queen of the most powerful nation in her world, so what does she do when her sister attempts to overthrow her? She uses her magic to kill every other living being on the planet, then sits around waiting for someone to take her to another world so she can presumably do it all over again. Harsh. Even more blatant when you consider that she is the Satan to Aslan's Golden Feline Jesus. And while it was mentioned that while Aravis and Shasta/King Cor quarreled quite a lot after they were married, the fact that the kingdom remained prosperous for so long would indicate that she was a subversion as well.\n The Lady of the Green Kirtle from The Silver Chair is sometimes called the Queen of Underland, though given how her \"subjects\" were basically gnomes that she kidnapped, brainwashed, and enslaved and her \"kingdom\" was more or less a palace under the ground, it's uncertain how certifiable her claims for the title are. Still, she would have become that had her plan succeeded.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "Pale-Skinned", 
                    "attractive"
                ], 
                "role": "The Chronicles of Narnia:\n The Eerie Pale-Skinned Brunette White Witch Jadis, but her beauty isn't emphasized much. In The Magician's Nephew, however, Jadis was very attractive to Digory, at least before she ate the fruit.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [
                    "Caspian"
                ], 
                "role": "Subverted in the film version of Prince Caspian: While Caspian holds his sword to Miraz' throat, Miraz' wife grabs a crossbow and points it at Caspian (without climbing out of bed!), turning the scene into a Mexican Standoff.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [], 
                "role": "Ojou: Queen Susan", 
                "id": "Ojou"
            }, 
            {
                "adjectives": [
                    "faithful", 
                    "enthusiastic"
                ], 
                "role": "The Chronicles of Narnia has Lucy Pevensie, who discovers Narnia, insists on helping save Mr Tumnus, is a faithful believer in Narnia, and is an enthusiastic archer.", 
                "id": "OutdoorsyGal"
            }, 
            {
                "adjectives": [], 
                "role": "In Lewis's The Chronicles of Narnia we have Polly Plummer, Lucy Pevensie, Jill Pole and Aravis Tarkheena.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "scimitar-fighting"
                ], 
                "role": "Aravis of The Horse and His Boy — princess of the Calormene province of Calavar who prefers hunting and riding and scimitar-fighting to what princesses like her best friend Lasaraleen are expected to do. Even leaves her home rather than being forced to marry the Smug Snake of the Tisroc's Prime Minister.  Ends up marrying Shasta aka Prince Cor and becoming the Queen of Archenland.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "The Lion, the Witch, and the Wardrobe: Edmund Pevensie claims Susan always tries to act like Mother, bossing the two youngest Pevensies around. He's right. Her goal is to keep them safe.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [
                    "other", 
                    "rough"
                ], 
                "role": "Tomboy and Girly Girl: Aravis is the tomboy to Lasaraleen's girly-girl. When they meet after some years apart, each finds the other boring — Lasaraleen doesn't understand why Aravis wants to dress like a boy and do rough things, whilst Aravis can't stand Lasaraleen's whirl of parties and dresses.", 
                "id": "TomBoyAndGirlyGirl"
            }, 
            {
                "adjectives": [
                    "good", 
                    "archery", 
                    "fight", 
                    "quiet"
                ], 
                "role": "The Chronicles of Narnia, The Horse and His Boy has Aravis Tharkeena, who upgrades from a Tomboy Noblewoman to a Tomboy Princess when she marries Shasta aka Crown Prince Cor. Lucy The Valiant is a Tomboy Queen who is good with archery and acts like a Cool Big Sis to Aravis when they meet. The girliness and reluctance to openly fight unless it's truly needed is for her older and more quiet sister, Queen Susan the Gentle.", 
                "id": "TomboyPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy Princess: Aravis, after  her marriage to Cor.", 
                "id": "TomboyPrincess"
            }, 
            {
                "adjectives": [
                    "fellow"
                ], 
                "role": "The Chronicles of Narnia has Queen Lucy show one in The Horse and His Boy, where she talks with fellow Tomboy Princess Aravis about dresses and girly things.", 
                "id": "TomboyWithAGirlyStreak"
            }, 
            {
                "adjectives": [], 
                "role": "Ramandu's platinum blonde haired daughter from Chronicles of Narnia, who is actually a star.", 
                "id": "WhiteHairedPrettyGirl"
            }
        ]
    }, 
    "imdbid": "tt0363771", 
    "poster_url": "TheChroniclesOfNarnia.jpg", 
    "similar": [
        {
            "shared": [
                "RebelliousPrincess", 
                "EverythingsBetterWithPrincesses", 
                "HotWitch", 
                "GodSaveUsFromTheQueen", 
                "TomboyPrincess", 
                "PluckyGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 7, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "HotWitch", 
                "GodSaveUsFromTheQueen", 
                "TomboyPrincess", 
                "TheGoodKing", 
                "BadassPrincess"
            ], 
            "shared_count": 6, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "RebelliousPrincess", 
                "EverythingsBetterWithPrincesses", 
                "TomboyPrincess", 
                "TheGoodKing", 
                "BadassPrincess"
            ], 
            "shared_count": 6, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "TomboyWithAGirlyStreak", 
                "WhiteHairedPrettyGirl", 
                "TeamMom", 
                "NeutralFemale", 
                "PluckyGirl", 
                "Ojou"
            ], 
            "shared_count": 6, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "BeardOfEvil", 
                "BadassPrincess", 
                "TheGoodKing", 
                "PluckyGirl", 
                "TomboyPrincess"
            ], 
            "shared_count": 5, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }
    ], 
    "id": "TheChroniclesOfNarnia", 
    "name": "The Chronicles of Narnia"
}