{
    "plot": "Jimmy Rabbitte, che vive di piccoli espedienti in un quartiere proletario di Dublino, si e' messo in testa di organizzare una band musicale per rinverdire i fasti del rythm&blues e del soul. Grazie ad un annuncio sul giornale, Rabbitte comincia a selezionare giovani dal lavoro precario ma pieni di talento: Dean, Fay, Outspan, l'occhialuto Steven , Clifford, Deco, il ciccione senza buone maniere ma con una grande voce, Billy il batterista e Joey \"The lips\", un bizzarro e maturo anziano suonatore di tromba che si vanta di aver suonato con famosi soul-singers. Aggrega anche Natalie, Imelda e Bernie, tre grintose ragazze, ottime coriste e molto sexy. Procuratisi a credito la strumentazione, cominciano le prove, massacranti, che impegnano tutti. Si inizia a suonare in pubblico, in capannoni e feste sociali: il gruppo sembra pervaso dal fuoco della musica e dell'ambizione. La band, pur se dilettantesca e provinciale, sembra lanciata verso il vertice e finisce invece nel fallimento: dissapori, piccole gelosie e contrasti umani ed artistici, sfaldano il gruppo. Il sogno di Jimmy evapora nel nulla e quel grande patrimonio di energia e bravura che poteva fruttare quattrini e successo siPL: disperde nel nulla.", 
    "genres": "Comedy, Drama, Music", 
    "release_year": "1991", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Kavorka Man: Joey Fagan. Then again,  in the novel Imelda explains that she and the other girls had a bet on to see who could get it on with him first.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "famous", 
                    "much", 
                    "long-dead", 
                    "ambiguous", 
                    "able", 
                    "sub-plot"
                ], 
                "role": "Miles Gloriosus: In the film, Joey claims to have played with Elvis Presley, Frank Sinatra, The Beatles and an array of famous soul artists, although he doesn't have much evidence. At the end of the film  he disappears, leaving a postcard explaining he is on tour with the long-dead Joe Tex. This is less ambiguous in the novel, where he is able to provide photographs of himself playing with Otis Redding and others and quickly departs at the conclusion  because he was tricked into thinking he's impregnated one of the girls, the climax of a sub-plot not included in the film.", 
                "id": "MilesGloriosus"
            }, 
            {
                "adjectives": [], 
                "role": "The Casanova: Joey, of all people.", 
                "id": "TheCasanova"
            }
        ]
    }, 
    "imdbid": "tt0101605", 
    "poster_url": "TheCommitments.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "KavorkaMan"
            ], 
            "shared_count": 2, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "KavorkaMan"
            ], 
            "shared_count": 2, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "KavorkaMan"
            ], 
            "shared_count": 2, 
            "id": "CloselyWatchedTrains", 
            "name": "Closely Watched Trains", 
            "poster_url": "CloselyWatchedTrains.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "KavorkaMan"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "KavorkaMan"
            ], 
            "shared_count": 2, 
            "id": "TheFifthElement", 
            "name": "The Fifth Element", 
            "poster_url": "TheFifthElement.jpg"
        }
    ], 
    "id": "TheCommitments", 
    "name": "The Commitments"
}