{
    "plot": "Parisian murder detective commissioner Pierre Niemans is called to Gueron, a self-sufficient, prestigious university in a mountain valley, to investigate the murder on 32-year old professor and librarian Rémy Caillois, whose corpse was found 50 meters high on a steep mountain side, naked, horribly covered in bruises and bleeding wounds, the result of some five hours of bestial torture including quasi-surgical amputation of hands cauterized to prevent bleeding to death- and eyes. Guernon is a closed society of virtually incestuous scientists, de facto succeeding to their parents' posts; the eye-doctor, formerly on the staff, says hereditary genetic diseases are the price of such elitism, but in recent years spread to the simple farming families. Inspector Max Kerkerian examines two crimes in the town: a school break-in with theft of old photos and archive papers as well as a graveyard desecration of Judith Herault, the daughter of local nun Andrée, who lives in a dark cell since 15 years and mumbles the demons who made an attempt of both of their lives have returned to prevent the child endanger their secret. As both police investigations continue, the loner sleuths meet; secrets and other corpses are found, till it all ties together.", 
    "genres": "Crime, Mystery, Thriller", 
    "release_year": "2000", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Sweet Polly Oliver: Judith was disguised as a boy by her mother to escape persecution.", 
                "id": "SweetPollyOliver"
            }
        ]
    }, 
    "imdbid": "tt0228786", 
    "poster_url": "TheCrimsonRivers.jpg", 
    "similar": [
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "Lockout", 
            "name": "Lockout", 
            "poster_url": "Lockout.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "HouseOfFlyingDaggers", 
            "name": "House of Flying Daggers", 
            "poster_url": "HouseOfFlyingDaggers.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "RobinHoodPrinceOfThieves", 
            "name": "Robin Hood: Prince of Thieves", 
            "poster_url": "RobinHoodPrinceOfThieves.jpg"
        }
    ], 
    "id": "TheCrimsonRivers", 
    "name": "The Crimson Rivers"
}