{
    "plot": "Five teenagers head off for a weekend at a secluded cabin in the woods. They arrive to find they are quite isolated with no means of communicating with the outside world. When the cellar door flings itself open, they of course go down to investigate. They find an odd assortment of relics and curios but when one of the women, Dana, reads from a book she awakens a family of deadly zombie killers. There's far more going on however than meets the eye as the five campers are all under observation.", 
    "genres": "Horror, Mystery, Thriller", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "later", 
                    "intelligent", 
                    "sensitive", 
                    "suspicious"
                ], 
                "role": "Initially Subverted but later Enforced in The Cabin in the Woods. Curt is introduced as a generally intelligent and sensitive character, but needing him to fit a stereotype, the Controllers begin manipulating him with drugs until he fits this trope perfectly. Forms a plot point as well: it is so out of character that it makes Marty suspicious.", 
                "id": "Fratbro"
            }, 
            {
                "adjectives": [
                    "ultimate", 
                    "whole", 
                    "annual", 
                    "demonic", 
                    "ritual", 
                    "horrific", 
                    "ritual", 
                    "several", 
                    "sole", 
                    "first", 
                    "such", 
                    "bad", 
                    "entire"
                ], 
                "role": "And then the ultimate reveal:  The whole experiment in the lab is actually to complete an annual ritual created by demonic beings called \"The Ancient Ones\", who enjoy watching humans suffer. The ritual requires at least five people (and at least one each of: The Athlete, The Whore, The Scholar, The Fool, and The Virgin) to die in horrific ways, while saving the virgin for last. If the ritual is not completed, The Ancient Ones will destroy the Earth. There are several labs all across the world, and their sole purpose is to ensure the scenario plays off without a hitch (see the first reveal), which is why horror characters always make such bad decisions. As it turns out, the entire fate of the world depends on it!", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Holden. Dana is impressed.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Final", 
                    "last", 
                    "live"
                ], 
                "role": "Final Girl: Enforced. Dana (the virgin) is allowed to live as long as she is the last one standing. Even when she and Marty have broken into the controller base, the guards are ordered to kill the virgin last. She's not actually a virgin, but the villains \"work with what they've got.\" Lampshaded by Hadley, who admires how it's so effective.  Ultimately averted. Dana and Marty both live to the end - and she is the one closer to death, having just been mauled by a werewolf.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "interesting", 
                    "other", 
                    "typical", 
                    "white", 
                    "friendly", 
                    "loveable", 
                    "funny"
                ], 
                "role": "Jules from The Cabin in the Woods is an interesting subversion of the trope...as is every other trope in this movie. She's the typical alpha bitch sex tease, but only because of the pheromones and chemicals she's been given by the white collars, to change her behavior and intelligence. In truth, she's very friendly, loveable and funny, as seen in the beginning of the film.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [
                    "steady", 
                    "promiscuous"
                ], 
                "role": "The Cabin in the Woods has Jules and Dana shoehorned into both roles, Jules becoming \"The Whore\" and Dana being \"The Virgin\". Though in reality the Whore is in a steady relationship with her boyfriend and isn't exactly that promiscuous while the Virgin/Madonna isn't actually a virgin and has been having an affair with her professor.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [
                    "Stringy-Haired", 
                    "Japanese"
                ], 
                "role": "Stringy-Haired Ghost Girl: What a classroom of Japanese students are shown contending with.", 
                "id": "StringyHairedGhostGirl"
            }, 
            {
                "adjectives": [
                    "Japanese", 
                    "Japanese", 
                    "song", 
                    "happy"
                ], 
                "role": "The Japanese ritual site in The Cabin in the Woods featured a girl like this terrorising a classroom of Japanese children, until they perform a song and dance to turn her into a happy frog.", 
                "id": "StringyHairedGhostGirl"
            }
        ]
    }, 
    "imdbid": "tt1259521", 
    "poster_url": "TheCabinInTheWoods.jpg", 
    "similar": [
        {
            "shared": [
                "ShirtlessScene", 
                "JerkJock", 
                "FinalGirl"
            ], 
            "shared_count": 3, 
            "id": "Gutterballs", 
            "name": "Gutterballs", 
            "poster_url": "Gutterballs.jpg"
        }, 
        {
            "shared": [
                "MadonnaWhoreComplex", 
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "TheBreakfastClub", 
            "name": "The Breakfast Club", 
            "poster_url": "TheBreakfastClub.jpg"
        }, 
        {
            "shared": [
                "StringyHairedGhostGirl", 
                "ShirtlessScene", 
                "FinalGirl"
            ], 
            "shared_count": 3, 
            "id": "TheGrudge", 
            "name": "The Grudge", 
            "poster_url": "TheGrudge.jpg"
        }, 
        {
            "shared": [
                "MadonnaWhoreComplex", 
                "ShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "SaturdayNightFever", 
            "name": "Saturday Night Fever", 
            "poster_url": "SaturdayNightFever.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "TheHotChick", 
            "name": "The Hot Chick", 
            "poster_url": "TheHotChick.jpg"
        }
    ], 
    "id": "TheCabinInTheWoods", 
    "name": "The Cabin in the Woods"
}