{
    "plot": "A bag full of symbolic folklore about werewolves, or, rather, their sexual connotation. Granny tells her granddaughter Rosaleen strange, disturbing tales about innocent maidens falling in love with handsome, heavily eyebrowed strangers with a smoldering look in their eyes; about sudden disappearances of spouses when the moon is round & the wolves are howling in the woods; about babies found inside stork eggs, in a stork nest high up a tree; etc., etc. Of course the story of Little Red Ridinghood is also present, with a very handsome he-wolf! (And of course this he-wolf consumes Grandmother, but 'consumes' Little Red Ridinghood). All the stories are somehow reducible to loss of innocence, and fear of/hunger for (a newly acquired sense of) sexuality; their Freudian character is mirrored in their dreamlike shapes. This movie is not really a horror movie; it's more a multiple tale about growing up into adolescence.", 
    "genres": "Horror, Fantasy", 
    "release_year": "1984", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "creepy"
                ], 
                "role": "Shirtless Scene: A very creepy example with The Huntsman. Whether it's Fanservice or Fan Disservice depends on  how hairy you like your men.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Broken Bird: Gran's rants against men, love, and sexuality hint at this.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [], 
                "role": "Lady in Red: Rosaleen herself, which is disturbing considering she's not even thirteen yet. However, once she receives the red cloak from her grandmother, her sexuality begins to bud.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [
                    "last", 
                    "gate"
                ], 
                "role": "Little Dead Riding Hood: This is set up all through the movie, particularly towards the last trip to Granny's house when Rosaleen finds blood by the gate.", 
                "id": "LittleDeadRidingHood"
            }, 
            {
                "adjectives": [], 
                "role": "Little Red Fighting Hood: Rather than be threatened, Rosaleen  grabs the huntsman's gun and shoots him.", 
                "id": "LittleRedFightingHood"
            }, 
            {
                "adjectives": [], 
                "role": "My Beloved Smother: Granny comes off as this more so than the Mother, who tries to discourage Rosaleen from taking everything Granny says as the Gospel truth.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [], 
                "role": "Badass Grandma: Rosaleen's grandmother certainly puts up a better fight than the tradition granny in Little Red Riding Hood.", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [
                    "actual"
                ], 
                "role": "Woman in Black: Granny, who appears to be a widow. She is the matriarch of the family and the strongest voice of warning against Rosaleen straying from the path.  As it turns out, her words are more restriction than actual warning.", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [
                    "funeral", 
                    "young"
                ], 
                "role": "Woman in White: Alice at her funeral looks interestingly more like a young bride than someone who was savaged by wolves.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0087075", 
    "poster_url": "TheCompanyOfWolves.jpg", 
    "similar": [
        {
            "shared": [
                "WomanInBlack", 
                "BrokenBird", 
                "WomanInWhite", 
                "MyBelovedSmother"
            ], 
            "shared_count": 4, 
            "id": "BlackSwan", 
            "name": "Black Swan", 
            "poster_url": "BlackSwan.jpg"
        }, 
        {
            "shared": [
                "LadyInRed", 
                "NeverMessWithGranny", 
                "ShirtlessScene"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "BrokenBird", 
                "WomanInWhite"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "WomanInWhite", 
                "MyBelovedSmother"
            ], 
            "shared_count": 3, 
            "id": "Fantaghiro", 
            "name": "Fantaghiro"
        }, 
        {
            "shared": [
                "MyBelovedSmother", 
                "LadyInRed", 
                "ShirtlessScene"
            ], 
            "shared_count": 3, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }
    ], 
    "id": "TheCompanyOfWolves", 
    "name": "The Company of Wolves"
}