{
    "plot": "Famous actress Lara Tyler can't get married to author James Arber without intrusive paparazzi crashing the ceremony. Because of James's best-seller, Lara's agent, Steve, checks out the little known Hegg Island in Scotland as the site for their next attempted wedding. Unfortunately, James is a hack, and his book (supposedly based on Hegg) relays little of it accurately. Katie, an island native and the only unmarried woman on it, has been unlucky in love. She's working on writing her own guide to Hegg Island when Steve and crew arrive, eventually hiring her as a reluctant decoy bride to distract the paparazzi. In a mix-up, she and James end up married to each other while Lara, having spotted the press, goes into hiding. Katie and James now have to get an island divorce while avoiding the press while other parties seek out Lara (who has disguised herself as one of the elderly islanders).", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Cock Fight: Angus tries to have one with James, who refuses, saying he \"doesn't fight.\" Angus tries to tackle him anyway, and James manages to throw him to the ground.", 
                "id": "CockFight"
            }, 
            {
                "adjectives": [], 
                "role": "Disappeared Dad: Katie's father left years ago. She and her mother keep a picture of him on the wall to throw darts at.", 
                "id": "DisappearedDad"
            }
        ]
    }, 
    "imdbid": "tt1657299", 
    "poster_url": "TheDecoyBride.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "CockFight"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CockFight"
            ], 
            "shared_count": 2, 
            "id": "Bambi", 
            "name": "Bambi", 
            "poster_url": "Bambi.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CockFight"
            ], 
            "shared_count": 2, 
            "id": "TheGreenHornet", 
            "name": "The Green Hornet", 
            "poster_url": "TheGreenHornet.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CockFight"
            ], 
            "shared_count": 2, 
            "id": "TheRescuers", 
            "name": "The Rescuers", 
            "poster_url": "TheRescuers.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }
    ], 
    "id": "TheDecoyBride", 
    "name": "The Decoy Bride"
}