{
    "plot": "Two campers in the New Jersey woods have their outdoor fun interrupted by the arrival of a meteorite crashing nearby. They go to investigate the crater, but are suddenly attacked and devoured by alien parasites who have hitched a ride to Earth. After finishing off the campers, the hungry space monsters head for a nearby town, where they make their domain in the basement of an old house soon begin polishing off one hapless inhabitant after another. Four young teenagers, plus one pre-teen boy, try to find a way to stop the angry space monsters before they reproduce and literally eat humanity.", 
    "genres": "Horror, Sci-Fi, Thriller", 
    "release_year": "1983", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "likely", 
                    "last", 
                    "precocious", 
                    "little", 
                    "know-how", 
                    "home-made", 
                    "free"
                ], 
                "role": "The girl who looks most likely to be the Final Girl in The Deadly Spawn  dies in the last 20 minutes and is replaced by another girl who arrived shortly before two-thirds of the way through the film. The monster ends up being killed by the precocious little boy who was hiding in the basement where he was cornered by the monster earlier, figured out its weaknesses by observing it, and had enough know-how to construct a home-made bomb when he finally got free.", 
                "id": "FinalGirl"
            }
        ]
    }, 
    "imdbid": "tt0087998", 
    "poster_url": "TheDeadlySpawn.jpg", 
    "similar": [
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "DevilsPrey", 
            "name": "Devil's Prey", 
            "poster_url": "DevilsPrey.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "Suspiria", 
            "name": "Suspiria", 
            "poster_url": "Suspiria.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "YoureNext", 
            "name": "You're Next", 
            "poster_url": "YoureNext.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "NineDead", 
            "name": "Nine Dead", 
            "poster_url": "NineDead.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "FridayThe13thPartVANewBeginning", 
            "name": "Friday the 13th Part V: A New Beginning"
        }
    ], 
    "id": "TheDeadlySpawn", 
    "name": "The Deadly Spawn"
}