{
    "plot": "Batman raises the stakes in his war on crime. With the help of Lieutenant Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the city streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as The Joker.", 
    "genres": "Action, Crime, Drama", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "pre-cursor", 
                    "self-claimed"
                ], 
                "role": "A pre-cursor to Douchy; Melvin, self-claimed brother of the Joker, lives with his mother, whom he tries to pass off as his secretary to the audience, but to no avail. He finally admits it later in the video:", 
                "id": "BasementDweller"
            }, 
            {
                "adjectives": [
                    "whole"
                ], 
                "role": "Alfred from The Dark Knight mentions that he used to be a soldier and once burned a whole forest down to catch a bandit. However, he's never seen in a combat situation in the films.\n Alfred knocks down one of the intruders from behind in the burning mansion in Batman Begins.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "criminal"
                ], 
                "role": "“Gotham's White Knight,” District Attorney Harvey Dent in The Dark Knight is trying to help bring down the criminal empire in Gotham.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [
                    "ballistic"
                ], 
                "role": "Harvey Dent / Two-Face from The Dark Knight. Originally the White Knight of Gotham, he goes ballistic and insane after some antics by The Joker.", 
                "id": "LawmanGoneBad"
            }, 
            {
                "adjectives": [
                    "Bankrupt"
                ], 
                "role": "Morally Bankrupt Banker: Lau, the Chinese banker for the mob.", 
                "id": "MorallyBankruptBanker"
            }, 
            {
                "adjectives": [], 
                "role": "The Dark Knight: The Mob Bank at the beginning.", 
                "id": "MorallyBankruptBanker"
            }, 
            {
                "adjectives": [
                    "prisoner's-dilemma-type", 
                    "other", 
                    "other", 
                    "boat", 
                    "other", 
                    "boat", 
                    "other", 
                    "few", 
                    "large", 
                    "scary", 
                    "black", 
                    "only"
                ], 
                "role": "A minor subversion of this character appeared briefly in The Dark Knight. Towards the end of the film, the Joker sets up a prisoner's-dilemma-type situation: two ferries, stalled in Gotham Harbor, both loaded with explosives. One ferry is carrying prisoners, the other is filled with civilians. The captains of the ferries have the detonators—to each other's boat. If one boat blows up the other, then it will go free. If neither boat destroys the other, they'll both be blown up in a few minutes. The captain of the prisoner's ferry is struggling with the decision, when a very large, very scary black man (played by Tiny Lister) in prisoner's orange and chains comes over to him. He states that the captain knows what he needs to do, but doesn't have the guts for it — but he does. He convinces the captain to hand him the detonator, then immediately throws it out the window and into the water, having said they should've done that ten minutes ago.\n Played straight by Gambol, the black gangster, at least until Joker crashes his party.\n Played straight in the '89 film. Joker employs one of these guys. He's the only henchman to give Batman trouble.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "inverted", 
                    "other"
                ], 
                "role": "Also a inverted version is pulled by the Scary Black Man on the ferry during the finale, when he asks the Warden for the detenator to the other boat.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Rachel.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "primary", 
                    "major", 
                    "emotional", 
                    "major"
                ], 
                "role": "In The Dark Knight, Rachel Dawes' primary plot function is for the Joker to use her death to push Harvey Dent over the edge and deliver a major emotional punch to Bruce Wayne, though she gets some characterization. In The Dark Knight Rises, Selina Kyle averts this trope, as she does have major character development and is still around at the end of the movie.", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "white", 
                    "wide", 
                    "black", 
                    "Assistant"
                ], 
                "role": "In one scene in The Dark Knight, Maggie Gyllenhaal is interrogating a guy, while wearing black slacks, a white dress shirt with wide lapels, and a black vest, or, as one guy called it, \"her David Bowie outfit\".\n As Rachel Dawes is an Assistant District Attorney, she often wears suits.\n Miranda Tate/  Talia al Ghul in The Dark Knight Rises.", 
                "id": "HotChickInABadassSuit"
            }, 
            {
                "adjectives": [
                    "fetish", 
                    "old-fashioned", 
                    "actual", 
                    "bad", 
                    "modesty-wise", 
                    "sexy", 
                    "kind"
                ], 
                "role": "Also  played straight subverted in The Dark Knight, except for fetish fuel value. The nurse uniform itself appears to be somewhat more old-fashioned than what actual nurses are shown to be wearing, and wouldn't be half bad modesty-wise, though still sexy, but  um, it's kind of on the Joker.", 
                "id": "NaughtyNurseOutfit"
            }, 
            {
                "adjectives": [], 
                "role": "Grace Montello-Wayne from the The Dark Knight fanfic Question of Honor.", 
                "id": "TheWomanWearingTheQueenlyMask"
            }
        ]
    }, 
    "imdbid": "tt0468569", 
    "poster_url": "TheDarkKnight.jpg", 
    "similar": [
        {
            "shared": [
                "BattleButler", 
                "DisposableWoman", 
                "ScaryBlackMan", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 4, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "DisposableWoman", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "Taken", 
            "name": "Taken", 
            "poster_url": "Taken.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "DamselInDistress", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "TheBeastmaster", 
            "name": "The Beastmaster", 
            "poster_url": "TheBeastmaster.jpg"
        }, 
        {
            "shared": [
                "DisposableWoman", 
                "HotChickInABadassSuit", 
                "LawmanGoneBad"
            ], 
            "shared_count": 3, 
            "id": "LicenceToKill", 
            "name": "Licence to Kill", 
            "poster_url": "LicenceToKill.jpg"
        }, 
        {
            "shared": [
                "HotChickInABadassSuit", 
                "ScaryBlackMan", 
                "BasementDweller"
            ], 
            "shared_count": 3, 
            "id": "MenInBlack", 
            "name": "Men In Black", 
            "poster_url": "MenInBlack.jpg"
        }
    ], 
    "id": "TheDarkKnight", 
    "name": "The Dark Knight"
}