{
    "plot": "The Republic of Wadiya is ruled by an eccentric and oppressive leader named Hafez Aladeen. Aladeen is summoned to New York to a UN assembly to address concerns about his country's nuclear weapons program, but the trip goes awry.", 
    "genres": "Comedy", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "The Generalissimo: Aladeen embodies the exaggerated version of this.", 
                "id": "TheGeneralissimo"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Admiral General Aladeen's bodyguards in The Dictator. They also serve as sex slaves.", 
                "id": "AmazonBrigade"
            }, 
            {
                "adjectives": [], 
                "role": "Bodyguard Babes: Shabazz's guards.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Perhaps inspired by stories of Gaddafi, Sascha Baron Cohen's character in The Dictator has a few of these.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [
                    "enormous", 
                    "aggressive", 
                    "only"
                ], 
                "role": "Boobs of Steel: The \"virgin guard\" with the enormous Gag Boobs, Etra, is also the most physically aggressive of all the guards, and the only one depicted engaging in violence...using said gag boobs as weapons (in a scene from the unrated extended addition).", 
                "id": "BoobsOfSteel"
            }, 
            {
                "adjectives": [
                    "enormous", 
                    "aggressive"
                ], 
                "role": "In The Dictator, Etra, the \"virgin guard\" with the enormous Gag Boobs, is also the most physically aggressive, and she uses said gag boobs as weapons.", 
                "id": "BoobsOfSteel"
            }, 
            {
                "adjectives": [
                    "extended"
                ], 
                "role": "Gag Boobs: Aladeen's guard Etra. She smashes a stack of bricks with them, and in a scene from the extended unrated edition, attacks  Aladeen himself with them.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "aggressive", 
                    "extended"
                ], 
                "role": "The Dictator had the \"virgin guard\" named Etra, the most aggressive of Aladeen's team of guards. In a scene in the extended unrated edition, she is seen using said boobs as weapons, and is earlier seen smashing a stack of bricks with them.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "democratic", 
                    "political"
                ], 
                "role": "Granola Girl: Zoey, who manages a completely democratic health food store which is hyper eco friendly and takes in political refugees as workers.", 
                "id": "GranolaGirl"
            }, 
            {
                "adjectives": [
                    "funny", 
                    "oral"
                ], 
                "role": "Hairy Girl: Playing alongside the Granola Girl image, Zoey is also seen sporting armpit hair for the length of the movie. She and Aladeen even manage a particularly funny fake out during their \"sex scene\" swapping oral sex for him instead licking her furry armpits.", 
                "id": "HairyGirl"
            }, 
            {
                "adjectives": [
                    "eponymous", 
                    "funny", 
                    "oral"
                ], 
                "role": "In The Dictator, the eponymous main character and unlikely love interest, Zoey, somehow manage a particularly funny fake out during their \"sex scene\" swapping oral sex for The Dictator Aladeen instead licking her hairy armpits.", 
                "id": "HairyGirl"
            }
        ]
    }, 
    "imdbid": "tt1645170", 
    "poster_url": "TheDictator.jpg", 
    "similar": [
        {
            "shared": [
                "AmazonBrigade", 
                "TheGeneralissimo"
            ], 
            "shared_count": 2, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }, 
        {
            "shared": [
                "GranolaGirl", 
                "HairyGirl"
            ], 
            "shared_count": 2, 
            "id": "WithoutAPaddle", 
            "name": "Without A Paddle", 
            "poster_url": "WithoutAPaddle.jpg"
        }, 
        {
            "shared": [
                "AmazonBrigade", 
                "GranolaGirl"
            ], 
            "shared_count": 2, 
            "id": "TheGreatMuppetCaper", 
            "name": "The Great Muppet Caper", 
            "poster_url": "TheGreatMuppetCaper.jpg"
        }, 
        {
            "shared": [
                "BodyguardBabes", 
                "GagBoobs"
            ], 
            "shared_count": 2, 
            "id": "WildWildWest", 
            "name": "Wild Wild West", 
            "poster_url": "WildWildWest.jpg"
        }, 
        {
            "shared": [
                "GranolaGirl", 
                "GagBoobs"
            ], 
            "shared_count": 2, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }
    ], 
    "id": "TheDictator", 
    "name": "The Dictator"
}