{
    "plot": "Despite his tarnished reputation after the events of The Dark Knight, in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its police force which is struggling to cope with Bane's plans to destroy the city.", 
    "genres": "Action, Thriller", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "peculiar", 
                    "vocal", 
                    "jovial", 
                    "nasal"
                ], 
                "role": "In The Dark Knight Rises, Bane has a voice amplifier that gives him an extremely peculiar contrast between the trope (in vocal range) and jovial, eloquent word choice and mode of speech, in comparison with Tom Hardy's fairly nasal voice.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [
                    "hospitalized"
                ], 
                "role": "Badass Grandpa: Gordon's no slouch and this time he gets to show off his ability when he pulls his pistol and gets the drop on two mercenaries armed with submachine guns while hospitalized from a gunshot wound, no less.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "lieutenant", 
                    "bald-headed"
                ], 
                "role": "Beard of Evil: Barsad, Bane's lieutenant, sports one. So does McGarrity, the computer operator for the Stock Exchange heist (who also is bald-headed).", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "shelved", 
                    "reclusive"
                ], 
                "role": "Beard of Sorrow: A shelved and reclusive Bruce Wayne sports a natty Van Dyke, which he shaves when he resumes the mantle.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "eight-year"
                ], 
                "role": "Bruce Wayne early in The Dark Knight Rises, toward the end of his eight-year depression after the events of The Dark Knight.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "few", 
                    "Teal'c"
                ], 
                "role": "Scary Black Man: The captain of the team of mercenaries who take Blake hostage while he's making a solo attempt to grab a few cops through a manhole. It's Teal'c from Stargate, if you were wondering.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "semi-conscious", 
                    "enormous"
                ], 
                "role": "Shirtless Scene: Played with: Bane is shirtless when the two sewer goons bring the semi-conscious Gordon to him, but it's played less for Fanservice and more for giving us that \"Holy crap, that guy is enormous\" feeling. Honest Trailers even uses it in their parody trailer for this movie.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Cat-Burglar", 
                    "elegant"
                ], 
                "role": "Classy Cat-Burglar: Selina Kyle, obviously. Her get up and poise are always elegant when snatching fingerprints or pearl necklaces. The grace with which she backfips out of Bruce's room is just one example.", 
                "id": "ClassyCatBurglar"
            }, 
            {
                "adjectives": [], 
                "role": "Daddy's Little Villain: Miranda Tate, a.k.a Talia al Ghul.", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "The Dark Knight Rises. Bane with Talia Al Ghul  AKA Miranda Tate who wants to finish her Dad's Evil Plan because he was killed in the first movie.", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [
                    "bad"
                ], 
                "role": "Dark Action Girl: Selina Kyle is a competent fighter and works for the bad guys.  Initially.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "scared"
                ], 
                "role": "A variant is done by Selina Kyle in The Dark Knight Rises. While she never actually traps anyone, she has no problem pretending to be a scared, helpless victim, if it means the police will overlook her long enough to make her getaway.\n Played straighter by  love interest Miranda Tate who is really Talia al Ghul, and conspiring with Bane.", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [
                    "third", 
                    "later"
                ], 
                "role": "Decoy Damsel: Miranda Tate is captured by Bane in the third act of the film, leading Bruce to rescue her. Miranda is later revealed to be Talia al Ghul and working with Bane.", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [
                    "general"
                ], 
                "role": "Femme Fatale: Selina clinches it, with some Wounded Gazelle Gambits and general badassery thrown in. Also Miranda Tate, aka Talia al Ghul.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "High"
                ], 
                "role": "High Heel-Face Turn: Selina Kyle", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [], 
                "role": "Miranda Tate/  Talia al Ghul in The Dark Knight Rises.", 
                "id": "HotChickInABadassSuit"
            }, 
            {
                "adjectives": [], 
                "role": "Little Miss Badass: Talia, who escaped from the prison as a child.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [
                    "black"
                ], 
                "role": "Woman in Black: Selina Kyle wears black outfits in practically all of her scenes", 
                "id": "WomanInBlack"
            }
        ]
    }, 
    "imdbid": "tt1345836", 
    "poster_url": "TheDarkKnightRises.jpg", 
    "similar": [
        {
            "shared": [
                "BeardOfSorrow", 
                "WomanInBlack", 
                "LittleMissBadass", 
                "HotChickInABadassSuit", 
                "DarkActionGirl"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "BadassGrandpa", 
                "ShirtlessScene", 
                "DecoyDamsel", 
                "DarkActionGirl"
            ], 
            "shared_count": 5, 
            "id": "LegendOfTheSeeker", 
            "name": "Legend of the Seeker"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "LittleMissBadass", 
                "BeardOfEvil", 
                "ScaryBlackMan", 
                "DarkActionGirl"
            ], 
            "shared_count": 5, 
            "id": "KillBill", 
            "name": "Kill Bill", 
            "poster_url": "KillBill.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "BeardOfEvil", 
                "DarkActionGirl", 
                "FemmeFatale"
            ], 
            "shared_count": 4, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "WomanInBlack", 
                "DarkActionGirl", 
                "FemmeFatale"
            ], 
            "shared_count": 4, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }
    ], 
    "id": "TheDarkKnightRises", 
    "name": "The Dark Knight Rises"
}