{
    "plot": "In The Equalizer, Denzel Washington plays McCall, a man who believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when McCall meets Teri (Chloë Grace Moretz), a young girl under the control of ultra-violent Russian gangsters, he can't stand idly by - he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.", 
    "genres": "Action, Crime, Thriller", 
    "release_year": "2014", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Badass Grandpa: While Robert McCall has a son who is about 20-25 years old, he doesn't seem to have any grandchildren. Regardless, he is still definitely a Badass Old Guy. Dyson as well.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "old", 
                    "kung"
                ], 
                "role": "The Equalizer: Robert McCall may be ~50 years old, but he knows kung fu (or something) and can handle any gun.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "ex-spy"
                ], 
                "role": "Robert McCall, the hero of The Equalizer, is urbane and well-read. And an ex-spy with no compunctions at all with ending a person if they become a problem.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed", 
                    "significant"
                ], 
                "role": "Sharp-Dressed Man: McCall dresses impeccably throughout the show; whenever he doesn't, it's significant in some way. Occasionally includes Waistcoat of Style.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "industrial"
                ], 
                "role": "An episode of The Equalizer had a handsome chronic womaniser get kidnapped by industrial spies who keep insisting that \"she said she gave it to you\" and refuse to believe his claims of innocence. Realising he's going to be tortured he quickly \"confesses\" and promises to get \"it\" to them in 24 hours — he then has to hire the Equalizer to help him sort though the multitude of women he's dated to find the right one. \"It\" turns out to be a microdot on a matchbook handed to him with a girl's phone number written on the inside.", 
                "id": "TheCasanova"
            }, 
            {
                "adjectives": [], 
                "role": "The Casanova: Harley Gage.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "considerable", 
                    "steady", 
                    "good"
                ], 
                "role": "Girl of the Week: McCall generally has somewhere between two and four per season. It's usually implied that they have been or do date for a considerable amount of time but you never see each one beyond one episode, rather implied to be because even though McCall wants to have a steady relationship he's still not very good at maintaining one.", 
                "id": "GirlOfTheWeek"
            }
        ]
    }, 
    "imdbid": "tt0455944", 
    "poster_url": "TheEqualizer.jpg", 
    "similar": [
        {
            "shared": [
                "SharpDressedMan", 
                "BadassGrandpa", 
                "GirlOfTheWeek", 
                "CoolOldGuy"
            ], 
            "shared_count": 4, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "TheCasanova", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "BadassGrandpa", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "BadassGrandpa", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "SpaceCowboys", 
            "name": "Space Cowboys", 
            "poster_url": "SpaceCowboys.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "TheEqualizer", 
    "name": "The Equalizer"
}