{
    "plot": "In this animated comedy from the folks at Disney, the vain and cocky Emperor Kuzco is a very busy man. Besides maintaining his \"groove\", and firing his suspicious administrator, Yzma; he's also planning to build a new waterpark just for himself for his birthday. However, this means destroying one of the villages in his kingdom. Meanwhile, Yzma is hatching a plan to get revenge and usurp the throne. But, in a botched assassination courtesy of Yzma's right-hand man, Kronk, Kuzco is magically transformed into a llama. Now, Kuzco finds himself the property of Pacha, a lowly llama herder whose home is ground zero for the water park. Upon discovering the llama's true self, Pacha offers to help resolve the Emperor's problem and regain his throne, only if he promises to move his water park.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2000", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "asexual"
                ], 
                "role": "Camp Straight: Kuzco is an example of this. (As mentioned above, however, he may be asexual; he just never shows interest in men.)", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "flamboyant"
                ], 
                "role": "Kuzco from The Emperor's New Groove and The Emperor's New School is very flamboyant but has feelings for a girl in the spinoff.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "certain", 
                    "razor-sharp"
                ], 
                "role": "Dumb Muscle: Kronk; somewhat subverted in that in certain narrow areas he displays razor-sharp competence.", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [], 
                "role": "Kronk to Yzma in The Emperor's New Groove.", 
                "id": "RightHandHottie"
            }, 
            {
                "adjectives": [
                    "Right-Hand"
                ], 
                "role": "Right-Hand Hottie: Kronk, to Yzma.", 
                "id": "RightHandHottie"
            }, 
            {
                "adjectives": [], 
                "role": "As quoted above, Kronk from The Emperor's New Groove has legs that are long, but are only slightly larger than broom handles.", 
                "id": "TopHeavyGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "The Emperor's New Groove: Kronk's (male) shoulder angel carries a harp, prompting his shoulder devil to mock the \"sissy, stringy thing.\"", 
                "id": "HarpOfFemininity"
            }, 
            {
                "adjectives": [
                    "parental"
                ], 
                "role": "Kuzco from The Emperor's New Groove lacks in the parental department as well.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "Semi-parodied", 
                    "new"
                ], 
                "role": "Semi-parodied in The Emperor's New Groove with Yzma and Kronk. Cuzco says that she frequently gets a new younger male assistant, with Kronk being \"this year's model.\"", 
                "id": "MistressAndServantBoy"
            }, 
            {
                "adjectives": [
                    "original", 
                    "hot", 
                    "young", 
                    "new", 
                    "much", 
                    "December-May"
                ], 
                "role": "In the original movie The Emperor's New Groove, we're told that Yzma has a revolving cast of hot young male assistants (\"Every decade or so she gets a new one. This year's model is called Kronk.\"), and it doesn't take much to infer that Yzma is keeping Kronk around for some December-May lovin' (it's all in the delivery):", 
                "id": "MrsRobinson"
            }, 
            {
                "adjectives": [], 
                "role": "Mrs. Robinson: Kronk thinks that Yzma is trying this, to his disgust.", 
                "id": "MrsRobinson"
            }, 
            {
                "adjectives": [
                    "pregnant", 
                    "young"
                ], 
                "role": "Pacha's wife Chicha in The Emperor's New Groove is pregnant throughout the movie (and shown realistically), but with the help of her young children is more than a match for the villain Yzma.", 
                "id": "PregnantBadass"
            }, 
            {
                "adjectives": [
                    "Pregnant"
                ], 
                "role": "Pregnant Badass: Yes, in a Disney animated film.", 
                "id": "PregnantBadass"
            }
        ]
    }, 
    "imdbid": "tt0120917", 
    "poster_url": "TheEmperorsNewGroove.jpg", 
    "similar": [
        {
            "shared": [
                "CampStraight", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MrsRobinson", 
                "RightHandHottie"
            ], 
            "shared_count": 2, 
            "id": "CatherineTheGreat", 
            "name": "Catherine The Great", 
            "poster_url": "CatherineTheGreat.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "TopHeavyGuy", 
                "CampStraight"
            ], 
            "shared_count": 2, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "BillyElliot", 
            "name": "Billy Elliot", 
            "poster_url": "BillyElliot.jpg"
        }
    ], 
    "id": "TheEmperorsNewGroove", 
    "name": "The Emperor's New Groove"
}