{
    "plot": "The Flintstones and the Rubbles are modern stone-age families. Fred and Barney work at Slate and Company, mining rock. Fred gives Barney some money so he and Betty can adopt a baby. When Fred and Barney take a test to determine who should become the new associate vice president, Barney returns the favor by switching his test answers for Fred's, whose answers aren't very good. Fred gets the executive position, but little realizes that he's being manipulated by Cliff Vandercave to be the fall guy for an embezzlement scheme.", 
    "genres": "Comedy, Family, Fantasy", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bumbling Dad: Fred, when Pebbles was born.", 
                "id": "BumblingDad"
            }, 
            {
                "adjectives": [], 
                "role": "In The Flintstones episode \"In the Dough\", Fred and Barney disguise themselves as women to enter a baking contest when Wilma and Betty get the measles.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [
                    "obvious", 
                    "own"
                ], 
                "role": "A staple of The Flintstones and The Jetsons, which tended to follow the source material very closely in this respect — minus the obvious underlying affection. Sadly, Cosmo Spacely has his own power issues in dealing with HIS spouse! Seems like what Spacely gives to Jetson at work, Spacely gets at home! Call It Karma.", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [
                    "male", 
                    "prehistoric", 
                    "man-kilt"
                ], 
                "role": "Man in a Kilt: Pretty much every male character wears a prehistoric man-kilt.", 
                "id": "ManInAKilt"
            }, 
            {
                "adjectives": [
                    "Bamm-Bamm", 
                    "small", 
                    "green", 
                    "hot", 
                    "original", 
                    "similar", 
                    "such"
                ], 
                "role": "Mr. Fanservice: In The Pebbles and Bamm-Bamm Show, one episode had them entering Bamm-Bamm in a singing competition. But he can only sing in the shower, so they solved this by having him singing while wearing a small green Speedo and soaking himself in water in front of all his classmates. Sadly it wasn't nearly as hot as it sounds though. Said episode was also a Recycled Script of an original series episode with Barney having a similar singing problem/solution to such.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "Overprotective"
                ], 
                "role": "Overprotective Dad: Fred, in regard to Pebbles.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Bam-Bam from The Flintstones is billed as the strongest baby in the world, and in later cartoons the strongest teen in the world.", 
                "id": "WorldsStrongestMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Mrs. Slaghoople, Wilma Flintstone's mother.", 
                "id": "ApronMatron"
            }, 
            {
                "adjectives": [
                    "few", 
                    "other"
                ], 
                "role": "The Flintstones had one of these show up when Pebbles was born. A few other times, too.", 
                "id": "BattleaxeNurse"
            }, 
            {
                "adjectives": [
                    "complete", 
                    "first", 
                    "serious", 
                    "straight"
                ], 
                "role": "Yet another subversion, in a scene from The Flintstones On the Rocks: Wilma walks into the bedroom with her hair down and in skimpy clothing, complete with Sexophone accompaniment. Fred at first seems to react according to the trope, but it turns out that Wilma was blocking his view of the TV. Seriously, we are in serious need of straight examples in this section...", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "The Flintstones: Wilma and Betty wore mustaches to infiltrate a Water Buffalo lodge meeting.", 
                "id": "GirlsWithMoustaches"
            }, 
            {
                "adjectives": [], 
                "role": "Housewife: Both Wilma and Betty.", 
                "id": "HouseWife"
            }, 
            {
                "adjectives": [], 
                "role": "Maybe three quarters of all the women on The Flintstones would count. The men, not so much.", 
                "id": "NubileSavage"
            }, 
            {
                "adjectives": [], 
                "role": "Sexy Secretary: Halle Berry's character", 
                "id": "SexySecretary"
            }
        ]
    }, 
    "imdbid": "tt0109813", 
    "poster_url": "TheFlintstones.jpg", 
    "similar": [
        {
            "shared": [
                "NubileSavage", 
                "OverprotectiveDad", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "TheCroods", 
            "name": "The Croods", 
            "poster_url": "TheCroods.jpg"
        }, 
        {
            "shared": [
                "ManInAKilt", 
                "MrFanservice", 
                "HouseWife"
            ], 
            "shared_count": 3, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "WorldsStrongestMan", 
                "GirlsWithMoustaches", 
                "OverprotectiveDad"
            ], 
            "shared_count": 3, 
            "id": "LesMiserables", 
            "name": "Les Misérables"
        }, 
        {
            "shared": [
                "OverprotectiveDad", 
                "ApronMatron", 
                "DisguisedInDrag"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "NubileSavage", 
                "BattleaxeNurse", 
                "DisguisedInDrag"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "TheFlintstones", 
    "name": "The Flintstones"
}