{
    "plot": "After years of helping their hubbies climb the ladder of success, three wives have been dumped for newer, curvier models. But the trio is determined to turn their pain into gain. They come up with a cleverly devious plan to hit their exes where it really hurts - in the wallet! Sit back and watch the sparks fly as The Wives get mad, get even and get it all. Justice has seldom been so sweet. Or so much fun.", 
    "genres": "Comedy", 
    "release_year": "1996", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Lesbian"
                ], 
                "role": "Butch Lesbian: Most, if not all, of the women in the gay bar scene.", 
                "id": "ButchLesbian"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Mafia Princess: Brenda. In the book, her connections was a way her husband got her to shut up during the divorce. In the movie, finding out her family helped Morty's business at first was how she got him.", 
                "id": "MafiaPrincess"
            }, 
            {
                "adjectives": [
                    "new", 
                    "young", 
                    "ugly", 
                    "grotesque", 
                    "major", 
                    "Sean", 
                    "old", 
                    "entire"
                ], 
                "role": "Elise Elliot is on her way to becoming this in The First Wives Club. She is still recognised by her fans, but her career is fading. She is struggling to get a role and when she finally thinks she will be cast as the star of a new film it turns out the young and hip regisseur wants her as the ugly and grotesque Mother. She has undergone major plastic surgery and is an alcoholic. She drunkenly complains about how Sean Connery is 400 years old and still a star, but women are cast as the mother when they are older than 20. In her apartment she has an entire room filled with her memorabilia, including prizes she won, gifts etc. Fortunately at the end of the film she gets better.", 
                "id": "WhiteDwarfStarlet"
            }, 
            {
                "adjectives": [
                    "White-Dwarf", 
                    "new", 
                    "young", 
                    "ugly", 
                    "grotesque", 
                    "major", 
                    "Sean", 
                    "old", 
                    "entire", 
                    "much"
                ], 
                "role": "White-Dwarf Starlet: Elise Elliot is on her way to becoming this. She is still recognised by her fans, but her career is fading. She is struggling to get a role and when she finally thinks she will be cast as the star of a new film it turns out the young and hip regisseur wants her as the ugly and grotesque Mother. She has undergone major plastic surgery and is an alcoholic. She drunkenly complains about how Sean Connery is 300 years old and \"still a stud,\" while women in Hollywood have only three ages: \"babe, District Attorney, and Driving Miss Daisy.\" In her apartment she has an entire room filled with her memorabilia, including prizes she won, gifts etc. Fortunately, by the end of the film she's doing much better thanks to Annie and Brenda's intervention and support.", 
                "id": "WhiteDwarfStarlet"
            }
        ]
    }, 
    "imdbid": "tt0116313", 
    "poster_url": "TheFirstWivesClub.jpg", 
    "similar": [
        {
            "shared": [
                "WhiteDwarfStarlet", 
                "ButchLesbian"
            ], 
            "shared_count": 2, 
            "id": "TheProducers", 
            "name": "The Producers", 
            "poster_url": "TheProducers.jpg"
        }, 
        {
            "shared": [
                "WhiteDwarfStarlet"
            ], 
            "shared_count": 1, 
            "id": "DinnerAtEight", 
            "name": "Dinner At Eight", 
            "poster_url": "DinnerAtEight.jpg"
        }, 
        {
            "shared": [
                "MafiaPrincess"
            ], 
            "shared_count": 1, 
            "id": "OnTheJob", 
            "name": "On The Job", 
            "poster_url": "OnTheJob.jpg"
        }, 
        {
            "shared": [
                "WhiteDwarfStarlet"
            ], 
            "shared_count": 1, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }, 
        {
            "shared": [
                "ButchLesbian"
            ], 
            "shared_count": 1, 
            "id": "TheAdventuresOfPicasso", 
            "name": "The Adventures Of Picasso", 
            "poster_url": "TheAdventuresOfPicasso.jpg"
        }
    ], 
    "id": "TheFirstWivesClub", 
    "name": "The First Wives Club"
}