{
    "plot": "Barry Allen is a Central City police forensic scientist with a reasonably happy life, despite the childhood trauma of a mysterious red and yellow being killing his mother and framing his father. All that changes when a massive particle accelerator accident leads to Barry being struck by lightning in his lab. Coming out of coma nine months later, Barry and his new friends at STAR labs find that he now has the ability to move at superhuman speed. Furthermore, Barry learns that he is but one of many affected by that event, most of whom are using their powers for evil. Determined to make a difference, Barry dedicates his life to fighting such threats, as The Flash. While he gains allies he never expected, there are also secret forces determined to aid and manipulate him for their own agenda.", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "2014–", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "crushed", 
                    "rush", 
                    "angry", 
                    "other", 
                    "shy", 
                    "nervous"
                ], 
                "role": "The Flash in Justice League and Justice League Unlimited. Hits on Wonder Woman and Hawkgirl constantly, is thrilled at the prospect of visiting Themyscira, and is not above using his cred as a superhero to chat up the ladies. He's also, well, The Flash, a genuine hero and as gentlemanly as Superman, when it comes down to it.\n Though, remember, \"Because I'm a Stud!\"\n This is played for laughs in one episode, where two girls are seriously turned off when he flirts with them; then a car crashes through the diner they're in, and he has to move them to safety before they're crushed, then rush after the driver. Then one of them gets angry at the other for telling her to ignore him!\n When he developed a crush on Fire, he becomes shy and nervous around her.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "biological", 
                    "step-father"
                ], 
                "role": "Although not her biological nor step-father, Jay Garrick is this way to Stargirl, especially with adult supers (or Captain Marvel) trying to date her. Good to know the oldsters in the JSA aren't just Cool Old Guys.", 
                "id": "OverprotectiveDad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Hot", 
                    "good", 
                    "anti-aging", 
                    "30th", 
                    "young", 
                    "first"
                ], 
                "role": "Hot Mom: they must have really good anti-aging cosmetics in the 30th century if Iris really looks that young in Rebirth... One of Bart's friends immediately develops a crush on Meloni on first sight:", 
                "id": "HotMom"
            }
        ]
    }, 
    "imdbid": "tt3107288", 
    "similar": [
        {
            "shared": [
                "OverprotectiveDad", 
                "ChivalrousPervert"
            ], 
            "shared_count": 2, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad", 
                "HotMom"
            ], 
            "shared_count": 2, 
            "id": "BlackCloud", 
            "name": "Black Cloud", 
            "poster_url": "BlackCloud.jpg"
        }, 
        {
            "shared": [
                "ChivalrousPervert"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "ChivalrousPervert"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad"
            ], 
            "shared_count": 1, 
            "id": "Coneheads", 
            "name": "Coneheads", 
            "poster_url": "Coneheads.jpg"
        }
    ], 
    "id": "TheFlash", 
    "name": "The Flash"
}