{
    "plot": "After a car accident in which his wife, Debra, was killed and he was injured, Frank Bannister develops psychic abilities allowing him to see, hear, and communicate with ghosts. After losing his wife, he then gave up his job as an architect, letting his unfinished \"dream house\" sit incomplete for years, and put these skills to use by befriending a few ghosts and getting them to haunt houses in the area to drum up work for his ghostbusting business; Then Frank proceeds to \"exorcise\" the houses for a fee. But when he discovers that an entity resembling the Grim Reaper is killing people, marking numbers on their forehead beforehand, Frank tries to help the people whom the Reaper is after!", 
    "genres": "Comedy, Horror", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Drill Sergeant Nasty: Hiles, as played by R. Lee Ermey.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: Ray", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "unhappy"
                ], 
                "role": "Adrenaline Makeover: Lucy goes from frumpy woman in an unhappy marriage to hot widow after her husband's death.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "frumpy", 
                    "male"
                ], 
                "role": "Lucy in The Frighteners starts out as a beleaguered widow, a little frumpy, and a doctor who's not taken seriously by the patients of the male doctor she occasionally replaces. After the events of the movie, she ends up with Frank, the hero, in more ways than one.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "exceptional"
                ], 
                "role": "Distressed Damsel: Lucy, with the exceptional moment when she pretends to run from Frank to distract Dammers and sprays him with a fire extinguisher while he's about to shoot Frank.", 
                "id": "DamselInDistress"
            }
        ]
    }, 
    "imdbid": "tt0116365", 
    "poster_url": "TheFrighteners.jpg", 
    "similar": [
        {
            "shared": [
                "AdrenalineMakeover", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "AdrenalineMakeover", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "Stardust", 
            "name": "Stardust", 
            "poster_url": "Stardust.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "TwiceUponATime", 
            "name": "Twice Upon a Time", 
            "poster_url": "TwiceUponATime.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 2, 
            "id": "Cars", 
            "name": "Cars", 
            "poster_url": "Cars.jpg"
        }
    ], 
    "id": "TheFrighteners", 
    "name": "The Frighteners"
}