{
    "plot": "In the twenty-third century, the universe is threatened by evil. The only hope for mankind is the Fifth Element, who comes to Earth every five thousand years to protect the humans with four stones of the four elements: fire, water, Earth and air. A Mondoshawan spacecraft is bringing The Fifth Element back to Earth but it is destroyed by the evil Mangalores. However, a team of scientists use the DNA of the remains of the Fifth Element to rebuild the perfect being called Leeloo. She escapes from the laboratory and stumbles upon the taxi driver and former elite commando major Korben Dallas that helps her to escape from the police. Leeloo tells him that she must meet Father Vito Cornelius to accomplish her mission. Meanwhile, the Evil uses the greedy and cruel Jean-Baptiste Emanuel Zorg and a team of mercenary Mangalores to retrieve the stones and avoid the protection of Leeloo. But the skilled Korben Dallas has fallen in love with Leeloo and decides to help her to retrieve the stones.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "former", 
                    "professional"
                ], 
                "role": "Bald Black Leader Guy: Lindberg, the President of the Federated Territories, played by former professional wrestler Tom \"Tiny\" Lister, Jr.", 
                "id": "BaldBlackLeaderGuy"
            }, 
            {
                "adjectives": [
                    "black"
                ], 
                "role": "Seen in The Fifth Element, where the President of the Federated Territories is both bald and black.", 
                "id": "BaldBlackLeaderGuy"
            }, 
            {
                "adjectives": [
                    "fabulous", 
                    "female", 
                    "gaggle", 
                    "wealthy", 
                    "much"
                ], 
                "role": "Camp Straight Ruby Rhod and his entourage play every camp stereotype to the hilt, even though they're not gay. Just because Ruby's fabulous doesn't mean he doesn't love the ladies. A lot. According to the DVD Commentary, Ruby (originally named \"Loc\") is a combination of Prince and Lenny Kravitz. Ruby even oddly uses the female pronoun when referring to himself on radio calling himself Miss Ruby Rhod. Also applies to Baby Ray, the deaf \"star of stage and screen\", who is surrounded by a gaggle of admiring ladies when we first meet him. If anything, it seems like this is the fashion of the future and Korben is the aberration as a manly man. Or it's a class thing, as they're both wealthy celebrities, and Korben is very much working class.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "voracious", 
                    "large"
                ], 
                "role": "The Fifth Element: Ruby Rhod is flamboyantly camp but also a voracious sex machine to the ladies. To a large extent, an Affectionate Parody of Prince, below in Real Life.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [], 
                "role": "Kavorka Man: Despite dressing and behaving in a fashion that evokes Camp Gay, the ladies love Ruby Rhod, and he loves them right back.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [], 
                "role": "The Fifth Element, even if the sissy boy is the ladies' man.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "Jean-Baptiste", 
                    "high", 
                    "other", 
                    "ex-soldier"
                ], 
                "role": "Jean-Baptiste Emanuel Zorg from The Fifth Element had some of these traits, specifically the delicacy and high fashion. Remember his perfectly appointed office? Dallas, on the other hand, is an ex-soldier played by Bruce Willis.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "bumble"
                ], 
                "role": "Sissy Villain: Zorg The Mongolores after their leader is killed. Korben lampshades that they won't fight without their leader and once Korben manages to find and kill him, the rest of them just bumble around impotently.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "The Casanova: Ruby Rhod", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl / Action Girlfriend: Leeloo", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "last"
                ], 
                "role": "Leeloo from The Fifth Element. Although Corben Dallas was already a trained soldier before she fell into his cab, it still gave him a reason to come out of retirement for one last mission.", 
                "id": "ActionGirlFriend"
            }, 
            {
                "adjectives": [
                    "same"
                ], 
                "role": "She's played by the same actor, Julie T. Wallace, who provides the example from The Fifth Element.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "attractive", 
                    "gratuitous", 
                    "hot"
                ], 
                "role": "70% of jobs for females in the world portrayed in The Fifth Element have Fanservice Extra as a mandatory requirement. While you would expect flight attendants, receptionists and hotel personnel to be strikingly attractive, it goes to gratuitous levels when bodyguards and McDonald's clerks happen to be quite hot and show some cleavage at work.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Innocent Fanservice Girl: Leeloo, who at first doesn't bother to hide her nudity when changing clothes.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Leeloo in The Fifth Element has no problem changing her clothes in front of men (who hurriedly turn around so that they're not looking).", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "Jewish"
                ], 
                "role": "Jewish Mother: Korben Dallas's mother seems to be this.", 
                "id": "JewishMother"
            }, 
            {
                "adjectives": [
                    "Magical"
                ], 
                "role": "Magical Girlfriend: Leeloo, natch.", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [
                    "subverted/played", 
                    "muddy", 
                    "traditional", 
                    "magical", 
                    "stereotypical", 
                    "hardcore", 
                    "good-looking", 
                    "other", 
                    "washed", 
                    "first"
                ], 
                "role": "The line between subverted/played straight in The Fifth Element is a little muddy here. The female lead is a fairly traditional magical girlfriend, but whether or not Bruce Willis fits the stereotypical loser role is questionable. On one hand, he is as hardcore and good-looking as any action hero. On the other hand, he is a washed up vet with no friends or prospects who loses his job and his apartment within the first quarter of the movie.", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [
                    "tiny", 
                    "spiral"
                ], 
                "role": "Leeloo in The Fifth Element is zany, tiny, and cute. She literally falls into Bruce Willis's lap and begins reshaping a life that was on a downward spiral through adventure and mayhem.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [], 
                "role": "My Beloved Smother: Korben's mother.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Leeloo, the female lead of The Fifth Element", 
                "id": "MysteriousWaif"
            }, 
            {
                "adjectives": [
                    "Mysterious", 
                    ".anima-related"
                ], 
                "role": "Mysterious Waif: Leeloo again, of course. She basically has the market cornered on all .anima-related tropes.", 
                "id": "MysteriousWaif"
            }, 
            {
                "adjectives": [], 
                "role": "The flight attendants (one of whom is seduced by Ruby Rhod) in The Fifth Element.", 
                "id": "SexyStewardess"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick — David", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0119116", 
    "poster_url": "TheFifthElement.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan", 
                "SissyVillain", 
                "SexyStewardess", 
                "MagicalGirlfriend", 
                "TheCasanova", 
                "SensitiveGuyAndManlyMan", 
                "JewishMother", 
                "ActionGirlFriend"
            ], 
            "shared_count": 8, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "MagicalGirlfriend", 
                "SensitiveGuyAndManlyMan", 
                "ActionGirl", 
                "InnocentFanserviceGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 5, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "BaldBlackLeaderGuy", 
                "TheChick", 
                "MysteriousWaif", 
                "ActionGirl"
            ], 
            "shared_count": 5, 
            "id": "ResidentEvil", 
            "name": "Resident Evil", 
            "poster_url": "ResidentEvil.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "ManicPixieDreamGirl", 
                "SissyVillain", 
                "MagicalGirlfriend", 
                "KavorkaMan"
            ], 
            "shared_count": 5, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "KavorkaMan", 
                "TheChick", 
                "BrawnHilda"
            ], 
            "shared_count": 4, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }
    ], 
    "id": "TheFifthElement", 
    "name": "The Fifth Element"
}