{
    "plot": "Twenty years after the end of WWI in which the nation of Tomainia was on the losing side, Adenoid Hynkel has risen to power as the ruthless dictator of the country. He believes in a pure Aryan state, and the decimation of the Jews. This situation is unknown to a simple Jewish-Tomainian barber who has since been hospitalized the result of a WWI battle. Upon his release, the barber, who had been suffering from memory loss about the war, is shown the new persecuted life of the Jews by many living in the Jewish ghetto, including a washerwoman named Hannah, with whom he begins a relationship. The barber is ultimately spared such persecution by Commander Schultz, who he saved in that WWI battle. The lives of all Jews in Tomainia are eventually spared with a policy shift by Hynkel himself, who is doing so for ulterior motives. But those motives include a want for world domination, starting with the invasion of neighboring Osterlich, which may be threatened by Benzino Napaloni, the dictator of neighboring Bacteria. Ultimately Schultz, who has turned traitor against Hynkel's regime, and the barber, may be able to join forces to take control of the situation, they using Schultz's inside knowledge of the workings of the regime and the barber's uncanny resemblance to one of those in power.", 
    "genres": "Comedy, Drama, War", 
    "release_year": "1940", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Officer and a Gentleman: Commander Schultz.", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [], 
                "role": "In The Great Dictator the head of Bacteria was portrayed like this.", 
                "id": "TheGeneralissimo"
            }, 
            {
                "adjectives": [], 
                "role": "The Generalissimo: Hynkel", 
                "id": "TheGeneralissimo"
            }
        ]
    }, 
    "imdbid": "tt0032553", 
    "poster_url": "TheGreatDictator.jpg", 
    "similar": [
        {
            "shared": [
                "OfficerAndAGentleman"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "OfficerAndAGentleman"
            ], 
            "shared_count": 1, 
            "id": "TheBarberOfSiberia", 
            "name": "The Barber of Siberia", 
            "poster_url": "TheBarberOfSiberia.jpg"
        }, 
        {
            "shared": [
                "OfficerAndAGentleman"
            ], 
            "shared_count": 1, 
            "id": "EnemyAtTheGates", 
            "name": "Enemy at the Gates", 
            "poster_url": "EnemyAtTheGates.jpg"
        }, 
        {
            "shared": [
                "TheGeneralissimo"
            ], 
            "shared_count": 1, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }, 
        {
            "shared": [
                "OfficerAndAGentleman"
            ], 
            "shared_count": 1, 
            "id": "TheLongestDay", 
            "name": "The Longest Day", 
            "poster_url": "TheLongestDay.jpg"
        }
    ], 
    "id": "TheGreatDictator", 
    "name": "The Great Dictator"
}