{
    "plot": "Following his mother's death, Mark is sent to Maine to visit his aunt and uncle while his father goes on a business trip to Tokyo. Mark meets his cousin, Henry, and the two quickly form a friendship. However, Henry begins to show signs of violent behavior that worry Mark.", 
    "genres": "Drama, Thriller", 
    "release_year": "1993", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "father/manager", 
                    "forcing", 
                    "first", 
                    "kid", 
                    "first"
                ], 
                "role": "Nearly all of Macaulay Culkin's Hollywood crash-and-burnout can be attributed to his father/manager, Kit Culkin. To give an example, one of the reasons Macaulay was pushed into the horror film The Good Son was Kit's pushing and threatening to withdraw Macaulay from Home Alone 2. Kit's presence on The Good Son wound up forcing the first director to quit. Eventually, studios were turning the kid down for roles specifically because they didn't want to deal with Kit, leading to his retirement from acting at the age of 14. Macaulay has since become estranged from Kit and refuses to speak to him.\n When auditioning child actors for the Harry Potter movies, producer Chris Columbus interviewed the parents of all of the children being considered for roles and immediately eliminated the children of those who came across as stage parents. He said he did that because of all the problems he had with Kit Culkin while doing the first two Home Alone movies.", 
                "id": "StageMom"
            }
        ]
    }, 
    "imdbid": "tt0107034", 
    "poster_url": "TheGoodSon.jpg", 
    "similar": [
        {
            "shared": [
                "StageMom"
            ], 
            "shared_count": 1, 
            "id": "BarbieInAChristmasCarol", 
            "name": "Barbie in A Christmas Carol"
        }, 
        {
            "shared": [
                "StageMom"
            ], 
            "shared_count": 1, 
            "id": "DropDeadGorgeous", 
            "name": "Drop Dead Gorgeous"
        }, 
        {
            "shared": [
                "StageMom"
            ], 
            "shared_count": 1, 
            "id": "CampNowhere", 
            "name": "Camp Nowhere", 
            "poster_url": "CampNowhere.jpg"
        }, 
        {
            "shared": [
                "StageMom"
            ], 
            "shared_count": 1, 
            "id": "TheUglyDucklingAndMe", 
            "name": "The Ugly Duckling and Me"
        }, 
        {
            "shared": [
                "StageMom"
            ], 
            "shared_count": 1, 
            "id": "TemptationIsland", 
            "name": "Temptation Island"
        }
    ], 
    "id": "TheGoodSon", 
    "name": "The Good Son"
}