{
    "plot": "When the aging head of a famous crime family decides to transfer his position to one of his subalterns, a series of unfortunate events start happening to the family, and a war begins between all the well-known families leading to insolence, deportation, murder and revenge, and ends with the favorable successor being finally chosen.", 
    "genres": "Crime, Drama", 
    "release_year": "1972", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "blatant", 
                    "uncomfortable", 
                    "large", 
                    "common", 
                    "painful"
                ], 
                "role": "Bigger Is Better in Bed: Sonny, though it is less blatant in the film than in the book, where it is deconstructed as the size makes the sex extremely uncomfortable to his partners except to Lucy, who has an abnormally large vagina. Johnny Fontane. Enough so that stories about its sheer girth are common on the Hollywood scene. One rumor (eventually confirmed) stated that he had to have his suits specially tailored in order to accommodate it. Subverted by \"Superman\" in the sex show in Part II, where it's implied that the sex will be very painful for the woman.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [
                    "large", 
                    "large", 
                    "few", 
                    "realistic", 
                    "painful", 
                    "enlarged", 
                    "vaginal", 
                    "later", 
                    "good"
                ], 
                "role": "Mario Puzo takes a rather large detour from describing the Corleone family saga in The Godfather to describe Sonny's large penis. The moment makes it into the movie as well if you're looking for it during the wedding scene - watch his wife's hand gestures carefully. However, this is one of the few realistic examples: His wife complains how painful sex is, and Sonny's mistress Lucy has an enlarged vagina. Lucy needs vaginal reduction surgery later on, in order to have good sex with lesser men than Sonny.", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [
                    "incorruptible", 
                    "ferocious", 
                    "trusted"
                ], 
                "role": "Lawman Gone Bad: Al Neri, in the novel, is revealed to be an incorruptible but ferocious cop. When a Pay Evil unto Evil situation does not quite go as planned, he winds up convicted of manslaughter. Michael Corleone gets him off with a suspended sentence; in gratitude, he becomes Michael's most trusted bodyguard and Professional Killer.", 
                "id": "LawmanGoneBad"
            }, 
            {
                "adjectives": [
                    "big"
                ], 
                "role": "In Part I consigliere Tom Hagen is reassigned to handling the family move to Nevada because there is a big fight coming and he is not a wartime consigliere.", 
                "id": "NonActionGuy"
            }, 
            {
                "adjectives": [], 
                "role": "The Godfather: Michael Corleone.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "original", 
                    "Many", 
                    "other", 
                    "one-night", 
                    "unreliable", 
                    "wrong", 
                    "useful", 
                    "expedite", 
                    "good-natured", 
                    "more-powerful-than-a-locomotive", 
                    "two-second"
                ], 
                "role": "Straight Gay: Fredo, mainly discussed in the original book and the Mark Winegardner follow-ups: Many of the personality conflicts he has with Michael and other Made Men are because of his issues dealing with his extremely repressed sexuality, occasionally leading to drunken one-night affairs, and his overcompensation by cultivating a reputation as a Vegas ladies' man. This gives him the impression of being inconsistent, flighty, and unreliable, all traits that attract the wrong kinds of attention and are liabilities for a man looking to make himself useful in the family business. Subtly referenced in Part II. In Cuba, Michael gives Fredo the task of arranging entertainment for his visiting guests, all VIPs and politicians he hopes to win over and expedite his investment in the Cuban hotel industry. Fredo's choice of venue is a seedy club hosting a sex show, starring 'Superman'. While all the guests are laughing in good-natured disbelief at the size of Superman's more-powerful-than-a-locomotive, there is a two-second cut of Fredo staring, unblinking and almost trembling.", 
                "id": "StraightGay"
            }, 
            {
                "adjectives": [], 
                "role": "Vito Corleone in The Godfather. Michael too.", 
                "id": "ThePatriarch"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Disposable", 
                    "dead", 
                    "rough", 
                    "dangerous", 
                    "exact", 
                    "convenient", 
                    "brief", 
                    "nearby", 
                    "poor"
                ], 
                "role": "Disposable Sex Worker: In Part II, the Corleones get corrupt U.S. Senator Geary in their pocket when he wakes up in a room with a dead prostitute in a brothel run by Fredo. They had engaged in rough, possibly dangerous sex before the senator blacked out, but the exact circumstances of her death are never revealed, and it is awfully \"convenient\" for the Corleone interests that she died. Of course, there is a brief scene during that moment where Al Neri is idly washing his hands in a nearby bathroom, hinting he had set up the senator by drugging him unconscious and then killing the poor girl.", 
                "id": "DisposableSexWorker"
            }, 
            {
                "adjectives": [
                    "Italian", 
                    "next", 
                    "dead", 
                    "next"
                ], 
                "role": "In The Godfather Part II, a U.S. Senator who refused a deal with Michael Corleone, and insulted his family and the Italian people, is set up by the family to awaken in the whorehouse he frequents next to a dead prostitute, in order to make him think he killed her and needs the Corleones' protection. No one mentions the fact that someone apparently had to kill a prostitute to execute the charade. (It is implied that Al Neri did the deed. He is shown in the next room with a towel in his hands).", 
                "id": "DisposableSexWorker"
            }, 
            {
                "adjectives": [
                    "archetypal", 
                    "first", 
                    "abusive", 
                    "downward", 
                    "spiral", 
                    "turncoat", 
                    "third", 
                    "full-blown", 
                    "third", 
                    "oblivious", 
                    "corrupt"
                ], 
                "role": "Constanzia \"Connie\" Corleone (Talia Shire) in The Godfather may be the archetypal example of this. By the end of the first film however, when her abusive husband is murdered by her brother Michael for his role in setting up the murder of the oldest sibling Sonny, Connie finds herself quite jaded and goes into a downward spiral of debauchery and drinking to punish her brother Michael. It takes the death of her mother Carmela to get her to clean her act up, at which point she convinces Michael to reconcile with turncoat brother Fredo. By the third film, she's been upgraded to full-blown Godmother and has taken the role of adviser/Corleone Family mentor to Sonny's illegitimate son Vinnie, who has followed his father's footsteps into organized crime.\n Michael's youngest daughter Mary (Sofia Coppola, covering up for Winona Ryder), in the third film, takes this role and is legitimately oblivious to her father's corrupt ways, also striking a romance with her cousin Vinnie.  The poor kid ends up shot to death as a result of her father's crimes coming back to bite him on the ass, since an assassin sent to snipe Michael after her brother's opera debut shoots her instead by mistake; she dies in Michael's arms, and he's pushed to the Despair Event Horizon.", 
                "id": "MafiaPrincess"
            }, 
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Matron Chaperone: Apollonia and Michael are escorted by half a dozen old ladies when the couple walks around Corleone.", 
                "id": "MatronChaperone"
            }, 
            {
                "adjectives": [
                    "Proper"
                ], 
                "role": "Proper Lady: Mama Corleone, though the novel epilogue revealed she is also a Stepford Smiler.", 
                "id": "ProperLady"
            }
        ]
    }, 
    "imdbid": "tt0068646", 
    "poster_url": "TheGodfather.jpg", 
    "similar": [
        {
            "shared": [
                "MafiaPrincess", 
                "DisposableSexWorker"
            ], 
            "shared_count": 2, 
            "id": "Pusher", 
            "name": "Pusher"
        }, 
        {
            "shared": [
                "MafiaPrincess", 
                "DisposableSexWorker"
            ], 
            "shared_count": 2, 
            "id": "EasternPromises", 
            "name": "Eastern Promises", 
            "poster_url": "EasternPromises.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "SharpDressedMan"
            ], 
            "shared_count": 2, 
            "id": "ActOfValor", 
            "name": "Act of Valor", 
            "poster_url": "ActOfValor.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "StraightGay", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "RockSlyde", 
            "name": "Rock Slyde", 
            "poster_url": "RockSlyde.jpg"
        }
    ], 
    "id": "TheGodfather", 
    "name": "The Godfather"
}