{
    "plot": "Mikey Walsh and Brandon Walsh are brothers whose family is preparing to move because developers want to build a golf course in the place of their neighborhood -- unless enough money is raised to stop the construction of the golf course, and that's quite doubtful. But when Mikey stumbles upon a treasure map of the famed \"One-Eyed\" Willy's hidden fortune, Mikey, Brandon, and their friends Lawrence \"Chunk\" Cohen, Clark \"Mouth\" Devereaux, Andrea \"Andy\" Carmichael, Stefanie \"Stef\" Steinbrenner, and Richard \"Data\" Wang, calling themselves The Goonies, set out on a quest to find the treasure in hopes of saving their neighborhood. The treasure is in a cavern, but the entrance to the cavern is under the house of evil thief Mama Fratelli and her sons Jake Fratelli, Francis Fratelli, and the severely disfigured Lotney \"Sloth\" Fratelli. Sloth befriends the Goonies and decides to help them.", 
    "genres": "Adventure, Comedy, Family", 
    "release_year": "1985", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "high-pitched", 
                    "groin-first"
                ], 
                "role": "Francis lets out a high-pitched scream in The Goonies after he slips a on log over a stream of water and lands on it groin-first.", 
                "id": "InstantSoprano"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: Troy.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [], 
                "role": "Troy in The Goonies. He inherited his Jerk Ass genes from his father. \"Come on, Walsh. We don't have all day. There's 50 more houses to tear down after yours.\"", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Evil Matriarch: Mama Fratelli.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Fratelli in The Goonies. She's the head of a family of criminals including two of her sons.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "The Goonies: Stef.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "beautiful"
                ], 
                "role": "Andy of The Goonies flips her shit and begins babbling nonsense about \"having a beautiful body\" shortly before the group encounters the corpse of Chester Copperpot... which doesn't help the situation.", 
                "id": "TheOphelia"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Steph and Andy.", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt0089218", 
    "poster_url": "TheGoonies.jpg", 
    "similar": [
        {
            "shared": [
                "TomBoyAndGirlyGirl", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "TheRageCarrie2", 
            "name": "The Rage: Carrie 2"
        }, 
        {
            "shared": [
                "InstantSoprano", 
                "Meganekko"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "EvilMatriarch", 
                "TheOphelia"
            ], 
            "shared_count": 2, 
            "id": "Sybil", 
            "name": "Sybil", 
            "poster_url": "Sybil.jpg"
        }, 
        {
            "shared": [
                "TomBoyAndGirlyGirl", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }
    ], 
    "id": "TheGoonies", 
    "name": "The Goonies"
}