{
    "plot": "One late night in a college dorm, four socially inept geeks immerse themselves in a fantasy world of their own creation. As their characters journey through forbidden kingdoms, ancient ruins, and the forsaken wilderness, the players attempt to solve a mysterious puzzle that could ultimately mean the difference between getting a life and death. Who is The Shadow? Where is The Princess hidden? Will any of them ever find a date? And how long do they have before their annoyed neighbors call the cops?", 
    "genres": "Adventure, Comedy, Fantasy", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Dumb Muscle: Rogar.", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [], 
                "role": "Gentleman Thief: The Bandit King with A Glass of Chianti.", 
                "id": "GentlemanThief"
            }, 
            {
                "adjectives": [
                    "kind", 
                    "high"
                ], 
                "role": "Kavorka Man: Flynn, to be kind, is not the kind of Bard women typically swoon for. Thank god for high seduction stats.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "black"
                ], 
                "role": "Shirtless Scene: Played for Laughs with Cass. The fact that Gary is dressed in black and thwacking him with a riding crop doesn't help matters.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "few", 
                    "other", 
                    "bad", 
                    "offensive", 
                    "very", 
                    "extended", 
                    "own", 
                    "double", 
                    "major"
                ], 
                "role": "Straw Misogynist: The Legacy intentionally play this up to help make themselves hated, although a few other players are shown as just as bad and Leo kicks one particularly offensive player out of his store in the very beginning. Cass (and Lodge in the extended cut) getting over their own sexism and double standards is also a major subplot.", 
                "id": "StrawMisogynist"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Affirmative"
                ], 
                "role": "Affirmative Action Girl: Parodied with Luster, a Vain Sorceress who is, fetishistically, played by a man.", 
                "id": "AffirmativeActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Gamer Chick: Natalie, although she hates being perceived this way.", 
                "id": "GamerChick"
            }, 
            {
                "adjectives": [
                    "female", 
                    "first", 
                    "spear", 
                    "extra", 
                    "double", 
                    "normal", 
                    "extra", 
                    "good", 
                    "dug", 
                    "third", 
                    "pathetic", 
                    "top", 
                    "requisite", 
                    "key", 
                    "fresh", 
                    "warrior-type", 
                    "other", 
                    "unconventional", 
                    "other", 
                    "big", 
                    "strong", 
                    "such", 
                    "conventional", 
                    "big"
                ], 
                "role": "The Gamers 2: The female newbie on her first session comes up with a feat combo that allows her a crit range of 13-20 with a spear and lets her take an extra attack every time she does. That means 40% of the time, she gets to deal double her normal damage and take an extra attack. Meanwhile, the men in the group are all depicted as powergaming assholes, but for some reason, despite being veteran DND players and played through this campaign twice before, never thought of this combo.\n They are powergamers, they just are not any good at it.\n Or she's dug it out of some third party sourcebook, given that it's not in any of the official ones. Not that we were pathetic enough to scour the 3.5 library from top to bottom hunting for the requisite feats, of course. That would be pathetic.\n Third party or not, the key could have been her \"thinking outside the box\" approach to gaming (she's never gamed, so she has a fresh perspective). She plays a warrior-type, but the aforementioned feat combo is based on intelligence and other unconventional feats for fighters to take, so the other players, who typecast a lot (warrior HAS to be big and strong, etc.) never even thought of such a combo, because it is not conventional for a fighter to be anything but a big brute.", 
                "id": "GamerChick"
            }, 
            {
                "adjectives": [
                    "game-within-a-show", 
                    "fellow"
                ], 
                "role": "The Gamers: Dorkness Rising has Daphne, the Lawful Good Fragile Speedster female fighter in the game-within-a-show Her fighting style emphasizes speed and precision over brute force, and she generally behaves with more dignity than her fellow PCs, although there are times when she lightens up a bit.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "social"
                ], 
                "role": "Jase - The Chick (with an emphasis on social networking and nurturing over being the love interest)", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0369445", 
    "poster_url": "TheGamers.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan", 
                "ShirtlessScene", 
                "TheChick"
            ], 
            "shared_count": 3, 
            "id": "PitchPerfect", 
            "name": "Pitch Perfect", 
            "poster_url": "PitchPerfect.jpg"
        }, 
        {
            "shared": [
                "StrawMisogynist", 
                "ShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan", 
                "TheChick"
            ], 
            "shared_count": 2, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan", 
                "DumbMuscle"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "TheChick"
            ], 
            "shared_count": 2, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }
    ], 
    "id": "TheGamers", 
    "name": "The Gamers"
}