{
    "plot": "Joe Kingman is a huge football star. He's got women, money, and a good career. Everything is perfect for him. Then one day an 8 year old girl shows up at his door telling him that she's his daughter from a past relationship. Once he has proof that she is for a fact his, he tries but fails miserably at \"parenting.\" From problems such as his super speedy car with no backseat, to leaving her in a bar at 3 am, he's got a lot to deal with. Eventually though, she gets him, (and his football team) wrapped around her finger. When she has a near-death experience and Joe finds out her mother died early that year, he wants her to move and live with him. Her aunt though disagrees and takes her home. Joe has to play the game of his life and when he's injured, and things don't look good for him, his daughter comes out and gets him right back on the field.", 
    "genres": "Comedy, Family, Sport", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Action Hero Babysitter: The Rock as a football player unexpectledly having to raise a ballerina daughter.", 
                "id": "ActionHeroBabysitter"
            }, 
            {
                "adjectives": [], 
                "role": "The Game Plan The Rock as a football player unexpectedly having to raise a ballerina daughter.", 
                "id": "ActionHeroBabysitter"
            }, 
            {
                "adjectives": [
                    "professional"
                ], 
                "role": "Jerk Jock: Kingman starts off as a professional version of this, although he eventually softens up.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "later", 
                    "high"
                ], 
                "role": "Scary Black Man: Subverted. The Scary Black Football Player first scares Peyton, but then is later seen giving her high fives and cries during the ballet recital.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "outright"
                ], 
                "role": "Blondes are Evil: Played straight with Tatiana and Kingman's agent, she's more of a jerk than an outright antagonist.", 
                "id": "BlondesAreEvil"
            }
        ]
    }, 
    "imdbid": "tt0492956", 
    "poster_url": "TheGamePlan.jpg", 
    "similar": [
        {
            "shared": [
                "BlondesAreEvil", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "RomyAndMichelesHighSchoolReunion", 
            "name": "Romy and Michele's High School Reunion", 
            "poster_url": "RomyAndMichelesHighSchoolReunion.jpg"
        }, 
        {
            "shared": [
                "BlondesAreEvil", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "RevengeOfTheNerds", 
            "name": "Revenge of the Nerds"
        }, 
        {
            "shared": [
                "JerkJock", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheHungerGames", 
            "name": "The Hunger Games", 
            "poster_url": "TheHungerGames.jpg"
        }
    ], 
    "id": "TheGamePlan", 
    "name": "The Game Plan"
}