{
    "plot": "Set in Mississippi during the 1960s, Skeeter (Stone) is a southern society girl who returns from college determined to become a writer, but turns her friends' lives -- and a Mississippi town -- upside down when she decides to interview the black women who have spent their lives taking care of prominent southern families. Aibileen (Davis), Skeeter's best friend's housekeeper, is the first to open up -- to the dismay of her friends in the tight-knit black community. Despite Skeeter's life-long friendships hanging in the balance, she and Aibileen continue their collaboration and soon more women come forward to tell their stories -- and as it turns out, they have a lot to say. Along the way, unlikely friendships are forged and a new sisterhood emerges, but not before everyone in town has a thing or two to say themselves when they become unwittingly -- and unwillingly -- caught up in the changing times.", 
    "genres": "Drama", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "big"
                ], 
                "role": "Subverted in The Help. The big publishing hotshot is disgusted to learn that our heroine lives with her mother. The heroine is actually taking care of her mother as she dies of cancer. Oops.", 
                "id": "BasementDweller"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "entire"
                ], 
                "role": "Alpha Bitch: Hilly Holbrook is this for the entire town of Jackson, Mississippi. Skeeter is part of her Girl Posse until she rebels.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "own"
                ], 
                "role": "Cool Old Lady: Mrs. Phelan definitely counts when she calls Hilly out on being a total jerk. Hilly's own mother counts as well.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [], 
                "role": "Girl Posse: Skeeter and Elizabeth are this for Hilly, at least at the beginning, although Skeeter rebels over the course of the story.", 
                "id": "GirlPosse"
            }, 
            {
                "adjectives": [
                    "Rich", 
                    "bad", 
                    "very", 
                    "second"
                ], 
                "role": "Rich Bitch: Hilly Holbrook. She's bad from about the very second we meet her, as she's convinced that Minny is trying to steal everything she owns.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Spirited Young Lady: Skeeter.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [
                    "white", 
                    "male"
                ], 
                "role": "Spoiled Sweet: Celia. Except she isn't spoiled. Celia grew up as penniless \"white trash\" in Sugar Ditch, and only got money when she married Johnny. If anything, Johnny is a male version.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt1454029", 
    "poster_url": "TheHelp.jpg", 
    "similar": [
        {
            "shared": [
                "SpoiledSweet", 
                "GirlPosse", 
                "AlphaBitch", 
                "RichBitch"
            ], 
            "shared_count": 4, 
            "id": "ALittlePrincess", 
            "name": "A Little Princess", 
            "poster_url": "ALittlePrincess.jpg"
        }, 
        {
            "shared": [
                "GirlPosse", 
                "AlphaBitch", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "CoolOldLady", 
                "AlphaBitch", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "WhatAGirlWants", 
            "name": "What a Girl Wants", 
            "poster_url": "WhatAGirlWants.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "SpiritedYoungLady", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "EverAfter", 
            "name": "Ever After"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "CoolOldLady", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "LittleWomen", 
            "name": "Little Women", 
            "poster_url": "LittleWomen.jpg"
        }
    ], 
    "id": "TheHelp", 
    "name": "The Help"
}