{
    "plot": "Jessica Spencer is the hottest, most popular girl in high school. Jessica, her best friend April, and a couple of other hot girls Lulu and Keecia visit the mall to hang out and do some shopping. They enter a new age store, where they check out a pair of ancient earrings. Unbeknownst to Jessica, these are magical ones set in ancient Abyssinia. A princess known as Princess Nawa is disgusted by the groom of her arranged marriage and switches bodies with a slave girl by means of an enchanted set of earrings. Since the earrings are not for sale, Jessica steals them. But the next morning she gets a big dose of reality when she wakes up in the body of a 30-something lowlife male, Clive, a career criminal. Clive finds himself in Jessica's body. Now it's up to Jessica (in Clive's body) to find a way to get her body back, while Clive (in Jessica's body) takes advantage of his new body to set in motion a crime spree to put the blame on Jessica!", 
    "genres": "Comedy, Fantasy", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Jerk Jock: Jake", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Lovable", 
                    "evil"
                ], 
                "role": "Alpha Bitch: Jessica, who's actually more of a Lovable Alpha Bitch. At the end maybe, but in the beginning... not so much. And Bianca, who is the evil one of the two.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "Lovable"
                ], 
                "role": "Jessica, who's actually more of a Lovable Alpha Bitch. At the end maybe, but in the beginning... not so much.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [
                    "certain", 
                    "good", 
                    "important", 
                    "easy", 
                    "sorry", 
                    "later"
                ], 
                "role": "Jessica Spencer of The Hot Chick is a Jerkass to certain people she doesn't like, but takes good care of her baby brother. The Pet the Dog moment with her brother is important because it makes it easy for us to feel sorry for her later on when she is magically transformed into a man (don't ask).", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Perky Goth: Eden (after she joins the Girl Posse)", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [], 
                "role": "Spicy Latina: Bianca. While she's never explicitly identified as being a Latina, she is briefly suspected to be a follower of santeria (Cuban witchcraft).", 
                "id": "SpicyLatina"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Keecia and Lulu", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0302640", 
    "poster_url": "TheHotChick.jpg", 
    "similar": [
        {
            "shared": [
                "TheChick", 
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 4, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 4, 
            "id": "GeekCharming", 
            "name": "Geek Charming"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "JerkJock", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "TheBreakfastClub", 
            "name": "The Breakfast Club", 
            "poster_url": "TheBreakfastClub.jpg"
        }
    ], 
    "id": "TheHotChick", 
    "name": "The Hot Chick"
}