{
    "plot": "Soviets create a new nuclear submarine that runs silent due to a revolutionary propulsion system. Russian sub captain defects, goal of taking it to the U.S.A. to prevent the Russians from using the sub to wreak nuclear (missile) war against the U.S. Lots of plot turns and twists in this high-tech thriller.", 
    "genres": "Action, Adventure, Thriller", 
    "release_year": "1990", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "many", 
                    "former", 
                    "willing"
                ], 
                "role": "In The Hunt for Red October Captain Ramius stationed many of his former officers on the Red October and they are willing to risk their lives to help him carry out his plan  to defect with the submarine to the USA. One of his officers even  takes a bullet for Ramius.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "political", 
                    "real", 
                    "nuclear", 
                    "ballistic", 
                    "entire", 
                    "Soviet", 
                    "maneuverable", 
                    "Soviet", 
                    "own", 
                    "own"
                ], 
                "role": "The Hunt for Red October: Marko Ramius crushes his political officer's windpipe in one blow, falsifies his orders and burns the real ones, takes a nuclear ballistic missile sub to defect to the U.S., and evades detection by the entire Soviet Northern Fleet before blowing up a much more maneuverable Soviet Alfa-class attack submarine with its own torpedo and an American sub as a distraction. And he does all this successfully, without his own crew ever suspecting him.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "various", 
                    "graduate", 
                    "due"
                ], 
                "role": "Non-Action Guy: Downplayed. Jack Ryan is a CIA Analyst, an office mouse type who hates flying, takes poorly to being shot at, and spends much of the movie out of his depth as he hitches rides on various warships and submarines. As it is eventually revealed, he is also a graduate of the United States Naval Academy and commissioned in the Marine Corps before being discharged due to his injuries in a helicopter crash.", 
                "id": "NonActionGuy"
            }
        ]
    }, 
    "imdbid": "tt0099810", 
    "poster_url": "TheHuntForRedOctober.jpg", 
    "similar": [
        {
            "shared": [
                "NonActionGuy", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "TowerHeist", 
            "name": "Tower Heist", 
            "poster_url": "TowerHeist.jpg"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "RedCliff", 
            "name": "Red Cliff", 
            "poster_url": "RedCliff.jpg"
        }, 
        {
            "shared": [
                "NonActionGuy", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "LupinIIIThePursuitOfHarimaosTreasure", 
            "name": "Lupin III: The Pursuit Of Harimao's Treasure"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "Transformers", 
            "name": "Transformers"
        }
    ], 
    "id": "TheHuntForRedOctober", 
    "name": "The Hunt for Red October"
}