{
    "plot": "A race of non-corporeal, parasitic aliens who go from planet to planet looking for hosts have come to Earth and basically taken over the human race. It's believed that, once inside a body, all memories of the host human are gone. Some few free humans remain hidden from them, forming a resistance group. When an alien Seeker captures a girl named Melanie and puts a Wanderer in her body, she hopes to find out where the remaining humans are gathered, but Melanie, a strong fighter able to converse with the alien in her commandeered body, convinces the Wanderer to say nothing. Disappointed by the lack of progress (though suspecting an empathy for the human), the Seeker informs the Wanderer that she'll be removed and placed in a new host while she herself will enter Melanie. With human lives at risk, Melanie convinces Wanderer to run away and hide out with the humans, but finding them doesn't mean they'll allow an alien presence among them. Jared (Melanie's boyfriend) wants her dead, but Jeb (Melanie's uncle) wants to wait, and Ian, tasked with guarding her, finds himself siding with Jeb. As Ian begins to fall for Melanie, a strange love triangle develops, with Ian wanting Wanderer (inhabiting Melanie's body), Jared wanting Melanie (imprisoned inside her own body), and no one knowing any way to separate the two without killing both.", 
    "genres": "Adventure, Romance, Sci-Fi", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Dogged", 
                    "Ian"
                ], 
                "role": "Dogged Nice Guy: Ian.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "Ian"
                ], 
                "role": "Ian O'Shea in The Host.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "Ian"
                ], 
                "role": "Ian and Jared from The Host. This is also the relationship Ian has with his brother, Kyle.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "Sensitive", 
                    "Ian"
                ], 
                "role": "Sensitive Guy and Manly Man: Ian and Jared. This is also the relationship Ian has with his brother, Kyle.", 
                "id": "SensitiveGuyAndManlyMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Nam-joo"
                ], 
                "role": "Action Girl: Nam-joo", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "blond", 
                    "precious", 
                    "black"
                ], 
                "role": "Blondes are Evil: Inverted. Wanda's replacement body is extremely blond and so girly and precious she Tastes Like Diabetes. Played straight in the movie, where the Seeker's black hair is now blonde.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "blond", 
                    "precious"
                ], 
                "role": "Inverted in The Host where Wanda's replacement body is extremely blond and so girly and precious she Tastes Like Diabetes.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "strong", 
                    "high", 
                    "petite", 
                    "young", 
                    "own", 
                    "strong", 
                    "stupid", 
                    "wild", 
                    "sure", 
                    "able", 
                    "dependent"
                ], 
                "role": "Chickification:  Wanderer is a strong, intelligent Soul who has been on more worlds than most and is held in high regard among the Souls. She once defeated a Claw Beast on the planet of the Bears, transplanted a friend into it on the spot, and rode it into the city. At the end of the book, she's implanted in the body of a petite young blonde girl and can't even carry her own sleeping mat without the help of her man. Melanie gets it as well. She starts out as a strong survivor who opted to jump down an elevator shaft to save herself from being assimilated. Any time her boyfriend appears onscreen though, or comes to her mind, she makes some pretty stupid decisions, including letting Wanderer know where her colony of \"wild\" humans are hiding (keep in mind that Wanderer's job is to find and assimilate them as well). Her decision is justified. Melanie sends Wanderer her memories and emotions and shows the \"wild\" human colony's location only when she is sure that Wanderer cares deeply about her boyfriend and brother. Wanderer wouldn't be able to betray them, which Melanie knew, having constant connection with her mind. That said, Melanie is still heavily dependent on Jared, to the extent that she only bothers trying to \"talk\" when he is around. He even has to pull off a heavily subverted Distressed Damsel rescue when she's not responding in Wanderer's head.", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [
                    "strong", 
                    "high", 
                    "petite", 
                    "young", 
                    "own", 
                    "strong", 
                    "stupid", 
                    "wild", 
                    "sure", 
                    "able", 
                    "dependent"
                ], 
                "role": "The Host: Wanderer is a strong, intelligent Soul who has been on more worlds than most and is held in high regard among the Souls. She once defeated a Claw Beast on the planet of the Bears, transplanted a friend into it on the spot, and rode it into the city. At the end of the book, she's implanted in the body of a petite young blonde girl and can't even carry her own sleeping mat without the help of her man.\n Melanie gets it as well. She starts out as a strong survivor who opted to jump down an elevator shaft to save herself from being assimilated. Any time her boyfriend appears onscreen though, or comes to her mind, she makes some pretty stupid decisions, including letting Wanderer know where her colony of \"wild\" humans are hiding (keep in mind that Wanderer's job is to find and assimilate them as well). Her decision is justified. Melanie sends Wanderer her memories and emotions and shows the \"wild\" human colony's location only when she is sure that Wanderer cares deeply about her boyfriend and brother. Wanderer wouldn't be able to betray them, which Melanie knew, having constant connection with her mind. That said, Melanie is still heavily dependent on Jared, to the extent that she only bothers trying to \"talk\" when he is around. He even has to pull off a heavily subverted Distressed Damsel rescue when she's not responding in Wanderer's head.", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [
                    "understandable"
                ], 
                "role": "Cool Big Sis: Melanie and, by extension, Wanda for Jamie. They are a bit overprotective, but given the environment, it's understandable.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "understandable"
                ], 
                "role": "In The Host Melanie and, by extension, Wanda serve as this for Jamie. They are a bit overprotective but, given the environment, it's understandable.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "dependent"
                ], 
                "role": "That said, Melanie is still heavily dependent on Jared, to the extent that she only bothers trying to \"talk\" when he is around. He even has to pull off a heavily subverted Distressed Damsel rescue when she's not responding in Wanderer's head.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "previous"
                ], 
                "role": "Wanderer/Wanda from The Host was apparently quite the badass in some of her previous lives. This is somewhat at odds with how she acts once on Earth.", 
                "id": "FauxActionGirl"
            }
        ]
    }, 
    "imdbid": "tt1517260", 
    "poster_url": "TheHost.jpg", 
    "similar": [
        {
            "shared": [
                "CoolBigSis", 
                "Chickification", 
                "SensitiveGuyAndManlyMan", 
                "DamselInDistress", 
                "ActionGirl"
            ], 
            "shared_count": 5, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "Chickification", 
                "DamselInDistress", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "OnceUponAForest", 
            "name": "Once Upon a Forest", 
            "poster_url": "OnceUponAForest.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "DoggedNiceGuy", 
                "FauxActionGirl", 
                "BlondesAreEvil"
            ], 
            "shared_count": 4, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "BlondesAreEvil", 
                "SensitiveGuyAndManlyMan", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "DoggedNiceGuy", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "Super", 
            "name": "Super", 
            "poster_url": "Super.jpg"
        }
    ], 
    "id": "TheHost", 
    "name": "The Host"
}