{
    "plot": "Sarah Ashburn, an FBI agent, is extremely ambitious and has her eye on a promotion, but she doesn't get along with her co-workers. She is sent to Boston to uncover the identity of an elusive drug lord, Mr. Larkin, by tracking down his proxy, Rojas, and is told that she'll have a good shot at the promotion if she finds Larkin. When she arrives in Boston, she learns that Larkin has been eliminating his competition and taking over their operations. She learns that Rojas is in Boston PD custody and goes to see him to ask him what he knows about Larkin, but is warned that the cop who arrested Rojas, Shannon Mullins, is very territorial, and she is not exactly sociable. When the two meet they don't get along. When Mullins learns why Ashburn is in Boston, she decides to find Larkin herself. Ashburn is told by her boss to work with Mullins, but it won't be easy because Ashburn does things by the book while Mullins does things her way.", 
    "genres": "Action, Comedy, Crime", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "attractive", 
                    "unshakeable"
                ], 
                "role": "Kavorka Woman: Mullins may not be conventionally attractive, but she certainly has her fair share of unshakeable admirers.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [], 
                "role": "Shannon Mullins from The Heat is a Rare Female Example.", 
                "id": "KavorkaMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "main"
                ], 
                "role": "Action Girl: Both main characters.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Big Beautiful Woman: Mullins definitely has her admirers.", 
                "id": "BigBeautifulWoman"
            }, 
            {
                "adjectives": [
                    "pathetic"
                ], 
                "role": "Crazy Cat Lady: Ashburn; given an especially pathetic twist by it not even being her cat, but her neighbour's.", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [], 
                "role": "Dirty Harriet: A version. Mullins rips up Ashburn's suit into a more revealing outfit in a club to get her close to a dealer.", 
                "id": "DirtyHarriet"
            }, 
            {
                "adjectives": [
                    "huge", 
                    "normal", 
                    "low"
                ], 
                "role": "Gag Boobs: Subverted with Tatiana. While the dealer who led them to her described her boobs as being huge enough for the audience to expect this, they look fairly normal sized when she shows up, if accentuated by a low top. The credits feature this gem:", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "huge", 
                    "normal", 
                    "low"
                ], 
                "role": "Subverted with Tatiana in The Heat. While the dealer who led them to her described her boobs as being huge enough for the audience to expect this, they look fairly normal sized when she shows up, if accentuated by a low top.\n The credits feature this gem:", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "first", 
                    "good", 
                    "wild", 
                    "emotional", 
                    "good"
                ], 
                "role": "The Heat with the at first emotionally repressed, by the book, FBI agent with very good results in getting her man paired with a wild, emotional, Perp Sweating, Cluster F-Bomb using Police Detective who is also good at getting her man.", 
                "id": "LovelyAngels"
            }, 
            {
                "adjectives": [
                    "Lad-ette"
                ], 
                "role": "Lad-ette: Mullins through and through.", 
                "id": "TheLadette"
            }
        ]
    }, 
    "imdbid": "tt2404463", 
    "poster_url": "TheHeat.jpg", 
    "similar": [
        {
            "shared": [
                "TheLadette", 
                "CrazyCatLady", 
                "BigBeautifulWoman", 
                "KavorkaMan"
            ], 
            "shared_count": 4, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "TheLadette", 
                "ActionGirl", 
                "LovelyAngels"
            ], 
            "shared_count": 3, 
            "id": "VivaMaria", 
            "name": "Viva Maria!", 
            "poster_url": "VivaMaria.jpg"
        }, 
        {
            "shared": [
                "DirtyHarriet", 
                "ActionGirl", 
                "LovelyAngels"
            ], 
            "shared_count": 3, 
            "id": "CharliesAngels", 
            "name": "Charlie's Angels", 
            "poster_url": "CharliesAngels.jpg"
        }, 
        {
            "shared": [
                "TheLadette", 
                "BigBeautifulWoman"
            ], 
            "shared_count": 2, 
            "id": "CatherineTheGreat", 
            "name": "Catherine The Great", 
            "poster_url": "CatherineTheGreat.jpg"
        }, 
        {
            "shared": [
                "TheLadette", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }
    ], 
    "id": "TheHeat", 
    "name": "The Heat"
}