{
    "plot": "In 15th century Paris, Clopin the puppeteer tells the story of Quasimodo, the misshapen but gentle-souled bell ringer of Notre Dame, who was nearly killed as a baby by Claude Frollo, the Minister of Justice. But Frollo was forced by the Archdeacon of Notre Dame to raise Quasimodo as his own. Now a young man, Quasimodo is hidden from the world by Frollo in the belltower of the cathedral. But during the Festival of Fools, Quasimodo, cheered on by his gargoyle friends Victor, Hugo, and Laverne, decides to take part in the festivities, where he meets the lovely gypsy girl Esmeralda and the handsome soldier Phoebus. The three of them find themselves ranged against Frollo's cruelty and his attempts to destroy the home of the gypsies, the Court of Miracles. And Quasimodo must desperately defend both Esmeralda and the very cathedral of Notre Dame.", 
    "genres": "Animation, Drama, Family", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Amazon Chaser: Watching Esmeralda single-handedly trounce Frollo's guards makes Phoebus exclaim \"What a woman!\" despite nearly being decapitated.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "interested", 
                    "Frisbee-style", 
                    "love-struck"
                ], 
                "role": "The Hunchback of Notre Dame: The reason why Phoebus went after Esmeralda. Clearly he was interested before, but when he saw her standing up to Frollo and kicking some ass... Yeah.\n This is highlighted when Esmeralda is nicely taking care of the guards Frollo sends after her. Phoebus ducks a metal helmet that she flings at him, Frisbee-style, looks totally love-struck, and comments \"What a woman!\"", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "own", 
                    "later", 
                    "erstwhile", 
                    "dark", 
                    "abusive", 
                    "insane"
                ], 
                "role": "Archnemesis Dad: Frollo takes Quasimodo in after killing his mother, but only to save his own soul and keep Quasi for later use. He raises his erstwhile son to hate himself, tells him that the world is dark and cruel, and keeps him locked away from sight to prevent being associated with him. When Frollo's atrocities increase, Quasi realizes the man's evil, calls him out on his abusive parenting, and saves Esmeralda from the murderously insane Frollo.", 
                "id": "ArchnemesisDad"
            }, 
            {
                "adjectives": [
                    "own", 
                    "later", 
                    "erstwhile", 
                    "dark", 
                    "abusive", 
                    "insane"
                ], 
                "role": "In The Hunchback of Notre Dame, Frollo takes Quasimodo in after killing his mother, but only to save his own soul and keep Quasi for later use. He raises his erstwhile son to hate himself, that the world is dark and cruel, and keeps him locked away from sight to prevent being associated with him. When Frollo's atrocities increase Quasi realizes the man's evil, calls him out on his abusive parenting, and saves Esmeralda from the murderously insane Frollo.", 
                "id": "ArchnemesisDad"
            }, 
            {
                "adjectives": [], 
                "role": "Frollo and Gaston from The Frollo Show operate on this principal even when there's not any sort of fight to be had.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "Chivalrous", 
                    "able"
                ], 
                "role": "Chivalrous Pervert: Phoebus. He's obviously very excited by Esmerelda's dancing, but is able to look beyond just that to her kindness and spirit.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "sexual", 
                    "willing", 
                    "along", 
                    "other", 
                    "adoptive"
                ], 
                "role": "Judge Claude Frollo from The Hunchback of Notre Dame fits the bill much better than Gaston. His whole deconstruction revolved around his sexual obsession with Esmeralda and was willing to kill her along with her other two love interests, one of them being his adoptive son.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "villainous", 
                    "serious", 
                    "romantic", 
                    "hypocritical"
                ], 
                "role": "Judge Claude Frollo from The Hunchback of Notre Dame is another villainous Dirty Old Man with a serious lust for the romantic lead, Esmeralda, who he tries to have burned at the stake when she rejects his advances. (And, being the hypocritical coward that he is, Frollo insists that his perversion is all Esmeralda's fault.)", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Dude: Phoebus and Quasi find the Court of Miracles. They are Bound and Gagged by Clopin and the Gypsies, mistaking them for \"Frollo's spies\", leaving Esmeralda to save them from an untimely execution.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "high-pitched", 
                    "simultaneous"
                ], 
                "role": "In The Hunchback of Notre Dame, four guards let out a high-pitched squeal after receiving a simultaneous crotch kick from a guy in stilts.", 
                "id": "InstantSoprano"
            }, 
            {
                "adjectives": [], 
                "role": "Knight in Shining Armor: Phoebus. Not only does he look the part with his armor and horse but he acts the part in protecting Esmeralda and saving the family trapped in a burning house.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [], 
                "role": "Phoebus of The Hunchback of Notre Dame.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [], 
                "role": "Sissy Villain: Most fans will agree Sarousch fits this trope to a tea, especially when compared to the likes of Judge Frollo.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "The Casanova: Phoebus regains some of his womanizing traits, but he still genuinely loves Esmeralda.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "naive", 
                    "snarky", 
                    "resourceful"
                ], 
                "role": "Hugo's Esmeralda was, for most of the time, naive, trusting and clueless, especially when it came to Phoebus. Disney's Esmeralda is a smart, snarky, resourceful Action Girl.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Esmeralda from The Hunchback of Notre Dame. When she is tied to a pyre, Claude Frollo, who has lusted for her since meeting her, offers to release her in exchange for becoming \"his\". She metaphorically - and literally - spits on his offer.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [], 
                "role": "Lots of women deeply empathize with Frollo for lusting over Esmeralda.", 
                "id": "EvenTheGirlsWantHer"
            }, 
            {
                "adjectives": [], 
                "role": "Quasimodo is a rare male example from The Hunchback of Notre Dame.", 
                "id": "GirlInTheTower"
            }, 
            {
                "adjectives": [
                    "predominant", 
                    "white", 
                    "teal", 
                    "purple—with"
                ], 
                "role": "Esmeralda from The Hunchback of Notre Dame has a predominant scheme of white, teal, gold, and purple—with purple standing out the most as the color of her skirt.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Esmeralda from Disney's version of The Hunchback of Notre Dame.\n As well as most other adaptions, including the 1956 version with Gina Lollobrigida and the 1997 version with Salma Hayek.", 
                "id": "HotGypsyWoman"
            }, 
            {
                "adjectives": [
                    "Hot", 
                    "such"
                ], 
                "role": "Hot Gypsy Woman: Esmeralda status as such informs the plot; Frollo wants to both kill her and possess her.", 
                "id": "HotGypsyWoman"
            }, 
            {
                "adjectives": [
                    "real", 
                    "bad", 
                    "public", 
                    "Bad"
                ], 
                "role": "Esmeralda wore red poledancing outfit in the \"Topsy Turvy\" number in The Hunchback of Notre Dame. Ironically, in real life, red is considered bad luck for Gypsies, and Judge Frollo was watching her dance in public... Bad luck indeed.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [], 
                "role": "Lady in Red: Esmeralda wears a alluring red dress during her performance at the Feast of Fools.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [], 
                "role": "Esmeralda from The Hunchback of Notre Dame is this to Clopin.", 
                "id": "LovelyAssistant"
            }, 
            {
                "adjectives": [
                    "Assistant"
                ], 
                "role": "Lovely Assistant: Esmeralda is this to Clopin; after he gives the introduction he calls her out and she dances for the crowd.", 
                "id": "LovelyAssistant"
            }, 
            {
                "adjectives": [
                    "female", 
                    "seductive", 
                    "other", 
                    "tough", 
                    "well-intentioned", 
                    "possible", 
                    "naive", 
                    "human", 
                    "due", 
                    "only", 
                    "original"
                ], 
                "role": "Disney's The Hunchback of Notre Dame has this as a plot point and heavily deconstructs the trope. Esmeralda, our female heroine is considered to be a Whore (seductive, performs suggestive dances, other men fantasise about her) which puts Frollo in a tough position. He lusts after her but knows he can't have her because she is a Whore (plus he's bigoted against gypsies) so he decides to burn her if she refuses him.\n What's more, Quasimodo is well-intentioned but only sees Esmeralda as a pure Madonna, heavily idealizing her since she saved him from humiliation and possible death — which does NOT mix well with the fact that Quasi has an extremely naive view of human relationships due to him living all of his life locked away fom the world. Phoebus is attracted to both Esmeralda's kind heart and her alluring nature, so she chooses him because he's the only one that sees her as a proper human being with flaws and pros instead of just one thing or another. Ironic, considering in the original book...", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [
                    "Madonna-Whore", 
                    "good", 
                    "human", 
                    "sinful", 
                    "lustful", 
                    "other"
                ], 
                "role": "Madonna-Whore Complex: Quasimodo idolizes Esmeralda (who is a good person but is still human), seeing her as a perfect angel in Heaven's Light, while Frollo sees her as a sinful seductress for giving him lustful thoughts, as evidenced best Hellfire. These two songs go straight from one to the other as well.", 
                "id": "MadonnaWhoreComplex"
            }, 
            {
                "adjectives": [
                    "open", 
                    "fair", 
                    "biological", 
                    "other", 
                    "fair"
                ], 
                "role": "Quasimodo's Roma mother in The Hunchback of Notre Dame is kicked down a flight of stone stairs and cracks her head open while trying to save her baby son from Frollo. His father was arrested, so one can assume she's dead. (Considering Quasimodo has fair skin, he may not be their biological son; on the other hand, he may be Roma and have the fair skin as part of his deformity. In any case, it still counts.)", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "other", 
                    "petite"
                ], 
                "role": "Ms. Fanservice: Esmeralda, so much that all three of the other main characters want her. Sick of drawing petite princesses like Ariel and Belle, Disney decided what they really needed was a heroine who looked like a Victoria's Secret model who pole dances.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "long", 
                    "white"
                ], 
                "role": "Esmeralda wore a long, white dress at the end of Disney's The Hunchback of Notre Dame.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "burnt"
                ], 
                "role": "Woman in White: Esmeralda in the climax when she's sentenced to be burnt at the stake. It's the symbol of purity and hence 'innocent victim'.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "song", 
                    "Topsy-Turvy"
                ], 
                "role": "According to the song \"Topsy-Turvy\" from The Hunchback of Notre Dame, Esmeralda is \"The finest girl in France.\"", 
                "id": "WorldsMostBeautifulWoman"
            }
        ]
    }, 
    "imdbid": "tt0116583", 
    "poster_url": "TheHunchbackOfNotreDame.jpg", 
    "similar": [
        {
            "shared": [
                "LadyInRed", 
                "MsFanservice", 
                "ChivalrousPervert", 
                "KnightInShiningArmor", 
                "BashBrothers", 
                "TheCasanova", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "DirtyOldMan", 
                "BashBrothers", 
                "SissyVillain", 
                "TheCasanova", 
                "ArchnemesisDad", 
                "MissingMom"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "DirtyOldMan", 
                "EvenTheGirlsWantHer", 
                "DistressedDude", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "KnightInShiningArmor", 
                "GracefulLadiesLikePurple", 
                "WomanInWhite", 
                "DistressedDude", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "GirlInTheTower", 
                "KnightInShiningArmor", 
                "GracefulLadiesLikePurple", 
                "BadassDamsel", 
                "DistressedDude", 
                "ActionGirl"
            ], 
            "shared_count": 6, 
            "id": "Tangled", 
            "name": "Tangled", 
            "poster_url": "Tangled.png"
        }
    ], 
    "id": "TheHunchbackOfNotreDame", 
    "name": "The Hunchback of Notre Dame"
}