{
    "plot": "Elliot Moore is a high school science teacher who quizzes his class one day about an article in the New York Times. It's about the sudden, mysterious disappearance of bees. Yet again Nature is doing something inexplicable, and whatever science has to say about it will be, in the end, only a theory. Scientists will bring out more theories, but no explanations, when a more urgent dilemma hits the planet. It begins in Central Park. Suddenly and inexplicably, the behavior of everyone in the park changes in a most bizarre and horrible way. Soon, the strange behavior spreads throughout the city and beyond. Elliot, his wife, Alma, and Jess, the young daughter of a friend, will only have theories to guide them where to run and where to hide. But theories may not be enough.", 
    "genres": "Sci-Fi, Thriller", 
    "release_year": "2008", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Crazy Cat Lady: Or, in this case, a Crazy Doll Lady.", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [
                    "egregious", 
                    "many"
                ], 
                "role": "Emotionless Girl: Alma, more or less, spends most of the movie in Dull Surprise mode, and states at the beginning \"I don't like to show my emotions.\" Maybe the most egregious example among many in this movie is her line about the foliage \"It makes you kill yourself\" ... right after she and Elliot heard it together!", 
                "id": "EmotionlessGirl"
            }
        ]
    }, 
    "imdbid": "tt0949731", 
    "poster_url": "TheHappening.jpg", 
    "similar": [
        {
            "shared": [
                "CrazyCatLady"
            ], 
            "shared_count": 1, 
            "id": "Gremlins", 
            "name": "Gremlins", 
            "poster_url": "Gremlins.jpg"
        }, 
        {
            "shared": [
                "CrazyCatLady"
            ], 
            "shared_count": 1, 
            "id": "PracticalMagic", 
            "name": "Practical Magic", 
            "poster_url": "PracticalMagic.jpg"
        }, 
        {
            "shared": [
                "EmotionlessGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }, 
        {
            "shared": [
                "CrazyCatLady"
            ], 
            "shared_count": 1, 
            "id": "TheAristocats", 
            "name": "The Aristocats", 
            "poster_url": "TheAristocats.jpg"
        }, 
        {
            "shared": [
                "CrazyCatLady"
            ], 
            "shared_count": 1, 
            "id": "ItsAVeryMerryMuppetChristmasMovie", 
            "name": "It's a Very Merry Muppet Christmas Movie", 
            "poster_url": "ItsAVeryMerryMuppetChristmasMovie.jpg"
        }
    ], 
    "id": "TheHappening", 
    "name": "The Happening"
}