{
    "plot": "While the hot rodders and motorcyclists are having a rock-and-roll beach party, a barrel of radioactive material is unloaded from a passing ship, plunges to the bottom and splits against a jagged rock. A black liquid oozes out and covers a shapeless mass on the ocean floor, which suddenly moves and becomes an encrusted vicious monster. Soon there are several monsters and they must have human blood to survive. Tina is the first victim, and football hero Hank Green and airhead Elaine Gavin enlist the aid of her science-professor father, Dr. Gavin, to solve and capture the killer. Not working fast enough to prevent the attack on twenty teen-agers at a slumber party nor the killing of three girl motorists, Dr. Gavin finds an arm lost by one of the monsters and discovers that only sodium will destroy the monsters whose composition is mostly water. Can they gather enough salt in southern California to put an end to this horror?", 
    "genres": "Horror, Musical", 
    "release_year": "1964", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Elaine's role for the film's finale, having tumbled down a slight incline and somehow gotten her leg trapped.", 
                "id": "DamselInDistress"
            }
        ]
    }, 
    "imdbid": "tt0058208", 
    "poster_url": "TheHorrorOfPartyBeach.jpg", 
    "similar": [
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "HouseOfFlyingDaggers", 
            "name": "House of Flying Daggers", 
            "poster_url": "HouseOfFlyingDaggers.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "TurtlesForever", 
            "name": "Turtles Forever", 
            "poster_url": "TurtlesForever.png"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress"
            ], 
            "shared_count": 1, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }
    ], 
    "id": "TheHorrorOfPartyBeach", 
    "name": "The Horror of Party Beach"
}