{
    "plot": "Angelenos Doug Billings and Tracy Garner are about to get married. Two days before the wedding, the four men in the wedding party - Doug, Doug's two best buddies Phil Wenneck and Stu Price, and Tracy's brother Alan Garner - hop into Tracy's father's beloved Mercedes convertible for a 24-hour stag party to Las Vegas. Phil, a married high school teacher, has the same maturity level as his students when he's with his pals. Stu, a dentist, is worried about everything, especially what his controlling girlfriend Melissa thinks. Because she disapproves of traditional male bonding rituals, Stu has to lie to her about the stag, he telling her that they are going on a wine tasting tour in the Napa Valley. Regardless, he intends on eventually marrying her, against the advice and wishes of his friends. And Alan seems to be unaware of what are considered the social graces of the western world. The morning after their arrival in Las Vegas, they awaken in their hotel suite each with the worst hangover. None remembers what happened in the past twelve or so hours. The suite is in shambles. And certain things are in the suite that shouldn't be, and certain things that should be in the suite are missing. Probably the most important in the latter category is Doug. As Phil, Stu and Alan try to find Doug using only what little pieces of information they have at hand, they go on a journey of discovery of how certain things got into the suite and what happened to the missing items. However they are on a race for time as if they can't find Doug in the next few hours, they are going to have to explain to Tracy why they are not yet back in Los Angeles. And even worse, they may not find Doug at all before the wedding.", 
    "genres": "Comedy", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "intensely"
                ], 
                "role": "Badass Beard: Alan. He's got a fine beard. In the sequel, note that Alan has posters of \"Macho Man\" Randy Savage and Hillbilly Jim on the wall among his intensely decorated room.", 
                "id": "BadAssBeard"
            }, 
            {
                "adjectives": [], 
                "role": "Camp Gay / Camp Straight: Mr. Chow  is a subversion, actually. He's been married to a woman for fifteen years.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [
                    "first", 
                    "only", 
                    "direct", 
                    "third", 
                    "incentive"
                ], 
                "role": "Distressed Dude: Subverted with Doug and Teddy in the first two films - the only danger they're in comes from it taking two days to find them in the isolated locations they're trapped in and not of any direct threats on their lives. Played straight in the third film, as Doug is kidnapped and held hostage as incentive for the Wolfpack to track Chow down after he stole millions from Marshall.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [], 
                "role": "Henpecked Boyfriend: Stu. He manages to break up.", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [
                    "fat"
                ], 
                "role": "A policeman calls hirsute Alan \"fat Jesus\" in The Hangover. Likely an Actor Allusion; see the Zach Galifianakis entry in the Real Life section.", 
                "id": "LooksLikeJesus"
            }, 
            {
                "adjectives": [
                    "Overprotective", 
                    "late"
                ], 
                "role": "Overprotective Dad: Completely averted with Tracy's dad, who thinks it's okay for Doug to be late to the wedding if he's on a heater, and doesn't seem to mind the possibility of him getting herpes in Vegas and passing it onto his daughter.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed"
                ], 
                "role": "Sharp-Dressed Man: Alan as the guys are walking through the airport.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "second"
                ], 
                "role": "Sharp Dressed Man: Alan in the second film as the guys are walking through the airport.", 
                "id": "SharpDressedMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Hooker with a Heart of Gold: Jade, who also doubles as a Single Mom Stripper.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "mean"
                ], 
                "role": "The Hangover: Melissa. One can see why Stu wants to stay with her initially, regardless of how mean she is to him.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "single", 
                    "single"
                ], 
                "role": "Heather Graham's character in The Hangover is both a single mom stripper and a single mom prostitute. She says that she works at a strip club as a way of meeting clients.", 
                "id": "SingleMomStripper"
            }
        ]
    }, 
    "imdbid": "tt1119646", 
    "poster_url": "TheHangover.jpg", 
    "similar": [
        {
            "shared": [
                "OverprotectiveDad", 
                "CampGay", 
                "Meganekko"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "HenpeckedHusband", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "TheBestMan", 
            "name": "The Best Man", 
            "poster_url": "TheBestMan.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "OverprotectiveDad"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "JesusChristSuperstar", 
            "name": "Jesus Christ Superstar", 
            "poster_url": "JesusChristSuperstar.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "BadAssBeard"
            ], 
            "shared_count": 2, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }
    ], 
    "id": "TheHangover", 
    "name": "The Hangover"
}