{
    "plot": "In the green woods of Silver Falls, Oregon, Aaron Hallam, a trained assassin AWOL from the Special Forces, keeps his own brand of wildlife vigil. After Hallam brutally slew four deer hunters in the area, FBI Special Agent Abby Durrell turns to L.T. Bonham-- the one man who may be able to stop him. At first L.T. resists the mission. Snug in retirement, he's closed off to his past, the years he spent in the Special Forces training soldiers to become skilled murderers. But when he realizes that these recent slaying is the work of a man he trained, he feels obligated to stop him. Accepting the assignment under the condition that he works alone, L.T. enters the woods, unarmed--plagued by memories of his best student and riddled with guilt for not responding to Aaron's tortured letters to him as he began to slip over the edge of sanity. Furious as he is with his former mentor for ignoring his pleas for help, Aaron knows that he and L.T. share a tragic bond that is unbreakable. And, even as they go into their final combat against each other, neither can say with certainty who is the hunted and who is the hunter.", 
    "genres": "Action, Crime, Drama", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "A Father to His Men: Played with. Those trained by L.T. do see him as a father figure. He does return the feeling (having kept all of Hallam's letters to him speaking of his difficulties) but finds himself failing the \"Father's Dilemma\": how to tell your child \"I don't know the answer\".", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [], 
                "role": "Badass Grandpa: L.T. Bonham", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "L.T"
                ], 
                "role": "Beard of Sorrow: L.T.", 
                "id": "BeardOfSorrow"
            }
        ]
    }, 
    "imdbid": "tt0269347", 
    "poster_url": "TheHunted.jpg", 
    "similar": [
        {
            "shared": [
                "BeardOfSorrow", 
                "BadassGrandpa"
            ], 
            "shared_count": 2, 
            "id": "XMenDaysOfFuturePast", 
            "name": "X-Men: Days of Future Past", 
            "poster_url": "XMenDaysOfFuturePast.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "BadassGrandpa"
            ], 
            "shared_count": 2, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "WeWereSoldiers", 
            "name": "We Were Soldiers", 
            "poster_url": "WeWereSoldiers.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "BadassGrandpa"
            ], 
            "shared_count": 2, 
            "id": "TheOutlawJoseyWales", 
            "name": "The Outlaw Josey Wales", 
            "poster_url": "TheOutlawJoseyWales.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "OnlyGodForgives", 
            "name": "Only God Forgives", 
            "poster_url": "OnlyGodForgives.jpg"
        }
    ], 
    "id": "TheHunted", 
    "name": "The Hunted"
}