{
    "plot": "Eddie is forty, owns a sporting-goods store, and is still single. After watching his ex-fiancée walk down the aisle, he meets Lila, an environmental researcher, who seems too good to be true. Pressured by his father and best friend, Eddie pops the question and marries Lila after only 6 weeks. However, as he almost instantly discovers, his new bride is a nightmare with more baggage than he can handle. She's immature, foolish, a monster in bed, owes a tremendous amount of money to various sources, and as it turns out, is only a volunteer and doesn't actually have a job. While on their honeymoon in Cabo, Eddie meets Miranda, a down-to-earth lacrosse coach who is visiting with her family. Sparks fly, and Eddie falls for her. Now comes the tricky part of breaking off his marriage to crazy Lila, all while keeping the truth from Miranda about why he's in Cabo in the first place...", 
    "genres": "Comedy, Romance", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "instant", 
                    "numerous"
                ], 
                "role": "Papa Wolf: Kelly's father (Eddie Albert) takes an instant disliking to Lenny, which eventually blossoms into seething hatred. He tries numerous times to keep him away from his daughter, even resorting to bribery at one point.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Jewish", 
                    "blue-eyed"
                ], 
                "role": "Shiksa Goddess: Jewish Lenny falls hard for blonde, blue-eyed Kelly ... while on his honeymoon.", 
                "id": "ShiksaGoddess"
            }
        ]
    }, 
    "imdbid": "tt0408839", 
    "poster_url": "TheHeartbreakKid.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "GodzillaVsDestoroyah", 
            "name": "Godzilla vs. Destoroyah"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "TheHeartbreakKid", 
    "name": "The Heartbreak Kid"
}