{
    "plot": "The exploits of four friends, who are socially only marginally above what one of them calls \"the freaks\", are presented as they grow from their late teen years into adults and as they go on their quest, usually unsuccessfully, for such grown up things as beer and sex. Simon Cooper, Jay Cartwright and Neil Sutherland have been friends for some time. Insecure Simon's main quest in life is to get long time friend, Carli D'Amato, to be his girlfriend. Jay is the big talker whose stories, especially about his sexual conquests, are more fantasy than reality. And slightly dim-witted Neil is generally two steps behind everyone else in comprehension of life, and who is always defending his father from beliefs that he's a closet homosexual. Into the group comes its fourth member, Will McKenzie, who met them when he transferred into their school, Rudge Park Comprehensive, at the start of sixth form, as Will's newly divorced mum could no longer afford his private school tuition. Nerdish and straight-laced Will, ridiculed for carrying a briefcase, insinuated himself in the group - not aiming his sights too high - as he tried not to be labeled as one of the freaks. Regardless, he is still the target of the school's \"psycho bully\", Mark Donovan, and the head of Rudge Park's sixth form, Mr. Gilbert. Will's initial saving grace in bonding with his new mates may have been that they all want to shag his pretty but protective mother, Polly.", 
    "genres": "Comedy", 
    "release_year": "2008–2010", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Casanova Wannabe: Jay, of course.", 
                "id": "CasanovaWannabe"
            }, 
            {
                "adjectives": [
                    "Dogged", 
                    "usual"
                ], 
                "role": "Dogged Nice Guy: Will with Allison at first. And Simon with Carli, as usual.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "fair", 
                    "other", 
                    "next"
                ], 
                "role": "Kavorka Man: Neil. He's extremely thick and yet he seems to get offers left, right and centre! Though, to be fair, he's not exactly picky. The other guys have to literally drag him away from the next dinner lady who comes onto him.", 
                "id": "KavorkaMan"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Alpha Bitch: Carli can be this sometimes.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Big Beautiful Woman: Zigzagged with Jane. Jay initially sees her as an Abhorrent Admirer, but apparently more because he's worried about what his friends would think. He comes around in the end.", 
                "id": "BigBeautifulWoman"
            }
        ]
    }, 
    "imdbid": "tt1220617", 
    "similar": [
        {
            "shared": [
                "KavorkaMan", 
                "CasanovaWannabe", 
                "AlphaBitch", 
                "BigBeautifulWoman"
            ], 
            "shared_count": 4, 
            "id": "PitchPerfect", 
            "name": "Pitch Perfect", 
            "poster_url": "PitchPerfect.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan", 
                "DoggedNiceGuy", 
                "BigBeautifulWoman", 
                "CasanovaWannabe"
            ], 
            "shared_count": 4, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "KavorkaMan", 
                "DoggedNiceGuy", 
                "CasanovaWannabe"
            ], 
            "shared_count": 3, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "Burlesque", 
            "name": "Burlesque", 
            "poster_url": "Burlesque.jpg"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "ShowMeLove", 
            "name": "Show Me Love", 
            "poster_url": "ShowMeLove.jpg"
        }
    ], 
    "id": "TheInbetweeners", 
    "name": "The Inbetweeners"
}