{
    "plot": "In late nineteenth century Vienna, renowned illusionist Eisenheim is reunited with the Duchess von Teschen when she is volunteered from the audience to participate in an illusion during one of his performances. Despite having not seen each other in fifteen years when they were teenagers, they almost immediately recognize each other as Eduard Abramovich and Sophie von Teschen, they who had a doomed romance at that time due to their class differences. The Duchess is soon to be wed to the Crown Prince Leopold in what would be for him a marriage solely in pursuit of power: overthrowing his father, the Emperor Leopold, as well as overtaking the Hungarian side of the empire. The Crown Prince is known to use violence against women if it suits his needs or purposes. As such, the Duchess, who realizes that she still loves Eisenheim and he her, can never leave the Crown Prince without it jeopardizing her life. After Eisenheim humiliates the Crown Prince at a private show which results in an incident between the Crown Prince and the Duchess, the battle between Eisenheim and the Crown Prince moves into the public performance realm, which many believe demonstrates Eisenheim's supernatural powers. Much of the work for the Crown Prince in the battle with Eisenheim is conducted by Chief Inspector Uhl, who would become the Chief of Police under the Crown Prince's reign. As such, Uhl may have ulterior motives in turning a blind eye to any unlawful act of the Crown Prince against Eisenheim or the Duchess.", 
    "genres": "Drama, Mystery, Romance", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Beatles-like", 
                    "song"
                ], 
                "role": "Camp Gay: The Beatles-like band whose song is sweeping Europe and driving the Illusionist and acts of his sort out of work.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [
                    "high"
                ], 
                "role": "Man in a Kilt: The film is mostly set in Scotland, so no surprise. The drunk Scotsman gets the Fan Disservice version when the wind blows his kilt a little too high.", 
                "id": "ManInAKilt"
            }, 
            {
                "adjectives": [], 
                "role": "Prince Charmless: Then again...yeah.", 
                "id": "PrinceCharmless"
            }, 
            {
                "adjectives": [], 
                "role": "The prince of The Illusionist.", 
                "id": "PrinceCharmless"
            }, 
            {
                "adjectives": [
                    "Austro-Hungarian", 
                    "murder-suicide"
                ], 
                "role": "Prince Leopold from The Illusionist, who is based on Prince Rudolph of the Austro-Hungarian empire. Prince Rudolph committed a murder-suicide in his hunting lodge; his body was found with a number of bullets in it indicating that there was a palace cover-up and that The Coroner Doth Protest Too Much. Given that, after his death, Franz Ferdinand became heir, things might have turned out better had Rudolph gained the throne.", 
                "id": "TheEvilPrince"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Brawn Hilda: The opera singer at the wedding.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [], 
                "role": "One of these appears as a wedding singer in The Illusionist.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "Rebellious"
                ], 
                "role": "Rebellious Princess: Well, duchess, at least; she wants desperately to run away with Edward despite the fact that he's the lowborn son of a cabinetmaker.", 
                "id": "RebelliousPrincess"
            }
        ]
    }, 
    "imdbid": "tt0443543", 
    "poster_url": "TheIllusionist.jpg", 
    "similar": [
        {
            "shared": [
                "PrinceCharmless", 
                "CampGay", 
                "RebelliousPrincess"
            ], 
            "shared_count": 3, 
            "id": "Spaceballs", 
            "name": "Spaceballs", 
            "poster_url": "Spaceballs.jpg"
        }, 
        {
            "shared": [
                "PrinceCharmless", 
                "TheEvilPrince", 
                "RebelliousPrincess"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "TheEvilPrince", 
                "CampGay"
            ], 
            "shared_count": 2, 
            "id": "Stardust", 
            "name": "Stardust", 
            "poster_url": "Stardust.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "BrawnHilda"
            ], 
            "shared_count": 2, 
            "id": "RevengeOfTheNerds", 
            "name": "Revenge of the Nerds"
        }, 
        {
            "shared": [
                "CampGay", 
                "ManInAKilt"
            ], 
            "shared_count": 2, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }
    ], 
    "id": "TheIllusionist", 
    "name": "The Illusionist"
}