{
    "plot": "Daniel and his mother move from New Jersey to California. She has a wonderful new job, but Daniel quickly discovers that a dark haired Italian boy with a Jersey accent doesn't fit into the blond surfer crowd. Daniel manages to talk his way out of some fights, but he is finally cornered by several who belong to the same karate school. As Daniel is passing out from the beating he sees Miyagi, the elderly gardener leaps into the fray and save him by outfighting half a dozen teenagers. Miyagi and Daniel soon find out the real motivator behind the boys' violent attitude in the form of their karate teacher. Miyagi promises to teach Daniel karate and arranges a fight at the all-valley tournament some months off. When his training begins, Daniel doesn't understand what he is being shown. Miyagi seems more interested in having Daniel paint fences and wax cars than teaching him Karate.", 
    "genres": "Action, Drama, Family", 
    "release_year": "1984", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "first", 
                    "iconic"
                ], 
                "role": "Barbaric Bully: The first movie is a rather iconic example. It gives us High School bullies which Daniel eventually sees off by besting his tormenters in a karate tournament.", 
                "id": "BarbaricBully"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Take a guess...", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Mr Miyagi from The Karate Kid", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "Next", 
                    "young", 
                    "previous", 
                    "same", 
                    "wrong"
                ], 
                "role": "This trope is flirted with in The Next Karate Kid. Old Mr. Miyagi has taken on a young female pupil to replace Daniel LaRusso from the previous films, and in one scene he is shown entering a women's clothing store to buy a prom dress for her. Miyagi is obviously playing the role of grandfather; but since he and the girl are obviously not of the same blood, a TV viewer flipping through that scene might get the wrong idea.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Disappeared Dad: The fact that Dre's father had died was made known at the beginning of the movie.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "original", 
                    "little", 
                    "other", 
                    "first"
                ], 
                "role": "In The Karate Kid (both the original and the 2010 remake), there is little or no mention of Daniel La Russo's dad (the title character) other than that his death prompted Daniel and his mother to move in the beginning of the first movie.\n In the remake, Dre's father is indicated to have died before the story starts.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "This is essentially every William Zabka role in an 80s movie, from The Karate Kid to Back to School.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "Overprotective", 
                    "bad", 
                    "late", 
                    "recital", 
                    "reasonable", 
                    "stereotypical", 
                    "phonetic", 
                    "Chinese", 
                    "later"
                ], 
                "role": "Overprotective Dad: Mei Ying's father disapproved of his daughter's friendship with Dre because he saw him as a bad influence to his daughter, causing her to be late for her recital and forbade her from spending time with him. However, he turns out to be much more reasonable than the stereotypical version. When Dre respectfully approaches him and apologizes (in phonetic Chinese), he reconsiders and is later seen actively cheering for Dre.", 
                "id": "OverprotectiveDad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "last"
                ], 
                "role": "Neutral Female: Kumiko attempts to subvert it by trying to pull Chozen away from Daniel during their last fight. It doesn't work, but the effort is appreciated.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [], 
                "role": "Dre's mother in the 2010 remake of The Karate Kid.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Sassy Black Woman: Dre's mother.", 
                "id": "SassyBlackWoman"
            }
        ]
    }, 
    "imdbid": "tt0087538", 
    "poster_url": "TheKarateKid.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "OverprotectiveDad", 
                "CoolOldGuy", 
                "DirtyOldMan"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "JerkJock", 
                "DirtyOldMan", 
                "SassyBlackWoman"
            ], 
            "shared_count": 3, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "JerkJock", 
                "SassyBlackWoman"
            ], 
            "shared_count": 3, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "DisappearedDad", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "SassyBlackWoman", 
                "JerkJock", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "Transformers", 
            "name": "Transformers"
        }
    ], 
    "id": "TheKarateKid", 
    "name": "The Karate Kid"
}