{
    "plot": "In the 70's in Afghanistan, the Pushtun boy Amir and the Hazara boy Hassan, who is his loyal friend and son of their Hazara servant Ali, are raised together in Amir's father house, playing and kitting on the streets of a peaceful Kabul. Amir feels that his wise and good father Baba blames him for the death of his mother in the delivery, and also that his father loves and prefers Hassan to him. In return, Amir feels a great respect for his father's best friend Rahim Khan, who supports his intention to become a writer. After Amir winning a competition of kitting, Hassan runs to bring a kite to Amir, but he is beaten and raped by the brutal Assef in an empty street to protect Amir's kite; the coward Amir witness the assault but does not help the loyal Hassam. On the day after his birthday party, Amir hides his new watch in Hassam's bed to frame the boy as a thief and force his father to fire Ali, releasing his conscience from recalling his cowardice and betrayal. In 1979, the Russians invade Afghanistan and Baba and Amir escape to Pakistan. In 1988, they have a simple life in Fremont, California, when Amir graduates in a public college for the pride and joy of Baba. Later Amir meets his countrywoman Soraya and they get married. In 2000, after the death of Baba, Amir is a famous novelist and receives a phone call from the terminal Rahim Khan, who discloses secrets about his family, forcing Amir to return to Peshawar, in Pakistan, in a journey of redemption.", 
    "genres": "Drama", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Beard of Evil: Assef.", 
                "id": "BeardOfEvil"
            }
        ]
    }, 
    "imdbid": "tt0419887", 
    "poster_url": "TheKiteRunner.jpg", 
    "similar": [
        {
            "shared": [
                "BeardOfEvil"
            ], 
            "shared_count": 1, 
            "id": "IronMan", 
            "name": "Iron Man", 
            "poster_url": "IronMan.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil"
            ], 
            "shared_count": 1, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil"
            ], 
            "shared_count": 1, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil"
            ], 
            "shared_count": 1, 
            "id": "TheMagnificentSeven", 
            "name": "The Magnificent Seven", 
            "poster_url": "TheMagnificentSeven.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil"
            ], 
            "shared_count": 1, 
            "id": "TheHillsHaveEyes", 
            "name": "The Hills Have Eyes", 
            "poster_url": "TheHillsHaveEyes.jpg"
        }
    ], 
    "id": "TheKiteRunner", 
    "name": "The Kite Runner"
}