{
    "plot": "Mrs. Anna Leonowens and her son Louis arrive in Bangkok, where she has been contracted to teach English to the children of the royal household. She threatens to leave when the house she had been promised is not available, but falls in love with the children. A new slave, a gift of a vassal king, translates \"Uncle Tom's Cabin\" into a Siamese ballet. After expressing her unhappiness at being with the King, the slave decides to make an attempt to escape with her lover. Anna and the King start to fall in love, but her headstrong upbringing inhibits her from joining his harem. She is just about to leave Siam but something important she finds out makes her think about changing her mind.", 
    "genres": "Drama, Musical, Romance", 
    "release_year": "1956", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "alleged", 
                    "own", 
                    "hot", 
                    "various", 
                    "clear", 
                    "able"
                ], 
                "role": "Sissy Villain: Despite his alleged menace, Kralahome does none of his own fighting through the film save for his attempt to shoot down the King's hot air balloon in the climax; his sorcery is also easily thwarted by the most unlikely of inconveniences in his various attempts to kill the King. Also, he had no exit strategy for taking over Siam when his treachery finally became clear to the heroes, and is easily cornered by his enemies before he's even able to attempt any sort of takeover or getaway.", 
                "id": "SissyVillain"
            }
        ]
    }, 
    "imdbid": "tt0049408", 
    "poster_url": "TheKingAndI.jpg", 
    "similar": [
        {
            "shared": [
                "SissyVillain"
            ], 
            "shared_count": 1, 
            "id": "NorthByNorthwest", 
            "name": "North by Northwest", 
            "poster_url": "NorthByNorthwest.jpg"
        }, 
        {
            "shared": [
                "SissyVillain"
            ], 
            "shared_count": 1, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "SissyVillain"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "SissyVillain"
            ], 
            "shared_count": 1, 
            "id": "BarbieAndTheMagicOfPegasus", 
            "name": "Barbie And The Magic Of Pegasus", 
            "poster_url": "BarbieAndTheMagicOfPegasus.jpg"
        }, 
        {
            "shared": [
                "SissyVillain"
            ], 
            "shared_count": 1, 
            "id": "LaserMission", 
            "name": "Laser Mission", 
            "poster_url": "LaserMission.jpg"
        }
    ], 
    "id": "TheKingAndI", 
    "name": "The King and I"
}