{
    "plot": "Soul mate minstrels Jang-sang and Gong-gil eke out a living in 14th century Korea through bawdy stories presented in a tightrope act; however, sexual interests of the rich over Gong-gil's androgynous looks impair their basic desire to entertain once too often. A line is crossed, an authority figure dies, and the pair must flee to Seoul. They soon take up with a trio of fellow minstrels and, lead by Jang-sang, present riskier shows that prove more lucrative; but, a scathing exhibition satirizing the king and his concubine puts them under arrest with a set date for execution. Forced to present themselves to the king for final judgment, they surprisingly wind up becoming his court performers, but the tyrannical king, though sensitive and intelligent, is also excessive and psychologically scarred, with the minstrel shows putting him uncomfortably in touch with buried issues over his dead mother (long ago forced to commit suicide by the court). This makes him dangerously unstable. The alarmed nobles, wanting the minstrels gone, find support from the king's mistress after the king's infatuation turns from her to Gong-gil. Longevity definitely isn't what it once was, and Jang-sang feels they all ought to high-tail it while they can, but Gong-gil, though unwaveringly allegiant, feels differently.", 
    "genres": "Drama, History, Thriller", 
    "release_year": "2005", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Bishōnen/Long-Haired", 
                    "Gong-gil", 
                    "real"
                ], 
                "role": "Bishōnen/Long-Haired Pretty Boy: Gong-gil is about the prettiest you get in real life. See bottom left of page picture.", 
                "id": "Bishonen"
            }
        ]
    }, 
    "imdbid": "tt0492835", 
    "poster_url": "TheKingAndTheClown.jpg", 
    "similar": [
        {
            "shared": [
                "Bishonen"
            ], 
            "shared_count": 1, 
            "id": "Stargate", 
            "name": "Stargate", 
            "poster_url": "Stargate.jpg"
        }, 
        {
            "shared": [
                "Bishonen"
            ], 
            "shared_count": 1, 
            "id": "BreakfastOnPluto", 
            "name": "Breakfast on Pluto", 
            "poster_url": "BreakfastOnPluto.jpg"
        }, 
        {
            "shared": [
                "Bishonen"
            ], 
            "shared_count": 1, 
            "id": "StreetFighter", 
            "name": "Street Fighter", 
            "poster_url": "StreetFighter.jpg"
        }, 
        {
            "shared": [
                "Bishonen"
            ], 
            "shared_count": 1, 
            "id": "Antiviral", 
            "name": "Antiviral", 
            "poster_url": "Antiviral.jpg"
        }, 
        {
            "shared": [
                "Bishonen"
            ], 
            "shared_count": 1, 
            "id": "MaryReilly", 
            "name": "Mary Reilly", 
            "poster_url": "MaryReilly.jpg"
        }
    ], 
    "id": "TheKingAndTheClown", 
    "name": "The King And The Clown"
}