{
    "plot": "Loosely based upon the story by Hans Christian Andersen. Ariel, youngest daughter of King Triton, is dissatisfied with life in the sea. She longs to be with the humans above the surface, and is often caught in arguments with her father over those \"barbaric fish-eaters\". She goes to meet Ursula, the Sea Witch, to strike a deal, but Ursula has bigger plans for this mermaid and her father.", 
    "genres": "Animation, Family, Fantasy", 
    "release_year": "1989", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "popular", 
                    "first"
                ], 
                "role": "Mr. Fanservice: Whilst not as popular as Phillip from Sleeping Beauty, Eric nevertheless has his fair share of fangirls. It helps that he's the Animation Renaissance's first bona fide badass.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "stingray-merman", 
                    "young", 
                    "evil", 
                    "whole", 
                    "little"
                ], 
                "role": "In the animated television series to Disney's The Little Mermaid, there's an episode involving a stingray-merman (who is evil) training his young son to be evil (even singing a whole Villain Song about it). The little stingray boy is conflicted between pleasing his dad and being himself.", 
                "id": "OverlordJr"
            }, 
            {
                "adjectives": [
                    "Overprotective"
                ], 
                "role": "Overprotective Dad: Triton destroys almost everything Ariel cares about because of this, but in the end he becomes a Papa Wolf.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [
                    "dangerous", 
                    "own"
                ], 
                "role": "The Little Mermaid\n King Triton. Granted, the surface IS probably dangerous for merpeople, but he kind of takes it to extremes.  This is explained in the prequel, when the audience finds out that his wife Athena had a BOAT dropped on her!. Yikes.\n Heck, even Ariel is like this to her own daughter, Melody. She doesn't even let her go in the water, probably to keep her safe from Morgana and to hope she doesn't do a repeat of she did with Ursula.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: And protects her from Ursula (Well, he tries.)", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "last", 
                    "straight", 
                    "Western", 
                    "well-developed"
                ], 
                "role": "Eric from The Little Mermaid (1989) is one of the last examples of this trope being played straight in Western media. Notably, unlike the Princes from Sleeping Beauty or Snow White, he is a well-developed character.", 
                "id": "PrinceCharming"
            }, 
            {
                "adjectives": [], 
                "role": "Prince Eric from The Little Mermaid, particularly in the Broadway play in which he states he prefers life on the sea.", 
                "id": "RebelPrince"
            }, 
            {
                "adjectives": [
                    "heavy-handed", 
                    "Fantasy-Forbidding"
                ], 
                "role": "King Triton from The Little Mermaid; although he's heavy-handed in a Fantasy-Forbidding Father kind of way, it was always with Ariel's safety in mind.", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "first", 
                    "musical"
                ], 
                "role": "Action Girl: Ariel was the first Disney Princess to take action and actually do her own rescuing. In the stage musical,  SHE'S the one who kills Ursula, not Eric!", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "first", 
                    "first", 
                    "only", 
                    "first", 
                    "powerful", 
                    "Fire/Ice/Lightning"
                ], 
                "role": "Ariel from The Little Mermaid was probably the first badass Disney princess and was most certainly the first to save her prince. The TV series, sequel and her appearance in the Kingdom Hearts video game only solidified her badassery. Ariel was the only female party member in the first game (unless you count Tinkerbell, who was a summon), and knew powerful Fire/Ice/Lightning magic, among others.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "first", 
                    "able", 
                    "powerful", 
                    "original", 
                    "many"
                ], 
                "role": "Ariel in the first Kingdom Hearts was an Action Girl able to cast powerful spells and take down The Heartless with a whip of her tail. Come the sequel, however, and she has suddenly lost all of the ability, leaving her almost (unfortunately they excluded her feisty attitude) exactly as she was in her original film, leaving many players to wonder what the point of revisiting Atlantica was to begin with.", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [], 
                "role": "Princess Ariel — The Little Mermaid (1989)", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "initial", 
                    "unworkable", 
                    "long", 
                    "single", 
                    "first"
                ], 
                "role": "The Little Mermaid was going to use this, and did use it through the storyboarding and the initial pencil tests. It was only abandoned when the colour tests showed the concept to be unworkable without redesigning almost every underwater shot. Seashell Bra were used instead.\n It should be noted however, that her long hair was used for a single shot to cover between her legs, when she was trying to stand for the first time.", 
                "id": "GodivaHair"
            }, 
            {
                "adjectives": [], 
                "role": "Ariel of The Little Mermaid wears a purple seashell bra as a mermaid, and in The Little Mermaid II: Return to the Sea, she wears a purple Pimped-Out Dress.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [
                    "purple"
                ], 
                "role": "Graceful Ladies Like Purple: Ariel's seashell bra, and her dress in the sequel are purple.", 
                "id": "GracefulLadiesLikePurple"
            }, 
            {
                "adjectives": [
                    "only", 
                    "much", 
                    "old"
                ], 
                "role": "Innocent Fanservice Girl: Ariel. When she first becomes human, the only thing she's wearing is her Seashell Bra. Not having much knowledge of clothes, who knows how much longer she would have went naked without care if Scuttle hadn't given her that old sail.", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "sixteen"
                ], 
                "role": "Jailbait: Ariel has just turned sixteen at the start of the movie, but no one makes any issue of her getting married what is presumably just weeks later. Possibly because she's royalty.", 
                "id": "Jailbait"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Bear: Ursula did not take Flotsam and Jetsam's deaths well. \"Babies! My poor little poopsies!\" Also, Ariel in the sequel and Athena in the prequel.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "'manic", 
                    "same"
                ], 
                "role": "Manic Pixie Dream Girl: Broken up into two components. The girl Prince Eric encounters on the beach is the 'dream girl'; the girl who uses a fork to comb her hair and jumps a carriage over a ravine is the 'manic pixie'. Only at the end does Eric realise they're one and the same.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "music", 
                    "hit-and-run", 
                    "pirate", 
                    "music", 
                    "music"
                ], 
                "role": "The Little Mermaid: No mention is made of Ariel's mother, or what became of her. (Ariel's Beginning is about her: she's called Athena. Ariel's love of music comes from her mother, who died in a hit-and-run with a pirate ship. Since that event, King Triton banned music from Atlantica in grief, so Ariel's Beginning is about how the music was brought back.)", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Ariel all the way.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Ariel from The Little Mermaid.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "Rebellious", 
                    "near-constant"
                ], 
                "role": "Rebellious Princess: Ariel fits this to a T. She's pretty much the Trope Codifier, at least for Disney's near-constant use of this trope ever since.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "appear", 
                    "purple", 
                    "sixteen-year", 
                    "old", 
                    "first"
                ], 
                "role": "Seashell Bra: Made of what appear to be purple clamshells. Also of note is that the sixteen-year old Ariel was the first Disney character designed and animated in a way that showed the line of her cleavage.", 
                "id": "SeashellBra"
            }, 
            {
                "adjectives": [
                    "unusual", 
                    "flesh", 
                    "song"
                ], 
                "role": "The Little Mermaid of course, though Ariel is unusual in that her top has a strap. Ursula has octopus flesh go over her chest instead, though. Some people think the overweight mermaid illusion seen in Ursula's song has her chest covered by scales, but looking closely reveals she too wears a Seashell Bra.", 
                "id": "SeashellBra"
            }, 
            {
                "adjectives": [], 
                "role": "Ariel from The Little Mermaid, and her daughter Melody in the sequel even moreso.", 
                "id": "TomboyPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Ursula from The Little Mermaid (also a member of a fairy race, but is considered a wicked witch to merfolk)", 
                "id": "WickedWitch"
            }, 
            {
                "adjectives": [], 
                "role": "Wicked Witch Witch with a Capital B", 
                "id": "WickedWitch"
            }
        ]
    }, 
    "imdbid": "tt0097757", 
    "poster_url": "TheLittleMermaid.jpg", 
    "similar": [
        {
            "shared": [
                "OverprotectiveDad", 
                "RebelliousPrincess", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "TomboyPrincess", 
                "Chickification", 
                "BadassPrincess", 
                "PluckyGirl", 
                "ActionGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 10, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "PrinceCharming", 
                "InnocentFanserviceGirl", 
                "EverythingsBetterWithPrincesses", 
                "GracefulLadiesLikePurple", 
                "MissingMom", 
                "PluckyGirl", 
                "MrFanservice", 
                "ActionGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 9, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "GracefulLadiesLikePurple", 
                "PapaWolf", 
                "EverythingsBetterWithPrincesses", 
                "BadassPrincess", 
                "PluckyGirl", 
                "MrFanservice", 
                "ActionGirl", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "MamaBear", 
                "EverythingsBetterWithPrincesses", 
                "TomboyPrincess", 
                "TheGoodKing", 
                "MrFanservice", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 8, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "PluckyGirl", 
                "RebelliousPrincess", 
                "GracefulLadiesLikePurple", 
                "EverythingsBetterWithPrincesses", 
                "TheGoodKing", 
                "MrFanservice", 
                "MissingMom"
            ], 
            "shared_count": 8, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }
    ], 
    "id": "TheLittleMermaid", 
    "name": "The Little Mermaid"
}