{
    "plot": "A young lion Prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron fist, the prince grows up beyond the savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young Prince must decide his fate: will he remain an outcast, or face his demons and become what he needs to be?", 
    "genres": "Animation, Adventure, Drama", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "evil", 
                    "black"
                ], 
                "role": "Scar, Simba's evil uncle from The Lion King has a tuft of scraggly black fur on his chin reminiscent of a goatee.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Rafiki from The Lion King.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "dead"
                ], 
                "role": "The Lion King: Mufasa is killed by Scar in the middle of the movie. He does return from the dead for some encouragement.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Keet: Simba occasionally shows a bit of this as a cub. Also possibly as an adult, thanks to living with Timon and Pumbaa.", 
                "id": "Keet"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Mufasa.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "light", 
                    "above", 
                    "future", 
                    "various", 
                    "royal", 
                    "first", 
                    "later"
                ], 
                "role": "In light of the above, the Princes in future Disney films play with this trope in various forms. They can be refusing their royal duties (Simba), be jerks at first (though later become better) (Beast, Kuzco, Naveen), actually start off as commoners who reach their role as prince through marriage (Aladdin, Flynn Rider), or even be the Big Bad (Hans)", 
                "id": "PrinceCharming"
            }, 
            {
                "adjectives": [], 
                "role": "The Lion King: Justified by Simba who thought Mufasa's death was his fault. He then stopped being a Sheltered Aristocrat and ran away.", 
                "id": "RebelPrince"
            }, 
            {
                "adjectives": [
                    "former", 
                    "golden-furred", 
                    "African-American", 
                    "dark-furred"
                ], 
                "role": "Inverted in The Lion King where the former Lion King Mufasa is a burly, golden-furred lion voiced by African-American actor James Earl Jones, while Big Bad Scar is a scrawny, dark-furred lion voiced by Caucasian (and British) Jeremy Irons.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "In The Lion King, Simba was surprised to learn that there was more to being king than getting your way all the time. He was still a cub at the time.", 
                "id": "ShelteredAristocrat"
            }, 
            {
                "adjectives": [
                    "limp-pawed", 
                    "big", 
                    "song", 
                    "Beautiful"
                ], 
                "role": "Scar from The Lion King is easily the most limp-pawed feline ever to grace the big screen. This becomes a Parental Bonus for the Swedish Viewers where Scar is dubbed by the Very Gay and Very Out Actor/Singer Richard Wolff. How out is he? He penned a song describing his Coming-Out Story titled \"Beautiful Boys, Beautiful Men.\" Don't worry, Scar is still awesome.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Scar from The Lion King kills his brother and tries to kill his nephew.", 
                "id": "TheEvilPrince"
            }, 
            {
                "adjectives": [], 
                "role": "Mufasa in The Lion King. The sequels show that Simba is following in his father's footsteps.", 
                "id": "TheGoodKing"
            }, 
            {
                "adjectives": [], 
                "role": "The Good King: Mufasa. And Simba after his return to the Pridelands.", 
                "id": "TheGoodKing"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "In The Lion King, Sarabi leads the lionesses who do the hunting. However, it's only mentioned when there's no food to hunt. There's also Nala, who almost kills Pumbaa and always pins Simba when they wrestle.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "nonhuman"
                ], 
                "role": "Shenzi, Zira, and Vitani are nonhuman examples from The Lion King films.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Nala from The Lion King, and Kiara in the sequel.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "Disney-related", 
                    "apparent", 
                    "opposite", 
                    "similar", 
                    "other"
                ], 
                "role": "The Lion King: Nala is probably one of the clearest Disney-related examples, as is easily apparent when she play-wrestles with Simba on her way to an elephant graveyard with him. That far into the movie, they're just friends (and they don't take seriously the idea that they'd grow up to be more than friends) and you could almost forget they're opposite genders if not for the voices. The Lion King has its protagonist and princess more similar to each other than most Disney movies do.", 
                "id": "TomboyPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy Princess: 90's-era Disney movies were known for these, and Nala is arguably the best example.", 
                "id": "TomboyPrincess"
            }
        ]
    }, 
    "imdbid": "tt0110357", 
    "poster_url": "TheLionKing.jpg", 
    "similar": [
        {
            "shared": [
                "RebelPrince", 
                "PluckyGirl", 
                "PrinceCharming", 
                "PapaWolf", 
                "TomboyPrincess", 
                "TheGoodKing", 
                "BadassPrincess"
            ], 
            "shared_count": 7, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "CoolOldGuy", 
                "DarkActionGirl", 
                "SissyVillain", 
                "PluckyGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 6, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad", 
                "PluckyGirl", 
                "CoolOldGuy", 
                "BadassPrincess"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil", 
                "PluckyGirl", 
                "SissyVillain", 
                "CoolOldGuy", 
                "DarkActionGirl"
            ], 
            "shared_count": 5, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "SissyVillain", 
                "BeardOfEvil", 
                "ScaryBlackMan", 
                "DarkActionGirl"
            ], 
            "shared_count": 5, 
            "id": "TheTransporter", 
            "name": "The Transporter", 
            "poster_url": "TheTransporter.jpg"
        }
    ], 
    "id": "TheLionKing", 
    "name": "The Lion King"
}