{
    "plot": "While being transported by two detectives in a car, the dangerous criminal Krug is rescued by his brother Francis and his girlfriend Sadie, and they brutally kill the detectives. Meanwhile Emma, her husband Dr. John and their seventeen year-old daughter Mari Collingwood head on vacation to their house nearby the lake. Mari borrows the family car to meet her friend Paige that is working in a store in the town. They befriend the teenager Justin in the store and he offers some marijuana to the pothead Paige in the motel where he is lodged. While they are smoking grass in Justin's room, Krug, who is Justin's father, Francis and Sadie arrive and abducts the girls. Krug drives Mari's car and she provokes a crash on a tree. Krug stabs Paige and rapes Mari; however Mari manages to escape, swimming in the lake, but Krug shoots her in the back. They walk through the isolated road in the woods and they reach Collingwood's house telling that they have just had a car accident. Emma and John welcome the strangers until they discover what has happened to their beloved daughter.", 
    "genres": "Horror", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Dirty Coward: In the end Krug appears to be this once he realizes that he is truly screwed and that old man Collingwood is gonna take him apart with that chainsaw, and suddenly all his macho psycho b.s. goes right out the window.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "elderly", 
                    "original"
                ], 
                "role": "Dirty Old Man: The elderly mailman at the beginning of the original film describes Mari as \"the prettiest piece I've ever seen\".", 
                "id": "DirtyOldMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "original"
                ], 
                "role": "Mama Bear & Papa Wolf: Emma (Estelle in the original) and John Collingwood.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "cheeky", 
                    "frantic"
                ], 
                "role": "Sassy Black Woman: Subverted as the chicken farmer's cheeky attitude towards the frantic cops helps get  Mari and Phyllis killed.", 
                "id": "SassyBlackWoman"
            }
        ]
    }, 
    "imdbid": "tt0844708", 
    "poster_url": "TheLastHouseOnTheLeft.jpg", 
    "similar": [
        {
            "shared": [
                "SassyBlackWoman", 
                "DirtyOldMan", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "DemonKnight", 
            "name": "Demon Knight", 
            "poster_url": "DemonKnight.jpg"
        }, 
        {
            "shared": [
                "SassyBlackWoman", 
                "DirtyOldMan"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "MamaBear", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "WhiteFang", 
            "name": "White Fang", 
            "poster_url": "WhiteFang.jpg"
        }, 
        {
            "shared": [
                "MamaBear", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "ResidentEvilDegeneration", 
            "name": "Resident Evil Degeneration"
        }, 
        {
            "shared": [
                "MamaBear", 
                "DirtyOldMan"
            ], 
            "shared_count": 2, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }
    ], 
    "id": "TheLastHouseOnTheLeft", 
    "name": "The Last House on the Left"
}