{
    "plot": "A young Hobbit named Frodo (Guard) is thrown on an amazing adventure, when he is appointed the job of destroying the one ring which was created by the dark lord Sauron. He is assigned with warriors including Gandalf (Squire), Aragorn (Hurt) and Boromir (Cox). It's not going to be an easy journey for the Fellowship of the Ring, on the ultimate quest to rid Middle-Earth of all evil.", 
    "genres": "Animation, Adventure, Drama", 
    "release_year": "1978", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old", 
                    "nearly-pure", 
                    "extended", 
                    "true"
                ], 
                "role": "Badass Grandpa: Speaking of Gandalf, the guy has been around since the creation of the universe. King Théoden was 71 years old when he died. In real life, Bernard Hill (the actor) was around 58 during the filming. Aragorn, being a nearly-pure Numenorean, is well into his 80s despite looking no more than half that. This is addressed in the extended edition of Two Towers, when Eowyn is flabbergasted to learn Aragorn's true age during a conversation.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "gate", 
                    "entire", 
                    "many", 
                    "impressive"
                ], 
                "role": "Aragorn and Gimli did a fine example of this in The Two Towers. Needing to give a gate some time to be repaired, Aragorn and Gimli did a flying leap onto the ramp and proceeded to fight off an entire legion of Uruk-hai. One of the best sequences of many impressive ones in the trilogy.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [], 
                "role": "Battle Butler: Sam.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [], 
                "role": "Child Soldiers: Glimpsed in The Two Towers.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "young", 
                    "combat", 
                    "heavy", 
                    "safe", 
                    "post-victory"
                ], 
                "role": "Glimpsed in The Two Towers in The Lord of the Rings.\n Specifically, there is a scene where the soldiers suit up to defend Helm's Deep and we see a number of people being armed are very young boys needed to up their soldier count. Mercifully, we're never shown the kids doing any actually combat besides throwing stones at the besiegers from the wall.\n Which is not to say that they aren't implied to having fought, we just don't see them die either. Judging by the heavy casualties suffered by the defenders, it is safe to say that most of these children will have been cut down by the Uruk-Hai.\n At least some of the boys can later be seen in the background of the post-victory banquet scene.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "Théoden"
                ], 
                "role": "Cool Old Guy: Gandalf and Théoden.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Aragorn in The Lord of the Rings trilogy. Bonus points for being a saviour for Gondor along with Healing Hands.", 
                "id": "LooksLikeJesus"
            }, 
            {
                "adjectives": [
                    "secondary", 
                    "delectable-looking", 
                    "male", 
                    "Middle-earth", 
                    "general", 
                    "strong", 
                    "female", 
                    "many", 
                    "serious", 
                    "romantic", 
                    "dramatic", 
                    "Impossible"
                ], 
                "role": "Mr. Fanservice: Most of the Fellowship as well as some secondary characters were targets of the Estrogen Brigade even before the books were adapted for screen. Having the characters played by delectable-looking actors merely made this trope more prominent. And to think the film's producers were worried that women wouldn't come to see this picture because they perceived the book as appealing primarily to males, since it's a war story featuring mostly male heroes. They seem never to have bothered to research this; the books, and Middle-earth in general, have always had an extremely strong female readership for many reasons. From about 1969 to 1971, there was a movement among fans of Leonard Nimoy to cast him as Aragorn in a live-action film version (this is long before Bakshi). The official fan club was quite serious about this, especially after Nimoy was cast as a romantic, dramatic stage magician and master of disguise in Mission: Impossible.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "male", 
                    "old", 
                    "Bishōnen"
                ], 
                "role": "Pretty Boy: All of the male elves. Well, except for Elrond, who is old, but you can still tell that he must have been Bishōnen in his younger years (he is played by Hugo Weaving, after all). Frodo.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [], 
                "role": "Rebel Prince is Aragorn.", 
                "id": "RebelPrince"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Éowyn", 
                    "first", 
                    "extended"
                ], 
                "role": "Action Girl: Éowyn aside, Arwen also has a moment in the limelight in the first film. Word of God reveals that Arwen was initially slated to appear at Helm's Deep to fight alongside the heroes. It was eventually realized that this may be pushing it a little too far (even Liv Tyler hated the idea), and in the end she was replaced by Haldir. If you look closely during the extended edition you will see some of the elves are actually women.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "several", 
                    "other", 
                    "new", 
                    "total"
                ], 
                "role": "Arwen's role in The Lord of the Rings is expanded considerably, compared to the books. Glorfindel's ride to bring Frodo to Rivendell is given to Arwen, along with several other changes, to make her both an Action Girl and an Affirmative Action Girl.\n And also according to the commentaries, to avoid introducing a new named character who will have 2 total minutes of screen time.", 
                "id": "AffirmativeActionGirl"
            }, 
            {
                "adjectives": [
                    "much"
                ], 
                "role": "In the film adaptation of The Lord of the Rings, Éowyn very much took on this role for Merry.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "beautiful"
                ], 
                "role": "The angelically beautiful elves in The Lord of the Rings movies displayed this quality for both genders, particularly for Liv Tyler's Arwen.", 
                "id": "GaussianGirl"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "terrible", 
                    "Treacherous", 
                    "despair"
                ], 
                "role": "God Save Us from the Queen!: \"In place of a Dark Lord you would have a QUEEN! Not dark but beautiful and terrible as the dawn! Treacherous as the sea (...) All shall love me, and despair.\"", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "good", 
                    "royal", 
                    "Lórien", 
                    "call"
                ], 
                "role": "In The Lord of the Rings Galadriel is most definitely The High Queen and a good gal, but she refuses to go by that title; or even be acknowledged as the ruler of Lórien. The reason she refuses royal titles is because she and her husband feel that Lórien is merely a place they are guarding, not ruling. The only moment when she does call herself a Queen is the moment of her temptation by the Ring. She resists it when she realizes she'll become one of these.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [
                    "portrayal", 
                    "male", 
                    "Ilúvatar"
                ], 
                "role": "Monogender Monsters: The movie's portrayal of Uruk-Hai, being all male and spawned from mud pits. In the books Orcs are said to \"breed after the fashion of the Children of Ilúvatar\" (elves and men) but only males are seen.", 
                "id": "MonogenderMonsters"
            }, 
            {
                "adjectives": [
                    "only", 
                    "only"
                ], 
                "role": "Sweet Polly Oliver: Partly averted. Éowyn's disguise worked only worked as long as no only looked at her closely or heard her speak. Thus Merry recognized her almost immediately, but he didn't mind as she was the only one who would take him to battle.", 
                "id": "SweetPollyOliver"
            }, 
            {
                "adjectives": [
                    "High", 
                    "famous"
                ], 
                "role": "The High Queen: Galadriel. In a case of Meta Casting, she is played by Cate Blanchett, famous for portraying Elizabeth I, a Trope Codifier of High Queendom.", 
                "id": "TheHighQueen"
            }, 
            {
                "adjectives": [
                    "first", 
                    "white-clad"
                ], 
                "role": "In the first movie, when the Fellowship parts from Lothlorien, a white-clad Galadriel makes a blessing gesture◊, looking much like Catholic statues of Virgin Mary.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "striking", 
                    "extended", 
                    "white", 
                    "impractical", 
                    "Witch-King", 
                    "white"
                ], 
                "role": "One of the most striking images from the extended edition of The Return of the King is Éowyn, the White Lady of Rohan, standing on a balcony in a flowing white gown with her blonde hair fluttering in the wind. As noted in the literature section, however, white is a bit impractical for things like killing the Witch-King and generally kicking ass on the battlefield, so she's not always in white.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0077869", 
    "poster_url": "TheLordOfTheRings.jpg", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa", 
                "CoolOldGuy", 
                "MrFanservice", 
                "WomanInWhite", 
                "PrettyBoy", 
                "TheHighQueen", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "AffirmativeActionGirl", 
                "CoolOldGuy", 
                "BashBrothers", 
                "SweetPollyOliver", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "SweetPollyOliver", 
                "PrettyBoy", 
                "CoolOldGuy", 
                "ActionGirl", 
                "MrFanservice"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "ActionGirl", 
                "MrFanservice", 
                "WomanInWhite", 
                "TheHighQueen"
            ], 
            "shared_count": 5, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "GodSaveUsFromTheQueen", 
                "ActionGirl", 
                "TheHighQueen", 
                "WomanInWhite"
            ], 
            "shared_count": 5, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }
    ], 
    "id": "TheLordOfTheRings", 
    "name": "The Lord of the Rings"
}