{
    "plot": "The world is divided into four kingdoms, each represented by the element they harness, and peace has lasted throughout the realms of Water, Air, Earth, and Fire under the supervision of the Avatar, a link to the spirit world and the only being capable of mastering the use of all four elements. When young Avatar Aang disappears, the Fire Nation launches an attack to eradicate all members of the Air Nomads to prevent interference in their future plans for world domination. 100 years pass and current Fire Lord Ozai continues to conquer and imprison anyone with elemental \"bending\" abilities in the Earth and Water Kingdoms, while siblings Katara and Sokka from a Southern Water Tribe find a mysterious boy trapped beneath the ice outside their village. Upon rescuing him, he reveals himself to be Aang, Avatar and last of the Air Nomads. Swearing to protect the Avatar, Katara and Sokka journey with him to the Northern Water Kingdom in his quest to master \"Waterbending\" and eventually fulfill his destiny of once again restoring peace to the world. But as they inch nearer to their goal, the group must evade Prince Zuko, the exiled son of Lord Ozai, Commander Zhao, the Fire Nation's military leader, and the tyrannical onslaught of the evil Fire Lord himself.", 
    "genres": "Action, Adventure, Family", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bash Brothers: Aang and the Blue Spirit.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [], 
                "role": "Dude Looks Like a Lady: Haru, as pointed out in the RiffTrax.", 
                "id": "DudeLooksLikeALady"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Last", 
                    "instructive", 
                    "different", 
                    "original"
                ], 
                "role": "Katara spends most of the film adaptation of The Last Airbender looking like she's about to cry. It's instructive to compare the different versions of her fight with Zuko - in the original, she almost wins, whereas in the movie, he defeats her easily.", 
                "id": "Chickification"
            }
        ]
    }, 
    "imdbid": "tt0938283", 
    "poster_url": "TheLastAirbender.jpg", 
    "similar": [
        {
            "shared": [
                "DudeLooksLikeALady", 
                "Chickification"
            ], 
            "shared_count": 2, 
            "id": "LesMiserables", 
            "name": "Les Misérables"
        }, 
        {
            "shared": [
                "DudeLooksLikeALady", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "DudeLooksLikeALady", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "BashBrothers"
            ], 
            "shared_count": 1, 
            "id": "KamenRider", 
            "name": "Kamen Rider"
        }, 
        {
            "shared": [
                "BashBrothers"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "TheLastAirbender", 
    "name": "The Last Airbender"
}