{
    "plot": "Scottish archaeologist Angus Flint discovers an odd skull amid the ruins of a convent that he is excavating. Shortly thereafter, Lady Sylvia Marsh returns to Temple House, a nearby mansion, far earlier than expected. At a party in the village, Angus meets Lord James D'Ampton, who has just inherited his family's land right next to Temple House. Angus learns of the D'Ampton Worm, a huge dragon-snake that an earlier D'Ampton killed by cutting it in half. (There's a pretty catchy rock-folk song that tells the D'Ampton Worm legend.) As people begin disappearing and acting strangely over the next few days, the skull is stolen from Angus's room, and the watch of a missing person is found in a cavern that was the legendary home of the D'Ampton worm. Angus and James discover that there was an ancient cult that worshiped the worm as a god, and they theorize that the creature somehow survived its destruction, but it was trapped inside the cavern. The remainder of the movie shows Angus, James, and Mary Trent attempting to stop Lady Marsh from freeing the creature....", 
    "genres": "Comedy, Horror", 
    "release_year": "1988", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Lady Sylvia Marsh in The Lair of the White Worm likes both genders, but seems to take more pleasure in her female victims.", 
                "id": "LesbianVampire"
            }, 
            {
                "adjectives": [
                    "Lesbian", 
                    "particular"
                ], 
                "role": "Lesbian Vampire: Lady Marsh has sex with men but that seems to be a means to an end when it comes to feeding. She takes a more particular liking to Eve.", 
                "id": "LesbianVampire"
            }, 
            {
                "adjectives": [
                    "dark"
                ], 
                "role": "Mrs. Robinson: A very dark example.", 
                "id": "MrsRobinson"
            }, 
            {
                "adjectives": [], 
                "role": "Lady Marsh in The Lair of the White Worm seduces both men and women to their doom.", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [], 
                "role": "The Vamp: Lady Marsh... in more ways than one.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0095488", 
    "poster_url": "TheLairOfTheWhiteWorm.jpg", 
    "similar": [
        {
            "shared": [
                "TheVamp", 
                "MrsRobinson"
            ], 
            "shared_count": 2, 
            "id": "LairOfTheWhiteWorm", 
            "name": "Lair Of The White Worm", 
            "poster_url": "LairOfTheWhiteWorm.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "LesbianVampire"
            ], 
            "shared_count": 2, 
            "id": "DraculasDaughter", 
            "name": "Dracula's Daughter", 
            "poster_url": "DraculasDaughter.jpg"
        }, 
        {
            "shared": [
                "LesbianVampire"
            ], 
            "shared_count": 1, 
            "id": "RazorBladeSmile", 
            "name": "Razor Blade Smile", 
            "poster_url": "RazorBladeSmile.jpg"
        }, 
        {
            "shared": [
                "TheVamp"
            ], 
            "shared_count": 1, 
            "id": "Sunrise", 
            "name": "Sunrise", 
            "poster_url": "Sunrise.jpg"
        }, 
        {
            "shared": [
                "MrsRobinson"
            ], 
            "shared_count": 1, 
            "id": "CatherineTheGreat", 
            "name": "Catherine The Great", 
            "poster_url": "CatherineTheGreat.jpg"
        }
    ], 
    "id": "TheLairOfTheWhiteWorm", 
    "name": "The Lair of the White Worm"
}