{
    "plot": "Passengers on a scheduled train out of the mountainous European country of Mandrika are delayed by a day due to an avalanche, and thus get up close and personal with each other out of necessity in the only and what becomes an overcrowded inn in the area. Once the train departs, the one person who it is uncertain is on the train is a middle aged English governess named Miss Froy. Iris Henderson, who was vacationing in Mandrika with girlfriends before heading back to England to get married, is certain that Miss Froy was on the train as they were in the same compartment and they had tea together in the dining car, but all those people who can corroborate her story don't seem to want to do so. Iris' thoughts are easily dismissed as a possible concussion as Iris was hit over the head just before boarding the train. Iris will take anyone's help in finding Miss Froy, even that of an Englishman named Gilbert, a musicologist with who she had a not so pleasant encounter at the inn the evening before. As Iris and Gilbert go on their quest throughout the train, they believe there is a conspiracy amongst many of the passengers against the validity of there being a Miss Froy. But if there is a conspiracy, Iris and Gilbert still have to find Miss Froy and find out why anyone would want to kidnap a middle aged English governess.", 
    "genres": "Comedy, Mystery, Thriller", 
    "release_year": "1938", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "referee", 
                    "bad"
                ], 
                "role": "Neutral Female: Defied. A fight scene between Gilbert and one of the conspirators starts out with Iris standing on the sidelines before Gilbert tells her \"don't just stand there like a referee, cooperate.\" She does help and actually ends up being the one to disarm and knock out the bad guy.", 
                "id": "NeutralFemale"
            }
        ]
    }, 
    "imdbid": "tt0030341", 
    "poster_url": "TheLadyVanishes.jpg", 
    "similar": [
        {
            "shared": [
                "NeutralFemale"
            ], 
            "shared_count": 1, 
            "id": "RawDeal", 
            "name": "Raw Deal", 
            "poster_url": "RawDeal.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale"
            ], 
            "shared_count": 1, 
            "id": "RobinHoodPrinceOfThieves", 
            "name": "Robin Hood: Prince of Thieves", 
            "poster_url": "RobinHoodPrinceOfThieves.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale"
            ], 
            "shared_count": 1, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale"
            ], 
            "shared_count": 1, 
            "id": "TheBladeMaster", 
            "name": "The Blade Master"
        }, 
        {
            "shared": [
                "NeutralFemale"
            ], 
            "shared_count": 1, 
            "id": "TheScarletPumpernickel", 
            "name": "The Scarlet Pumpernickel"
        }
    ], 
    "id": "TheLadyVanishes", 
    "name": "The Lady Vanishes"
}