{
    "plot": "When his army unit was ambushed during the first Gulf War, Sergeant Raymond Shaw saved his fellow soldiers just as his commanding officer, then-Captain Ben Marco, was knocked unconscious. Brokering the incident for political capital, Shaw eventually becomes a vice-presidential nominee, while Marco is haunted by dreams of what happened -- or didn't happen -- in Kuwait. As Marco (now a Major) investigates, the story begins to unravel, to the point where he questions if it happened at all. Is it possible the entire unit was kidnapped and brainwashed to believe Shaw is a war hero as part of a plot to seize the White House? Some very powerful people at Manchurian Global corporation appear desperate to stop him from finding out.", 
    "genres": "Drama, Mystery, Sci-Fi", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Manchurian"
                ], 
                "role": "Henpecked Husband / Parenting the Husband: The Manchurian Candidate in the novel is Mrs. Iselin's husband, John. She fusses over him day and night...after all, world domination is at stake!", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [
                    "possible"
                ], 
                "role": "Raymond Shaw, the protagonist of The Manchurian Candidate, is controlled utterly by his mother, to perhaps the most frightening possible degree.", 
                "id": "MommasBoy"
            }, 
            {
                "adjectives": [
                    "shy", 
                    "sexual"
                ], 
                "role": "The Casanova: Marco is said to have at least two women every night, and Raymond's pretty good at with women as well. Raymond was originally shy around women, but Dr. Yen Lo \"removed\" Raymond's sexual timidity during his brainwashing.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "political", 
                    "neurotic"
                ], 
                "role": "Eleanor Iselin in Richard Condon's The Manchurian Candidate. Having waaay too much political ambition, she manipulates and discards men, including her neurotic, brainwashed son without hesitation.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "Evil Matriarch: Keep reading, and you'll learn all you need to know about Raymond's mom.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "much"
                ], 
                "role": "\"Colonel Bud Manstrong, listen to your mother!\". He's clearly somewhere in his forties, but his mother is very much controlling his life. Bonus points for the episode she appears in being a parody of The Manchurian Candidate, with the movie being mentioned by name.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [], 
                "role": "My Beloved Smother: Mrs. Iselin Serial Escalation.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "several", 
                    "notorious", 
                    "young", 
                    "tight"
                ], 
                "role": "Janet Leigh was dressed this way in several films, including Holiday Affair and The Manchurian Candidate. A biography of her Holiday Affair co-star Robert Mitchum revealed that Holiday Affair producer Howard Hughes, who was notorious for his obsession with breasts and his predatory habits with young starlets, forced Leigh to wear an absurdly tight sweater after she rejected his advances.", 
                "id": "SweaterGirl"
            }
        ]
    }, 
    "imdbid": "tt0368008", 
    "poster_url": "TheManchurianCandidate.jpg", 
    "similar": [
        {
            "shared": [
                "EvilMatriarch", 
                "MommasBoy", 
                "MyBelovedSmother"
            ], 
            "shared_count": 3, 
            "id": "TheLionInWinter", 
            "name": "The Lion in Winter", 
            "poster_url": "TheLionInWinter.jpg"
        }, 
        {
            "shared": [
                "EvilMatriarch", 
                "MommasBoy", 
                "MyBelovedSmother"
            ], 
            "shared_count": 3, 
            "id": "ThrowMommaFromTheTrain", 
            "name": "Throw Momma from the Train", 
            "poster_url": "ThrowMommaFromTheTrain.jpg"
        }, 
        {
            "shared": [
                "EvilMatriarch", 
                "MommasBoy", 
                "MyBelovedSmother"
            ], 
            "shared_count": 3, 
            "id": "Notorious", 
            "name": "Notorious", 
            "poster_url": "Notorious.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "MommasBoy", 
                "MyBelovedSmother"
            ], 
            "shared_count": 3, 
            "id": "JumpingTheBroom", 
            "name": "Jumping the Broom", 
            "poster_url": "JumpingTheBroom.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "EvilMatriarch", 
                "MommasBoy"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "TheManchurianCandidate", 
    "name": "The Manchurian Candidate"
}