{
    "plot": "Rose and Gregory, both Columbia University professors meet when Rose's sister answers Gregory's \"personals\" ad. Several times burned, the handsome-but-boring Gregory believes that sex has ruined his life, and has deliberately set out to find and marry a woman with absolutely no sex appeal. Greg thinks he's found what he's looking for in Rose, a plain, plump English Lit professor who can't compete with her gorgeous mother and sister. More out of mutual admiration and respect than love, Greg and Rose marry. Greg assumes that Rose understands that he is not interested in a sexual relationship. He's mistaken, and their marriage is nearly destroyed when Rose tries to consummate their relationship. While Gregory is out of the country on a lecture tour, Rose diets and exercises to transform herself into a sexy siren in a last-ditch attempt to save her marriage.", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1996", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "whole"
                ], 
                "role": "Beautiful All Along: The whole point of the movie.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "platonic", 
                    "several", 
                    "terrific", 
                    "necessary"
                ], 
                "role": "In The Mirror Has Two Faces, the frumpy plain Jane professor played by Barbra Streisand gets fed up with her husband's obliviousness to her (although they did agree to a strictly platonic marriage), and spends the several weeks that he's away dieting, hitting the gym, and going to the beauty salon. By the time he returns, she looks terrific and has the self-confidence necessary to dump him.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Old Maid: Rose", 
                "id": "OldMaid"
            }
        ]
    }, 
    "imdbid": "tt0117057", 
    "poster_url": "TheMirrorHasTwoFaces.jpg", 
    "similar": [
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "KuchKuchHotaHai", 
            "name": "Kuch Kuch Hota Hai", 
            "poster_url": "KuchKuchHotaHai.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "CaptainEO", 
            "name": "Captain EO", 
            "poster_url": "CaptainEO.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong"
            ], 
            "shared_count": 1, 
            "id": "HowToMarryAMillionaire", 
            "name": "How to Marry a Millionaire", 
            "poster_url": "HowToMarryAMillionaire.jpg"
        }
    ], 
    "id": "TheMirrorHasTwoFaces", 
    "name": "The Mirror Has Two Faces"
}