{
    "plot": "In the New Mexico desert, Police Sgt. Ben Peterson and his partner find a child wandering in the desert and sooner they discover that giant ants are attacking the locals. FBI agent Robert Graham teams up with Ben and with the support of Dr. Harold Medford and his daughter Dr. Patricia 'Pat' Medford, they destroy the colony of ants in the middle of the desert. Dr. Harold Medford explains that the atomic testing in 1945 developed the dangerous mutant ants. But they also discover that two queen ants have flown away to Los Angeles and they are starting a huge colony in the underground of the city. When a mother reports that her two children are missing, the team and the army have a lead to follow. Will they arrive in time to save the children and destroy the colony?", 
    "genres": "Horror, Sci-Fi", 
    "release_year": "1954", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Absent-Minded"
                ], 
                "role": "Absent-Minded Professor - Edmund Gwenn's character.", 
                "id": "AbsentMindedProfessor"
            }, 
            {
                "adjectives": [
                    "classic", 
                    "giant-mutant-ant"
                ], 
                "role": "Harold Medford in the classic giant-mutant-ant movie Them!", 
                "id": "AbsentMindedProfessor"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scientist - Joan Weldon as Pat Medford.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "giant-ant", 
                    "classic", 
                    "father-daughter", 
                    "first"
                ], 
                "role": "This type of character was a staple of the Attack Of The Killer Whatever \"B\" movies of the '50s. For example: Joan Weldon's character in the giant-ant classic Them!; the daughter half of a father-daughter entomologist team, the first we see of her is a pair of shapely legs emerging from an airplane hatch.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "first", 
                    "giant", 
                    "professional", 
                    "catatonic", 
                    "vial", 
                    "formic"
                ], 
                "role": "Screaming Woman - Used effectively (e.g. with restraint) for once. Pat Metford screams the first time she (and the audience) catch sight of a giant killer ant at close quarters, but is calm and professional the rest of the movie. And of course there's the catatonic girl who suddenly breaks into a Title Drop when she smells a vial of formic acid.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [
                    "classic", 
                    "Absent-Minded", 
                    "gorgeous", 
                    "earth", 
                    "atomic", 
                    "giant"
                ], 
                "role": "In the classic monster movie Them!, the dorky Absent-Minded Professor who is sent to help shows up with another entomologist too. An incredibly gorgeous brunette. His daughter. How on earth this could have happened is stranger than the idea that atomic bomb tests could have turned ants into giant monsters the size of a truck.", 
                "id": "TheUglyGuysHotDaughter"
            }
        ]
    }, 
    "imdbid": "tt0047573", 
    "poster_url": "Them.jpg", 
    "similar": [
        {
            "shared": [
                "ScreamingWoman", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "KingdomOfTheSpiders", 
            "name": "Kingdom of the Spiders", 
            "poster_url": "KingdomOfTheSpiders.jpg"
        }, 
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "BatmanMysteryOfTheBatwoman", 
            "name": "Batman: Mystery of the Batwoman", 
            "poster_url": "BatmanMysteryOfTheBatwoman.jpg"
        }, 
        {
            "shared": [
                "ScreamingWoman", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "Tarantula", 
            "name": "Tarantula", 
            "poster_url": "Tarantula.jpg"
        }, 
        {
            "shared": [
                "ScreamingWoman", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "LakePlacid", 
            "name": "Lake Placid", 
            "poster_url": "LakePlacid.jpg"
        }, 
        {
            "shared": [
                "TheUglyGuysHotDaughter", 
                "AbsentMindedProfessor"
            ], 
            "shared_count": 2, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }
    ], 
    "id": "Them", 
    "name": "Them!"
}