{
    "plot": "Ami is a typical college girl. She's bright, friendly, popular and athletic, with nothing to set her apart from other girls her age other than the fact that she is an orphan, left to care for her younger brother after her father committed suicide after being falsely accused of murder. But while there is tragedy in their past, the siblings' future looks good, except for one thing. Ami's brother has racked up a considerable debt to another boy at school, and that boy just happens to be the heir to a clan of vicious ninja-yakuza. Ami's brother can't pay, violence breaks out and in the course of trying to avenge her brother, Ami is captured by the clan. They torture her and hack her arm right off. Ami escapes, barely alive, and is taken in by the owners of a machine shop who build her a customized, bullet-spewing arm. From that point, the quest for revenge is on in earnest.", 
    "genres": "Comedy, Horror, Thriller", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "complete", 
                    "dangerous"
                ], 
                "role": "The Yakuza boss in The Machine Girl is a complete sponge to his wife. She's the more dangerous of the two by far; he doesn't even want to punish the title character for her supposed misdeeds.", 
                "id": "HenpeckedHusband"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Japanese", 
                    "adorable", 
                    "Japanese"
                ], 
                "role": "The Japanese revenge-porn movie The Machine Girl is built entirely on this trope; Ami, the title character, is an adorable Japanese schoolgirl with a comically oversized machine gun fitted over the stub of her severed left hand. Before the injury, she wielded a kama sickle.", 
                "id": "GirlWithPsychoWeapon"
            }, 
            {
                "adjectives": [], 
                "role": "Lovely Angels: Ami and Miki.", 
                "id": "LovelyAngels"
            }
        ]
    }, 
    "imdbid": "tt1050160", 
    "poster_url": "TheMachineGirl.jpg", 
    "similar": [
        {
            "shared": [
                "HenpeckedHusband"
            ], 
            "shared_count": 1, 
            "id": "WhosAfraidOfVirginiaWoolf", 
            "name": "Who's Afraid of Virginia Woolf?", 
            "poster_url": "WhosAfraidOfVirginiaWoolf.jpg"
        }, 
        {
            "shared": [
                "HenpeckedHusband"
            ], 
            "shared_count": 1, 
            "id": "SevenFacesOfDrLao", 
            "name": "7 Faces of Dr. Lao", 
            "poster_url": "SevenFacesOfDrLao.jpg"
        }, 
        {
            "shared": [
                "HenpeckedHusband"
            ], 
            "shared_count": 1, 
            "id": "RebelWithoutACause", 
            "name": "Rebel Without a Cause", 
            "poster_url": "RebelWithoutACause.jpg"
        }, 
        {
            "shared": [
                "HenpeckedHusband"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "HenpeckedHusband"
            ], 
            "shared_count": 1, 
            "id": "TheBestMan", 
            "name": "The Best Man", 
            "poster_url": "TheBestMan.jpg"
        }
    ], 
    "id": "TheMachineGirl", 
    "name": "The Machine Girl"
}