{
    "plot": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion.", 
    "genres": "Action, Sci-Fi", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Bald Black Leader Guy: Morpheus.", 
                "id": "BaldBlackLeaderGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Morpheus in The Matrix.\n Laurence Fishburne, again, in Event Horizon, this time as the captain of a spaceship.", 
                "id": "BaldBlackLeaderGuy"
            }, 
            {
                "adjectives": [
                    "pencil-thin"
                ], 
                "role": "Beard of Evil: Cypher and his pencil-thin goatee.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [], 
                "role": "The Matrix has Cipher's beard to couple with his bald.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "pencil-thin", 
                    "evil", 
                    "compelling", 
                    "facial", 
                    "full"
                ], 
                "role": "Beard of Evil: Cypher and his pencil-thin goatee. At the end of Reloaded, Neo and his evil counterpart are lying unconscious. How do we know that Bane is evil? Well aside from the fact that we saw him  get possessed by The Big Bad and the rumours that he sabotaged his teammates, the most compelling piece of evidence of his evil is probably the facial hair. Or the \"duh duh DUUUHH?!\" music that plays when the camera pans over to him. The Architect sports a natty full beard.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "first", 
                    "few", 
                    "other", 
                    "old", 
                    "dearly"
                ], 
                "role": "In the first Matrix movie, Agent Smith and a few other agents ambushed Morpheus's crew in an old building. The rest of the crew (except for the dearly departed Mouse) escape, but Morpheus was abducted. With him in his custody, Agent Smith attempted to interrogate him into giving them the codes to get into Zion's mainframe. Luckely, Neo and Trinity were on their way to rescue him.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [], 
                "role": "The Architect from The Matrix", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [
                    "stereotypical", 
                    "pretty-boy", 
                    "big"
                ], 
                "role": "Neo in The Matrix. The stereotypical pretty-boy taunt comes from Cypher, who mocks Neo's \"big pretty eyes\".", 
                "id": "PrettyBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "female", 
                    "iconic", 
                    "third", 
                    "Vasquez-esque"
                ], 
                "role": "Action Girl: Pretty much any female character of note, Trinity's opening sequence is one of the most iconic action girl moments in cinema. Others include Switch, Niobe, and by the end of the third film, Zee and her Vasquez-esque friend.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "The Matrix: Trinity", 
                "id": "ActionGirlFriend"
            }, 
            {
                "adjectives": [
                    "actual", 
                    "third"
                ], 
                "role": "In a nod to The Matrix, there's an actual hacker character known as Trinity in the third book. Unfortunately, he turns out to be a guy.", 
                "id": "Hackette"
            }, 
            {
                "adjectives": [], 
                "role": "The Matrix: \"Were you listening to me, Neo? Or were you looking at the woman in the red dress?\"", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [
                    "Due", 
                    "apparent", 
                    "fetishes/artistic", 
                    "goth-like"
                ], 
                "role": "Due to the apparent fetishes/artistic style of the directors, most every character from The Matrix dress in a goth-like manner, but none act the part.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [
                    "other", 
                    "black", 
                    "important", 
                    "other"
                ], 
                "role": "Averted with Switch in The Matrix. All of the other human characters dress in black inside the Matrix, but Switch doesn't play any particularly important role (other than her death).", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0133093", 
    "poster_url": "TheMatrix.jpg", 
    "similar": [
        {
            "shared": [
                "LadyInRed", 
                "DistressedDude", 
                "ActionGirl", 
                "WomanInWhite"
            ], 
            "shared_count": 4, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "BaldBlackLeaderGuy", 
                "LadyInRed", 
                "BeardOfEvil", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "GIJoeRetaliation", 
            "name": "G.I. Joe: Retaliation", 
            "poster_url": "GIJoeRetaliation.jpg"
        }, 
        {
            "shared": [
                "LadyInRed", 
                "DistressedDude", 
                "ActionGirl", 
                "WomanInWhite"
            ], 
            "shared_count": 4, 
            "id": "MirrorMirror", 
            "name": "Mirror, Mirror"
        }, 
        {
            "shared": [
                "DistressedDude", 
                "ActionGirl", 
                "WomanInWhite"
            ], 
            "shared_count": 3, 
            "id": "Fantaghiro", 
            "name": "Fantaghiro"
        }, 
        {
            "shared": [
                "PrettyBoy", 
                "ActionGirl", 
                "WomanInWhite"
            ], 
            "shared_count": 3, 
            "id": "TheLordOfTheRings", 
            "name": "The Lord of the Rings", 
            "poster_url": "TheLordOfTheRings.jpg"
        }
    ], 
    "id": "TheMatrix", 
    "name": "The Matrix"
}