{
    "plot": "Everyone thinks of it as a harmless lightning storm. When Dave Drayton notices a strange mist on the lake, he thinks nothing of it. When he, his son, Billy Drayton, and his neighbor Brent Norton travel to the supermarket, the unthinkable happens. On their way to the market, they see the army, firefighters, and the police heading toward the mist. When he sees this Brent mentions something about \"Project Arrowhead\", a secret military project that no one knows about. As they are shopping, they see three soldiers walk in, pick up a few things, then head toward the mist. All eighty of the store's shoppers have no clue what is going on until an old man runs in the market with a bloody nose and declares \"Something in the mist!\" He tells them to close the door. About five seconds after they close the door, the entire store shakes, as though it has been lifted several feet above the ground. When David is asked to check on the generator, he finds the loading dock door being pushed on by something outside. Then Dave hears a groan. He asks three people to come with him. When Norm the bag-boy volunteers to go out, he is dragged away by a creature with large squid-like tentacles that have mouths, teeth, and arms. After Dave and the other three fight off the tentacles, they warn everyone in the store what is out there. Upon hearing this, Mrs. Carmody exclaims that it is the End Time and that God is punishing them. People don't believe it, but finally Mrs. Carmody has almost everyone in the store on her side. Does 'Project Arrowhead' have anything to do with this? Will Dave Drayton, his son, and his friends make it out alive as they make a last stand against this destruction? Or will they be taken by the demon-like creatures of 'The Mist'?", 
    "genres": "Horror, Sci-Fi, Thriller", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Papa Wolf: David", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Cool Old Lady: Irene, the lady who beans Mrs. Carmody with a can and torches a spider monster.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "young", 
                    "possible", 
                    "due"
                ], 
                "role": "Mama Bear: Call her what you will, but the woman in the beginning who leaves the store alone proves she is one. Could you leave your young children alone without trying to get back to them? Oh and  she survives and rescues her kids. And though the movie doesn't go into it, it's possible that she survived due to leaving early when there may have been less creatures about.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "elderly", 
                    "facial", 
                    "old", 
                    "old"
                ], 
                "role": "Never Mess with Granny: Irene Reppler, the elderly school teacher (Frances Sternhagen), fries a FREAKING GIANT ACID-SPITTING SPIDER with a lighter and a can of bug-spray, all the while having a facial expression saying \"I'll show YOU!\" in that way that only old ladies can say. She also clocks Mrs. Carmody in the face with a can of peas and then said there was plenty more where that came from. King writes awesome old people.", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [
                    "old", 
                    "eponymous", 
                    "monstrous", 
                    "tough", 
                    "original"
                ], 
                "role": "The Mist has one of these, a little old schoolteacher who stops one of the crazy fundamentalist's rants by conking her on the head with a thrown can of peas (and asserting that there are plenty more where that came from), and not only goes along on the expedition out into the eponymous mist but kills one of the mist's monstrous bugs with a flamethrower improvised from a can of hair spray and a lighter. The character's pretty tough in the original Stephen King novella as well.", 
                "id": "NeverMessWithGranny"
            }
        ]
    }, 
    "imdbid": "tt0884328", 
    "poster_url": "TheMist.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "CoolOldLady", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "CoolOldLady", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "TheSecretOfNIMH", 
            "name": "The Secret of NIMH", 
            "poster_url": "TheSecretOfNIMH.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "CoolOldLady"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CoolOldLady", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "PokemonZoroarkMasterOfIllusions", 
            "name": "Pokémon: Zoroark: Master of Illusions"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }
    ], 
    "id": "TheMist", 
    "name": "The Mist"
}