{
    "plot": "Stanley Ipkiss is a bank clerk that is an incredibly nice man. Unfortunately, he is too nice for his own good and is a pushover when it comes to confrontations. After one of the worst days of his life, he finds a mask that depicts Loki, the Norse night god of mischief. Now, when he puts it on, he becomes his inner, self: a cartoony romantic wild man. However, a small time crime boss, Dorian Tyrel, comes across this character dubbed \"The Mask\" by the media. After Ipkiss's alter ego indirectly kills his friend in crime, Tyrel now wants this green-faced goon destroyed.", 
    "genres": "Comedy, Crime, Fantasy", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Casanova Wannabe Richard Jeni as Charlie. The Mask himself fits this trope when he gets carried away on his date with Tina.", 
                "id": "CasanovaWannabe"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "hot", 
                    "simple", 
                    "simple", 
                    "hot", 
                    "simple", 
                    "High", 
                    "hot", 
                    "simple", 
                    "red"
                ], 
                "role": "Blondes are Evil: Inverted. Usually in a story involving a guy, a hot lady (usually a blonde and a performer), and a simple girl, the guy gets the simple girl and optionally the hot lady betrays him beforehand. Here the guy is betrayed by the simple girl and gets the hot blonde lady. It should be noted that the blonde starts off using Stanley in order to help her mobster boyfriend rob the bank and goes through a High Heel-Face Turn. Discussed. Stanley's buddy keeps trying to steer him away from the hot blonde and towards the simple red head.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "bad", 
                    "evil", 
                    "own"
                ], 
                "role": "Subverted in The Mask. Tina starts the movie dating the bad guy and helping his plans, but is not evil on her own.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Tina", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Hello, Nurse!: Tina", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [
                    "full", 
                    "complete", 
                    "appropriate"
                ], 
                "role": "The Mask recreates the nightclub scene nearly in full, complete with Looney Tunes effects. This is appropriate, since it is a \"live-action cartoon\".", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [
                    "hot", 
                    "simple", 
                    "simple", 
                    "hot", 
                    "simple", 
                    "High"
                ], 
                "role": "Inverted. Usually in a story involving a guy, a hot lady (usually a blonde and a performer), and a simple girl, the guy gets the simple girl and optionally the hot lady betrays him beforehand. Here the guy is betrayed by the simple girl and gets the hot blonde lady. It should be noted that the blonde starts off using Stanley in order to help her mobster boyfriend rob the bank and goes through a High Heel-Face Turn.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scoop: Peggy Brandt", 
                "id": "HotScoop"
            }, 
            {
                "adjectives": [
                    "joint"
                ], 
                "role": "Early in The Mask, Tina shows up at the bank wearing a clingy red dress, distracting Stanley while innocently inquiring about opening an account and surreptitiously casing the joint.", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [], 
                "role": "The Chanteuse: Tina.", 
                "id": "TheChanteuse"
            }, 
            {
                "adjectives": [
                    "Distressed"
                ], 
                "role": "Tina in The Mask.  Although she's not a Femme Fatale, but a Distressed Damsel", 
                "id": "TheChanteuse"
            }
        ]
    }, 
    "imdbid": "tt0110475", 
    "poster_url": "TheMask.jpg", 
    "similar": [
        {
            "shared": [
                "TheChanteuse", 
                "DamselInDistress", 
                "LadyInRed", 
                "HelloNurse"
            ], 
            "shared_count": 4, 
            "id": "RedHotRidingHood", 
            "name": "Red Hot Riding Hood"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "BlondesAreEvil", 
                "HelloNurse", 
                "CasanovaWannabe"
            ], 
            "shared_count": 4, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "TheChanteuse", 
                "LadyInRed", 
                "HelloNurse"
            ], 
            "shared_count": 3, 
            "id": "WhoFramedRogerRabbit", 
            "name": "Who Framed Roger Rabbit", 
            "poster_url": "WhoFramedRogerRabbit.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "LadyInRed", 
                "HelloNurse"
            ], 
            "shared_count": 3, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "LadyInRed", 
                "HelloNurse"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }
    ], 
    "id": "TheMask", 
    "name": "The Mask"
}