{
    "plot": "While attending a medical conference in Paris, American physician Dr. Ben McKenna, his wife, retired musical theater actress and singer Jo McKenna née Conway, and their adolescent son Hank McKenna decide to take a side trip to among other places Marrekesh, French Morocco. With a knife plunged into his back, Frenchman Louis Bernard, who the family met earlier in their bus ride into Marrakesh and who is now masquerading as an Arab, approaches Ben, cryptically whispering into Ben's ears that there will be an attempted assassination in London of a statesman, this news whispered just before Bernard dies. Ben is reluctant to provide any information of this news to the authorities because concurrently Hank is kidnapped by British couple, Edward and Lucy Drayton, who also befriended the McKennas in Marrakesh and who probably have taken Hank out of the country back to England. Whoever the unknown people the Draytons are working for have threatened to kill Hank if Ben divulges any information told to him by Bernard. With what little information they have on hand, Ben and Jo head to London to try and thwart the assassination attempt and more importantly find an alive and safe Hank. Scotland Yard is aware of some pieces to the puzzle, including the fact that Bernard was a French secret service agent and that there will be an assassination attempt on someone. They and the McKennas will have to work together as they hit a diplomatic roadblock, one that may be overcome with a special Jo Conway song.", 
    "genres": "Mystery, Thriller", 
    "release_year": "1956", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Papa Wolf: Ben", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Mama Bear: Jo", 
                "id": "MamaBear"
            }
        ]
    }, 
    "imdbid": "tt0049470", 
    "poster_url": "TheManWhoKnewTooMuch.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "HomeAlone", 
            "name": "Home Alone", 
            "poster_url": "HomeAlone.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "WhiteFang", 
            "name": "White Fang", 
            "poster_url": "WhiteFang.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "ClassOf1984", 
            "name": "Class Of", 
            "poster_url": "ClassOf1984.jpg"
        }
    ], 
    "id": "TheManWhoKnewTooMuch", 
    "name": "The Man Who Knew Too Much"
}