{
    "plot": "In Jungle Village, the leader of the Lion's clan Gold Lion is summoned by the Governor and assigned to protect his gold that will be transported through the village. However he is betrayed and murdered by the greedy Silver Lion and Bronze Lion. Gold Lion's favorite son Zen Yi, a.k.a. The X-Blade, seeks revenge and heads to Jungle Village, but he is defeated by Brass Body and rescued by the local Blacksmith Thaddeus. Meanwhile the Gemini Female and the Gemini Male protect the Governor's gold, but they are vanquished by the army of Silver and Bronze Lion. The Blacksmith is abducted by the Lions and has his arms severed by Brass Body. However he is saved by the British Jack Knife, who is the emissary of the Emperor, and he manufactures iron arms for Thaddeus. Meanwhile the Governor sends the Jackal army to fight against the Lions and they hide the gold in the brothel of Madam Blossom. However, Madam Blossom and his girls form an army of black widows and together with Jack, Zen Yi and The Blacksmith, they fight against the Lions.", 
    "genres": "Action", 
    "release_year": "2012", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Dragon Lady: Madame Blossom.", 
                "id": "DragonLady"
            }
        ]
    }, 
    "imdbid": "tt1258972", 
    "poster_url": "TheManWithTheIronFists.jpg", 
    "similar": [
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "ThePunisher1989", 
            "name": "The Punisher ", 
            "poster_url": "ThePunisher1989.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "TheCrow", 
            "name": "The Crow", 
            "poster_url": "TheCrow.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "WildWildWest", 
            "name": "Wild Wild West", 
            "poster_url": "WildWildWest.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "IDrinkYourBlood", 
            "name": "I Drink Your Blood", 
            "poster_url": "IDrinkYourBlood.jpg"
        }
    ], 
    "id": "TheManWithTheIronFists", 
    "name": "The Man with the Iron Fists"
}