{
    "plot": "The Duchy of Grand Fenwick, the smallest country in the world, is nestled in the French Alps. Being as isolated as it is, its life is a throwback to olden days. It is a happy, peace-loving country. Its economy solely rests on export of its only wine, Pinot Grand Fenwick, to the US. When a California vintner starts producing and selling a knock-off of the Pinot Grand Fenwick at a lower price, the Grand Fenwick economy goes into a crisis situation, the country on the brink of bankruptcy. Three protests to the US go largely unanswered. Grand Fenwick's Prime Minister, Rupert of Mountjoy, believes the solution is to declare war on the US, and promptly lose the war in less than a day with no casualties on either side, after which the US, which it has historically done, will provide vast financial aide to rebuild the country. Grand Fenwick's monarch, the Grand Duchess Gloriana XII, ultimately supports this concept. The plan is to send an official declaration of war to the US, have a small army of approximately twenty sail from Marseilles to New York City, and the army immediately surrendering when they can't enter the US without visas anyway. Although seen as a hapless man, the person to lead the mission is Tully Bascombe, who inherited the roles of Grand Fenwick's head forest ranger, head field marshal and grand constable of the armed forces, which still uses longbows and arrows as their weapon. The Prime Minister and Duchess believe that even Tully cannot screw up losing the war. But things do not go according to plan, due largely to the US official receiving the declaration believing it to be a gag, and events happening in New York City the day the army arrives leading to the army having no one to surrender to. Things take a further turn when Tully believes that they can actually win the war by kidnapping Doctor Alfred Kokintz and his q-bomb - which is exponentially more deadly than the h-bomb - which he is developing for the US. This move by Tully leads to an all-out global crisis. In the process, they need to also kidnap Kokintz's daughter, Helen Kokintz, with who Tully falls in love, but who sees in Tully solely a criminal. Even the greatest diplomatic minds may not be able to figure a way out of this crisis, especially with Tully on the scene.", 
    "genres": "Comedy, Romance, War", 
    "release_year": "1959", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Helen Kokintz in The Mouse That Roared, except that her father is not mad.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Mad Scientist's Beautiful Daughter: Helen Kokintz, except that her father is not mad.", 
                "id": "MadScientistsBeautifulDaughter"
            }
        ]
    }, 
    "imdbid": "tt0053084", 
    "poster_url": "TheMouseThatRoared.jpg", 
    "similar": [
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "IslandOfLostSouls", 
            "name": "Island of Lost Souls", 
            "poster_url": "IslandOfLostSouls.jpg"
        }, 
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "TheKillerShrews", 
            "name": "The Killer Shrews", 
            "poster_url": "TheKillerShrews.jpg"
        }, 
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "TheMaskOfZorro", 
            "name": "The Mask of Zorro", 
            "poster_url": "TheMaskOfZorro.jpg"
        }, 
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "IronSky", 
            "name": "Iron Sky", 
            "poster_url": "IronSky.jpg"
        }, 
        {
            "shared": [
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 1, 
            "id": "YoungSherlockHolmes", 
            "name": "Young Sherlock Holmes", 
            "poster_url": "YoungSherlockHolmes.jpg"
        }
    ], 
    "id": "TheMouseThatRoared", 
    "name": "The Mouse That Roared"
}