{
    "plot": "Cooper, the deputy director of the CIA, wants to be the director. So, he tries to make it appear that the director is corrupt so that he will resign or be removed. The director appears before a committee and asks for some time to prepare his defense. The director goes home and asks his man Brown to join him. He then shows Brown that Cooper is bugging him. That's when he decides to turn the tables on Cooper by feeding him some false information. And that information is that there's a man, who might be able to clear him of the charges against him, will be arriving at the airport, so he tells Brown to meet him. The Director tells Brown to just pick someone who is arriving at the airport thus making Cooper believe that he is the man who can help the director. Brown picks Richard cause he is wearing mismatched shoes, one of them being red. So Cooper sets up surveillance on Richard and sends his femme fatale, Maddy to come on to him and find out what he knows. While Maddy is playing, Richard actually falls for her.", 
    "genres": "Comedy, Thriller", 
    "release_year": "1985", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Used", 
                    "close"
                ], 
                "role": "Femme Fatale: Used by the Deputy to get close to Drew  played arrow straight, up to and including Redemption By Sex", 
                "id": "FemmeFatale"
            }
        ]
    }, 
    "imdbid": "tt0089543", 
    "poster_url": "TheManWithOneRedShoe.jpg", 
    "similar": [
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "AssassinationOfAHighSchoolPresident", 
            "name": "Assassination Of A High School President", 
            "poster_url": "AssassinationOfAHighSchoolPresident.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "ISpitOnYourGrave", 
            "name": "I Spit on Your Grave", 
            "poster_url": "ISpitOnYourGrave.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }
    ], 
    "id": "TheManWithOneRedShoe", 
    "name": "The Man With One Red Shoe"
}