{
    "plot": "In New York, the money-driven dealer Dean Corso is a rare-books expert and partner of Bernie, who owns a bookstore. He is contacted by the renowned collector of books about the devil Boris Balkan, who has just acquired the rare The Nine Gates of the Kingdom of Shadows from the collector Andrew Telfer, to verify whether his book is authentic or a forgery. Balkan explains that the book was written by the writer Aristide Torchia, in 1666, with Lucifer and he was burned at the stake with his entire work. There are only three exemplars of The Nine Gates and in accordance with the legend, its nine engravings form a riddle to conjure the devil. The skeptical Corso accepts the assignment and has to flight to Sintra, Portugal, and Paris, France, to contact the owners Victor Fargas and Baroness Kessler and find the genuine exemplar for Balkan. Meanwhile, he asks Bernie to hide the rare book. Before traveling to Europe, the widow Liana Telfer wants to retrieve the book and has sex with Corso, but he does not accept her offer. When Corso goes Bernie's bookstore, he finds his friend murdered in the same position of an engraving. Corso travels to Toledo, Spain, to meet the Ceniza twin brothers and learn more about The Nine Gates. During his journey in Europe, Corso is pursued by Liana and her bodyguard, who belong to the sect The Order of the Silver Serpents, and is protected by a mysterious Girl with supernatural powers. Meanwhile, the owners of the two other exemplars of The Nine Gates are murdered. Corso becomes obsessed with the book and discloses the truth about it.", 
    "genres": "Mystery, Thriller", 
    "release_year": "1999", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "actual", 
                    "usual", 
                    "old", 
                    "wheelchair-bound", 
                    "sympathetic", 
                    "helpful"
                ], 
                "role": "Baroness Kessler from The Ninth Gate is the Klebb style to a T, even being an actual Baroness. Nicely subverted from the usual, however, in that the crabby, old, wheelchair-bound, Satanic lesbian is actually one of the most sympathetic and helpful characters in the film.", 
                "id": "TheBaroness"
            }
        ]
    }, 
    "imdbid": "tt0142688", 
    "poster_url": "TheNinthGate.jpg", 
    "similar": [
        {
            "shared": [
                "TheBaroness"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "TheBaroness"
            ], 
            "shared_count": 1, 
            "id": "CasinoRoyale1967", 
            "name": "Casino Royale ", 
            "poster_url": "CasinoRoyale1967.jpg"
        }, 
        {
            "shared": [
                "TheBaroness"
            ], 
            "shared_count": 1, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "TheBaroness"
            ], 
            "shared_count": 1, 
            "id": "XMen", 
            "name": "X-Men", 
            "poster_url": "XMen.jpg"
        }, 
        {
            "shared": [
                "TheBaroness"
            ], 
            "shared_count": 1, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }
    ], 
    "id": "TheNinthGate", 
    "name": "The Ninth Gate"
}