{
    "plot": "Jack Skellington, the pumpkin king of Halloween Town, is bored with doing the same thing every year for Halloween. One day he stumbles into Christmas Town, and is so taken with the idea of Christmas that he tries to get the resident bats, ghouls, and goblins of Halloween town to help him put on Christmas instead of Halloween -- but alas, they can't get it quite right.", 
    "genres": "Animation, Family, Fantasy", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Camp Straight: Jack. At the end of \"Making Christmas\", he even swings his hips.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [], 
                "role": "Jack Skellington of The Nightmare Before Christmas.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "black", 
                    "actual", 
                    "bad"
                ], 
                "role": "Scary Black Man: Oogie Boogie's voice actor is black, but as he is a sentient sack of insects, he himself has no actual race. This has drawn criticism from Richard Delgado and Jean Stefancic, who says that the usage of the heroes using \"whitespeak\" and the villain using \"blackspeak\" is racist profiling. Mild bad grammar is considered \"blackspeak\"?", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "immediate", 
                    "many"
                ], 
                "role": "The Nightmare Before Christmas: Jack Skellington, proving the immediate sex appeal of this trope. Seriously, how many skeletons do you know who are freaking Memetic Sex Gods?", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "game-based", 
                    "giant", 
                    "monolithic", 
                    "outright", 
                    "actual", 
                    "one-armed"
                ], 
                "role": "Writer and producer Tim Burton and director Henry Selick's The Nightmare Before Christmas has Oogie Boogie, who is shown to base his actions off the roll of a die when torturing his captives. He also has a couple of game-based traps in his dungeon: a giant spinning roulette platform, monolithic cards with swinging swords, and the base of spinning propeller blades resembles an 8-ball. Like The Joker, another rare example that manages to be outright evil - he even admits to being ready to cheat in his Villain Song.\n You forgot about the actual one-armed bandits. Complete with guns.", 
                "id": "TheGambler"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "artificial", 
                    "Overprotective"
                ], 
                "role": "Mad Scientist's Beautiful Daughter: In the \"artificial creation\" sense of \"daughter\", with an Overprotective Dad. Other theories are that he made her as a housemaid, or even with the intention of wooing her.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "artificial", 
                    "overprotective", 
                    "simple", 
                    "friendly", 
                    "friendly", 
                    "Finklestein/Sally", 
                    "next", 
                    "few", 
                    "beautiful"
                ], 
                "role": "The Nightmare Before Christmas:\n Dr. Finklestein and his beautiful artificial creation Sally. He's smotheringly overprotective, to the point that she has to poison him repeatedly to get a simple night out. Also, Finklestein is actually on friendly terms with Skellington — really, the person he antagonizes most is Sally.\n Interestingly, in an alternative ending,  Finklestein being on friendly terms with Jack is subverted with Finklestein being Oogie Boogie, in order to teach Sally about choosing Jack over him, making the Finklestein/Sally relationship seem more carnal. This, along with canonically the next person the Doc creates to replace Sally seems to be a wife (who looks exactly like him and even shares half his brain), has quite a few fans calling bullshit on the \"beautiful daughter\" explanation.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [
                    "visible", 
                    "few"
                ], 
                "role": "Mrs. Claus is briefly seen in the background at one point in The Nightmare Before Christmas. Even though she's visible for a few seconds at best, the animators still had to trim her ears out of fear that it looked like Santa had married an elf.", 
                "id": "MrsClaus"
            }, 
            {
                "adjectives": [], 
                "role": "Jack Skellington from The Nightmare Before Christmas — although he could also get pretty moody.\n \"... Why does nothing ever turn out like it should? Well, what the heck, I went and did my best. And by God, I really tasted something swell...\"", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [], 
                "role": "Perky Goth: Jack, if not most of the citizens of Halloween Town.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [
                    "domestic", 
                    "leaf-filled", 
                    "determined", 
                    "great", 
                    "free"
                ], 
                "role": "Sally from The Nightmare Before Christmas fits this trope pretty well. She has the modest, feminine personality and attire, and is domestic and sensible. She's a leaf-filled patchwork doll with stitches all over her body and puts deadly nightshade in her creator's food and drink to get out of the house, which gives her shades of being more determined and shows she has a great desire to be free.", 
                "id": "ProperLady"
            }
        ]
    }, 
    "imdbid": "tt0107688", 
    "poster_url": "TheNightmareBeforeChristmas.jpg", 
    "similar": [
        {
            "shared": [
                "SharpDressedMan", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "TheWiz", 
            "name": "The Wiz", 
            "poster_url": "TheWiz.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "PerkyGoth"
            ], 
            "shared_count": 2, 
            "id": "Wishmaster", 
            "name": "Wishmaster", 
            "poster_url": "Wishmaster.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "PulpFiction", 
            "name": "Pulp Fiction", 
            "poster_url": "PulpFiction.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "ScaryBlackMan"
            ], 
            "shared_count": 2, 
            "id": "The5000FingersOfDrT", 
            "name": "The 5,000 Fingers Of Dr. T", 
            "poster_url": "The5000FingersOfDrT.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "ProperLady"
            ], 
            "shared_count": 2, 
            "id": "TheGodfather", 
            "name": "The Godfather", 
            "poster_url": "TheGodfather.jpg"
        }
    ], 
    "id": "TheNightmareBeforeChristmas", 
    "name": "The Nightmare Before Christmas"
}