{
    "plot": "George and Nina seem like the perfect couple. They share a cozy Brooklyn apartment, a taste for tuna casserole dinners, and a devotion to ballroom dancing. They love each other. There's only one hitch: George is gay. And when Nina announces she's pregnant, things get especially complicated. Vince - Nina's overbearing boyfriend and the baby's father-wants marriage. Nina wants independence. George will do anything for a little unqualified affection, but is he ready to become an unwed surrogate dad?", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "effeminate"
                ], 
                "role": "Camp Gay: Averted. None of the gay characters are particularly effeminate.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [
                    "particular"
                ], 
                "role": "Straight Gay: No particular effeminate mannerisms from the gay characters. Though it doesn't prevent them from discussing their sexuality.", 
                "id": "StraightGay"
            }, 
            {
                "adjectives": [
                    "gorgeous", 
                    "fiancée", 
                    "same", 
                    "cute", 
                    "current", 
                    "next", 
                    "final", 
                    "able", 
                    "monogamous"
                ], 
                "role": "The Casanova: Dr. Frank Hanson (Steve Zahn) , George's younger brother, is seen with one gorgeous fiancée after another. With the implication that this is Frank's method of getting into their pants. Promising marriage but never going through with it. At some point, he is flirting with two women at the same time, just before introducing his newest fiancée. His reaction when he learns that the couple of Vince and Melissa Marx (Kali Rocha) broke up, is to ask whether Melissa is cute and available. With his current fiancée standing right next to him. One of the final scenes of the film features his wedding. Whether Frank is able to stay in a monogamous relationship is never adressed.", 
                "id": "TheCasanova"
            }
        ]
    }, 
    "imdbid": "tt0120772", 
    "poster_url": "TheObjectOfMyAffection.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "CampGay", 
                "StraightGay"
            ], 
            "shared_count": 3, 
            "id": "TheBrokenHeartsClubARomanticComedy", 
            "name": "The Broken Hearts Club: A Romantic Comedy"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "CampGay"
            ], 
            "shared_count": 2, 
            "id": "IVitelloni", 
            "name": "I Vitelloni", 
            "poster_url": "IVitelloni.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "TheBirdcage", 
            "name": "The Birdcage", 
            "poster_url": "TheBirdcage.jpg"
        }, 
        {
            "shared": [
                "CampGay", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "FourWeddingsAndAFuneral", 
            "name": "Four Weddings And A Funeral", 
            "poster_url": "FourWeddingsAndAFuneral.jpg"
        }
    ], 
    "id": "TheObjectOfMyAffection", 
    "name": "The Object of My Affection"
}