{
    "plot": "When Carla Tate, now a young woman, is 'graduated' out of the training school where she has resided for many years because she is mentally challenged, her hope is that she will be accepted for all that she can now do for herself. But Carla's family is wealthy which permits her mother, already blinded to her daughter's rather high-functioning abilities, to try and provide for Carla beyond her needs or desires, bringing forth the inevitable confrontations... for what Carla may lack in mental ability she certainly makes up for in her insistence on being independent, even to living in her own apartment. But if this isn't enough, into the mix comes a young man, equally challenged mentally, who moves Carla beyond anyone's control...", 
    "genres": "Comedy, Drama, Romance", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Overprotective", 
                    "Mom/My", 
                    "great", 
                    "other", 
                    "such"
                ], 
                "role": "Overprotective Mom/My Beloved Smother: Carla's mother, Elizabeth, goes to great lengths to protect her. However, Carla and other characters feel she's taking it too far. In attempts to bond with her, she pressures her into activities in which she has no interest (such as tennis). Meanwhile, she initially shoots down all Carla's efforts to gain more independence before ultimately giving in.", 
                "id": "OverprotectiveDad"
            }
        ]
    }, 
    "imdbid": "tt0123209", 
    "poster_url": "TheOtherSister.jpg", 
    "similar": [
        {
            "shared": [
                "OverprotectiveDad"
            ], 
            "shared_count": 1, 
            "id": "Coneheads", 
            "name": "Coneheads", 
            "poster_url": "Coneheads.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad"
            ], 
            "shared_count": 1, 
            "id": "Paul", 
            "name": "Paul", 
            "poster_url": "Paul.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad"
            ], 
            "shared_count": 1, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }, 
        {
            "shared": [
                "OverprotectiveDad"
            ], 
            "shared_count": 1, 
            "id": "LoveInTheAfternoon", 
            "name": "Love in the Afternoon", 
            "poster_url": "LoveInTheAfternoon.jpg"
        }
    ], 
    "id": "TheOtherSister", 
    "name": "The Other Sister"
}