{
    "plot": "Terry Hoitz's past mistakes in the line of duty and Allen Gamble's reluctance to take risks have landed them the roles of the \"Other Guys\", disgraced New York City police detectives relegated to filling out paperwork for cocky hero cops Danson and Highsmith. The mismatched duo must look past their differences when they take on a high-profile investigation of shady capitalist David Ershon and attempt to fill the shoes of the notoriously reckless officers they idolize.", 
    "genres": "Action, Comedy, Crime", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Gamble", 
                    "irresistible", 
                    "hot", 
                    "fair"
                ], 
                "role": "Chick Magnet: Gamble doesn't seem to notice that he's irresistible to hot women, something which utterly perplexes Hoitz. To be fair, there's always something wrong with those women.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "Other", 
                    "own", 
                    "hot"
                ], 
                "role": "Det. Gamble from The Other Guys - to the frustration of his partner: both for the trope's own sake and the fact that Gamble doesn't even notice how hot the women in his life actually are (He thinks his wife, played by Eva Mendes, is \"just okay.\")", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "Detective", 
                    "Gamble"
                ], 
                "role": "Kavorka Man: Detective Gamble.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "Other", 
                    "first", 
                    "sensitive", 
                    "cynical", 
                    "sensitive"
                ], 
                "role": "Played with in The Other Guys. At first it looks like Extreme Doormat Allen (Will Ferrell) is the sensitive one and cynical Terry who wants to be The Hero (Mark Wahlberg) is the manly one. But then again, Allen is the ladies man with anger management issues while Terry is the one who knows ballet and how to play the harp (which he insists he learned as a kid in order to make fun of the sensitive guys who actually liked that stuff).", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "Sensitive", 
                    "Gamble"
                ], 
                "role": "Sensitive Guy and Manly Man: Gamble and Hoitz, of course. Then gradually Deconstructed.", 
                "id": "SensitiveGuyAndManlyMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "'attractive", 
                    "'hot", 
                    "obvious"
                ], 
                "role": "Not merely 'attractive' but explictly 'hot' (ie. sexy) women; Terry's girlfriend is played by Lindsay Sloane who, though pretty, is more of an understated attractiveness than the obvious babes that seem to fall for Gamble.", 
                "id": "GirlNextDoor"
            }
        ]
    }, 
    "imdbid": "tt1386588", 
    "poster_url": "TheOtherGuys.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan", 
                "SensitiveGuyAndManlyMan", 
                "ChickMagnet"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "GirlNextDoor", 
                "ChickMagnet", 
                "KavorkaMan"
            ], 
            "shared_count": 3, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "ChickMagnet", 
                "KavorkaMan"
            ], 
            "shared_count": 2, 
            "id": "PootieTang", 
            "name": "Pootie Tang", 
            "poster_url": "PootieTang.jpg"
        }, 
        {
            "shared": [
                "ChickMagnet", 
                "SensitiveGuyAndManlyMan"
            ], 
            "shared_count": 2, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "ChickMagnet", 
                "KavorkaMan"
            ], 
            "shared_count": 2, 
            "id": "TheAdventuresOfIchabodAndMrToad", 
            "name": "The Adventures of Ichabod and Mr. Toad", 
            "poster_url": "TheAdventuresOfIchabodAndMrToad.jpg"
        }
    ], 
    "id": "TheOtherGuys", 
    "name": "The Other Guys"
}