{
    "plot": "The movie details a town split between the wealthy South Zone gang called 'The Socials' and the poor North Zone gang called 'The Greasers'. Dallas Winston, Ponyboy Curtis and Johnny Cade from 'The Greasers' befriend the rich Cherry Valance and Marcia at a drive-in. Later that night, a group of 'The Socs' chase and beat up Johnny and attempt to drown Ponyboy in a fountain. However, Johnny stabs one Soc and kills him, saving Ponyboy. The desperate boys seek Dallas who finds a hideout for them in a nearby town. One week later, Johnny and Ponyboy decide to return to their hometown, with Dallas, to claim the murder as self-defense. But on their way back, they see the church on fire and Ponyboy and Johnny help the children trapped in the church and become heroes. However Johnny is badly wounded and confined to the hospital. Meanwhile The Socs and The Greasers prepare to fight.", 
    "genres": "Crime, Drama", 
    "release_year": "1983", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Bishōnen"
                ], 
                "role": "Bishōnen: Sodapop.", 
                "id": "Bishonen"
            }, 
            {
                "adjectives": [], 
                "role": "Grease Monkey: Steve.", 
                "id": "GreaseMonkey"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice: Pretty much everyone in the film adaptation.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Darry, Sodapop, Dally, and even Johnny have shades of this, mostly towards Ponyboy.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "handsome", 
                    "attractive"
                ], 
                "role": "The Outsiders: Sodapop Curtis is described as being incredibly handsome and looking a lot like his attractive mother. Cue The Film of the Book, where he is he's played by Rob Lowe.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "hospital", 
                    "gratuitous"
                ], 
                "role": "Shirtless Scene: Dallas in the film; a nurse (played by Hinton herself) even comments he should be wearing a hospital gown, but he casually responds, \"I threw it away.\" Not to mention a gratuitous fanservice moment of Sodapop getting out of the shower and just barely getting a Modesty Towel on.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "entire"
                ], 
                "role": "Troubled, but Cute: The entire main cast.", 
                "id": "TroubledButCute"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "well-off", 
                    "violent", 
                    "kind", 
                    "other"
                ], 
                "role": "Cherry Valance in The Outsiders may be well-off and dating one of the most violent members of the heroes' enemy gang, but she is very kind to Ponyboy when they actually get a chance to talk without other loyalties getting in the way.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "high"
                ], 
                "role": "Spoiled Sweet: Cherry. She is a cheerleader at her high school, as well as being a Soc. But she is friendly to Ponyboy and Johnny and generally likes them as individuals.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0086066", 
    "poster_url": "TheOutsiders.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "ShirtlessScene", 
                "PrettyBoy", 
                "MrFanservice"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ShirtlessScene", 
                "PrettyBoy", 
                "MrFanservice"
            ], 
            "shared_count": 4, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "TroubledButCute", 
                "ShirtlessScene"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ShirtlessScene", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "TroubledButCute", 
                "PrettyBoy"
            ], 
            "shared_count": 3, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }
    ], 
    "id": "TheOutsiders", 
    "name": "The Outsiders"
}