{
    "plot": "A parody/homage to Gilbert and Sullivan's Pirates of Penzance, The Pirate Movie is a comedy/musical utilizing both new songs and parodies from the original, as well as references to popular films of the time, including Star Wars and Raiders of the Lost Ark. In your typical boy meets girl, boy loses girl, boy fights girl with swords plot, the story revolves around Mabel, the youngest of Maj. Gen. Stanley's many daughters, and Frederic, an ex-Pirate of Penzance. They fall in love and proceed to retrieve the Stanley's fortune from the Pirates (stolen 20 years ago). The Pirate King informs Frederic that due to him being born on Feb. 29th (during a leap year), Frederic is still technically the King's apprentice. Frederic must then decide between duty and honor, the only good qualities the King taught him, and true love.", 
    "genres": "Adventure, Comedy, Musical", 
    "release_year": "1982", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Spare", 
                    "Irish", 
                    "Irish", 
                    "high-pitched"
                ], 
                "role": "In The Pirate Movie, a comedy 1980s version of The Pirates of Penzance, the enemy Chinese pirate says/sings \"Spare me!\" and the Pirate King says, \"Ooh, an Irish Tenor, no less! We could use an Irish Tenor, lads!\" He accidentally stabs the man in the crotch and the guy goes \"yeeOOOWWW\" in a very high-pitched voice. \"Soprano! Even better.\"", 
                "id": "InstantSoprano"
            }
        ]
    }, 
    "imdbid": "tt0084504", 
    "similar": [
        {
            "shared": [
                "InstantSoprano"
            ], 
            "shared_count": 1, 
            "id": "TheIcePirates", 
            "name": "The Ice Pirates", 
            "poster_url": "TheIcePirates.jpg"
        }, 
        {
            "shared": [
                "InstantSoprano"
            ], 
            "shared_count": 1, 
            "id": "HomeAlone", 
            "name": "Home Alone", 
            "poster_url": "HomeAlone.jpg"
        }, 
        {
            "shared": [
                "InstantSoprano"
            ], 
            "shared_count": 1, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "InstantSoprano"
            ], 
            "shared_count": 1, 
            "id": "SummerRental", 
            "name": "Summer Rental", 
            "poster_url": "SummerRental.jpg"
        }, 
        {
            "shared": [
                "InstantSoprano"
            ], 
            "shared_count": 1, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }
    ], 
    "id": "ThePirateMovie", 
    "name": "The Pirate Movie"
}