{
    "plot": "The evil Trade Federation, led by Nute Gunray is planning to take over the peaceful world of Naboo. Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi are sent to confront the leaders. But not everything goes to plan. The two Jedi escape, and along with their new Gungan friend, Jar Jar Binks head to Naboo to warn Queen Amidala, but droids have already started to capture Naboo and the Queen is not safe there. Eventually, they land on Tatooine, where they become friends with a young boy known as Anakin Skywalker. Qui-Gon is curious about the boy, and sees a bright future for him. The group must now find a way of getting to Coruscant and to finally solve this trade dispute, but there is someone else hiding in the shadows. Are the Sith really extinct? Is the Queen really who she says she is? And what's so special about this young boy?", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "pod-racing", 
                    "afraid"
                ], 
                "role": "The Phantom Menace: Sebulba, Anakin's pod-racing rival; although the movie does not suggest it, one Expanded Universe source said that the reason he had it out so badly for Anakin was because secretly, he was afraid of him. If Anakin were to actually win a race, even accidentally, Sebulba would have been humiliated beyond belief (which is exactly what happened).", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "pathetic", 
                    "general", 
                    "'knight", 
                    "general", 
                    "much", 
                    "much", 
                    "inflexible"
                ], 
                "role": "Jedi Knight, Qui-Gon Jinn in The Phantom Menace will defy the council to to help supposed pathetic life forms.\n Jedi Knights in general are supposed to be this (the word 'knight' is in their name after all) but as noted in the trope description, this is an ideal that not every member always lives up to.\n Jedi in general are a mix between (highly idealized versions of) knights and samurai. However, how much \"knight\" and how much \"samurai\" actually varies between cultures. Corellian Jedi, according to The Essential Guide to Warfare and Star Wars: The Old Republic, are actually a lot closer to European knights than the mainline Jedi, being descended directly from those who swore oaths of fealty to a Jedi Lord during the darkest days of the New Sith Wars. They're noted for being very inflexible about the law and justice.", 
                "id": "KnightInShiningArmor"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "very"
                ], 
                "role": "Action Girl: Padmé. Her loyal handmaidens too, though we only see this towards the very end.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "tongue-in-cheek", 
                    "brilliant"
                ], 
                "role": "The Phantom Menace Darth Maul has an Estrogen Brigade. At least one \"Estrogen Brigade\" site for Darth Maul that was done mostly tongue-in-cheek, and it was brilliant.", 
                "id": "EstrogenBrigade"
            }, 
            {
                "adjectives": [
                    "later", 
                    "few", 
                    "much"
                ], 
                "role": "In the Star Wars Episode I: The Phantom Menace game, Padmé says she's been trained in self defence shortly before you are to fight through a gauntlet of Tusken Raiders, and proves to be useless, screaming for help and falling on all fours when struck. Strangely, you get to control Padmé as Queen Amidala later in the game and retake the city of Theed with only a few men by your side. The leap from Damsel in Distress to Action Girl was much needed.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Padme's handmaidens in The Phantom Menace serve as both attendants and decoys for her.", 
                "id": "LadyInWaiting"
            }, 
            {
                "adjectives": [
                    "straight", 
                    "adoptive", 
                    "tangential"
                ], 
                "role": "Averted in The Phantom Menace where Amidala is ruler of Naboo. By Revenge of the Sith it's played straight as she's given up the throne, and while still a Senator it's all about Anakin becoming Darth Vader, though there are three deleted scenes of her actively trying to stop the Chancellor from taking over.\n Similarly averted in A New Hope where Princess Leia is a Senator and member of the rebellion with no man by her side. Her (adoptive) father was a Senator before her and is the chief executive on their homeworld, but it's implied that any influence he had on her getting her position was tangential at best.", 
                "id": "NeverASelfMadeWoman"
            }
        ]
    }, 
    "imdbid": "tt0120915", 
    "similar": [
        {
            "shared": [
                "EstrogenBrigade", 
                "DirtyCoward", 
                "NeverASelfMadeWoman", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 4, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "EstrogenBrigade", 
                "ActionGirl", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "FauxActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "ResidentEvilDegeneration", 
            "name": "Resident Evil Degeneration"
        }, 
        {
            "shared": [
                "LadyInWaiting", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "EstrogenBrigade", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "Ben10", 
            "name": "Ben 10"
        }
    ], 
    "id": "ThePhantomMenace", 
    "name": "The Phantom Menace"
}