{
    "plot": "Diana, a young mom working at a shoe store meets two strippers, Tricks and Ronnie. They tell her that she should work at The Playa's Club for big money. The woman accepts and soon introduces her cousin into the club. Then she finds out that her cousin is doing housecalls which Tricks bribed her to do. One day Diana returns to her house after almost being raped by an obsessed fan and finds her cousin sleeping with her ex-boyfriend. She kicks her cousin out and starts dating Blue, a DJ at the club. They go out one night and Diana's cousin calls asking her to pick her up from a bachelor party. Diana refuses and soon after her cousin is raped. Now she has only one option, to put Tricks in her place.", 
    "genres": "Comedy, Drama", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Papa Wolf: We find out that Diana's father is one. After  Lance cheats on Diana, her father threatens Blue by saying that anything he does with his daughter on their date, he would do to Blue. The above threat is said while the two are at a shooting yard and the father shoots the target first in the head, then in the groin.", 
                "id": "PapaWolf"
            }
        ]
    }, 
    "imdbid": "tt0119905", 
    "poster_url": "ThePlayersClub.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "GodzillaVsDestoroyah", 
            "name": "Godzilla vs. Destoroyah"
        }, 
        {
            "shared": [
                "PapaWolf"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "ThePlayersClub", 
    "name": "The Players Club"
}