{
    "plot": "Hallie Parker and Annie James. They look exactly alike and are sisters. It would be awesome for you to be a twin, but what is it like being a twin without even knowing it? That's what it's like for these girls. Hallie is a cool, laid-back gal from California. Annie James is a proper rose from London. Annie has never met her father, and Hallie has never met her mother. When they get thrown into the Isolation Cabin, they uncover the mystery behind the ripped picture. They realize that they are twin sisters seperated at birth by their divorced parents, and they decide to switch places to meet the parent that they've never met. They also decide to get them back together. But then something awful happens that will wreck everything: their father is engaged to a beautiful, selfish witch who's only after their dad's money.", 
    "genres": "Adventure, Comedy, Drama", 
    "release_year": "1998", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Camp Straight: If Martin doesn't qualify, I don't know who does. (see Little Black Dress below)", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "all-leather", 
                    "ensemble", 
                    "European"
                ], 
                "role": "The Lindsay Lohan version of The Parent Trap: Martin gives fashion advice, dons an all-leather biker ensemble, wears a Speedo to the pool, and gets together with Chessie mid-film. Go figure. (The Speedo, at least, may be passed off as a European eccentricity.)", 
                "id": "CampStraight"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Lisa in Lottie and Lisa, on which The Parent Trap was based.", 
                "id": "DaddysGirl"
            }, 
            {
                "adjectives": [
                    "new"
                ], 
                "role": "Chessy in The Parent Trap (new version)", 
                "id": "KindlyHousekeeper"
            }, 
            {
                "adjectives": [], 
                "role": "Kindly Housekeeper: Chessy, when she finds out, wants to coddle Annie and tries to cook everything in the kitchen for her", 
                "id": "KindlyHousekeeper"
            }, 
            {
                "adjectives": [], 
                "role": "This is Susan's fate in The Parent Trap.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "accurate", 
                    "rich"
                ], 
                "role": "In The Parent Trap, Gold Digger Vicky, who intends to marry the girls' father for his money. It may be more accurate to call her an aspiring Rich Bitch, as she never actually qualifies for the rich part.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "Rich"
                ], 
                "role": "Rich Bitch: The fiance in both versions. She serves the role as Gold Digger and Child Hater.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "original", 
                    "high", 
                    "girly-girl", 
                    "tomboyish"
                ], 
                "role": "Tomboy and Girly Girl: Played straight in the original; Sharon is a girly girl, having been raised as a child of Boston high society; Susan is the tomboy. Inverted in the remake, in which Annie is mainly a girly-girl, although she manages to beat her tomboyish sister at fencing.", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt0120783", 
    "poster_url": "TheParentTrap.jpg", 
    "similar": [
        {
            "shared": [
                "DaddysGirl", 
                "MissingMom", 
                "CampStraight"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "TomBoyAndGirlyGirl", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "MissingMom", 
                "TomBoyAndGirlyGirl", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "Bandidas", 
            "name": "Bandidas", 
            "poster_url": "Bandidas.jpg"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "TomBoyAndGirlyGirl", 
                "RichBitch"
            ], 
            "shared_count": 3, 
            "id": "EverAfter", 
            "name": "Ever After"
        }, 
        {
            "shared": [
                "DaddysGirl", 
                "KindlyHousekeeper", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }
    ], 
    "id": "TheParentTrap", 
    "name": "The Parent Trap"
}