{
    "plot": "Mia Thermopolis is the average teenager - sweet, a little geeky and pretty much invisible to everyone with the exception of her mother, best friend Lilly and Lilly's older brother Michael. Making it through high school without throwing up is a challenge in itself for Mia, so it doesn't come as welcome news when her estranged grandmother shows up out of the blue and calmly informs her that she is in fact the heir to the throne of a European country called Genovia. Suddenly Mia's life is thrown into complete overload. She's being taught about scarves, waves and pears in order to become a perfect princess, she gets a makeover and a tough looking yet sweet bodyguard/limo driver called Joe. Things get out of hand when the media gets a hold of the story and suddenly Mia is thrust into the spotlight in both the newspapers and in school. On top of all that Mia has a choice to make. She must decide by Genovia's Independence Day Ball whether she longs to relinquish her claim on the throne or to become the princess and heir to the throne and father and grandmother want her to be.", 
    "genres": "Comedy, Family, Romance", 
    "release_year": "2001", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "unremarkable", 
                    "movie-star", 
                    "gorgeous", 
                    "other", 
                    "real"
                ], 
                "role": "In The Princess Diaries, Mia is seen as a dowdy and generally unremarkable person until Paolo gives her a makeover, at which point it's revealed that she's actually movie-star gorgeous (in a minor twist, though, the other characters still don't pay her any real respect, even after they find out that she's the princess of Genovia).", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [], 
                "role": "Blondes are Evil: Lana played by Mandy Moore.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "funny", 
                    "fit"
                ], 
                "role": "Mia in The Princess Diaries. Anne Hathaway was reportedly given the role after she slipped and fell off the chair during her audition. Funnily enough the part of the movie where Mia slips and falls off the bleachers was not scripted but was left in there because the director felt it was funny and still fit the character.", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [
                    "big"
                ], 
                "role": "Although not to the extent of the books (mentioned below), The Princess Diaries combats this trope a little. Mia discovers she is a princess at age 15 and hates the idea. Her friend Lily also lists reasons why she shouldn't choose to become one. A big plot of the movie is how frequently a princess is in the public eye - and Mia has one of her worst moments being caught by the paparazzi. Ultimately though she chooses to accept the job and her situation has improved by the sequel.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "clumsy"
                ], 
                "role": "Femininity Failure: There's the awkward Mia who takes princess lessons and gets a makeover to which her friend tells her that she sold out. She's still clumsy after the lessons.", 
                "id": "FemininityFailure"
            }, 
            {
                "adjectives": [
                    "clumsy"
                ], 
                "role": "The Princess Diaries has the awkward Mia who takes princess lessons and gets a makeover to which her friend tells her that she sold out. She's still clumsy after the lessons.", 
                "id": "FemininityFailure"
            }, 
            {
                "adjectives": [
                    "second", 
                    "funny", 
                    "panicked", 
                    "15-year-old"
                ], 
                "role": "The second comes at the beach. While getting hounded by the paparazzi isn't treated as funny, it's still played light-heartedly. When Lana and her Girl Posse expose her getting changed, any humour the scene may have had goes away with Mia's panicked \"go away, all of you!\" - and with the Fridge Horror that this is a 15-year-old girl the photographers are trying to get nude pictures of.", 
                "id": "GirlPosse"
            }, 
            {
                "adjectives": [
                    "intelligent"
                ], 
                "role": "Mia's grandmother in The Princess Diaries is on the more intelligent end of this trope.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "popular"
                ], 
                "role": "Mia from The Princess Diaries blew off her best friend's brother to go to a party with the most popular guy in school who would hopefully give her a foot popping kiss.", 
                "id": "NaiveEverygirl"
            }, 
            {
                "adjectives": [
                    "next"
                ], 
                "role": "The Cheerleader: Lana. Lily also invokes this trope by worrying that next week Mia \"could be waving pompoms in my face!\"", 
                "id": "TheCheerleader"
            }, 
            {
                "adjectives": [], 
                "role": "The Princess Diaries has Mia having to deal with the cheer leading captain and her followers.", 
                "id": "TheCheerleader"
            }
        ]
    }, 
    "imdbid": "tt0247638", 
    "poster_url": "ThePrincessDiaries.jpg", 
    "similar": [
        {
            "shared": [
                "TheCheerleader", 
                "BlondesAreEvil", 
                "GirlPosse"
            ], 
            "shared_count": 3, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "BeautifulAllAlong", 
                "EverythingsBetterWithPrincesses", 
                "BlondesAreEvil"
            ], 
            "shared_count": 3, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "CuteClumsyGirl", 
                "BlondesAreEvil", 
                "NaiveEverygirl"
            ], 
            "shared_count": 3, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "FemininityFailure"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "ThePrincessDiaries", 
    "name": "The Princess Diaries"
}