{
    "plot": "In 1886, in the Victorian London, the corrupt Lord Henry Wotton meets the pure Dorian Gray posing for talented painter Basil Hallward. Basil paints Dorian's portrait and gives the beautiful painting and an Egyptian sculpture of a cat to him while Henry corrupts his mind and soul telling that Dorian should seek pleasure in life. Dorian wishes that his portrait could age instead of him. Dorian goes to a side show in the Two Turtles in the poor neighborhood of London and he falls in love with the singer Sibyl Vane. Dorian decides to get married with her and tells to Lord Henry that convinces him to test the honor of Sibyl. Dorian Gray leaves Sibyl and travels abroad and when he returns to London, Lord Henry tells him that Sibyl committed suicide for love. Along the years, Dorian's friends age while he is still the same, but his picture discloses his evilness and corruptive life. Can he still have salvation or is his soul trapped in the doomed painting?", 
    "genres": "Drama, Fantasy, Horror", 
    "release_year": "1945", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Depraved Homosexual: Scandalously inverted.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "Dogged", 
                    "oblivious", 
                    "romantic"
                ], 
                "role": "Dogged Nice Guy: Basil. Good person, nice friend, but boring, Dorian seems merely bored by his advice and entirely oblivious to any romantic interest.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "Dorian"
                ], 
                "role": "Pretty Boy: Dorian Gray. Lampshaded to hell and back.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "likely", 
                    "first", 
                    "naive", 
                    "several"
                ], 
                "role": "Given how soon it was written after the term originated, The Picture of Dorian Gray is likely one of the first subversions. Dorian is called this by extremely naive actress Sybil who he seduces and abandons, driving to suicide. Another lover also apparently called him this, and uses the nickname scornfully when he encounters her several years later as a prostitute.", 
                "id": "PrinceCharming"
            }, 
            {
                "adjectives": [
                    "exact", 
                    "first"
                ], 
                "role": "Prince Charming: Trope Namer in that this is the earliest known use of this exact term, but a deconstruction of the trope itself. While characters of this type existed before the novel, Dorian is the first referred to as \"Prince Charming\" verbatim, making this a Dead Unicorn Trope or Unbuilt Trope.", 
                "id": "PrinceCharming"
            }, 
            {
                "adjectives": [], 
                "role": "Princely Young Man", 
                "id": "PrincelyYoungMan"
            }, 
            {
                "adjectives": [
                    "formal"
                ], 
                "role": "Straight Gay: Basil doesn't like formal dressing.", 
                "id": "StraightGay"
            }, 
            {
                "adjectives": [], 
                "role": "The Charmer: Henry for Dorian.", 
                "id": "TheCharmer"
            }, 
            {
                "adjectives": [
                    "Dorian", 
                    "classic"
                ], 
                "role": "Dorian Gray and Lord Henry Wotton are classic examples. Unsurprisingly, they were created by Master Dandy, Oscar Wilde.", 
                "id": "TheDandy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "song", 
                    "Little"
                ], 
                "role": "Broken Bird: Sybil in the 1945 film—she even sings a song about it, \"Little Yellow Bird\".", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "ill"
                ], 
                "role": "Fragile Flower: Basil is not hard to make physically ill from pain, embarrassment or passion.", 
                "id": "FragileFlower"
            }, 
            {
                "adjectives": [], 
                "role": "Grande Dame: Pretty much every woman in the book besides Sybil and her mother fall into this category.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "whole"
                ], 
                "role": "Pretty much the whole female cast of The Picture of Dorian Gray, besides Sybil Vane and her mother, is portrayed in this way.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "Dorian"
                ], 
                "role": "The Cutie: Dorian's description by Henry why he was made to be worshiped.", 
                "id": "TheCutie"
            }, 
            {
                "adjectives": [
                    "poor"
                ], 
                "role": "The Ingenue: Poor, poor Sybil Vane.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [
                    "Dorian", 
                    "beautiful"
                ], 
                "role": "Subverted (after a fashion) in The Picture of Dorian Gray: Dorian himself is the muse for the painter Basil Hallward, which at once turns the concept of a muse on its head (he's a man!) and doesn't (Basil is gay, and Dorian is beautiful and ravenously bi).", 
                "id": "TheMuse"
            }, 
            {
                "adjectives": [
                    "Dorian"
                ], 
                "role": "The Muse: Dorian for Basil, naturally.", 
                "id": "TheMuse"
            }, 
            {
                "adjectives": [
                    "Dorian", 
                    "male"
                ], 
                "role": "The Vamp: Dorian is a male example.", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [], 
                "role": "Unrequited Tragic Maiden: Sybil becomes.", 
                "id": "UnrequitedTragicMaiden"
            }, 
            {
                "adjectives": [
                    "Dorian", 
                    "male", 
                    "young", 
                    "bad", 
                    "young"
                ], 
                "role": "Dorian from The Picture of Dorian Gray is pretty much the male poster for the trope, having expressed the desire to never age or show any flaws so he could stay young and be loved by everyone. His portrait became uglier and older every time he did something bad, while Dorian remained young and handsome.", 
                "id": "VainSorceress"
            }, 
            {
                "adjectives": [
                    "Dorian", 
                    "male"
                ], 
                "role": "Vain Sorceress: It could be argued Dorian is a male one.", 
                "id": "VainSorceress"
            }
        ]
    }, 
    "imdbid": "tt0037988", 
    "poster_url": "ThePictureOfDorianGray.jpg", 
    "similar": [
        {
            "shared": [
                "UnrequitedTragicMaiden", 
                "TheIngenue", 
                "PrettyBoy", 
                "BrokenBird", 
                "TheDandy"
            ], 
            "shared_count": 5, 
            "id": "LesMiserables", 
            "name": "Les Misérables"
        }, 
        {
            "shared": [
                "GrandeDame", 
                "TheDandy", 
                "TheIngenue", 
                "PrincelyYoungMan", 
                "TheCharmer"
            ], 
            "shared_count": 5, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "StraightGay", 
                "GrandeDame", 
                "DoggedNiceGuy", 
                "FragileFlower"
            ], 
            "shared_count": 4, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "TheIngenue", 
                "FragileFlower", 
                "TheVamp"
            ], 
            "shared_count": 4, 
            "id": "BlackSwan", 
            "name": "Black Swan", 
            "poster_url": "BlackSwan.jpg"
        }, 
        {
            "shared": [
                "TheIngenue", 
                "BrokenBird", 
                "TheCharmer"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }
    ], 
    "id": "ThePictureOfDorianGray", 
    "name": "The Picture of Dorian Gray"
}