{
    "plot": "A kindly grandfather sits down with his ill grandson and reads him a story. The story is one that has been passed down from father to son for generations. As the grandfather reads the story, the action comes alive. The story is a classic tale of love and adventure as the beautiful Buttercup, engaged to the odious Prince Humperdinck, is kidnapped and held against her will in order to start a war, It is up to Westley (her childhood beau, now returned as the Dread Pirate Roberts) to save her. On the way he meets a thief and his hired helpers, an accomplished swordsman and a huge, super strong giant, both of whom become Westley's companions in his quest.", 
    "genres": "Adventure, Comedy, Family", 
    "release_year": "1987", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Flat", 
                    "lampshaded", 
                    "first", 
                    "second", 
                    "evil"
                ], 
                "role": "Flat out lampshaded in the GM's notes for the campaign that took place in between the first and second movie (based on The Princess Bride). In his notes on Count Rugen, he notes \"Has a goatee! Should be fun when others don't believe Jim that he's evil.\"", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "live", 
                    "top", 
                    "Cold-Blooded"
                ], 
                "role": "The Princess Bride:\n Prince Humperdink. So much that, at the end of the movie, Westley says that simply letting him live the rest of his life as a coward is enough of a punishment.\n Count Rugen as well. When Inigo Montoya finally confronts him, Rugen raises his sword as if to fight, then turns and sprints away. (And then, on top of it, ambushes Indigo when he finally does catch up to him. But what do you expect from a guy whose idea of a \"hobby\" was Cold-Blooded Torture?)\n Also, Yellin, Humperdink's Captain of the Guard, given how he reacts after his men flee:", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "young", 
                    "six-fingered", 
                    "special", 
                    "long", 
                    "original", 
                    "young", 
                    "six-fingered", 
                    "last", 
                    "six-fingered", 
                    "much", 
                    "sick", 
                    "dad"
                ], 
                "role": "In The Princess Bride the story is that when Inigo was very young, his father, Domingo Montoya was commissioned by the six-fingered man Count Rugen to make a special sword. For a very long time Domingo worked on the sword, and it was his magnum opus. The six-fingered man offered a tenth of the original asking price, so Domingo refused to sell the sword. The six-fingered man killed Domingo, and young Inigo immediately took up the sword and challenged the six-fingered man to a duel. He spared Inigo's life, but gave him a pair of awesome scars on his cheeks. When we meet Inigo, he's been training for the last twenty years to best the six-fingered man, working with Vizzini to pay the bills. \"There's not much money in revenge.\"\n Also in Princess Bride, there is the framing device of the grandfather reading the story to his grandson. Grandpa says, \"This is the book my father used to read to me when I was sick and I used to read it to your father. And today, I'm going to read it to you.\" It's not mentioned why dad isn't around to read the book to the son himself, although he might just be at work.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [], 
                "role": "Miracle Max in The Princess Bride.", 
                "id": "GrumpyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Henpecked Husband: Miracle Max, to an extent.", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [
                    "main", 
                    "real"
                ], 
                "role": "Prince Charmless: Humperdinck is the main villain and a real asshole.", 
                "id": "PrinceCharmless"
            }, 
            {
                "adjectives": [
                    "real"
                ], 
                "role": "Fezzik in The Princess Bride, played by real life example André the Giant. Fezzik mentions that he doesn't bother exercising. Andre himself did not go out of his way to exercise, feeling no need to be stronger than he already was.", 
                "id": "StoutStrength"
            }, 
            {
                "adjectives": [], 
                "role": "The Evil Prince", 
                "id": "TheEvilPrince"
            }, 
            {
                "adjectives": [], 
                "role": "The Good King: Unfortunately one so doddery that The Evil Prince is reigning for him.", 
                "id": "TheGoodKing"
            }, 
            {
                "adjectives": [
                    "André"
                ], 
                "role": "Fezzik, from The Princess Bride, played by André the Giant.", 
                "id": "WorldsStrongestMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "same", 
                    "responsible"
                ], 
                "role": "Damsel in Distress: Buttercup on two occasions at the beginning and end of the film. The same person is responsible both times.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses: Buttercup actually gets promoted to princess, because she was born a commoner but Humperdinck wants to marry her.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "Queen/Defrosting", 
                    "other", 
                    "cold", 
                    "love"
                ], 
                "role": "Ice Queen/Defrosting Ice Queen: Buttercup goes from one to the other and back again throughout the story. She starts out cold, then defrosts when she realizes she's in love with Westley, then freezes up again after he's murdered by pirates, then defrosts again when he shows up.", 
                "id": "IceQueen"
            }, 
            {
                "adjectives": [], 
                "role": "Mistress and Servant Boy: Buttercup and Westley were originally this type of couple.", 
                "id": "MistressAndServantBoy"
            }, 
            {
                "adjectives": [], 
                "role": "The Princess Bride:", 
                "id": "MistressAndServantBoy"
            }, 
            {
                "adjectives": [
                    "other", 
                    "useful", 
                    "save", 
                    "Deconstructive", 
                    "intentional"
                ], 
                "role": "In The Princess Bride, Buttercup is almost laughably useless in Westley's fight against the Rodent of Unusual Size — she does actually try to fend off the ROUS with a stick, but fails utterly. She's not much better at most other points in the story either, and the one time she does something reasonably useful (\"Do you promise not to hurt him?\") everyone yells at her for it.\n When she attempts to fend off the ROUS, it's only when it comes after her. Prior to that, when it was gnawing Westley's arm to bloody shreds, she just stood there and watched. Not only that, by having to come save her, he loses his opportunity to get his hands on his sword. Considering the book and movies are Deconstructive Parodies of fairy tales, this may have been intentional.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [
                    "next"
                ], 
                "role": "Neutral Female: Buttercup never lifts a finger to help Westley's fight, not even when he's about to be eaten by a ROUS and his sword is lying right next to her.", 
                "id": "NeutralFemale"
            }
        ]
    }, 
    "imdbid": "tt0093779", 
    "poster_url": "ThePrincessBride.png", 
    "similar": [
        {
            "shared": [
                "TheEvilPrince", 
                "DirtyCoward", 
                "NeutralFemale", 
                "StoutStrength", 
                "DamselInDistress", 
                "TheGoodKing"
            ], 
            "shared_count": 6, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "PrinceCharmless", 
                "TheEvilPrince", 
                "EverythingsBetterWithPrincesses", 
                "DamselInDistress", 
                "IceQueen"
            ], 
            "shared_count": 5, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "PrinceCharmless", 
                "TheGoodKing", 
                "EverythingsBetterWithPrincesses", 
                "BeardOfEvil", 
                "DirtyCoward"
            ], 
            "shared_count": 5, 
            "id": "Aladdin", 
            "name": "Aladdin", 
            "poster_url": "Aladdin.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "BeardOfEvil", 
                "TheGoodKing", 
                "TheEvilPrince"
            ], 
            "shared_count": 4, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "PrinceCharmless", 
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }
    ], 
    "id": "ThePrincessBride", 
    "name": "The Princess Bride"
}