{
    "plot": "This love story has Kitty meeting young, intelligent, shy and somewhat dull Dr. Walter Fane, whose forte is the study of infectious diseases, and the convenient marriage that she finds herself committed to. It is in this web of intrigue that they head for China, only after Walter discovers Kitty's infidelity with one dashing and witty diplomat Charlie Townsend. So much as to hide her from herself and to help thwart a cholera outbreak, this is a marriage more than on the rocks. This is a cold, indifferent and loveless partnership in a vast unknown and deadly environment that will test both these flightless lovebirds and with the hardships and tolerances more than any had ever anticipated. A visual delight amid the pain and suffering of a dying people and failing marriage. Will a cure be found for both, before it's too late?", 
    "genres": "Drama, Romance", 
    "release_year": "2006", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "The Casanova: Charlie is implied to have had a number of affairs, Kitty merely being his latest conquest.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "drive"
                ], 
                "role": "Old Maid: Kitty's fear that this and years more of living with her mother will be her fate drive her to marry Walter.", 
                "id": "OldMaid"
            }
        ]
    }, 
    "imdbid": "tt0446755", 
    "poster_url": "ThePaintedVeil.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "OldMaid"
            ], 
            "shared_count": 2, 
            "id": "SexAndTheCity", 
            "name": "Sex and the City", 
            "poster_url": "SexAndTheCity.jpg"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "TheGreatBeauty", 
            "name": "The Great Beauty", 
            "poster_url": "TheGreatBeauty.jpg"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "KamenRider", 
            "name": "Kamen Rider"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "TheCommitments", 
            "name": "The Commitments", 
            "poster_url": "TheCommitments.jpg"
        }
    ], 
    "id": "ThePaintedVeil", 
    "name": "The Painted Veil"
}