{
    "plot": "Ellen, an unknown female gunslinger rides into a small, dingy and depressing prairie town with a secret as to her reason for showing up. Shortly after her arrival, a local preacher, Cort, is thrown through the saloon doors while townfolk are signing up for a gun competition. The pot is a huge sum of money and the only rule: that you follow the rules of the man that set up the contest, Herod. Herod is also the owner, leader, and \"ruler\" of the town. Seems he's arranged this little gun-show-off so that the preacher (who use to be an outlaw and rode with Herod) will have to fight again. Cort refuses to ever use a gun to kill again and Herod, acknowledging Cort as one of the best, is determined to alter this line of thinking ... even if it gets someone killed ...", 
    "genres": "Action, Thriller, Western", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "own"
                ], 
                "role": "A Lady on Each Arm: Virgil Sparks (the Pride of Texas) makes his introduction this way. The Kid has his own groupies too.", 
                "id": "ALadyOnEachArm"
            }, 
            {
                "adjectives": [], 
                "role": "Corrupt Hick: Herod", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [
                    "nigh", 
                    "unbeatable", 
                    "straight"
                ], 
                "role": "Herod of The Quick and the Dead. Also an example of Asskicking Equals Authority, since Herod is nigh unbeatable in a straight up fight  and is only blindsided and killed by someone who he thought was already dead.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [], 
                "role": "Gentleman Adventurer: Sergeant Cantrell claims to be one.", 
                "id": "GENTLEMANADVENTURER"
            }, 
            {
                "adjectives": [
                    "due", 
                    "fatal", 
                    "true"
                ], 
                "role": "Miles Gloriosus: Ace Hanlon is a moderately skilled gunslinger who specialises in trick shots. Despite his constant boasting, he doesn't run from a fight. However this is due to his fatal mistake of thinking he won't encounter a gunfighter who is quicker on the draw than him. Nor does he expect to run into the man who really killed the Terrence brothers, for which Ace has been taking credit for. He quickly gets Feet of Clay when confronted by a true ace.", 
                "id": "MilesGloriosus"
            }, 
            {
                "adjectives": [
                    "willing"
                ], 
                "role": "Papa Bear: Averted; after Eugene Dred rapes his daughter, the saloon keeper reaches for Dred's gunbelt which is slung over his shoulder, a pistol in tempting reach. Dred waits...but the man just turns and staggers off. Fortunately Lady is a more than willing Mama Bear.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [], 
                "role": "Sexy Priest: Cort.", 
                "id": "SexyPriest"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "The Dandy: Hanlon; subverted when after he dies, the other contestants strip his corpse of all his fine clothes.", 
                "id": "TheDandy"
            }, 
            {
                "adjectives": [
                    "pompous"
                ], 
                "role": "Ace, one of the gunfighters in the Quickdraw Tournament in The Quick and the Dead, is this, mixing card motifs, gun tricks, and lots of pompous boasting.", 
                "id": "TheGambler"
            }, 
            {
                "adjectives": [], 
                "role": "The Gambler: Ace", 
                "id": "TheGambler"
            }, 
            {
                "adjectives": [], 
                "role": "Fee \"The Kid\" Herrod in The Quick and the Dead", 
                "id": "YoungGun"
            }, 
            {
                "adjectives": [], 
                "role": "Young Gun: The Kid.", 
                "id": "YoungGun"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Lady.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "only"
                ], 
                "role": "The Quick And The Dead has the Lady, who is commonly remarked upon as she's the only woman in the gunfighting tournament.", 
                "id": "GirlsWithGuns"
            }, 
            {
                "adjectives": [
                    "true", 
                    "able"
                ], 
                "role": "Ms. Fanservice: It wouldn't be a true Sharon Stone vehicle without being able to see her breasts (twice if you included the deleted sex scene).", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "much", 
                    "other"
                ], 
                "role": "Statuesque Stunner: Lady is much taller than the other women, and doesn't even wear heels.", 
                "id": "StatuesqueStunner"
            }
        ]
    }, 
    "imdbid": "tt0114214", 
    "poster_url": "TheQuickAndTheDead.jpg", 
    "similar": [
        {
            "shared": [
                "StatuesqueStunner", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "Sharknado", 
            "name": "Sharknado"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "CorruptHick", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "GirlsWithGuns", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "Battleship", 
            "name": "Battleship", 
            "poster_url": "Battleship.jpg"
        }
    ], 
    "id": "TheQuickAndTheDead", 
    "name": "The Quick and the Dead"
}