{
    "plot": "1920s. Vietnam under colonial French ruling. Anti-French rebellions emerge all over the country to disrupt the foreign occupiers. In respond, the colonialist employed units of Vietnamese agents to track and destroy these rebels. The film follows the journey of LE VAN CUONG, a French cultured undercover elite. Although branded with a perfect track record, Cuong's inner conscience is troubled by the sea of Vietnamese blood he had spilled to uphold a French washed ideal. Following an assassination of a high ranking French, Cuong is assigned to seek and kill the notorious leader of the resistance. Cuong encounters VO THANH THUY, a relentless revolutionary fighter and the daughter of the rebel leader. Cuong's superior intends for him to use Thuy as a mean to get to her father but Cuong soon has feelings for her. Thuy's patriotism ignites conflicts between Cuong's consciousness and his cultured faith. Will Cuong discover his inner-self and find love or will he continue his mission? The journey unfolds...", 
    "genres": "Action, Drama, Romance", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "irresitable", 
                    "local"
                ], 
                "role": "Kavorka Man: Hancock himself. For some reason, once transplanted to Paris, he becomes irresitable to women; at one point the wife of a local gangster threatens to shoot herself over him after only knowing him for a couple of hours.", 
                "id": "KavorkaMan"
            }
        ]
    }, 
    "imdbid": "tt0782154", 
    "poster_url": "TheRebel.jpg", 
    "similar": [
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "TheCommitments", 
            "name": "The Commitments", 
            "poster_url": "TheCommitments.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan"
            ], 
            "shared_count": 1, 
            "id": "Popeye", 
            "name": "Popeye", 
            "poster_url": "Popeye.jpg"
        }
    ], 
    "id": "TheRebel", 
    "name": "The Rebel"
}