{
    "plot": "Stanley Goodspeed, who lives in Washington D.C., is a biochemist who works for the FBI. Soon after his fiancée Carla Pestalozzi announces that she is pregnant, Stanley gets a call from FBI director James Womack. Womack tells Stanley that San Francisco's Alcatraz Island has been taken hostage, along with 81 tourists, by marine General Francis Xavier Hummel who, for years, has been protesting the government's refusal to pay benefits to families of war veterans who died during covert military operations. The death of his wife Barbara Hummel on March 9, 1995 drove General Hummel over the edge, and now he's holding hostages in order to get his point across. Stanley is needed because General Hummel has stolen some VX gas warheads and has announced that he will launch them onto San Francisco unless his demands are met. Stanley knows how to disarm the bombs, but Stanley needs someone who knows Alcatraz well enough to get him inside. That man is former British intelligence agent John Patrick Mason, who has been in prison for the past 30 years without a trial because he was accused of stealing the private files of J. Edgar Hoover. In 1962, John became the only inmate ever to escape from Alcatraz, and he stayed out of Alcatraz long enough to father a daughter named Jade Angelou. Despite his extreme hatred of the FBI, John agrees to help Stanley. When John and Stanley are sent into Alcatraz with a Navy SEAL team, General Hummel's men kill the entire SEAL team, leaving Stanley and John to work on their own to rescue the hostages.", 
    "genres": "Action, Adventure, Thriller", 
    "release_year": "1996", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "notable", 
                    "knowlegeable", 
                    "hostage/terrorist"
                ], 
                "role": "In The Rock, the \"being torn up about sacrifices\" part leads Brigadier General Francis Hummel into the villainy. It's notable how everyone even remotely knowlegeable still talk all respect about him even after he initiates a hostage/terrorist plot. Which he intended to be just a bluff.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Badass Grandpa: John Mason, ex-SAS man and one of the few to escape the Rock.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [], 
                "role": "Camp Gay: The hairstylist.", 
                "id": "CampGay"
            }, 
            {
                "adjectives": [], 
                "role": "Mason mentioning Alcibiades, Sir Walter Raleigh and Solzhenitsyn shows he is a Cultured Badass.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "knife-wielding"
                ], 
                "role": "Scary Black Man: The knife-wielding Captain Darrow (played by Tony Todd which makes him more frightening).", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Goodspeed and Mason in The Rock.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "Sensitive"
                ], 
                "role": "Sensitive Guy and Manly Man: Goodspeed and Mason.", 
                "id": "SensitiveGuyAndManlyMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "much"
                ], 
                "role": "Damsel in Distress: Averted for Stanley's fiance and Mason's daughter. Although they are in danger from the rockets, this trope is otherwise avoided for them. Heck, one of the hostages isn't even a damsel as much as a Sassy Black Woman.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "Girlish"
                ], 
                "role": "Girlish Pigtails: Carla put them on once, since it seems Stanley has a thing for them.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [], 
                "role": "The Rock (1996). The wife of the FBI agent (played by Nicolas Cage) wore these while having sex with him.", 
                "id": "GirlishPigtails"
            }, 
            {
                "adjectives": [
                    "much"
                ], 
                "role": "Heck, one of the hostages isn't even a damsel as much as a Sassy Black Woman.", 
                "id": "SassyBlackWoman"
            }
        ]
    }, 
    "imdbid": "tt0117500", 
    "poster_url": "TheRock.jpg", 
    "similar": [
        {
            "shared": [
                "CulturedBadass", 
                "GirlishPigtails", 
                "SensitiveGuyAndManlyMan", 
                "ScaryBlackMan"
            ], 
            "shared_count": 4, 
            "id": "StreetFighter", 
            "name": "Street Fighter", 
            "poster_url": "StreetFighter.jpg"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "CampGay", 
                "SensitiveGuyAndManlyMan", 
                "AFatherToHisMen"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "GirlishPigtails", 
                "DamselInDistress", 
                "SensitiveGuyAndManlyMan"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "DamselInDistress", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "Taken", 
            "name": "Taken", 
            "poster_url": "Taken.jpg"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "BadassGrandpa", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }
    ], 
    "id": "TheRock", 
    "name": "The Rock"
}