{
    "plot": "After the suicide of her only friend, Rachel has never felt more on the outside. The one person who reached out to her, Jessie, also happens to be part of the popular crowd that lives to torment outsiders like her. But Rachel has something else that separates her from the rest, a secret amazing ability to move things with her mind. Sue Snell, the only survivor of Carrie White's rampage twenty-two years ago, may hold the key to helping Rachel come to terms with her awesome, but unwanted power. But as Rachel slowly learns to trust, a terrible trap is being laid for her. And making her angry could prove to be fatal.", 
    "genres": "Horror, Sci-Fi, Thriller", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "entire", 
                    "straight", 
                    "hot", 
                    "other", 
                    "boorish"
                ], 
                "role": "Jerk Jock: With the exception of Jesse, the entire football team is a straight example, rating girls according to how hot they are and scoring points with each other for having sex with them. Lovable Jock: Jesse rejects his teammates' boorish behavior, and develops genuine feelings for Rachel.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "other", 
                    "original", 
                    "nice", 
                    "prom-night", 
                    "straight-A", 
                    "professional", 
                    "original", 
                    "little", 
                    "discernible"
                ], 
                "role": "The entire football team in The Rage: Carrie 2, which rates girls according to their hotness and then scores points with each other by sleeping with them. Sadly, this was based on something that actually happened (see below).\n Tommy in the original film was a subversion; he was a nice boy who genuinely cared for Carrie, and was visibly pissed off when she fell victim to Chris' prom-night prank. The book subverted it further by showing that he was a straight-A student and an amateur writer, who wanted to get a college degree before pursuing a career in professional baseball. The remake (and to some extent the original film), while keeping his niceness, turned him into a Brainless Beauty for little discernible reason.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Alpha Bitch: Most of the female characters, save Rachel and Lisa — and the latter's death opens the film.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "good-looking", 
                    "pat", 
                    "pleasant"
                ], 
                "role": "Meganekko: Monica is a subversion — while she's got the \"good-looking in glasses\" part down pat, she doesn't seem to care about the \"pleasant\" part.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "good-looking", 
                    "pat", 
                    "sweet", 
                    "pleasant"
                ], 
                "role": "The Rage: Carrie 2: Monica. She gets the \"good-looking in glasses\" part down pat, but not the \"sweet\" or \"pleasant\" parts. The glasses also wind up  getting her brutally killed.", 
                "id": "Meganekko"
            }
        ]
    }, 
    "imdbid": "tt0144814", 
    "similar": [
        {
            "shared": [
                "Meganekko", 
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "Meganekko", 
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "GeekCharming", 
            "name": "Geek Charming"
        }, 
        {
            "shared": [
                "Meganekko", 
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "BatmanReturns", 
            "name": "Batman Returns", 
            "poster_url": "BatmanReturns.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "TheHotChick", 
            "name": "The Hot Chick", 
            "poster_url": "TheHotChick.jpg"
        }, 
        {
            "shared": [
                "JerkJock", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "RomyAndMichelesHighSchoolReunion", 
            "name": "Romy and Michele's High School Reunion", 
            "poster_url": "RomyAndMichelesHighSchoolReunion.jpg"
        }
    ], 
    "id": "TheRageCarrie2", 
    "name": "The Rage: Carrie 2"
}