{
    "plot": "Set in a totalitarian society. Ben Richards is a cop who was blamed for a massacre which wasn't his fault. He would be sent to prison and breaks out with some other inmates. He tries to escape but the woman whom he dragged into his plan turns him over to the authorities. Damon Killian, who is the host of THE RUNNING MAN a game show wherein convicted felons are given the chance to run to freedom but have to elude the stalkers; men who hunt them down and kill them in gruesome manners. When he learns that Richards has been caught, he wants him to be the show's next contestant. After being brought to Killian, Richards turns him down, Killian then reveals to Richards that his two friends who were in prison with him and who broke out with him have been caught, so unless Richards does the show they will. But on the night of the show, Richards is set to go but Killian also reveals that Richards' two friends are going with him. Richards tells Killian that he will be back. But first !", 
    "genres": "Action, Crime, Sci-Fi", 
    "release_year": "1987", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "titular"
                ], 
                "role": "In The Running Man, Ben Richards shoves the blade of Buzzsaw's titular weapon into his groin area, causing him to emit a scream that went higher in pitch.", 
                "id": "InstantSoprano"
            }, 
            {
                "adjectives": [
                    "titular", 
                    "high", 
                    "pitched"
                ], 
                "role": "Instant Soprano: Ben Richards shoves the blade of  Buzzsaw's titular weapon into his groin area, causing him to emit a scream that quickly goes from manly to high pitched.", 
                "id": "InstantSoprano"
            }, 
            {
                "adjectives": [
                    "Killian"
                ], 
                "role": "Sissy Villain: Killian.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "innocent", 
                    "corrupt"
                ], 
                "role": "The Butcher: Ben Richards, \"The Butcher of Bakersfield\". Played with, in that Richards himself is innocent of the crime, framed by his corrupt superiors when he objected to massacring hordes of innocent people.", 
                "id": "TheButcher"
            }, 
            {
                "adjectives": [
                    "military", 
                    "real", 
                    "direct"
                ], 
                "role": "The Running Man's Ben Richards is known as \"the Butcher of Bakersfield\" after the incident where, as a military helicopter pilot, he allegedly fired on a crowd of innocent people for no real reason. The fact of the matter is that he was resisting the direct order to do so but was framed by the government because they couldn't use him after that outburst.", 
                "id": "TheButcher"
            }
        ]
    }, 
    "imdbid": "tt0093894", 
    "poster_url": "TheRunningMan.jpg", 
    "similar": [
        {
            "shared": [
                "InstantSoprano", 
                "SissyVillain"
            ], 
            "shared_count": 2, 
            "id": "TheHunchbackOfNotreDame", 
            "name": "The Hunchback of Notre Dame", 
            "poster_url": "TheHunchbackOfNotreDame.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "TheButcher"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "InstantSoprano", 
                "SissyVillain"
            ], 
            "shared_count": 2, 
            "id": "BatmanForever", 
            "name": "Batman Forever", 
            "poster_url": "BatmanForever.jpg"
        }, 
        {
            "shared": [
                "InstantSoprano"
            ], 
            "shared_count": 1, 
            "id": "TheIcePirates", 
            "name": "The Ice Pirates", 
            "poster_url": "TheIcePirates.jpg"
        }, 
        {
            "shared": [
                "SissyVillain"
            ], 
            "shared_count": 1, 
            "id": "NorthByNorthwest", 
            "name": "North by Northwest", 
            "poster_url": "NorthByNorthwest.jpg"
        }
    ], 
    "id": "TheRunningMan", 
    "name": "The Running Man"
}