{
    "plot": "It's the weird and wonderful as newly engaged couple Brad and Janet encounter a problem when their car halts in the rain. They both look for contact, only to find themselves at the castle of Dr. Frank-N-Furter, a transvestite. A place to stay is offered, but will Brad and Janet want to remain there? Especially when a large group of Transylvanians dance to the 'Time Warp', Dr. Frank-N-Furter builds his own man and a whole host of participation for the audience to enjoy.", 
    "genres": "Comedy, Musical", 
    "release_year": "1975", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "faithful"
                ], 
                "role": "Riff Raff, Frank N. Furter's \"faithful handyman\" from The Rocky Horror Picture Show, lacks in people skills.", 
                "id": "CrustyCaretaker"
            }, 
            {
                "adjectives": [
                    "cast", 
                    "fun"
                ], 
                "role": "Inverted audience participation. Where the cast will make callbacks to the audience's callbacks. For example, there's a callback where people poke fun at Dr. Frank-N-Furter standing at attention by depicting him as a Drill Sergeant Nasty. Rocky will be variously referred to as a Marine through the rest of the film.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "Used", 
                    "questionable", 
                    "Handwaved/explained", 
                    "pregnant", 
                    "fat", 
                    "birth", 
                    "young", 
                    "standard"
                ], 
                "role": "Used in the The Rocky Horror Picture Show fanfic Parental Guidance in which it's Dr. Frank N. Furter who ends up pregnant. Most of the questionable aspects of Mpreg are Handwaved/explained via Bizarre Alien Biology. Long story short, Frank becomes pregnant (the \"father\" is yet to be revealed), grows really fat, and, instead of giving birth to live young (which is the standard for most Mpreg fics), ends up laying a clutch of eggs.", 
                "id": "MisterSeahorse"
            }, 
            {
                "adjectives": [], 
                "role": "Rocky of The Rocky Horror Picture Show.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "jealousy-induced", 
                    "hard"
                ], 
                "role": "Clingy Jealous Boy: Frank-N-Furter. Sure, he flirts with nearly everyone. But, if he sees anyone with his beloved Rocky, he unleashes his jealousy-induced rage upon them. Janet Weiss had to find this out the hard way.", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Fangirl: Columbia, for Frank, then for Eddie then for Frank again...I think. \"EDDIE!!!\"", 
                "id": "Fangirl"
            }, 
            {
                "adjectives": [
                    "French"
                ], 
                "role": "French Maid: Magenta.", 
                "id": "FrenchMaid"
            }, 
            {
                "adjectives": [
                    "song"
                ], 
                "role": "As the song goes, \"Anne Francis stars in Forbidden Planet\", based on The Tempest, as Altaira, the Beautiful Daughter of the Mad Scientist, Dr. Morbius.\n Actually a semi-aversion, though, since Morbius specifically denies being a mad scientist, and is ultimately proved to be misguided rather than crazy.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Columbia from The Rocky Horror Picture Show.", 
                "id": "PerkyFemaleMinion"
            }, 
            {
                "adjectives": [], 
                "role": "Screaming Woman: Columbia  after Frank's death. Riff Raff, either startled or annoyed, immediately kills her too.", 
                "id": "ScreamingWoman"
            }, 
            {
                "adjectives": [
                    "jealous", 
                    "former", 
                    "active"
                ], 
                "role": "Janet Weiss from The Rocky Horror Picture Show. She's an innocent girl who is Brad's fiancee. Though, during her time in the castle, she has sex with both Frank N. Furter and Rocky...the latter prompting pure jealous rage from the former (over him sleeping with her, not vice versa). In the end, she's confused about what has occurred, but also realizes the benefits of living a sexually active life.", 
                "id": "SeeminglyWholesomeFiftiesGirl"
            }, 
            {
                "adjectives": [
                    "poor"
                ], 
                "role": "Seemingly Wholesome '50s Girl: Janet, oh, poor Janet. Columbia may have been this before she met Frank and Eddie.", 
                "id": "SeeminglyWholesomeFiftiesGirl"
            }, 
            {
                "adjectives": [
                    "black", 
                    "French"
                ], 
                "role": "The Rocky Horror Picture Show: Magenta wears a black French Maid uniform and a slightly more revealing black outfit throughout the film. At least, until the end when she and Riff Raff reveal themselves as aliens.", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [
                    "Riff-Raff", 
                    "furious"
                ], 
                "role": "And Riff-Raff becomes furious when he remarks that Rocky didn't like him, although he seems fairly calm during the rest of the scene. One could reasonably infer that he had feelings for Rocky.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0073629", 
    "poster_url": "TheRockyHorrorPictureShow.jpg", 
    "similar": [
        {
            "shared": [
                "WomanInBlack", 
                "WalkingShirtlessScene", 
                "MisterSeahorse", 
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "CrustyCaretaker", 
                "WomanScorned", 
                "WalkingShirtlessScene"
            ], 
            "shared_count": 3, 
            "id": "SilentHill", 
            "name": "Silent Hill", 
            "poster_url": "SilentHill.jpg"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "PerkyFemaleMinion", 
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "MisterSeahorse", 
                "WomanScorned"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "MadScientistsBeautifulDaughter", 
                "FrenchMaid"
            ], 
            "shared_count": 3, 
            "id": "BeautyAndTheBeast", 
            "name": "Beauty and the Beast", 
            "poster_url": "BeautyAndTheBeast.jpg"
        }
    ], 
    "id": "TheRockyHorrorPictureShow", 
    "name": "The Rocky Horror Picture Show"
}