{
    "plot": "Young Brendan lives in a remote medieval outpost under siege from barbarian raids. But a new life of adventure beckons when a celebrated master illuminator arrives from the isle of Iona carrying an ancient but unfinished book, brimming with secret wisdom and powers. To help complete the magical book, Brendan has to overcome his deepest fears on a dangerous quest that takes him into the enchanted forest where mythical creatures hide. It is here that he meets the fairy Aisling, a mysterious young wolf-girl, who helps him along the way. But with the barbarians closing in, will Brendan's determination and artistic vision illuminate the darkness and show that enlightenment is the best fortification against evil?", 
    "genres": "Animation, Adventure, Family", 
    "release_year": "2009", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "literal", 
                    "protagonist", 
                    "outside"
                ], 
                "role": "A literal example would be Aisling in The Secret of Kells who actually is a pixie or fairy of some sort, and whose antics show protagonist Brenden what life is like outside the walls of his monastery. It's left for the viewer to decide if they're actually in love, or just a couple of kids having fun.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "Mystical", 
                    "assertive", 
                    "mystical"
                ], 
                "role": "Mystical Waif: Aisling, though she's more assertive than most mystical waifs.", 
                "id": "MysticalWaif"
            }, 
            {
                "adjectives": [
                    "white"
                ], 
                "role": "Aisling from The Secret of Kells has white hair. She's a fairy.", 
                "id": "WhiteHairedPrettyGirl"
            }, 
            {
                "adjectives": [
                    "White-Haired", 
                    "second", 
                    "comic", 
                    "racial"
                ], 
                "role": "White-Haired Pretty Girl: Aisling. In the second comic prologue, it's revealed to be a racial trait of The Fair Folk.", 
                "id": "WhiteHairedPrettyGirl"
            }
        ]
    }, 
    "imdbid": "tt0485601", 
    "poster_url": "TheSecretOfKells.jpg", 
    "similar": [
        {
            "shared": [
                "WhiteHairedPrettyGirl", 
                "MysticalWaif"
            ], 
            "shared_count": 2, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "AfterHours", 
            "name": "After Hours", 
            "poster_url": "AfterHours.jpg"
        }, 
        {
            "shared": [
                "WhiteHairedPrettyGirl"
            ], 
            "shared_count": 1, 
            "id": "XMen1", 
            "name": "X-Men", 
            "poster_url": "XMen1.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "WhatsUpDoc", 
            "name": "What's Up, Doc?", 
            "poster_url": "WhatsUpDoc.jpg"
        }, 
        {
            "shared": [
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 1, 
            "id": "Paprika", 
            "name": "Paprika", 
            "poster_url": "Paprika.jpg"
        }
    ], 
    "id": "TheSecretOfKells", 
    "name": "The Secret of Kells"
}