{
    "plot": "The evil wizard Gargamel creates a couple of mischievous Smurf-like creatures called the Naughties that he hopes will let him harness the all-powerful, magical Smurf-essence. But when he discovers that only a real Smurf can give him what he wants, and only a secret spell that Smurfette knows can turn the Naughties into real Smurfs, Gargamel kidnaps Smurfette and brings her to Paris, where he has been winning the adoration of millions as the world¹s greatest sorcerer. It's up to Papa, Clumsy, Grouchy, and Vanity to return to our world, reunite with their human friends Patrick and Grace Winslow, and rescue her! Will Smurfette, who has always felt different from the other Smurfs, find a new connection with the Naughties Vexy and Hackus or will the Smurfs convince her that their love for her is True Blue?", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "same"
                ], 
                "role": "Papa Wolf: Papa Smurf once again.  In one scene he desperately tries to climb up a door in order to get to Smurfette, and it takes the combined efforts of Clumsy, Grouchy and Vanity to stop him. Patrick places himself in front of Blue when Gargamel blasts them, and in the same scene Victor (who, bear in mind, has been turned into a duck) flies in Gargamel's face in order to protect Patrick.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Daddy's Little Villain: Smurfette is played up as this to her \"father\" Gargamel before her Heel-Face Turn, along with her \"sister\" Vexy, though to a lesser extent.", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [], 
                "role": "In The Smurfs 2, Smurfette is played up as this to her \"father\" Gargamel before her Heel-Face Turn, along with her \"sister\" Vexy, though to a lesser extent.", 
                "id": "DaddysLittleVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Mama Bear: Hard to see, but Grace shields herself in front of Blue when Gargamel confronts the four humans after Victor and Patrick foiled his plans.", 
                "id": "MamaBear"
            }
        ]
    }, 
    "imdbid": "tt2017020", 
    "poster_url": "TheSmurfs2.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "DaddysLittleVillain", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "RiseOfTheGuardians", 
            "name": "Rise of the Guardians"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "HomeAlone", 
            "name": "Home Alone", 
            "poster_url": "HomeAlone.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "WhiteFang", 
            "name": "White Fang", 
            "poster_url": "WhiteFang.jpg"
        }
    ], 
    "id": "TheSmurfs2", 
    "name": "The Smurfs 2"
}