{
    "plot": "In 1930's Austria, a young woman named Maria is failing miserably in her attempts to become a nun. When the Navy captain Georg Von Trapp writes to the convent asking for a governess that can handle his seven mischievous children, Maria is given the job. The Captain's wife is dead, and he is often away, and runs the household as strictly as he does the ships he sails on. The children are unhappy and resentful of the governesses that their father keeps hiring, and have managed to run each of them off one by one. When Maria arrives, she is initially met with the same hostility, but her kindness, understanding, and sense of fun soon draws them to her and brings some much-needed joy into all their lives -- including the Captain's. Eventually he and Maria find themselves falling in love, even though Georg is already engaged to a Baroness and Maria is still a postulant. The romance makes them both start questioning the decisions they have made. Their personal conflicts soon become overshadowed, however, by world events. Austria is about to come under the control of Germany, and the Captain may soon find himself drafted into the German navy and forced to fight against his own country.", 
    "genres": "Biography, Drama, Family", 
    "release_year": "1965", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Dad the Veteran: The Captain served in WWI and was decorated for his actions.", 
                "id": "DadTheVeteran"
            }, 
            {
                "adjectives": [], 
                "role": "Drill Sergeant Nasty: Captain von Trapp treats his children this way at the beginning.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "many", 
                    "such", 
                    "able"
                ], 
                "role": "In the beginning of The Sound of Music, Captain Von Trapp was one of these towards his children and household, because too many things such as singing and dancing reminded him of his deceased wife. Fortunately, with the help of Maria and his children, he was able to get over it.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "noble", 
                    "literal", 
                    "figurative"
                ], 
                "role": "Knight in Shining Armor: Captain Von Trapp was a member of Europe's noble caste and served by tradition, making him almost a literal as well as a figurative example of this. Alternatively, this could be Warrior Prince.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [], 
                "role": "Officer and a Gentleman: Captain von Trapp", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "Overprotective"
                ], 
                "role": "Overprotective Dad: The Captain in regards to Liesl; subverted when her boyfriend ends up as a Nazi.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [], 
                "role": "Captain von Trapp in The Sound of Music.", 
                "id": "ThePatriarch"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Such", 
                    "third"
                ], 
                "role": "Brawn Hilda: Such a woman wins third place at the concert, and won't get off the stage so she can keep soaking up applause.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "first", 
                    "protective"
                ], 
                "role": "Cool Old Lady: The Reverend Mother Superior of the convent. She instinctively knows that Maria's calling is outside the convent, and she realizes that Maria is in love with the captain. Not to mention when Maria, at first, told the Reverend Mother she left because she was \"frightened\". To which the Reverend Mother says, \"Frightened, were they unkind to you?\" The tone which she uses indicates she is very protective of the nuns. One could almost call her a Badass Preacher.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "Magical", 
                    "classic", 
                    "same", 
                    "other"
                ], 
                "role": "Magical Nanny: One of the classic examples, played by the same actress as the other one, no less. Maria comes to the household, improves the life of everyone and marries the father of the children she's taking care of.", 
                "id": "MagicalNanny"
            }, 
            {
                "adjectives": [], 
                "role": "Classic example: Maria in The Sound of Music. She's often overlooked as an example of the trope, because she's really trying her best to be a mature, motherly type (in addition to being a nun).", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Manic Pixie Dreamgirl: Maria to the Captain.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [], 
                "role": "In The Sound of Music there is no mother in the Vonn Trapp family. Captain Von Trapp is explicitly referred to as a widower.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "savvy"
                ], 
                "role": "In The Sound of Music, Maria tries to retire to the convent after she realizes she is in love with the Captain. The Reverend Mother, being a rather savvy sort of person, informs Maria kindly but firmly that she can't use the convent to run away from her feelings, and reassures her that \"just because you love this man, it doesn't mean you love God less.\"\n Of course, Maria had already been in training to become a nun when she was sent to the von Trapps as a nanny.", 
                "id": "TakingTheVeil"
            }, 
            {
                "adjectives": [], 
                "role": "Taking the Veil: Maria tries to pull this, and is sent firmly back.", 
                "id": "TakingTheVeil"
            }, 
            {
                "adjectives": [], 
                "role": "Team Mom: Maria.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [], 
                "role": "The Cutie: Maria", 
                "id": "TheCutie"
            }, 
            {
                "adjectives": [], 
                "role": "Maria in The Sound of Music. And, even more, Liesl.", 
                "id": "TheIngenue"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Tomboy Maria and Girly Girl Elsa. Tomboy Louisa and Girly Girl Liesl. Tomboy Brigitta and Girly Girl Marta. And Gretel is somewhere in the middle.", 
                "id": "TomBoyAndGirlyGirl"
            }, 
            {
                "adjectives": [
                    "sweet", 
                    "agree"
                ], 
                "role": "The Sound of Music:\n Maria's rival Baroness Ilse is clearly aiming to be a Wicked Stepmother; she's already planning to pack the children Off to Boarding School. But it's subverted near the end, when the Baroness pulls a I Want My Beloved to Be Happy, willingly ending her engagement with Captain von Trapp after he had realized that he loved Maria.\n Subverted by Maria the Magical Nanny, when she marries Captain von Trapp. The children loved her before the marriage and only loved her more after the marriage. There's a very sweet scene with Maria and Liesl, the eldest child, after Maria and the Captain return from their honeymoon; Liesl calls Maria \"Mother\" and they both agree they like that a lot.", 
                "id": "WickedStepmother"
            }
        ]
    }, 
    "imdbid": "tt0059742", 
    "poster_url": "TheSoundOfMusic.jpg", 
    "similar": [
        {
            "shared": [
                "MissingMom", 
                "TheIngenue", 
                "ManicPixieDreamGirl", 
                "TomBoyAndGirlyGirl", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 5, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "MissingMom", 
                "TheIngenue", 
                "OverprotectiveDad", 
                "CoolOldLady", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TheIngenue", 
                "MissingMom", 
                "CoolOldLady", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 4, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }, 
        {
            "shared": [
                "MissingMom", 
                "TheIngenue", 
                "TeamMom", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 4, 
            "id": "SnowWhiteAndTheSevenDwarfs", 
            "name": "Snow White and the Seven Dwarfs"
        }, 
        {
            "shared": [
                "WickedStepmother", 
                "TheIngenue", 
                "MagicalNanny", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Cinderella", 
            "name": "Cinderella", 
            "poster_url": "Cinderella.jpg"
        }
    ], 
    "id": "TheSoundOfMusic", 
    "name": "The Sound of Music"
}