{
    "plot": "Divorcee Scott Calvin is disgusted to learn that his ex and her husband have tried - and failed - to break it easy to their 6-year-old son Charlie that Santa isn't real. On Christmas Eve, Scott reads The Night Before Christmas... then receives an unexpected visitor on his roof. When he's startled by Scott's calling out and falls, the Santa impersonator disappears, leaving only an 8-reindeer sleigh and a suit with instructions to put it on if he's involved in an accident. Scott does, and is transported around the town dropping gifts through chimneys until he's taken to the North Pole and informed by a group who claim they're elves that he is now Santa. Charlie is proud of his dad's new job, though Scott's convinced it's a dream. Until his hair turns white, his beard refuses to stay shaved, he gains weight inexplicably, even for his sudden love of junk food... Now he's accepted it, there's just one problem: how to keep it secret from his disbelieving family?", 
    "genres": "Comedy, Drama, Family", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "first", 
                    "much", 
                    "second"
                ], 
                "role": "Disappeared Dad: Scott always loved Charlie, but the first movie demonstrates how much more focused with business he was. Becoming Santa obviously helps him get his priorities in order. However, in an irony, Scott still falls into this by the second movie - though now because of the workload over caring for all the children of the world.", 
                "id": "DisappearedDad"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Legal", 
                    "much", 
                    "other"
                ], 
                "role": "Legal Jailbait: The trope is played with when Scott meets an elf who looks about ten, but is very much over a thousand years old. He innocently remarks about her looks and she is the one who takes it the other way:", 
                "id": "LegalJailbait"
            }, 
            {
                "adjectives": [
                    "second"
                ], 
                "role": "Mrs. Claus: The second film is about Scott having to get a wife.", 
                "id": "MrsClaus"
            }
        ]
    }, 
    "imdbid": "tt0111070", 
    "poster_url": "TheSantaClause.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "TheFog", 
            "name": "The Fog", 
            "poster_url": "TheFog.jpg"
        }
    ], 
    "id": "TheSantaClause", 
    "name": "The Santa Clause"
}