{
    "plot": "Mrs. Brisby, a widowed mouse, lives in a cinder block with her children on the Fitzgibbon farm. She is preparing to move her family out of the field they live in as plowing time approaches, however her son Timothy has fallen ill, and moving him could prove fatal. Mrs. Brisby visits The Great Owl, a wise creature who advises her to visit a mysterious group of rats who live beneath a rose bush on the farm. Upon visiting the rats, Brisby meets Nicodemus, the wise and mystical leader of the rats, and Justin, a friendly rat who immediately becomes attached to Mrs. Brisby. While there, she learns that her late husband, Mr. Jonathon Brisby, along with the rats, was a part of a series of experiments at a place known only as N.I.M.H. (revealed earlier in the story as the National Institute of Mental Health). The experiments performed on the mice and rats there boosted their intelligence, allowing them to read without being taught and to understand things such as complex mechanics and electricity. The rats and Mr. Brisby escaped from N.I.M.H. and came to live on the Fitzgibbon farm. The rats created a home for themselves under Mrs. Fitzgibbon's rose bush, creating an elaborate habitation of beautiful chambers, elevators, and Christmas lights. However, the rats are unhappy in their dependence on the humans, who they are stealing electricity from, and have concocted a plan to leave the farm and live independently. Because of her husband's prior relationship with the rats, they agree to help Mrs. Brisby move her home out of the path of the plow. However, the evil Jenner and his unwilling accomplice Sullivan, who wish to remain beneath the rose bush, yet plot to kill Nicodemus during the move.", 
    "genres": "Animation, Drama, Family", 
    "release_year": "1982", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Beard of Evil: Jenner has one.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "great"
                ], 
                "role": "Disguised in Drag: Played With. Jeremy while helping Mrs. Brisby reach the rosebush to find the rats decides it'd be a great idea to disguise himself by sneaking around inside a pair of ladies' bloomers.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [
                    "abrasive", 
                    "much", 
                    "old", 
                    "old"
                ], 
                "role": "Grumpy Old Man: Mr. Ages is an abrasive misanthrope, but his heart is very much in the right place. Auntie Shrew who is a grumpy old woman herself, even refers to him as \"that old flim-flam\".", 
                "id": "GrumpyOldMan"
            }, 
            {
                "adjectives": [
                    "valid"
                ], 
                "role": "Papa Wolf: Jeremy tries to act as one, but ultimately his clumsiness intervenes — as well as inadvertently falling under the wrath of a Mama Bear in the process. That said he does act out a pretty valid showing of this for Mrs. Brisby, and to a lesser extent, Timmy.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "call", 
                    "much", 
                    "top", 
                    "original"
                ], 
                "role": "Sissy Villain: Doctor Valentine in the sequel. Might as well call him \"the camp evil scientist that wears eye liner\" (seriously). It also doesn't help much that on top of being nonexistent in the original film and having no speaking lines whatsoever, Jenny still builds him up to be an absolutely depraved villain hellbent on the capture and destruction of the rats, only for him to finally emerge at the climax as nothing more than Evil!Martin's mindless pet. Literally.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Wizard Beard: Nicodemus.", 
                "id": "WizardBeard"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "responsible", 
                    "few", 
                    "odd"
                ], 
                "role": "Action Girl: Jenny, who is arguably more responsible in stopping  Evil!Martin 's plans than Timmy. She does get a few odd Distressed Damsel moments however.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "interesting", 
                    "scared", 
                    "courageous"
                ], 
                "role": "Action Mom: Mrs. Brisby is an interesting example of this trope, as she is only doing what she does to protect her children (\"Timothy... remember Timothy!\") It is certainly not because she enjoys adventure or action. In fact, the film clearly shows that she's scared out of her mind by the tasks she must do, but she is still courageous enough to pull through, expecially when the action really gets going.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "much"
                ], 
                "role": "Mrs Brisby of The Secret of NIMH is an Action Survivor Action Mom. She spends much if not most of the movie in well over her head but keeps going because her family is at stake.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "old", 
                    "necessary", 
                    "absolute"
                ], 
                "role": "Cool Old Lady: Auntie Shrew is a bossy old Drama Queen, but when necessary she is an absolute Badass, shutting down a tractor single-handedly.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "In The Secret of NIMH, Mrs. Brisby is a widowed mouse who's family has to move in order to avoid the farmer's plow but her son Timothy has come down with pneumonia and can't be moved for a few weeks. She will do whatever it takes to move her whole house in order to protect him.", 
                "id": "DeterminedWidow"
            }, 
            {
                "adjectives": [
                    "Half-Dressed"
                ], 
                "role": "Humanoid Female Animal: Jenny, despite also being a rare female variant of Half-Dressed Cartoon Animal.", 
                "id": "HumanoidFemaleAnimal"
            }, 
            {
                "adjectives": [], 
                "role": "Ill Boy: Timmy.", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [
                    "standard", 
                    "semi-anthropomorphic", 
                    "dark", 
                    "natural"
                ], 
                "role": "Mama Bear: Not as violent as standard examples, but any mouse (especially a semi-anthropomorphic one) who'll enter the dark spooky lair of one of her natural predators, in order to save her children, deserves a mention.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Mrs. Brisby in The Secret Of Nimh would not have gotten any help for her situation if she wasn't, as they keep calling her, \"Mrs. Jonathan Brisby.\" Though she ultimately succeeds based on her courage and inner strength, the sequel effectively demotes her to extra to focus on her son.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "Self-Made"
                ], 
                "role": "Never a Self-Made Woman: Mrs. Brisby would not have gotten any help for her situation if she wasn't \"Mrs. Jonathan Brisby\".", 
                "id": "NeverASelfMadeWoman"
            }
        ]
    }, 
    "imdbid": "tt0084649", 
    "poster_url": "TheSecretOfNIMH.jpg", 
    "similar": [
        {
            "shared": [
                "ActionMom", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "CoolOldLady", 
                "DisguisedInDrag"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "NeverASelfMadeWoman", 
                "BeardOfEvil", 
                "GrumpyOldMan", 
                "DisguisedInDrag"
            ], 
            "shared_count": 5, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "NeverASelfMadeWoman", 
                "BeardOfEvil", 
                "CoolOldLady", 
                "ActionGirl"
            ], 
            "shared_count": 5, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "HumanoidFemaleAnimal", 
                "ActionGirl", 
                "DisguisedInDrag"
            ], 
            "shared_count": 4, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DeterminedWidow", 
                "ActionGirl", 
                "MamaBear"
            ], 
            "shared_count": 4, 
            "id": "Terminator2JudgmentDay", 
            "name": "Terminator 2: Judgment Day", 
            "poster_url": "Terminator2JudgmentDay.jpg"
        }
    ], 
    "id": "TheSecretOfNIMH", 
    "name": "The Secret of NIMH"
}