{
    "plot": "Young and inexperienced Sister Ann has just arrived at her next posting at Samaritan House, a Dominican order located in a disreputable neighborhood of Ghent, Belgium. Sister Ann is enthusiastic, progressive but naive, all which irks one of the senior sisters, Sister Cluny, especially the fact that Sister Ann has a prized material possession, a guitar she's named Adele. Sister Ann considers Adele and her music to be her friends. Contrary to Sister Cluny, the Mother Prioress believes Sister Ann will be a welcome addition to their order. This posting is to be the training ground for Sister Ann and others to become missionaries in Africa. Sister Ann's path takes a detour when the order's Father Clementi hears Sister Ann sing. He believes Sister Ann should record her music and as a favor asks Robert Gerarde of Primavera Records for recording time. Unknown at the time the request is made, Robert and Sister Ann are old friends who attended the Paris Conservatory of Music together five years earlier before she became a nun. Robert believes Sister Ann could be a recording sensation, keeping true to her style of music of religious based folk songs. As Sister Ann becomes more famous, which includes an appearance on the The Ed Sullivan Show (1948), Sister Ann increasingly wonders if she truly is doing the work of God, as she admits she enjoys the adulation of being a celebrity and despite the financial gain to the church. This question, which was important previously in dealing with a precocious local boy named Dominic Arlien (after who she named one of her songs) and his troubled family, becomes all the more important after a specific incident which threatens Dominic's life.", 
    "genres": "Biography, Drama, Musical", 
    "release_year": "1966", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "in-universe", 
                    "easy"
                ], 
                "role": "Sexy Priest: Father Clementi. Not that it's mentioned or bragged about in-universe, but the man is pretty easy on the eyes and he is a carpenter.", 
                "id": "SexyPriest"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Missing Mom: Nicole and Dominic's mother.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0060983", 
    "poster_url": "TheSingingNun.jpg", 
    "similar": [
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "IndependenceDay", 
            "name": "Independence Day", 
            "poster_url": "IndependenceDay.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Epic", 
            "name": "Epic"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "StarTrekInsurrection", 
            "name": "Star Trek: Insurrection", 
            "poster_url": "StarTrekInsurrection.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "TheSingingNun", 
    "name": "The Singing Nun"
}