{
    "plot": "In 1858 France, Bernadette, an adolescent peasant girl, has a vision of \"a beautiful lady\" in the city dump. She never claims it to be anything other than this, but the townspeople all assume it to be the virgin Mary. The pompous government officials think she is nuts, and do their best to suppress the girl and her followers, and the church wants nothing to do with the whole matter. But as Bernadette attracts wider and wider attention, the phenomenon overtakes everyone in the the town, and transforms their lives.", 
    "genres": "Biography, Drama", 
    "release_year": "1943", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "own", 
                    "young", 
                    "frail"
                ], 
                "role": "Bernadette Soubirous, who had eighteen visions of the Virgin Mary at Lourdes when she was fourteen, entered a hospice school at sixteen and at 22 joined the Sisters of Charity and Christian Instruction. Fictional accounts aside, her own writings show that she wanted to do this. Her friend Antoine Nicolau really was just a friend, and in fact was married before the visions began. However, her story codified the Vocation type where seeing the Blessed Mother means you have to Take The Veil and die young, preferably of TB. (Bernadette, an already physically frail Ill Girl, died of bone tuberculosis when in her 30's.)", 
                "id": "TakingTheVeil"
            }
        ]
    }, 
    "imdbid": "tt0036377", 
    "poster_url": "TheSongOfBernadette.jpg", 
    "similar": [
        {
            "shared": [
                "TakingTheVeil"
            ], 
            "shared_count": 1, 
            "id": "AMidsummerNightsDream", 
            "name": "A Midsummer Night's Dream"
        }, 
        {
            "shared": [
                "TakingTheVeil"
            ], 
            "shared_count": 1, 
            "id": "ThePrimeOfMissJeanBrodie", 
            "name": "The Prime of Miss Jean Brodie", 
            "poster_url": "ThePrimeOfMissJeanBrodie.jpg"
        }, 
        {
            "shared": [
                "TakingTheVeil"
            ], 
            "shared_count": 1, 
            "id": "Hamlet", 
            "name": "Hamlet", 
            "poster_url": "Hamlet.jpg"
        }, 
        {
            "shared": [
                "TakingTheVeil"
            ], 
            "shared_count": 1, 
            "id": "TheSoundOfMusic", 
            "name": "The Sound of Music", 
            "poster_url": "TheSoundOfMusic.jpg"
        }, 
        {
            "shared": [
                "TakingTheVeil"
            ], 
            "shared_count": 1, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }
    ], 
    "id": "TheSongOfBernadette", 
    "name": "The Song Of Bernadette"
}