{
    "plot": "Phil, a divorced 30-something, responsible for his youngest son Ryan, is laid-off from by his good friend at the local newspaper. Not knowing where to go or what to do, Phil is encouraged by his best friend, Camile, to participate in a local Street Fighter 4 tournament in order to use the cash winnings to pay for Ryan's private school tuition and ultimately win his respect. Once Phil places 2nd at the tournament just behind the owner of the local comic book cafe, Evil-Dan, he is bitten by the bug realizing his natural talent for Street Fighter can give him a real shot at taking gaming to the next level. This presents a problem with his ex-wife Julie, who threatens to take custody of Ryan unless Phil can come up with the tuition to send their son to the esteemed Middlebrook prep school. Under the looming pressure of his ex-wife, Evil-Dan, and his own unemployment, Phil enters the Alex Valle's Ultimate Street Fighter Tournament to win back his son and find his inner Street Fighter.", 
    "genres": "Drama", 
    "release_year": "2011–", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "later"
                ], 
                "role": "Miss Yang, who hires and later betrays Terry Tsurugi in The Street Fighter.", 
                "id": "DragonLady"
            }
        ]
    }, 
    "imdbid": "tt2138030", 
    "similar": [
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "ThePunisher1989", 
            "name": "The Punisher ", 
            "poster_url": "ThePunisher1989.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "TheCrow", 
            "name": "The Crow", 
            "poster_url": "TheCrow.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "WildWildWest", 
            "name": "Wild Wild West", 
            "poster_url": "WildWildWest.jpg"
        }, 
        {
            "shared": [
                "DragonLady"
            ], 
            "shared_count": 1, 
            "id": "IDrinkYourBlood", 
            "name": "I Drink Your Blood", 
            "poster_url": "IDrinkYourBlood.jpg"
        }
    ], 
    "id": "TheStreetFighter", 
    "name": "The Street Fighter"
}