{
    "plot": "Joanna Eberhart, a wildly succesful president of a TV Network, after a series of shocking events suffers a nervous breakdown and is moved by her milquetoast of a husband, Walter, from Manhattan to the chic, upper-class and very modern planned community of Stepford, Connecticut. Once there, she makes good friends with the ascerbic Bobbie Markowitz, a jewish writer who's also a recovering alcoholic. Together they find out, much to their growing stupor and-then horror, that all the housewives in town are strangely blissful, and somehow... doomed. What is going on behind the closed doors of the Stepford Men's Association and the Stepford Day Spa? Why is everything perfect here? Will it be too late for Joanna and Bobbie when they finally find out?", 
    "genres": "Comedy, Sci-Fi, Thriller", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "perfect"
                ], 
                "role": "Stepford, where guys kill their wives and replace them with \"perfect\" robot women.", 
                "id": "NoWomansLand"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "responsible", 
                    "whole"
                ], 
                "role": "Claire Wellington from the remake of The Stepford Wives  turns out to be responsible for the whole mess, blaming feminism for emasculating men.", 
                "id": "FemaleMisogynist"
            }, 
            {
                "adjectives": [], 
                "role": "Female Misogynist: Claire", 
                "id": "FemaleMisogynist"
            }, 
            {
                "adjectives": [
                    "original", 
                    "obedient", 
                    "original"
                ], 
                "role": "In the original film (and its remake) and the book version of The Stepford Wives, all of the women in Stepford have been replaced with obedient androids. This was kept in the 2004 remake. Some of the sequels to the original film changed this process to simply the women getting brainwashed.", 
                "id": "RobotGirl"
            }
        ]
    }, 
    "imdbid": "tt0327162", 
    "poster_url": "TheStepfordWives.jpg", 
    "similar": [
        {
            "shared": [
                "NoWomansLand"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "NoWomansLand"
            ], 
            "shared_count": 1, 
            "id": "Django", 
            "name": "Django", 
            "poster_url": "Django.jpg"
        }, 
        {
            "shared": [
                "RobotGirl"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }, 
        {
            "shared": [
                "NoWomansLand"
            ], 
            "shared_count": 1, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "NoWomansLand"
            ], 
            "shared_count": 1, 
            "id": "Outrage", 
            "name": "Outrage", 
            "poster_url": "Outrage.jpg"
        }
    ], 
    "id": "TheStepfordWives", 
    "name": "The Stepford Wives"
}