{
    "plot": "As children, Prince Derek and Princess Odette are forced to spend their summers together by their widowed parents, who hope that the two will eventually fall in love and marry, so that the kingdoms of the two will be united. As children and adolescents, Derek and Odette can't stand each other, but as young adults they begin to see each other in a different light and fall in love with each other. But one night things take a bad turn when Derek unintentionally offends Odette, who then refuses to marry him if he can't prove that he loves her for who she is and not just her beauty. Odette and her father are then attacked by Lord Rothbart, a vengeful sorcerer who was cast out of William's kingdom when he plotted against the king. In the form of a beast, Rothbart mortally wounds William, and kidnaps Odette then places her under a spell. Now it is up to Derek to rescue Odette by showing his undying love. But, will he be in time?", 
    "genres": "Animation, Comedy, Family", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old", 
                    "particular", 
                    "able", 
                    "non-flying"
                ], 
                "role": "Cool Old Guy: Rogers, Derek's advisor. Also, Speed; he's an old turtle, but wise and heroic. Puffin, too. He's of particular help to Odette since he's able to accompany her more conveniently than their non-flying friends.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "original", 
                    "able"
                ], 
                "role": "Disappeared Dad: It is mentioned in the prologue that Uberta was a widow, so Derek's dad is assumed to be dead. The original ballet even has her character as a Queen Mum sort of figure, only ruling as Sovereign Princess until her son is able to take a wife.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "Jean-Bob"
                ], 
                "role": "Prince Charming Wannabe: Jean-Bob with Odette.", 
                "id": "PrinceCharmingWannabe"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Butter Face: Bridget as Fake!Odette in the first film. Ugh.", 
                "id": "ButterFace"
            }, 
            {
                "adjectives": [
                    "free", 
                    "whole", 
                    "integral", 
                    "notable"
                ], 
                "role": "Damsel in Distress: Odette. Notably, while she does require saving, she had previously done everything she could to try and liberate herself or at least get Derek's attention to help free her. While she does need Derek to save her, it's somewhat justified since Rothbart's spell can only be broken either by him or be Derek making a vow of everlasting love to the whole world, so Derek is an integral part in breaking the spell. Odette even basically says if she could break the spell by herself she would. Also notable is that Odette actively tries to seek out Derek, including breaking into Rothbart's castle to steal a map and then flying to Derek's hunting grounds to find him.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "good", 
                    "title"
                ], 
                "role": "Everything's Better with Princesses: Apparently Swan Lake wasn't a good enough title.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "original", 
                    "beautiful"
                ], 
                "role": "The Swan Princess - Odette actually is a princess in the original ballet and the film adds the Disney Princess touches to her, giving her a beautiful singing voice, becoming a Friend to All Living Things etc. She manages to become a Queen at the end of the film and remains one in the sequels.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "birth"
                ], 
                "role": "Missing Mom: Odette's mother is never seen. The only mention we get of her is the phrase \"and to him a daughter was born\", so she may have died during the birth.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "wise", 
                    "sweetness", 
                    "light", 
                    "personified"
                ], 
                "role": "Odette from the Swan Princess is a slightly more wise version of this. Much of the plot is driven by her refusal to marry her Love Interest until he can list a reason to love her beside her beauty. Other than that though, she's sweetness and light personified, especially in the sequels.", 
                "id": "PrincessClassic"
            }
        ]
    }, 
    "imdbid": "tt0111333", 
    "poster_url": "TheSwanPrincess.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses", 
                "CoolOldGuy", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "DamselInDistress", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "SnowWhiteAndTheSevenDwarfs", 
            "name": "Snow White and the Seven Dwarfs"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses", 
                "PrincessClassic", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "Cinderella", 
            "name": "Cinderella", 
            "poster_url": "Cinderella.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "EverythingsBetterWithPrincesses", 
                "CoolOldGuy", 
                "MissingMom"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }
    ], 
    "id": "TheSwanPrincess", 
    "name": "The Swan Princess"
}