{
    "plot": "Simon Templar has no real family, no real home and Simon Templar isn't even his real name. Yet Simon Templar , also known as the Saint for his use of creating false identities using the names of Catholic saints,is one of the world's most successful thieves. Slick, debonair and a master of disguise, Simon manages to outwit the police again and again. On his next job Simon is hired by the Russian Mafia to steal a cold fusion energy formula from scientist Emma Russel, however the mission backfires as he falls for the pretty, intelligent scientist. Simon and his new love must now manage to outwit the Russian Mafia and work out the energy formula before the worst happens and the US is affected forever.", 
    "genres": "Action, Adventure, Romance", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "The TV series of The Saint and The Persuaders (both starring Roger Moore).", 
                "id": "GENTLEMANADVENTURER"
            }, 
            {
                "adjectives": [
                    "Last", 
                    "tragic", 
                    "Templar", 
                    "Templar", 
                    "other", 
                    "current", 
                    "archetypal", 
                    "aware", 
                    "loyal", 
                    "physicial", 
                    "inavoidable", 
                    "dishourable"
                ], 
                "role": "Knight In Shining Armour: In \"The Last Hero\", one of the earlier Saint novels (1931), Simon Templar takes backstage to his gallant and tragic associate Norman Kent, who falls in love hopelessly with Templar's girlfriend Patricia Holm (who hardly notices him) and at the end of the book sacrifices his life to let Templar and his other comrades-in-arms escape the current villain and fight again another day. A book called \"Knights Errant of the Nineeteenth and Early Twentieth Centuries\" by Caroline Whitehead and George Mc Leod says it all: \"Norman Kent is an archetypal knight-errant. Though formally a man of 20th Century England, he lives (and dies) by the Code of Chivalry. He loves totally his Lady, Patricia Holm - who, like Don Quixote's Dulcinea, is not aware of that love. He is totally loyal to his Liege Lord, Simon Templar. Like Sir Gawain in \"Sir Gawain and the Green Knight\", Norman Kent takes on the threats to his Lord. Not only physicial threats to life and limb, but also the sometimes inavoidable need to take dishourable acts which would have reflected badly on the reputation of King Arthur/Simon Templar is taken on, wholly and without reservation, by Sir Gawain/Norman Kent.\"", 
                "id": "KnightInShiningArmor"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Adrenaline Makeover: Emma", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "shy", 
                    "nervous", 
                    "nuclear", 
                    "brilliant", 
                    "original"
                ], 
                "role": "The Saint: Emma is a shy, nervous nuclear physicist who is brilliant enough to have invented Cold Fusion. She meets Simon in one of his aliases, and it's Love at First Sight. Once she gets over being astonished that a man like him would notice her, she's so worked up she has to take her heart medication before they go to bed. But he betrays her. Incensed, Emma throws off the meek mouse persona and tracks him down. Along the way, they're pursued by the Russian Mafia, and by the end of the movie, she can do a 100 yard dash, and doesn't need her pills anymore.\n In the original ending, she was going to die of heart problems, but test audiences didn't like it.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [], 
                "role": "Adrenaline Makeover: Emma.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Scientist: Dr. Emma Russell.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "female", 
                    "titular"
                ], 
                "role": "In The Saint, a female scientist hides the notes to her invention on scraps of paper tucked into her bra.  So the titular (sorry, couldn't resist) character seduces her in order to get them.", 
                "id": "Ptitleba4e2b2g"
            }
        ]
    }, 
    "imdbid": "tt0120053", 
    "poster_url": "TheSaint.jpg", 
    "similar": [
        {
            "shared": [
                "AdrenalineMakeover", 
                "HotScientist"
            ], 
            "shared_count": 2, 
            "id": "Innerspace", 
            "name": "Innerspace", 
            "poster_url": "Innerspace.jpg"
        }, 
        {
            "shared": [
                "GENTLEMANADVENTURER", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 2, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "HotScientist", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 2, 
            "id": "Robocop", 
            "name": "RoboCop", 
            "poster_url": "Robocop.jpg"
        }, 
        {
            "shared": [
                "HotScientist", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 2, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "HotScientist", 
                "KnightInShiningArmor"
            ], 
            "shared_count": 2, 
            "id": "Transformers", 
            "name": "Transformers"
        }
    ], 
    "id": "TheSaint", 
    "name": "The Saint"
}