{
    "plot": "A young British girl born and raised in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's estate. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and neglected. Aided by one of the servants' brothers, she begins restoring the garden, and eventually discovers some other secrets of the manor.", 
    "genres": "Drama, Family, Fantasy", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Crusty Caretaker: Ben Weatherstaff.", 
                "id": "CrustyCaretaker"
            }, 
            {
                "adjectives": [], 
                "role": "The Secret Garden has Ben Weatherstaff, the gardener.", 
                "id": "CrustyCaretaker"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Cool Big Sis: Martha, to Mary as well as literally for Dickon.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [], 
                "role": "Ill Boy: Colin Craven, especially in the anime series  where he almost dies.", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [
                    "male", 
                    "good"
                ], 
                "role": "Manic Pixie Dream Girl: Dickon serves as a male version of this for both Mary and Colin. Until he shows up, his sister Martha is a good Manic Pixie Dream Girl for Mary.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "dead", 
                    "horrible", 
                    "song"
                ], 
                "role": "Missing Mom: While both Mary's parents are dead, she tends to think of her mother more often than her father. The 1993 movie plays this aspect way up for both Colin and Mary. Also very cranked up in the anime series, where Colin's mom Lillias is painted as Messianic Archetype and things got horrible in the manor immediately after she died. Also, at the start Mary is seen singing a song and then thinking of both her mother and her nanny, but not about her dad.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "first", 
                    "new", 
                    "young", 
                    "clean", 
                    "sufficient"
                ], 
                "role": "In The Secret Garden, Mary's first relationship in her new home is with the young scullery maid who comes to clean the fireplace in her room. Mary can't do anything for herself (having always been waited on hand and foot) and the girl takes pity on her and helps her learn to be self sufficient.", 
                "id": "SculleryMaid"
            }, 
            {
                "adjectives": [
                    "much"
                ], 
                "role": "Team Mom: Mrs. Susan Sowerby, so very much.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [
                    "contrary", 
                    "negative", 
                    "rich"
                ], 
                "role": "Mary from The Secret Garden, mocked as \"Mary Mary, quite contrary\". It's seen as a negative trait, but one that allows her to go toe to toe with her cousin, the rich Spoiled Brat.", 
                "id": "TinyTyrannicalGirl"
            }, 
            {
                "adjectives": [
                    "guardian", 
                    "such", 
                    "young", 
                    "white"
                ], 
                "role": "In The Secret Garden, Mary wears white. This is because her mother has died, and her guardian finds black too much for such a young child. (In Victorian times, children could wear white, though no colors, in mourning.)", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "only", 
                    "musical", 
                    "entire", 
                    "ensemble", 
                    "first", 
                    "later", 
                    "light"
                ], 
                "role": "Woman in White: Mary. As mentioned above, Colin's father finds black too much for a child, and this is the only alternative, since she is in mourning for her mother. And in the 1993 film, Mary's mother in a Dream Sequence. And in the musical, the entire ensemble of Dreamers are this. Averted in the anime: Mary wears black at first, but later she puts on a light blue dress.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt0108071", 
    "poster_url": "TheSecretGarden.jpg", 
    "similar": [
        {
            "shared": [
                "IllGirl", 
                "WomanInWhite", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "MissingMom", 
                "WomanInWhite", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "IllGirl", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "GraveOfTheFireflies", 
            "name": "Grave of the Fireflies", 
            "poster_url": "GraveOfTheFireflies.jpg"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "TeamMom", 
                "IllGirl"
            ], 
            "shared_count": 3, 
            "id": "LittleWomen", 
            "name": "Little Women", 
            "poster_url": "LittleWomen.jpg"
        }, 
        {
            "shared": [
                "IllGirl", 
                "WomanInWhite", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "TheGrudge", 
            "name": "The Grudge", 
            "poster_url": "TheGrudge.jpg"
        }
    ], 
    "id": "TheSecretGarden", 
    "name": "The Secret Garden"
}