{
    "plot": "Madame Souza, an elderly woman, instills in her grandson Champion (for who she acts as his guardian) a love of cycling. As a young man, he does become a dedicated road racer with his grandmother as his trainer. During a mountainous leg of the Tour de France in which Champion is racing, he goes missing. Evidence points to him being kidnapped. Indeed, he and two of his competitors were kidnapped, the kidnappers who want to use the threesome's unique skills for nefarious purposes. With Champion's overweight and faithful pet dog Bruno at her side, Madame Souza goes looking for Champion. Their trek takes them overseas to the town of Belleville. Without any money, Madame Souza and Bruno are befriended and taken in by three eccentric elderly women, who were once the renowned jazz singing group The Triplets of Belleville. The triplets help Madame Souza and Bruno try to locate and rescue Champion.", 
    "genres": "Animation, Comedy", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "club-footed", 
                    "old", 
                    "persistent", 
                    "ocean", 
                    "entire", 
                    "foot-pedalled", 
                    "huge", 
                    "eponymous", 
                    "vaudeville", 
                    "surprising"
                ], 
                "role": "Badass Grandma: Madame Souza is a tiny, club-footed old woman who is persistent enough to follow an ocean liner across the entire Atlantic in a foot-pedalled boat, at night, during a huge storm at sea, to the accompaniment of Mozart's \"Mass in C Minor - Kyrie\". She kicks over a car too. The eponymous Triplets are no slouches either; for elderly vaudeville performers, they have surprising proficiency with explosives.", 
                "id": "BadassGrandpa"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Cool Old Lady: Both Madame Souza and the Triplets.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "eponymous", 
                    "ex-vaudeville", 
                    "only"
                ], 
                "role": "The eponymous Triplets of Belleville, ex-vaudeville stars still doing their thing on stage. Also Madame Souza, who is possibly the only Implacable Grandma.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "eponymous"
                ], 
                "role": "They may not have grandkids, but The Triplets of Belleville definitely get a place here. The main character, Madame Souza, is a grandmother, and earns Never Mess With Granny status by being a Determinator who takes on The Mafia (with the help of the eponymous triplets) to rescue her kidnapped grandson Champion.", 
                "id": "NeverMessWithGranny"
            }
        ]
    }, 
    "imdbid": "tt0286244", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa", 
                "NeverMessWithGranny", 
                "CoolOldLady"
            ], 
            "shared_count": 3, 
            "id": "SummerWars", 
            "name": "Summer Wars", 
            "poster_url": "SummerWars.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "NeverMessWithGranny"
            ], 
            "shared_count": 2, 
            "id": "TheLastStand", 
            "name": "The Last Stand", 
            "poster_url": "TheLastStand.jpg"
        }, 
        {
            "shared": [
                "NeverMessWithGranny", 
                "CoolOldLady"
            ], 
            "shared_count": 2, 
            "id": "SleepingBeauty", 
            "name": "Sleeping Beauty"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "CoolOldLady"
            ], 
            "shared_count": 2, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "NeverMessWithGranny", 
                "CoolOldLady"
            ], 
            "shared_count": 2, 
            "id": "Madagascar", 
            "name": "Madagascar", 
            "poster_url": "Madagascar.jpg"
        }
    ], 
    "id": "TheTripletsOfBelleville", 
    "name": "The Triplets of Belleville"
}