{
    "plot": "The Charlestown neighborhood of Boston is renowned for churning out a high number of armed robbers, generation after generation. These robbers never leave their Charlestown life on their own volition, the neighborhood where there is an unwritten code to protect that lifestyle. Such robbers include friends Doug MacRay, James Coughlin, Albert 'Gloansy' Magloan and Desmond Elden. Doug and James in particular treat each other like family, as the Coughlins have realistically been as such to Doug since Doug's mother ran off and Doug's father, Stephen MacRay, was sent to prison. James' single mother sister, the drugged out Krista Coughlin, and Doug have a casual sexual relationship. The foursome carry out a mostly successful bank robbery, but due to circumstances take the bank manager, Claire Keesey, hostage for a short period before releasing her physically unharmed. They find out that Claire lives in Charlestown, so they want to ensure that she did not see anything that could incriminate them if they were to ever run into her. As such, Doug begins a personal relationship with her to find out what she knows and what she's told the police and the FBI, who have taken charge of the investigation. He learns that she has kept some information from the authorities for her own protection but information that could identify James in particular. But Doug slowly falls for her, as she does for him. Ultimately, Doug dreams about leaving his Charlestown life to be with Claire anywhere but there. But Doug has to try and keep his true identity from her, and keep the fact that he is seeing her from his colleagues. But leaving is not as easy as he would like as he and the gang are tasked with a big job by a local gangster named Fergie whether Doug likes it or not. And Adam Frawley, the FBI's lead investigator, comes into evidence that links the foursome to the bank robbery and a subsequent armored car heist, so is on their tail for evidence that will send them away dead or alive.", 
    "genres": "Crime, Drama, Thriller", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "villainous", 
                    "tight"
                ], 
                "role": "Badass Grandpa: The villainous version thereof. Fergie the Florist is in his sixties at the very least, but still has a very tight grip over The Irish Mob.", 
                "id": "BadassGrandpa"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "desperate"
                ], 
                "role": "Hooker with a Heart of Gold: Subverted with Krista Coughlin, who is just as desperate and unbalanced as her clients.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "young"
                ], 
                "role": "Missing Mom: Doug's mother, Doris, left him at a young age. He searched all over town for her, but never found out where she was. Later on, Fergie reveals to Doug that he hooked Doris on drugs, which caused her to overdose, and, eventually, kill herself.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0840361", 
    "poster_url": "TheTown.jpg", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa", 
                "HookerWithAHeartOfGold", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "Unforgiven", 
            "name": "Unforgiven", 
            "poster_url": "Unforgiven.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "HookerWithAHeartOfGold", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "LesMiserables", 
            "name": "Les Misérables"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "NextAvengersHeroesOfTomorrow", 
            "name": "Next Avengers: Heroes of Tomorrow"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Stardust", 
            "name": "Stardust", 
            "poster_url": "Stardust.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }
    ], 
    "id": "TheTown", 
    "name": "The Town"
}