{
    "plot": "There is a dead well-dressed man in a meadow clearing in the hills above a small Vermont town. Captain Albert Wiles, who stumbles across the body and finds by the man's identification that his name is Harry Worp, believes he accidentally shot Harry dead while he was hunting rabbits. Captain Wiles wants to hide the body as he feels it is an easier way to deal with the situation than tell the authorities. While Captain Wiles is in the adjacent forest, he sees other people stumble across Harry, most of whom don't seem to know him or care or notice that he's dead. One person who does see Captain Wiles there is spinster Ivy Gravely, who vows to keep the Captain's secret about Harry. Captain Wiles also Secretly sees a young single mother, Jennifer Rogers, who is the one person who does seem to know Harry and seems happy that he's dead. Later, another person who stumbles across both Harry and Captain Wiles is struggling artist Sam Marlowe, to who Captain Wiles tells the entire story of what he has seen thus far. Over the course of the day, several revelations come to light that question if Captain Wiles actually killed Harry. Sam, Mrs. Rogers, Captain Wiles and Miss Gravely's individual and collective actions in the matter of Harry take into account friendship, self-preservation, the path of least resistance, love and a lot of realizations about what their past actions will mean. Their work may all be for naught if Deputy Sheriff Calvin Wiggs, the closest thing to law enforcement in their town, finds out about Harry.", 
    "genres": "Comedy, Mystery", 
    "release_year": "1955", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Maiden Aunt: Ivy Gravely", 
                "id": "MaidenAunt"
            }
        ]
    }, 
    "imdbid": "tt0048750", 
    "poster_url": "TheTroubleWithHarry.jpg", 
    "similar": [
        {
            "shared": [
                "MaidenAunt"
            ], 
            "shared_count": 1, 
            "id": "AuntieMame", 
            "name": "Auntie Mame", 
            "poster_url": "AuntieMame.jpg"
        }, 
        {
            "shared": [
                "MaidenAunt"
            ], 
            "shared_count": 1, 
            "id": "Hausu", 
            "name": "Hausu"
        }, 
        {
            "shared": [
                "MaidenAunt"
            ], 
            "shared_count": 1, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }, 
        {
            "shared": [
                "MaidenAunt"
            ], 
            "shared_count": 1, 
            "id": "TheMiracleWorker", 
            "name": "The Miracle Worker", 
            "poster_url": "TheMiracleWorker.jpg"
        }, 
        {
            "shared": [
                "MaidenAunt"
            ], 
            "shared_count": 1, 
            "id": "TheHouseOfTheSpirits", 
            "name": "The House of the Spirits", 
            "poster_url": "TheHouseOfTheSpirits.jpg"
        }
    ], 
    "id": "TheTroubleWithHarry", 
    "name": "The Trouble with Harry"
}