{
    "plot": "Ex-Special Forces operator Frank Martin lives what seems to be a quiet life along the French Mediterranean, hiring himself out as a mercenary \"transporter\" who moves goods--human or otherwise--from one place to another. No questions asked. Carrying out mysterious and sometimes dangerous tasks in his tricked-out BMW, Frank adheres to a strict set of rules, which he never breaks. Rule One: Never change the deal. Rule Two: No names--Frank doesn't want to know whom he's working for, or what he's transporting. Rule Three: never look in the package. Frank's newest transport seems no different from the countless ones he's done in the past. He's been hired by an American known only as \"Wall Street\" to make a delivery; but when Frank stops along the route, he notices his package is moving. Violating Rule Three, Frank looks inside the bag, finding its contents to be a beautiful, gagged woman. Frank's steadfast adherence to his other two rules--which make up his basic code of survival--also quickly fails, hurtling him and his new companion on a road leading to shocking secrets, deadly complications, and the last thing that Frank ever expected to come to believe: that rules are made to be broken.", 
    "genres": "Action, Crime, Thriller", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Agent Peacock: Wall Street.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [
                    "first", 
                    "enormous", 
                    "complete"
                ], 
                "role": "Downplayed in the first film: One of the villains is an enormous guy complete with Beard of Evil, but is only mildly harder for Frank to defeat than the others.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "situational", 
                    "Italian", 
                    "white"
                ], 
                "role": "Chillini: A situational example-he's an Italian man in a white suit in a movie where the villains are drug dealers. Yep, he's a villain.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [
                    "few", 
                    "soft", 
                    "soft", 
                    "unsentimental", 
                    "sensitive"
                ], 
                "role": "Papa Wolf: Transporter 2 is one of the few times you'll ever get to see Jason Statham showing a soft (well, as soft as an unsentimental hardass like Statham can be) and sensitive side; specifically, his kindness towards children.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "second"
                ], 
                "role": "The second movie has a Scary Black Man who's probably the hardest opponent Frank has to contend with.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed", 
                    "fresh"
                ], 
                "role": "Sharp-Dressed Man: Frank. Lampshaded in scenes where he beats up a bunch of mooks, then gets a fresh suit out of his car.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: In 3 Valentina keeps a sullen silence towards Frank until he takes off his shirt to fight a gang of hoods. Later she threatens to throw his car keys off the cliff unless he strips for her again. He does.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "first", 
                    "much", 
                    "nasty"
                ], 
                "role": "Darren \"Wall Street\" Bettencourt of The Transporter spends his first appearance trying to feel Frank up, while talking about how much \"I like him.\" He's got the limp wrists, the Large Ham gestures, the pretty boy look, and the mincing. And then he reveals that he's actually The Dragon and a fairly nasty Blood Knight who wants to fight Frank to the death. Anyone else see that coming?", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Sissy Villain: Wall Street, with his exaggerated gestures, and feeling up of Frank.", 
                "id": "SissyVillain"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Lola◊"
                ], 
                "role": "Blondes are Evil: Lola◊", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [], 
                "role": "In the opening of Transporter 2, Frank is unsuccessfully carjacked by a Zettai Ryouiki girl in a pleated tartan skirt. After wiping the floor with her carjacking gang, he suggests she's got some homework to do. She runs off.", 
                "id": "CatholicSchoolGirlsRule"
            }, 
            {
                "adjectives": [], 
                "role": "Lola from the The Transporter 2, could also double as Psycho for Hire.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "In The Transporter,  this turns out to be what is being transported.", 
                "id": "GirlInABox"
            }, 
            {
                "adjectives": [
                    "dual-wielded", 
                    "full-auto", 
                    "many", 
                    "black", 
                    "medical"
                ], 
                "role": "Ms. Fanservice: What doesn't Lola cater for? Gun Porn (is dual-wielded, full-auto silenced Glocks with Laser Sights enough for you?), Shameless Fanservice Girl, Excessive Evil Eyeshadow, Tattooed Crook (on her inner thigh, no less) Combat Stilettos, many a Lingerie Scene (with black garters and Stocking Filler), Sexy Coat Flashing, Hello, Nurse! (hello medical receptionist), Sexy Soaked Shirt (gets wet in clothes in the fire sprinklers) and Sexy Backless Outfit.", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0293662", 
    "poster_url": "TheTransporter.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "CatholicSchoolGirlsRule", 
                "SissyVillain", 
                "ScaryBlackMan", 
                "AgentPeacock", 
                "BeardOfEvil", 
                "GirlInABox"
            ], 
            "shared_count": 7, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "SissyVillain", 
                "BeardOfEvil", 
                "ScaryBlackMan", 
                "DarkActionGirl"
            ], 
            "shared_count": 5, 
            "id": "TheLionKing", 
            "name": "The Lion King", 
            "poster_url": "TheLionKing.jpg"
        }, 
        {
            "shared": [
                "CatholicSchoolGirlsRule", 
                "BlondesAreEvil", 
                "BeardOfEvil", 
                "ScaryBlackMan", 
                "DarkActionGirl"
            ], 
            "shared_count": 5, 
            "id": "KillBill", 
            "name": "Kill Bill", 
            "poster_url": "KillBill.jpg"
        }, 
        {
            "shared": [
                "GirlInABox", 
                "MsFanservice", 
                "ScaryBlackMan", 
                "ManInWhite", 
                "AgentPeacock"
            ], 
            "shared_count": 5, 
            "id": "DjangoUnchained", 
            "name": "Django Unchained", 
            "poster_url": "DjangoUnchained.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "SissyVillain", 
                "ShirtlessScene", 
                "MsFanservice"
            ], 
            "shared_count": 4, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "TheTransporter", 
    "name": "The Transporter"
}