{
    "plot": "In August, 1939, a worker goes into labor while working in a slaughterhouse and dies after a complicated labor, though the deformed child survives. The possibly orphaned baby is dumped in a garbage container and found by a beggar later, who brings him home. Along the years, the mentally retarded and disturbed boy called Thomas is raised by the Hewitt family in spite of having psychological problems as well as suffering from an unnamed skin disorder, later working in a meat packing plant. In July, 1969, when the facility is closed, the inhabitants move to other places, but the deformed, mentally childlike Thomas flies into a rage after being insulted and kills the foreman. His deranged brother (considered his uncle due to their age difference) executes the sheriff that is going to arrest Thomas, and assumes his identity, wearing his clothes,driving his car though the roads in Texas and entitling himself as Sheriff Hoyt. Meanwhile, the brothers Eric and Dean are traveling in a Jeep with their girlfriends Christie and Bailey, Eric to serve in Vietnam and Dean escaping to Mexico. When the group has a car accident, Hoyt arrests Eric, Dean and Bailey and brings them to his house. Christie follows them trying to rescue the trio, trapped in the house of sadistic and insane cannibals, in a trip of horror and gore.", 
    "genres": "Horror", 
    "release_year": "2006", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Biker Babe: Alex.", 
                "id": "BikerBabe"
            }, 
            {
                "adjectives": [
                    "Final"
                ], 
                "role": "Final Girl: Chrissie.  Subverted in that she dies as well.", 
                "id": "FinalGirl"
            }
        ]
    }, 
    "imdbid": "tt0420294", 
    "poster_url": "TheTexasChainsawMassacreTheBeginning.jpg", 
    "similar": [
        {
            "shared": [
                "BikerBabe"
            ], 
            "shared_count": 1, 
            "id": "SkyCaptainAndTheWorldOfTomorrow", 
            "name": "Sky Captain and the World of Tomorrow", 
            "poster_url": "SkyCaptainAndTheWorldOfTomorrow.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "DevilsPrey", 
            "name": "Devil's Prey", 
            "poster_url": "DevilsPrey.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "Suspiria", 
            "name": "Suspiria", 
            "poster_url": "Suspiria.jpg"
        }, 
        {
            "shared": [
                "BikerBabe"
            ], 
            "shared_count": 1, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "YoureNext", 
            "name": "You're Next", 
            "poster_url": "YoureNext.jpg"
        }
    ], 
    "id": "TheTexasChainsawMassacreTheBeginning", 
    "name": "The Texas Chainsaw Massacre: The Beginning"
}