{
    "plot": "Self-made billionaire Thomas Crown is bored of being able to buy everything he desires. Being irresistible to women, he also does not feel any challenge in that area. But there are a few things even he can't get, therefore Thomas Crown has a seldom hobby: He steals priceless masterpieces of Art. After the theft of a famous painting from Claude Monet, the only person suspecting Thomas Crown is Catherine Banning. Her job is to get the picture back, no matter how she accomplishes her mission. Unfortunately, Catherine gets involved too deeply with Thomas to keep a professional distance to the case. Fortunately, Thomas seems to fall for her, too.", 
    "genres": "Crime, Romance, Thriller", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "original"
                ], 
                "role": "Gentleman Thief: Crown. This is more of a remake trait; in the original, he was merely bored.", 
                "id": "GentlemanThief"
            }, 
            {
                "adjectives": [
                    "literal", 
                    "final", 
                    "original"
                ], 
                "role": "Pierce Brosnan plays a millionaire trying to be a Gentleman Thief in The Thomas Crown Affair. \"It's just a game, love; it's just a game.\"\n Complete with a literal calling card: a pencil with the name of his firm left plainly at the scene of the final caper!\n And, of course, the original 1968 film starring Steve McQueen.", 
                "id": "GentlemanThief"
            }
        ]
    }, 
    "imdbid": "tt0155267", 
    "poster_url": "TheThomasCrownAffair.jpg", 
    "similar": [
        {
            "shared": [
                "GentlemanThief"
            ], 
            "shared_count": 1, 
            "id": "Popeye", 
            "name": "Popeye", 
            "poster_url": "Popeye.jpg"
        }, 
        {
            "shared": [
                "GentlemanThief"
            ], 
            "shared_count": 1, 
            "id": "TheScore", 
            "name": "The Score", 
            "poster_url": "TheScore.jpg"
        }, 
        {
            "shared": [
                "GentlemanThief"
            ], 
            "shared_count": 1, 
            "id": "TheGreatMuppetCaper", 
            "name": "The Great Muppet Caper", 
            "poster_url": "TheGreatMuppetCaper.jpg"
        }, 
        {
            "shared": [
                "GentlemanThief"
            ], 
            "shared_count": 1, 
            "id": "Fantomas", 
            "name": "Fantômas"
        }, 
        {
            "shared": [
                "GentlemanThief"
            ], 
            "shared_count": 1, 
            "id": "GrandHotel", 
            "name": "Grand Hotel", 
            "poster_url": "GrandHotel.jpg"
        }
    ], 
    "id": "TheThomasCrownAffair", 
    "name": "The Thomas Crown Affair"
}