{
    "plot": "After failing in a scheme to steal Leonardo Da Vinci's airship blueprints, the Musketeers are disbanded by Cardinal Richelieu leaving Athos, Porthos and Aramis on the streets of Paris. In the meantime, the young, reckless and ambitious D'Artagnan has set off from Gascony with dreams of becoming a musketeer himself, not realizing that they have been disbanded. In no time, D'Artagnan manages to offend Athos, Porthos and Aramis on different occasions and challenges them all to duels. However before the duels can take place they are attacked by guards, trying to arrest them for illegal dueling. The ex-musketeers and D'Artagnan fight off the soldiers, leading to the four men becoming a band with the motto of \"All for one, and one for all\". Count Richelieu is not only determined to be rid of the musketeers, but also schemes with Athos' former lover Milady to undermine the reign of King Louis and his wife. The musketeers and D'Artagnan are determined to save the royal family and France itself.", 
    "genres": "Action, Adventure, Romance", 
    "release_year": "2011", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "d'Artagnan", 
                    "d'Artagnan", 
                    "large"
                ], 
                "role": "In The Three Musketeers (1973), Raquel Welch's character Constance Bonacieux, d'Artagnan's sweetheart. If it could be tripped over, knocked over, or dropped, Constance would do it. At one point, d'Artagnan hears the crash of a large potted plant falling off a balcony, looks and sees a lady standing on the balcony, and says with satisfaction, \"That has to be Constance.\" It is.", 
                "id": "CuteClumsyGirl"
            }
        ]
    }, 
    "imdbid": "tt1509767", 
    "poster_url": "TheThreeMusketeers1973.jpg", 
    "similar": [
        {
            "shared": [
                "CuteClumsyGirl"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "CuteClumsyGirl"
            ], 
            "shared_count": 1, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "CuteClumsyGirl"
            ], 
            "shared_count": 1, 
            "id": "BatmanMysteryOfTheBatwoman", 
            "name": "Batman: Mystery of the Batwoman", 
            "poster_url": "BatmanMysteryOfTheBatwoman.jpg"
        }, 
        {
            "shared": [
                "CuteClumsyGirl"
            ], 
            "shared_count": 1, 
            "id": "TheWonderfulWizardOfOz", 
            "name": "The Wonderful Wizard of Oz", 
            "poster_url": "TheWonderfulWizardOfOz.jpg"
        }, 
        {
            "shared": [
                "CuteClumsyGirl"
            ], 
            "shared_count": 1, 
            "id": "HighStakes", 
            "name": "High Stakes", 
            "poster_url": "HighStakes.jpg"
        }
    ], 
    "id": "TheThreeMusketeers1973", 
    "name": "The Three Musketeers "
}