{
    "plot": "Ek Villain movie is based on the character Guru who is quiet, tough and ruthless boy, working for a politician, Prahlad. A dark past refuses to let Guru sleep at night until he meets a girl, Aisha. He falls in love with her, his life changes and he convinces Aisha to get married to him. Guru even quits his job and moves from Goa to Mumbai to make a new beginning with Aisha. Just when things seem perfect, she falls prey to an attack. ADVERTISEMENT Devastated, Guru starts hunting the miscreant and is shocked to learn of his seemingly innocuous and simple identity. Something is amiss and Guru is unable to place a finger on the precise problem. Who is the real assailant? Does Guru succeed in getting even with the assailant? And what is the motive behind her killing? The plot thickens as the astonishing mystery unveils and new realizations come to the forefront.", 
    "genres": "Action, Crime, Drama", 
    "release_year": "2014", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "bad-guy-in-a-black-hat"
                ], 
                "role": "Cactus Jack, Kirk Douglas' character in the 1979 Western spoof The Villain uses the personality characteristics of this trope, but the costume conventions of the bad-guy-in-a-black-hat from Westerns.", 
                "id": "DastardlyWhiplash"
            }
        ]
    }, 
    "imdbid": "tt3175038", 
    "poster_url": "TheVillain.jpg", 
    "similar": [
        {
            "shared": [
                "DastardlyWhiplash"
            ], 
            "shared_count": 1, 
            "id": "Fearless", 
            "name": "Fearless", 
            "poster_url": "Fearless.jpg"
        }, 
        {
            "shared": [
                "DastardlyWhiplash"
            ], 
            "shared_count": 1, 
            "id": "ptitleqpy4opk0", 
            "name": "Mr. Bug Goes To Town", 
            "poster_url": "ptitleqpy4opk0.jpg"
        }, 
        {
            "shared": [
                "DastardlyWhiplash"
            ], 
            "shared_count": 1, 
            "id": "OswaldTheLuckyRabbit", 
            "name": "Oswald the Lucky Rabbit"
        }, 
        {
            "shared": [
                "DastardlyWhiplash"
            ], 
            "shared_count": 1, 
            "id": "TheGreatRace", 
            "name": "The Great Race", 
            "poster_url": "TheGreatRace.jpg"
        }, 
        {
            "shared": [
                "DastardlyWhiplash"
            ], 
            "shared_count": 1, 
            "id": "PetesDragon", 
            "name": "Pete's Dragon", 
            "poster_url": "PetesDragon.jpg"
        }
    ], 
    "id": "TheVillain", 
    "name": "The Villain"
}