{
    "plot": "All three previously married but now single, best friends sculptress Alex Medford, cellist Jane Spofford and writer Sukie Ridgemont are feeling emotionally and sexually repressed, in large part due to the traditional mores overriding their small New England coastal town of Eastwick. After their latest conversation lamenting about the lack of suitable men in Eastwick and describing the qualities they are looking for in a man, mysterious Daryl Van Horne and his equally mysterious butler Fidel arrive in town. Despite being vulgar, crude, brazen and not particularly handsome, Daryl manages to be able to tap into the innermost emotions of the three friends, and as such manages to seduce each. In turn, the three women blossom emotionally and sexually. After an incident involving one of the town's leading citizens, the ultra conservative Felicia Alden, the three women begin to understand how and why Daryl is able to mesmerize them so fully. The three decide to experiment with some powers learned indirectly from Daryl so that they can hopefully regain control of their own lives.", 
    "genres": "Comedy, Fantasy, Horror", 
    "release_year": "1987", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Clyde from The Witches of Eastwick. Ends up killing her with a frying pan. With her dying breath, she jams his tie in the garbage disposal and hits on.", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [], 
                "role": "Henpecked Husband: Clyde", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [
                    "attractive", 
                    "unattractive", 
                    "gorgeous", 
                    "little", 
                    "supernatural", 
                    "clear", 
                    "old", 
                    "charismatic"
                ], 
                "role": "Kavorka Man: Played with: Daryl is not particularly physically attractive (and Alex tells him at some length exactly how unattractive he is,) yet he ends up seducing three absolutely gorgeous women with little apparent effort. However, even ignoring the fact that he might have used his supernatural powers to assist him, it is clear even before we actually meet him that he's not using his looks; the old woman in a shop describes him \"as not handsome exactly, but - riveting. Yes, that's the word, I was riveted\" and Jack Nicholson is charismatic enough to make it work.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [], 
                "role": "Sexy Man, Instant Harem: Darkly deconstructed as the man in question is a Yandere Satan.", 
                "id": "SexyManInstantHarem"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Gossipy Hens: They do a lot of clucking about all the cavorting that goes on at Darryl's mansion.", 
                "id": "GossipyHens"
            }, 
            {
                "adjectives": [
                    "Hot", 
                    "eponymous"
                ], 
                "role": "Hot Witch: The eponymous witches, played by Michelle Pfeiffer, Cher and Susan Sarandon.", 
                "id": "HotWitch"
            }, 
            {
                "adjectives": [], 
                "role": "My Beloved Smother: Alexandra to Marcy.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "Rich"
                ], 
                "role": "Rich Bitch: Jane", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [
                    "husbands/significant"
                ], 
                "role": "In John Updike's The Witches of Eastwick, the women of the village of Eastwick only gain powers after their husbands/significant others either die or divorce them.", 
                "id": "WidowWitch"
            }, 
            {
                "adjectives": [
                    "last"
                ], 
                "role": "Widow Witch: Taken more literally, as all are elderly and have lost the husbands they conjured for themselves at the end the last book.", 
                "id": "WidowWitch"
            }
        ]
    }, 
    "imdbid": "tt0094332", 
    "poster_url": "TheWitchesOfEastwick.jpg", 
    "similar": [
        {
            "shared": [
                "WidowWitch", 
                "HotWitch", 
                "GossipyHens"
            ], 
            "shared_count": 3, 
            "id": "PracticalMagic", 
            "name": "Practical Magic", 
            "poster_url": "PracticalMagic.jpg"
        }, 
        {
            "shared": [
                "WidowWitch", 
                "HotWitch", 
                "GossipyHens"
            ], 
            "shared_count": 3, 
            "id": "EvesBayou", 
            "name": "Eve's Bayou", 
            "poster_url": "EvesBayou.jpg"
        }, 
        {
            "shared": [
                "GossipyHens", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "PeytonPlace", 
            "name": "Peyton Place", 
            "poster_url": "PeytonPlace.jpg"
        }, 
        {
            "shared": [
                "KavorkaMan", 
                "RichBitch"
            ], 
            "shared_count": 2, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "HenpeckedHusband", 
                "RichBitch"
            ], 
            "shared_count": 2, 
            "id": "TheFamilyThatPreys", 
            "name": "The Family That Preys", 
            "poster_url": "TheFamilyThatPreys.jpg"
        }
    ], 
    "id": "TheWitchesOfEastwick", 
    "name": "The Witches of Eastwick"
}