{
    "plot": "Chased off by the antics of Hank the Mule, Dorothy ends up in her cornfield, where she realizes her family's Scarecrow is alive. She helps him down and he takes a tumble on the turnstyle. A cyclone soon arrives and leaves Dorothy, Scarecrow, Toto and Hank spinning around on a haystack, with Imogene the Cow flying soon after. Soon after their arrival, the Wizard of Oz issues a public decree that he is a humbug, to make sure no one ever finds out. Glinda pops up out of the background and transforms Toto into a man in a bulldog suit to serve as a better protector for Dorothy. Then they encounter the Tin Woodman, the Cowardly Lion, and Eureka. Nevertheless, she is captured by Momba, the Wicked Witch of the West (suggesting Baum thought the other witches were Mombe, Mombo, and Mombu, in keeping with the council in _Queen Zixi of Ix_) and her flying lizards and soldiers. Dorothy defeats Momba, and they arrive at the Emerald City just in time for the Wizard's going away party.", 
    "genres": "Adventure, Fantasy, Short", 
    "release_year": "1910", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "matriarchy", 
                    "sure"
                ], 
                "role": "Surprisingly enough, the Nome Kingdom in The Wonderful Wizard of Oz, making this Older Than They Think. The Nomes are the sworn enemies of Oz (which is a matriarchy), and the Nomes make sure that anything feminine is verboten.", 
                "id": "NoWomansLand"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "clumsy", 
                    "straight", 
                    "own"
                ], 
                "role": "The Scarecrow from The Wonderful Wizard of Oz' is very clumsy and often walks straight into potholes, but luckily he doesn't feel anything and instead laughs with the others or Dorothy at his own clumsiness or mishaps.", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Emily \"Auntie Em\" Gale of The Wonderful Wizard of Oz book.", 
                "id": "DeterminedHomesteadersWife"
            }, 
            {
                "adjectives": [
                    "resourceful", 
                    "willing"
                ], 
                "role": "The Wonderful Wizard of Oz features Dorothy, a resourceful, smart little girl who is willing to slap lions in the face and learns not to be afraif by the Wicked Witch of the West.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "pound-for-pound", 
                    "overall", 
                    "hands-down", 
                    "evil", 
                    "full-fledged", 
                    "former", 
                    "green", 
                    "stereotypical", 
                    "strong", 
                    "hooked"
                ], 
                "role": "The Wonderful Wizard of Oz, where the witches are actually named \"Wicked Witch\" (of the East and West).\n Countless reviews and analyses of The Film of the Book have said that, pound-for-pound, The Wicked Witch of the West is overall the hands-down most evil character to have ever been portrayed in film. It's also the Trope Codifier for witches being green-skinned.\n The sequel The Marvelous Land of Oz introduced Mombi, the mildly wicked witch who brought Jack Pumpkinhead to life with her Powder of Life. Later in the series, in the Thompson novels, Mombi becomes a full-fledged Wicked Witch, the former Wicked Witch of the North.\n Gregory Maguire's novel Wicked is a revisionist look at the characters and the land of Oz. The story centers on a green girl named Elphaba who grows up to be the Wicked Witch of the West. Over the course of the book, Elphaba gradually acquires the stereotypical attributes of this trope (except the ugliness- while never pretty per se, she's repeatedly described as having strong features that could easily tip into the stereotype, including a hooked nose, but they come together strikingly on her).", 
                "id": "WickedWitch"
            }, 
            {
                "adjectives": [
                    "radical", 
                    "good"
                ], 
                "role": "Wicked Witch: Obviously, the Wicked Witches of the West and East. The Good Witches of the North and South are an inversion (and a rather radical one too, as the notion of a good witch was alien at the time).", 
                "id": "WickedWitch"
            }
        ]
    }, 
    "imdbid": "tt0001463", 
    "poster_url": "TheWonderfulWizardOfOz.jpg", 
    "similar": [
        {
            "shared": [
                "CuteClumsyGirl", 
                "PluckyGirl", 
                "WickedWitch"
            ], 
            "shared_count": 3, 
            "id": "Tangled", 
            "name": "Tangled", 
            "poster_url": "Tangled.png"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "NoWomansLand"
            ], 
            "shared_count": 2, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CuteClumsyGirl", 
                "PluckyGirl"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "WickedWitch"
            ], 
            "shared_count": 2, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "CuteClumsyGirl", 
                "WickedWitch"
            ], 
            "shared_count": 2, 
            "id": "TheWizardOfOz", 
            "name": "The Wizard of Oz", 
            "poster_url": "TheWizardOfOz.jpg"
        }
    ], 
    "id": "TheWonderfulWizardOfOz", 
    "name": "The Wonderful Wizard of Oz"
}