{
    "plot": "In London, lawyer Arthur Kipps still grieves the death of his beloved wife Stella on the delivery of their son Joseph four years ago. His employer gives him a last chance to keep his job, and he is assigned to travel to the remote village of Cryphin Gifford to examine the documentation of the Eel Marsh House that belonged to the recently deceased Mrs. Drablow. Arthur befriends Daily on the train and the man offers a ride to him to the Gifford Arms inn. Arthur has a cold reception and the owner of the inn tells that he did not receive the request of reservation and there is no available room. The next morning, Arthur meets solicitor Jerome who advises him to return to London. However, Arthur goes to the isolated manor and soon he finds that Eel Marsh House is haunted by the vengeful ghost of a woman dressed in black. He also learns that the woman lost her son drowned in the marsh and she seeks revenge, taking the children of the scared locals.", 
    "genres": "Drama, Horror, Thriller", 
    "release_year": "2012", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Simultaneous"
                ], 
                "role": "Girl in the Tower: Simultaneous use and inversion. The solicitor's daughter is locked in the office basement to protect her from Jennet. It fails horribly.", 
                "id": "GirlInTheTower"
            }, 
            {
                "adjectives": [], 
                "role": "The title character of The Woman in Black.", 
                "id": "WomanInBlack"
            }
        ]
    }, 
    "imdbid": "tt1596365", 
    "poster_url": "TheWomanInBlack.jpg", 
    "similar": [
        {
            "shared": [
                "WomanInBlack"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack"
            ], 
            "shared_count": 1, 
            "id": "DevilsPrey", 
            "name": "Devil's Prey", 
            "poster_url": "DevilsPrey.jpg"
        }, 
        {
            "shared": [
                "GirlInTheTower"
            ], 
            "shared_count": 1, 
            "id": "TheVikings", 
            "name": "The Vikings", 
            "poster_url": "TheVikings.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack"
            ], 
            "shared_count": 1, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack"
            ], 
            "shared_count": 1, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "TheWomanInBlack", 
    "name": "The Woman in Black"
}