{
    "plot": "Innocent and naive Letty Mason moves from her Virginia home to Sweet Water on the western prairies to live on the ranch of her cousin Beverly, his wife Cora and their three children. Letty quickly learns how inhospitable the environment in Sweet Water is, the most obvious item being the incessant wind. But equally inhospitable are the unrefined way the people in Sweet Water live to which she is unaccustomed, and Cora, who believes Letty has come to steal Beverly away from her. As such, Cora orders Letty out of her and Bev's house. With no money, Letty is forced to accept one of the marriage proposal she receives, the lesser evil being that from Bev and Cora's ranching neighbor, Lige Hightower, a man who she does not love. Despite a less than harmonious start, Letty, in part due to her isolation as she is more often than not forced to stay inside due to the wind, begins to have affection for Lige, who wants to do right by her, and who promises to send her back to Virginia when he is financial able. But a visitor who takes refuge in their house away from the wind may threaten Letty's ultimate happiness.", 
    "genres": "Drama, Romance, Western", 
    "release_year": "1928", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Determined Homesteader's Wife: Cora.", 
                "id": "DeterminedHomesteadersWife"
            }
        ]
    }, 
    "imdbid": "tt0019585", 
    "poster_url": "TheWind.jpg", 
    "similar": [
        {
            "shared": [
                "DeterminedHomesteadersWife"
            ], 
            "shared_count": 1, 
            "id": "TheWonderfulWizardOfOz", 
            "name": "The Wonderful Wizard of Oz", 
            "poster_url": "TheWonderfulWizardOfOz.jpg"
        }, 
        {
            "shared": [
                "DeterminedHomesteadersWife"
            ], 
            "shared_count": 1, 
            "id": "OldYeller", 
            "name": "Old Yeller", 
            "poster_url": "OldYeller.jpg"
        }, 
        {
            "shared": [
                "DeterminedHomesteadersWife"
            ], 
            "shared_count": 1, 
            "id": "McLintock", 
            "name": "McLintock!", 
            "poster_url": "McLintock.jpg"
        }, 
        {
            "shared": [
                "DeterminedHomesteadersWife"
            ], 
            "shared_count": 1, 
            "id": "Dor", 
            "name": "Dor", 
            "poster_url": "Dor.jpg"
        }, 
        {
            "shared": [
                "DeterminedHomesteadersWife"
            ], 
            "shared_count": 1, 
            "id": "RomancingTheStone", 
            "name": "Romancing the Stone", 
            "poster_url": "RomancingTheStone.jpg"
        }
    ], 
    "id": "TheWind", 
    "name": "The Wind"
}