{
    "plot": "Based on a very clever comedy by Claire Booth, wife of Time Publisher Henry Luce and later Ambassador to Italy. One of the surprises was an all-woman cast, novel in the 1930's. And although there were no men in the cast, most of the dialog was about them. The story is rather thin and depended on the fact that divorce, in the 1930's, was not only difficult but almost impossible in New York. Mrs. Stephen Haynes learns that her husband is seeing a salesgirl at Saks, and reluctantly divorces him, abetted by her friends, all of whom have romantic problems of their own. In the 1930's New York women who could afford it went to Nevada, where residency could be established quickly and divorce was relatively easy. The 1939 film, starring Norma Shearer, Paulette Goddard, Rosalind Russell, and Joan Crawford, was a hit. This one, with an even better looking cast, is definitely not, largely because someone tried to move a 1930's situation comedy into the present.", 
    "genres": "Comedy, Drama", 
    "release_year": "2008", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "significant"
                ], 
                "role": "The corset model in The Women. Though one of her lines is actually thematically significant, even then she's obviously there to show off the kind of body that doesn't really need a corset. IMDb notes that Judith Allen, who played her (uncredited) in the 1939 film version, had previously done modeling under the name Mari Colman.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [], 
                "role": "Gossipy Hens: Sylvia and the manicurist, mostly.", 
                "id": "GossipyHens"
            }, 
            {
                "adjectives": [], 
                "role": "Sylvia and the manicurist in The Women.", 
                "id": "GossipyHens"
            }, 
            {
                "adjectives": [], 
                "role": "The Countess de Lage in The Women.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "wistful", 
                    "l'amour"
                ], 
                "role": "The Women has the Countess de Lage, who tends to get wistful about \"l'amour\" over drinks after having divorced four husbands. \"Get me a bromide — and put some gin in it!\"", 
                "id": "LadyDrunk"
            }, 
            {
                "adjectives": [
                    "bad", 
                    "naive"
                ], 
                "role": "Spoiled Sweet: An adult version, although Mary could be considered a subversion since she's not a bad person, though she is naive when the movie begins.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0430770", 
    "poster_url": "TheWomen.jpg", 
    "similar": [
        {
            "shared": [
                "SpoiledSweet", 
                "GrandeDame", 
                "LadyDrunk", 
                "GossipyHens"
            ], 
            "shared_count": 4, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "GossipyHens"
            ], 
            "shared_count": 2, 
            "id": "FerrisBuellersDayOff", 
            "name": "Ferris Bueller's Day Off", 
            "poster_url": "FerrisBuellersDayOff.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "FanserviceExtra"
            ], 
            "shared_count": 2, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "GrandeDame"
            ], 
            "shared_count": 2, 
            "id": "EverAfter", 
            "name": "Ever After"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "GrandeDame"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }
    ], 
    "id": "TheWomen", 
    "name": "The Women"
}