{
    "plot": "In modern day Japan, Wolverine is out of his depth in an unknown world as he faces his ultimate nemesis in a life-or-death battle that will leave him forever changed. Vulnerable for the first time and pushed to his physical and emotional limits, he confronts not only lethal samurai steel but also his inner struggle against his own immortality, emerging more powerful than we have ever seen him before.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Shingen Yashida to Mariko in The Wolverine", 
                "id": "ArchnemesisDad"
            }, 
            {
                "adjectives": [], 
                "role": "Yukio to the Yashida Clan (more specifically, to Mariko) in The Wolverine.  By the end of the movie, she's also one for Wolverine.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "likely", 
                    "Last"
                ], 
                "role": "Beard of Sorrow: Logan starts out with a shaggy one, likely resulting from the events of The Last Stand.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "likely", 
                    "Last"
                ], 
                "role": "In The Wolverine Logan starts out with a shaggy one, likely resulting from the events of The Last Stand.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [], 
                "role": "In The Wolverine, Noburo Mori runs from conflict, especially in the face of Wolverine.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "nice", 
                    "underwear"
                ], 
                "role": "Mr. Fanservice: Logan — the bathing scene. Noburo Mori is in nice shape and gets an underwear scene.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "A benign example with Ichirō Yashida in The Wolverine, and his death triggers the problems. He turns out to be a Evil Patriarch", 
                "id": "ThePatriarch"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "later", 
                    "proficient", 
                    "softhanded", 
                    "martial"
                ], 
                "role": "Action Girl: Yukio introduces herself in a bar brawl and proves competent enough to protect Logan. And later helps him fight Viper. Mariko is proficient in softhanded martial arts and an excellent knife-thrower, helping to kill Silver Samurai.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Mariko in The Wolverine, who got in a few hits on  her kidnappers and even one of Hanada's assassins in a chokehold.\n Not to mention she saves Logan from Silver Samurai.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "funeral", 
                    "few", 
                    "knife-throwing"
                ], 
                "role": "Damsel out of Distress: When Mariko is snagged by thugs at her grandfather's funeral, she was well on her way toward escaping from them when Logan reached her and finished them off. Also she saves Logan a few times and helps take down Silver Samurai with her knife-throwing skills.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "funeral", 
                    "few", 
                    "knife-throwing"
                ], 
                "role": "In The Wolverine, when Mariko is snagged by thugs at her grandfather's funeral, she was well on her way toward escaping from them when Logan reached her and finished them off. Also she saves Logan a few times and helps take down Silver Samurai with her knife-throwing skills.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "vicious", 
                    "martial"
                ], 
                "role": "Dark Action Girl: Viper is a vicious poisoner and martial artist to the point that even men don't mind fighting her.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "vicious", 
                    "martial"
                ], 
                "role": "Viper from The Wolverine, is a vicious poisoner and martial artist to the point that even men don't mind fighting her.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "considerable"
                ], 
                "role": "Femme Fatale: Viper kills with a kiss... literally. She does know how to use her considerable sexuality as a weapon.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "considerable"
                ], 
                "role": "Viper from The Wolverine, kills with a kiss... literally. She does know how to use her considerable sexuality as a weapon.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "capable", 
                    "feminine"
                ], 
                "role": "Mariko Yashida from The Wolverine is a capable Action Girl and very feminine.", 
                "id": "GirlyBruiser"
            }, 
            {
                "adjectives": [], 
                "role": "Viper according to Logan in The Wolverine, who congratulates Yashida upon finding out she's his oncologist.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [], 
                "role": "Mariko Yashida from The Wolverine has the dignified demeanor of one when she fights.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "nice", 
                    "skin-tight"
                ], 
                "role": "Ms. Fanservice: All of Famke Janssen's cameos show her in very revealing clothing. Viper tends to wear some nice skin-tight outfits.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "sadistic", 
                    "cold", 
                    "old", 
                    "Russian"
                ], 
                "role": "Viper from The Wolverine is sadistic, cold and sexy. Even fitting the old Communist stereotype as the actress is Russian.", 
                "id": "TheBaroness"
            }, 
            {
                "adjectives": [
                    "apparent", 
                    "complete"
                ], 
                "role": "Yukio demonstrates traits of this in The Wolverine, with her tough-as-nails attitude and apparent lack of organization (notice her car is a complete mess when Wolverine arrives, and she doesn't seem bothered in the least with it).", 
                "id": "TheLadette"
            }, 
            {
                "adjectives": [], 
                "role": "Yukio from The Wolverine. Mostly her combat outfits.", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [
                    "'core"
                ], 
                "role": "In The Wolverine, Mariko Yashida is introduced caring for her grandfather in a family compound that values tradition (Yukio changes into a yukata when she arrives, Wolverine passes by a kendo match, etc). She demonstrates the 'core of iron' when targeted by kidnappers  and confronting her evil grandfather", 
                "id": "YamatoNadeshiko"
            }, 
            {
                "adjectives": [
                    "'core"
                ], 
                "role": "Yamato Nadeshiko: Mariko Yashida is introduced caring for her grandfather in a family compound that values tradition (Yukio changes into a yukata when she arrives, Wolverine passes by a kendo match, etc). She demonstrates the 'core of iron' when targeted by kidnappers  and confronting her evil grandfather.", 
                "id": "YamatoNadeshiko"
            }
        ]
    }, 
    "imdbid": "tt1430132", 
    "poster_url": "TheWolverine.jpg", 
    "similar": [
        {
            "shared": [
                "BattleButler", 
                "BeardOfSorrow", 
                "DamselOutOfDistress", 
                "MsFanservice", 
                "DirtyCoward", 
                "BadassDamsel", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 8, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "TheBaroness", 
                "DarkActionGirl", 
                "DirtyCoward", 
                "WomanInBlack", 
                "ArchnemesisDad", 
                "LadyOfWar"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "BattleButler", 
                "FemmeFatale", 
                "TheBaroness", 
                "MrFanservice", 
                "DirtyCoward", 
                "HotScientist"
            ], 
            "shared_count": 6, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "LadyOfWar", 
                "ActionGirl", 
                "DarkActionGirl", 
                "FemmeFatale"
            ], 
            "shared_count": 5, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "LadyOfWar", 
                "MsFanservice", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 5, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "TheWolverine", 
    "name": "The Wolverine"
}