{
    "plot": "\"The Way\" is a powerful and inspirational story about family, friends, and the challenges we face while navigating this ever-changing and complicated world. Martin Sheen plays Tom, an American doctor who comes to St. Jean Pied de Port, France to collect the remains of his adult son (played by Emilio Estevez), killed in the Pyrenees in a storm while walking the Camino de Santiago, also known as The Way of Saint James. Rather than return home, Tom decides to embark on the historical pilgrimage to honor his son's desire to finish the journey. What Tom doesn't plan on is the profound impact the journey will have on him and his \"California Bubble Life\". Inexperienced as a trekker, Tom soon discovers that he will not be alone on this journey. On his journey, Tom meets other pilgrims from around the world, each with their own issues and looking for greater meaning in their lives: a Dutchman (Yorick van Wageningen), a Canadian (Deborah Kara Unger) and an Irish writer ('James Nesbitt'), who is suffering from a bout of writer's block. From the unexpected and, oftentimes, amusing experiences along the way, this unlikely quartet of misfits creates an everlasting bond and Tom begins to learn what it means to be a citizen of the world again. Through Tom's unresolved relationship with his son, he discovers the difference between \"the life we live and the life we choose\".", 
    "genres": "Adventure, Comedy, Drama", 
    "release_year": "2010", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Missing Mom: Tom mentions that his wife's death was the start of his and Daniel's estrangement.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt1441912", 
    "poster_url": "TheWay.jpg", 
    "similar": [
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "IndependenceDay", 
            "name": "Independence Day", 
            "poster_url": "IndependenceDay.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "Epic", 
            "name": "Epic"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "StarTrekInsurrection", 
            "name": "Star Trek: Insurrection", 
            "poster_url": "StarTrekInsurrection.jpg"
        }, 
        {
            "shared": [
                "MissingMom"
            ], 
            "shared_count": 1, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }
    ], 
    "id": "TheWay", 
    "name": "The Way"
}