{
    "plot": "James Bond is back. An oil tycoon is murdered in MI6 and Bond is sent to protect his daughter. Renard, who has a bullet lodged in his brain from a previous agent, is secretly planning the destruction of a pipeline. Bond gains a hand from a research scientist, Dr. Christmas Jones who witnesses the action which happens when Bond meets up with Renard, but Bond becomes suspicious about Elektra King, especially when Bond's boss, M goes missing. Bond must work quickly to prevent Renard from destroying Europe.", 
    "genres": "Action, Adventure, Crime", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Distressed Dude: Bond gets put into a torture machine that slowly strangles him and will break his neck if pulled far enough.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [], 
                "role": "In The World Is Not Enough, Bond gets put into a torture machine that slowly strangles him and will break his neck if pulled far enough.", 
                "id": "DistressedDude"
            }, 
            {
                "adjectives": [
                    "same", 
                    "fanatical", 
                    "same"
                ], 
                "role": "In The World Is Not Enough, Renard holds a scalding hot rock - except he can't feel pain, so it doesn't matter to him. However, at the same time he tells of legends of fanatical monks who would hold those same rocks to prove their devotion.", 
                "id": "MachoMasochism"
            }, 
            {
                "adjectives": [
                    "same", 
                    "fanatical", 
                    "same"
                ], 
                "role": "Macho Masochism: Renard holds a scalding hot rock — except he can't feel pain, so it doesn't matter to him. However, at the same time he tells of legends of fanatical monks who would hold those same rocks to prove their devotion.", 
                "id": "MachoMasochism"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Elektra King in The World Is Not Enough escapes her kidnapper by shooting three men and then proceeds to manipulate her kidnapper into suffering reverse Stockholm syndrome going so far as to even die for her scheme.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "X-Ray"
                ], 
                "role": "The World Is Not Enough. Bond enters The Mafiya casino wearing his X-Ray specs which reveals the lingerie of the casino girls...and the fact that they're carrying guns under their dresses.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [], 
                "role": "Broken Bird: Elektra King. Oddly, also Renard.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [], 
                "role": "Elektra King in The World Is Not Enough escapes her kidnapper by shooting three men and then proceeds to manipulate her kidnapper into suffering Lima Syndrome and going so far as to die for her Evil Plan.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "explosive"
                ], 
                "role": "Dark Action Girl: The \"Cigar Girl\", for her explosive opening sequence.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "one-time", 
                    "current", 
                    "Russian", 
                    "nuclear", 
                    "own"
                ], 
                "role": "Elektra King in the James Bond film The World Is Not Enough, an oil heiress who conspires with the terrorist and her one-time captor (and current lover), Renard, to cause an oil shortage by blowing up a Russian pipeline with a nuclear detonation and thereby substantially increase her own oil holdings. She manipulates Bond, but he ultimately sees beyond her deception and manages to confront her.", 
                "id": "DecoyDamsel"
            }, 
            {
                "adjectives": [
                    "important"
                ], 
                "role": "Femme Fatale: Elektra King. This is important.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "Hot", 
                    "little-known"
                ], 
                "role": "Hot Scientist: Dr Jones seems to be a graduate of that little-known school, The Graduate School Of Hot Babes of which Lara Croft is an alumna.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "twenty-something", 
                    "nuclear", 
                    "large"
                ], 
                "role": "In The World Is Not Enough, this concept is stretched to beyond credibility by introducing Dr. Christmas Jones, a twenty-something nuclear physicist with large breasts. Needless to say, she and Bond end up in bed together.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Crops up in the Bond movies every now and then, Though there's a bit of a subversion in The World Is Not Enough.  Electra may talk a lot about her father, and becomes the owner of his oil company through heritage, but then it turns out that it was her mother's family that built up his wealth in the first place.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "Self-Made"
                ], 
                "role": "Never a Self-Made Woman: Subverted.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Elektra King in The World Is Not Enough.", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [], 
                "role": "The Vamp:  Elektra King.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0143145", 
    "poster_url": "TheWorldIsNotEnough.jpg", 
    "similar": [
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "DarkActionGirl", 
                "FemmeFatale", 
                "HotScientist"
            ], 
            "shared_count": 5, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "BodyguardBabes", 
                "DecoyDamsel", 
                "FemmeFatale", 
                "HotScientist"
            ], 
            "shared_count": 5, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "BodyguardBabes", 
                "DecoyDamsel", 
                "FemmeFatale"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "NeverASelfMadeWoman", 
                "HotScientist"
            ], 
            "shared_count": 4, 
            "id": "TheAmazingSpiderMan", 
            "name": "The Amazing Spider-Man", 
            "poster_url": "TheAmazingSpiderMan.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "NeverASelfMadeWoman", 
                "BodyguardBabes", 
                "DarkActionGirl"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }
    ], 
    "id": "TheWorldIsNotEnough", 
    "name": "The World Is Not Enough"
}