{
    "plot": "Fox Mulder and Dana Scully both worked at the FBI as partners, a bond between them that led to their becoming lovers. But now they're out of the FBI and have begun new careers. Scully works as a staff physician at a Catholic hospital. Her focus these days is on a young boy with an incurable brain disease. Administration wants to give up on him. Scully, who feels a special bond with the boy, does not. Meanwhile, Mulder's focus is on clipping newspaper articles, throwing pencils into his ceiling and writing about the paranormal. Scully and Mulder are brought together as partners again when a special case requires Mulder's expertise and Scully is prevailed upon to convince him to help. The case involves a pedophile priest who claims he is having psychic visions regarding the whereabouts of a missing FBI agent.", 
    "genres": "Drama, Mystery, Sci-Fi", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Beard of Sorrow: Mulder's grown one.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "guilty", 
                    "serial", 
                    "serial", 
                    "bisexual", 
                    "evil", 
                    "psychic", 
                    "repentant", 
                    "own"
                ], 
                "role": "The X-Files: I Want to Believe is guilty of this, with Callum Keith Rennie's serial killer kidnapping young women to build his boyfriend a girl-body. One has to hope that said boyfriend is actually a Transsexual and that said serial killer is actually bisexual because otherwise... well... slight problems might arise in the relationship. Add that to the plot of the evil psychic gay pedophile priest in the movie and it probably should have been called \"The X-Files: I Want to Believe Gay People Are Evil\". At least the pedophile priest seems to be genuinely repentant of his crimes. He did admit to cutting his own balls off after all.", 
                "id": "DepravedHomosexual"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Distressed Dude: Scully had the Distress Ball in the first movie, so it's Mulder's turn now.", 
                "id": "DistressedDude"
            }
        ]
    }, 
    "imdbid": "tt0443701", 
    "poster_url": "TheXFilesIWantToBelieve.jpg", 
    "similar": [
        {
            "shared": [
                "DepravedHomosexual", 
                "DistressedDude"
            ], 
            "shared_count": 2, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "DepravedHomosexual"
            ], 
            "shared_count": 2, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "DistressedDude"
            ], 
            "shared_count": 2, 
            "id": "DieAnotherDay", 
            "name": "Die Another Day", 
            "poster_url": "DieAnotherDay.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "DistressedDude"
            ], 
            "shared_count": 2, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "DepravedHomosexual"
            ], 
            "shared_count": 1, 
            "id": "NoWayOut", 
            "name": "No Way Out", 
            "poster_url": "NoWayOut.jpg"
        }
    ], 
    "id": "TheXFilesIWantToBelieve", 
    "name": "The X-Files: I Want to Believe"
}