{
    "plot": "Dominated by her possessive mother and her bullying consort, Conroy, since childhood, teen-aged Victoria refuses to allow them the power of acting as her regent in the last days of her uncle, William IV's rule. Her German cousin Albert is encouraged to court her for solely political motives but, following her accession at age eighteen, finds he is falling for her and is dismayed at her reliance on trusty Prime Minister Melbourne. Victoria is impressed by Albert's philanthropy which is akin to her own desire to help her subjects. However her loyalty to Melbourne, perceived as a self-seeker, almost causes a constitutional crisis and it is Albert who helps restore her self-confidence. She proposes and they marry, Albert proving himself not only a devoted spouse, prepared to take an assassin's bullet for her, but an agent of much-needed reform, finally endorsed by an admiring Melbourne.", 
    "genres": "Biography, Drama, History", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Cool Old Guy: The Duke of Wellington. A Retired Badass too.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [], 
                "role": "And Bertie offers to become The Wise Prince and share The Chains of Commanding.", 
                "id": "TheWisePrince"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "difficult", 
                    "kindly", 
                    "first"
                ], 
                "role": "Evil Matriarch: The princess has a very difficult relationship with her mother, the Duchess of Kent, who under the influence of Evil Chancellor Sir John Conroy controls the princess's every move and conspires to browbeat her into allowing the Duchess (and consequently Conroy) the regency until well into her adulthood. Upon her accession, Victoria banishes her mother to a far corner of Buckingham Palace and turfs Conroy altogether. Happily, she can rely on the counsel of her kindly aunt, the dowager Queen Adelaide, and eventually thaws slightly to her mother after the birth of her first daughter.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "whole", 
                    "other", 
                    "shot", 
                    "great", 
                    "British", 
                    "other"
                ], 
                "role": "In The Young Victoria, the Queen is pretty much treated as a puppet of her (male) advisers, and when she calls her husband out on undermining her as a queen, the whole movie starts to work against her - all her other advisers want them to reign together, and he is finally shot, causing her to back down. Later on this turns out to be an inversion, as all the men try to play her as a puppet because, ultimately, a great deal of their power rests solely on Victoria liking them. Albert goes behind her back because he feels useless and knows that every iota of his respect in the British court stems from his relationship with Victoria. In the end, the solution isn't for either of them to ignore or manipulate the other, but for Victoria to rule with Albert serving as a trusted, competent advisor, in a partnership that requires both of them.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "Self-Made", 
                    "whole"
                ], 
                "role": "Never a Self-Made Woman: Played subtly at the start, then amped up with the whole \"let him rule with you\" bit.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "Rebellious"
                ], 
                "role": "Rebellious Princess: Victoria fights off the determined attempts of her mother and John Conroy to control her and force her to accept a regency.", 
                "id": "RebelliousPrincess"
            }, 
            {
                "adjectives": [
                    "due"
                ], 
                "role": "The Woman Wearing the Queenly Mask: Victoria muses extensively on how to avoid being controlled or making mistakes due to her youth and inexperience. And Bertie offers to become The Wise Prince and share The Chains of Commanding.", 
                "id": "TheWomanWearingTheQueenlyMask"
            }
        ]
    }, 
    "imdbid": "tt0962736", 
    "poster_url": "TheYoungVictoria.jpg", 
    "similar": [
        {
            "shared": [
                "RebelliousPrincess", 
                "NeverASelfMadeWoman", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "TheWomanWearingTheQueenlyMask", 
                "RebelliousPrincess"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "NeverASelfMadeWoman", 
                "CoolOldGuy"
            ], 
            "shared_count": 2, 
            "id": "WildWildWest", 
            "name": "Wild Wild West", 
            "poster_url": "WildWildWest.jpg"
        }, 
        {
            "shared": [
                "TheWomanWearingTheQueenlyMask", 
                "NeverASelfMadeWoman"
            ], 
            "shared_count": 2, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }
    ], 
    "id": "TheYoungVictoria", 
    "name": "The Young Victoria"
}