{
    "plot": "Cheyenne, a wealthy former rock star (Penn), now bored and jaded in his retirement embarks on a quest to find his father's persecutor, an ex-Nazi war criminal now hiding out in the U.S. Learning his father is close to death, he travels to New York in the hope of being reconciled with him during his final hours, only to arrive too late. Having been estranged for over 30 years, it is only now in death that he learns the true extent of his father's humiliation in Auschwitz at the hands of former SS Officer Aloise Lange - an event he is determined to avenge. So begins a life-altering journey across the heartland of America to track down and confront his father's nemesis. As his quest unfolds, Cheyenne is reawakened by the people he encounters and his journey is transformed into one of reconciliation and self discovery. As his date with destiny arrives and he tracks down Lange, Cheyenne must finally decide if it is redemption he seeks ....or revenge. Starring two time Academy Award winner Sean Penn and marking the much-anticipated English-language debut of acclaimed director Paolo Sorrentino, THIS MUST BE THE PLACE is a gripping examination of a man on the precipice of obsession.", 
    "genres": "Comedy, Drama", 
    "release_year": "2011", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Broken Bird: Cheyenne, who blams himself for  the suicides of two of his fans.", 
                "id": "BrokenBird"
            }
        ]
    }, 
    "imdbid": "tt1440345", 
    "poster_url": "ThisMustBeThePlace.jpg", 
    "similar": [
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "PracticalMagic", 
            "name": "Practical Magic", 
            "poster_url": "PracticalMagic.jpg"
        }, 
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "TheCompanyOfWolves", 
            "name": "The Company of Wolves", 
            "poster_url": "TheCompanyOfWolves.jpg"
        }, 
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "Scarecrow", 
            "name": "Scarecrow", 
            "poster_url": "Scarecrow.jpg"
        }, 
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "BrokenBird"
            ], 
            "shared_count": 1, 
            "id": "SevenFacesOfDrLao", 
            "name": "7 Faces of Dr. Lao", 
            "poster_url": "SevenFacesOfDrLao.jpg"
        }
    ], 
    "id": "ThisMustBeThePlace", 
    "name": "This Must Be The Place"
}