{
    "plot": "The warrior Thor (Hemsworth) is cast out of the fantastic realm of Asgard by his father Odin (Hopkins) for his arrogance and sent to Earth to live among humans. Falling in love with scientist Jane Foster (Portman) teaches Thor much-needed lessons, and his new-found strength comes into play as a villain from his homeland sends dark forces toward Earth.", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "inspired"
                ], 
                "role": "Badass Beard: A staple in Asgard because these are the people that inspired Vikings.", 
                "id": "BadAssBeard"
            }, 
            {
                "adjectives": [
                    "courtesy"
                ], 
                "role": "Heimdall from the film version of Thor has one, courtesy of Idris Elba. It gives him a very fitting air of gravitas.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [
                    "several", 
                    "old", 
                    "powerful"
                ], 
                "role": "Badass Grandpa: Odin and Laufey are both several thousand years old and quite powerful.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "cool", 
                    "main"
                ], 
                "role": "Cool Old Guy: Odin (Action Dad) and Erik Selvig (drinking match). Heimdall is pretty cool and seemingly much older than the main cast as well, although he's played by a younger actor.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [], 
                "role": "In Thor, Odin is the Badass Grandpa variant.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "eponymous", 
                    "epic", 
                    "later", 
                    "mud-wrestling", 
                    "tight", 
                    "rain-soaked", 
                    "same"
                ], 
                "role": "The eponymous Thor. He's ruggedly handsome and his wardrobe on Midgard fits the description above exactly. And of course, he has a rather epic Shirtless Scene, later followed by mud-wrestling in a tight, rain-soaked T-shirt. This makes him a perfect foil to Loki's Pretty Boy looks.\n From the same universe, Captain America: The First Avenger himself, at least after he gets injected with Super Serum.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "common", 
                    "pregnant", 
                    "pregnant", 
                    "several", 
                    "female"
                ], 
                "role": "It's very common in the Thor fandom to have fanart and fanfiction of pregnant Loki. Justified because Norse Mythology has Loki being pregnant several times, and a lot of the pieces are actually retellings of those stories.\n Partly justified. Fans cheerfully ignore the part where the Loki of Norse myths was in some sort of female form the times he bore children.", 
                "id": "MisterSeahorse"
            }, 
            {
                "adjectives": [
                    "tall", 
                    "broad", 
                    "appreciate"
                ], 
                "role": "Mr. Fanservice: Thor is a tall, broad, linebacker type that in-universe girls appreciate.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Odin shows up in Jotunheim to pull Thor's ass out of the fire. Erik has shades of this towards Jane, and to some extent Darcy.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "facial", 
                    "physical", 
                    "meant", 
                    "sharp", 
                    "handsome", 
                    "muscular"
                ], 
                "role": "Pretty Boy: Loki possesses pretty facial features, a slender build, and moves gracefully. His physical appearance is meant to be a sharp contrast to the ruggedly handsome and very muscular Thor.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "other", 
                    "physical", 
                    "meant", 
                    "sharp", 
                    "muscular"
                ], 
                "role": "Thor: Loki has an innocent baby-face and a slimmer build than the other Asgardians. His physical appearance is meant to be a sharp contrast to his ruggedly handsome and very muscular brother Thor.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "full", 
                    "big"
                ], 
                "role": "Heimdall, full stop.\n The big SHIELD agent that confronts Thor.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "big", 
                    "big"
                ], 
                "role": "Scary Black Man: Heimdall. He's big, stoically intimidating and carries a big sword. Also the S.H.I.E.L.D. Giant Mook For a moment when Selvig first sees him, Nick Fury himself.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "Sensitive"
                ], 
                "role": "Sensitive Guy and Manly Man: Loki and Thor (before the latter's Character Development kicks in).", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [], 
                "role": "Thor and Loki are an extreme version of this until Character Development kicks in.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed", 
                    "top", 
                    "local"
                ], 
                "role": "Sharp-Dressed Man: Loki, when he appears on earth. Strangely, nobody else even seems to notice him, so maybe he's throwing in a \"you can't see me\" glamour on top of his \"look like a local\" spell. When he's on Asgard as well. That's one snazzy suit of armor he's got. Word of God mentioned that Loki cared quite a lot about appearances. Where Thor only had one armor, Loki's got three variations. Agent Coulson fulfills this trope, as part of his The Men in Black dress code.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Thor, and it's noted appreciatively by Darcy while Jane can't stop herself from peeking.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "evil"
                ], 
                "role": "Subverted in Thor. Loki shows all signs of being the evil prince, who wants his brother and father out of the way so that he can have the throne except for one thing..... he doesn't want the throne. He never intended for Thor to be banished to Earth or for Odin to fall into the Odinsleep, but they did and the throne just dropped into his hands.\n Played much straighter in Thor: The Dark World, where Loki disposes of Odin through unknown means and impersonates him in order to usurp the throne.", 
                "id": "TheEvilPrince"
            }, 
            {
                "adjectives": [], 
                "role": "The Wise Prince: Thor, after some Character Development.", 
                "id": "TheWisePrince"
            }, 
            {
                "adjectives": [], 
                "role": "Thor develops into one of these.", 
                "id": "TheWisePrince"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Sif is part of Thor's team of warriors.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "brief", 
                    "strong", 
                    "strong", 
                    "main"
                ], 
                "role": "A brief moment in Thor has Frigga proving that a strong son comes from a strong mother. When she sees that the Frost Giants are invading and Odin was under the Odinsleep at the time, she wastes no time grabbing a sword and killing Laufey's lackey with one hit for coming after her husband.\n This is upped in Thor: The Dark World, where she duels the main villain Malekith  and defeats him, only to be stabbed in the back by his Dragon.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "strong", 
                    "strong"
                ], 
                "role": "Action Mom: Frigga, Thor's mom, proves that a strong son can come from a strong mother. She kills the Jotun king's lackey with one hit before being taken out by the king himself.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "nice", 
                    "manipulative", 
                    "whole", 
                    "taught", 
                    "entire", 
                    "exact", 
                    "wrong", 
                    "spiral", 
                    "continues…"
                ], 
                "role": "Loki from the Marvel Cinematic Universe could be here. In Thor, we see that he is actually a relatively nice person deep down, who loves his brother and looks up to him immensely. Sure, he's manipulative and a little shit most of the time, what with ruining Thor's coronation to be King just because he thought Thor wasn't ready (he wasn't, but not the point), but learning his whole life and family is a lie and that he's actually part of a race he's been taught to hate his entire life is still pretty devastating, and is what ultimately makes him snap and go about violently trying to prove his worth in the exact wrong way. After this, the downward spiral only continues…  though he does seem to get some redemption in Thor: The Dark World. Or does he?", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [], 
                "role": "The \"mud wrestling\" fight in Thor does a lot for the ladies in the audience...", 
                "id": "EstrogenBrigade"
            }, 
            {
                "adjectives": [
                    "true", 
                    "female", 
                    "brief", 
                    "same", 
                    "swirl-patterned", 
                    "luminescent"
                ], 
                "role": "Another male example: Loki's true Jotun form in Thor, down to the weird exception-to-the-species factor often seen only in female examples. The rest of the Jotuns are hulking, craggy monsters; in the brief glimpses we see of Loki's Jotun form, he looks the same as ever except for having swirl-patterned blue skin and vaguely luminescent red eyes.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "Hot", 
                    "political"
                ], 
                "role": "Hot Scientist: Jane, a lovely astronomer. Also Darcy, as played by Kat Dennings, who is admittedly only a political scientist.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "long"
                ], 
                "role": "Kicking Ass in All Her Finery: Frigga fights the Frost Giants while wearing a long dress.", 
                "id": "KickingAssInAllHerFinery"
            }, 
            {
                "adjectives": [
                    "warrior"
                ], 
                "role": "Lady of War: Lady Sif, verily, as one of Thor's warrior friends. Queen Frigga, too. She killed Laufey's mook in one hit before being knocked out by Laufey.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [
                    "friendly"
                ], 
                "role": "Thor is basically about Thor being Jane's Magical Boyfriend. He's friendly! He's ripped! He beats up Viking alien laser robots!", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [
                    "titular", 
                    "normal", 
                    "spacial", 
                    "unsuccessful", 
                    "difficult"
                ], 
                "role": "In the movie Thor, the titular character is a rare Manic Pixie Dream Dude for scientist every-girl Jane Foster. Her normal life of studying spacial phenomena and unsuccessful relationships is interrupted when a god literally drops out of the sky. In the beginning of the sequel, we even see how difficult it has been for her to return to her mundane life without him.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "all-guy"
                ], 
                "role": "Sif from the Thor movies is an Action Girl who hangs out with an all-guy group of warriors.", 
                "id": "OneOfTheBoys"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "gracious"
                ], 
                "role": "Thor and Thor: The Dark World: Frigga is the Queen of Asgard, and she is beautiful, gracious and regal.\n And not to mention deadly...", 
                "id": "TheHighQueen"
            }, 
            {
                "adjectives": [
                    "main", 
                    "white"
                ], 
                "role": "Queen Frigga's main outfit in Thor is a white dress.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [], 
                "role": "Woman in White: Frigga in her main outfit.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "single", 
                    "mid-late", 
                    "isn’t", 
                    "romantic"
                ], 
                "role": "Tom Hiddleston aka Loki from Thor is seen with a (rather pretty) lady who seems to be either his girlfriend or his wife. Cue the screaming fangirl meltdown.\n Side note: Hiddleston's single as of mid-late 2012 - he ended things with his girlfriend Susannah Fielding because \"It’s just I am very driven right now and there isn’t really any time to have a proper girlfriend.\" The majority of \"Hiddlestoners\" also tend to look down on those who do anything that might cause him problems (like insulting a romantic partner).", 
                "id": "YokoOhNo"
            }
        ]
    }, 
    "imdbid": "tt0800369", 
    "poster_url": "Thor.jpg", 
    "similar": [
        {
            "shared": [
                "YokoOhNo", 
                "TheHighQueen", 
                "Hunk", 
                "WomanInWhite", 
                "SensitiveGuyAndManlyMan", 
                "LadyOfWar", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 8, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "TheEvilPrince", 
                "KickingAssInAllHerFinery", 
                "SharpDressedMan", 
                "Hunk", 
                "SensitiveGuyAndManlyMan", 
                "BrokenBird", 
                "ActionGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 8, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "KickingAssInAllHerFinery", 
                "CoolOldGuy", 
                "PapaWolf", 
                "ShirtlessScene", 
                "PrettyBoy", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "BadAssBeard", 
                "CoolOldGuy", 
                "SharpDressedMan", 
                "ShirtlessScene", 
                "BrokenBird", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "CoolOldGuy", 
                "MrFanservice", 
                "WomanInWhite", 
                "PrettyBoy", 
                "TheHighQueen", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "TheLordOfTheRings", 
            "name": "The Lord of the Rings", 
            "poster_url": "TheLordOfTheRings.jpg"
        }
    ], 
    "id": "Thor", 
    "name": "Thor"
}