{
    "plot": "In 1922 New York City, Millie Dillmount and Miss Dorothy Brown are just two of the girls living at the Priscilla Hotel for Single Young Ladies run by Mrs. Meers. Orphaned, Miss Dorothy, just recently arrived, is a naive, old-fashioned girl from a seemingly privileged background who has aspirations to be a stage actress. From more modest means, Millie, in New York for three months, used to be old fashioned, but now has a new modern sensibility and look to match, complete with bobbed hair and dresses with hemlines above the knee. Included in this new modern sensibility is Millie's goal of getting a job as a stenographer, with a quick promotion to being her wealthy boss' \"Mrs.\". Love is not to factor into the equation. She believes she's found the right employer in the form of chisel-jawed Trevor Graydon of the Sincere Trust Insurance Company. Millie's pursuit of Mr. Graydon is despite the fact that Mr. Graydon sees her as one of the boys, he has old fashioned sensibilities, and Millie herself has a mutual attraction to another boy named Jimmy Smith. Although she likes Jimmy, Millie feels that Jimmy, as a paper clip salesman with an overwhelming happy-go-lucky attitude, is not driven enough to be husband material. That doesn't stop Jimmy's pursuit of Millie. In her association with Jimmy, Millie meets flamboyant wealthy Renaissance woman Muzzy Van Hossmere. Jimmy's father once worked as Muzzy's gardener. Originally from humble means much like Millie, Muzzy tries to convince Millie that true love will lead to happiness, as that is what happened when she met the now deceased Mr. Van Hossmere who she had no idea was rich. In other goings-on among this new circle of friends, Miss Dorothy leaves New York without a word to anyone except Mrs. Meers. Thinking this situation rather odd, Millie connects Miss Dorothy's leaving with that of other girls previously living at the Priscilla Hotel. With Mr. Graydon's help, Jimmy and Millie try to find out what happened to Miss Dorothy.", 
    "genres": "Comedy, Musical", 
    "release_year": "1967", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Disguised in Drag: Jimmy does this in the movie.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [], 
                "role": "The Casanova: Jimmy in the stage show.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Lampshaded", 
                    "difficult", 
                    "well-endowed"
                ], 
                "role": "Lampshaded in the movie Thoroughly Modern Millie, where flapper Millie (played by Julie Andrews) complained that her \"fronts\" made it difficult to wear her beads properly. She tries to flatten her chest but she's just too well-endowed.", 
                "id": "PetitePride"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: Millie, especially in the stage version. In case you couldn't tell from the opening number, she drives it home in the \"Not for the Life of Me\" tag by turning the Dark Reprise into Triumphant Reprise.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "Rich"
                ], 
                "role": "Rich Bitch: Judith Tremaine.", 
                "id": "RichBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Socialite: Muzzy van Hossmere.", 
                "id": "Socialite"
            }, 
            {
                "adjectives": [], 
                "role": "The Flapper", 
                "id": "TheFlapper"
            }, 
            {
                "adjectives": [], 
                "role": "Tomboy and Girly Girl: Millie and Dorothy.", 
                "id": "TomBoyAndGirlyGirl"
            }
        ]
    }, 
    "imdbid": "tt0062362", 
    "poster_url": "ThoroughlyModernMillie.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "PluckyGirl", 
                "DisguisedInDrag"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "RichBitch"
            ], 
            "shared_count": 2, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "DisguisedInDrag"
            ], 
            "shared_count": 2, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }, 
        {
            "shared": [
                "TomBoyAndGirlyGirl", 
                "RichBitch"
            ], 
            "shared_count": 2, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "PluckyGirl", 
                "TomBoyAndGirlyGirl"
            ], 
            "shared_count": 2, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }
    ], 
    "id": "ThoroughlyModernMillie", 
    "name": "Thoroughly Modern Millie"
}