{
    "plot": "Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stop them but their leader Malekith escapes to wait for another opportunity. The warriors find the Aether and since it cannot be destroyed, they try to hide it. In the present day, Jane Foster awaits the return of Thor although it has been two years since they last saw once another. In the meantime, Thor has been trying to bring peace to the nine realms. Jane discovers an anomaly similar to the one that brought Thor to Earth. She goes to investigate, finds a wormhole, and is sucked into it. Back on Asgard, Thor wishes to return to Earth but his father, Odin refuses to let him. Thor learns from Heimdall, who can see into all of the realms, that Jane disappeared. Thor then returns to Earth just as Jane reappears. However, when some policemen try to arrest her, an unknown energy repulses them. Thor then brings Jane to Asgard to find out what happened to her. When the energy is released again, they discover that when Jane disappeared, she crossed paths with the Aether and it entered her. Malekith, upon sensing that the time to strike is now, seeks out the Aether. He attacks Asgard and Thor's mother Frigga is killed protecting Jane. Odin wants to keep Jane on Asgard so that Malekith will come. Thor disagrees with his plan, so with his cohorts, he decides to take Jane away. He enlists the aid of his brother, Loki. Unfortunately, Loki's motivations remain unknown.", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "2013", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "hilarious", 
                    "glorious"
                ], 
                "role": "Mr. Fanservice: Thor, naturally. There's even a hilarious blatant pair of shots devoted to his magnificent chest and equally glorious back, both glistening with water from a sponge bath.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "first", 
                    "30-second"
                ], 
                "role": "Shirtless Scene: As in the first film, the sequel basically takes a 30-second break to show off Chris Hemsworth's rippling pecs before getting back to the story.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [], 
                "role": "Played much straighter in Thor: The Dark World, where Loki disposes of Odin through unknown means and impersonates him in order to usurp the throne.", 
                "id": "TheEvilPrince"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "first", 
                    "second"
                ], 
                "role": "Action Girl: Lady Sif's first scene is kicking marauder ass. Her second scene is practicing in Asgard.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Action Mom: Frigga gets in on the action, too, and easily defeats Malekith in a one-on-one fight.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "main"
                ], 
                "role": "This is upped in Thor: The Dark World, where she duels the main villain Malekith  and defeats him, only to be stabbed in the back by his Dragon.", 
                "id": "ActionMom"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Frigga defeats Malekith with ease, in a dress, with only one arm. When Kurse shows up, things go in the other direction.", 
                "id": "KickingAssInAllHerFinery"
            }, 
            {
                "adjectives": [
                    "graceful", 
                    "lethal"
                ], 
                "role": "Lady of War: Both Sif and Frigga are graceful and lethal fighters.", 
                "id": "LadyOfWar"
            }
        ]
    }, 
    "imdbid": "tt1981115", 
    "poster_url": "ThorTheDarkWorld.jpg", 
    "similar": [
        {
            "shared": [
                "TheEvilPrince", 
                "KickingAssInAllHerFinery", 
                "MrFanservice", 
                "ShirtlessScene", 
                "ActionMom", 
                "LadyOfWar", 
                "ActionGirl"
            ], 
            "shared_count": 7, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "KickingAssInAllHerFinery", 
                "ActionGirl", 
                "MrFanservice"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "TheEvilPrince", 
                "LadyOfWar", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Dune", 
            "name": "Dune", 
            "poster_url": "Dune.jpg"
        }, 
        {
            "shared": [
                "LadyOfWar", 
                "ShirtlessScene", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "PrincessMononoke", 
            "name": "Princess Mononoke", 
            "poster_url": "PrincessMononoke.jpg"
        }, 
        {
            "shared": [
                "LadyOfWar", 
                "ShirtlessScene", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "LegendOfTheSeeker", 
            "name": "Legend of the Seeker"
        }
    ], 
    "id": "ThorTheDarkWorld", 
    "name": "Thor: The Dark World"
}