{
    "plot": "Rancher Dan Evans heads into Bisbee to clear up issues concerning the sale of his land when he witnesses the closing events of a stagecoach robbery led by famed outlaw Ben Wade. Shortly thereafter, Wade is captured by the law in Bisbee and Evans finds himself one of the escorts who will take Wade to the 3:10 to Yuma train in Contention for the reward of $200. Evans's effort to take Wade to the station is in part an effort to save his land but also part of an inner battle to determine whether he can be more than just a naive rancher in the eyes of his impetuous and gunslinging son William Evans. The transport to Contention is hazardous and filled with ambushes by Indians, pursuits by Wade's vengeful gang and Wade's own conniving and surreptitious demeanor that makes the ride all the more intense.", 
    "genres": "Adventure, Crime, Drama", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "real", 
                    "American", 
                    "friendly"
                ], 
                "role": "Dirty Coward: Near the end of the movie, Dan reveals  that the real reason why he lost his leg is because during the American Civil War, he was caught in friendly fire while trying to flee from the battle. Everything he does to get Ben on the train to Yuma is to give his kids a dad they can be proud of. Ben is impressed enough to help him for the rest of the movie.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "outright"
                ], 
                "role": "3:10 to Yuma, where Charlie \"Princess\" is almost outright stated to be gay (especially for his boss, Ben Wade). And Fanon explains Ben himself to be gay as well.", 
                "id": "GayCowboy"
            }, 
            {
                "adjectives": [
                    "criminal"
                ], 
                "role": "Gay Cowboy: Charlie to Wade, the subtext practically screaming Ambiguously Gay. Charlie is even once insulted as \"Charlie Princess\". Given that he's a criminal, he also counts as a Gayngster.", 
                "id": "GayCowboy"
            }, 
            {
                "adjectives": [], 
                "role": "Charlie Prince in the remake of  3:10 to Yuma.", 
                "id": "SissyVillain"
            }
        ]
    }, 
    "imdbid": "tt0381849", 
    "poster_url": "ThreeTenToYuma.jpg", 
    "similar": [
        {
            "shared": [
                "SissyVillain", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "RobinHood", 
            "name": "Robin Hood", 
            "poster_url": "RobinHood.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "MillersCrossing", 
            "name": "Miller's Crossing", 
            "poster_url": "MillersCrossing.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "DirtyCoward"
            ], 
            "shared_count": 2, 
            "id": "Transformers", 
            "name": "Transformers"
        }
    ], 
    "id": "ThreeTenToYuma", 
    "name": "3:10 to Yuma"
}