{
    "plot": "Frigga lives with her parents on their farm. Unable to speak after being horrifically raped by an elderly man when she was young, her parents spend the majority of their money on speech therapy classes for their daughter in the hope that one day, she will speak again. One day, Frigga misses the bus to get to her speech therapy class. She accepts a ride off a suave looking gentlemen named Tony who pulls up beside her. Once they are in town, he takes her for a meal. Afterwards, he takes Frigga back to what appears to be his bachelor pad. He gives her wine that has probably been drugged, as she passes out after drinking it. The man then takes no time in bringing a crooked doctor in to get her fixed on high class heroin. After announcing to Frigga that she is now dependent on heroin and cannot last more than 48 hours without it, she must work as a prostitute for him. Frigga, obviously not thrilled by this news, attempts escape twice, but to no avail. On getting her very first client, she reacts by scratching down his face. Tony punishes her for this by removing an eye (the infamous supposed cadaver eye scene). Having found out that Tony sent a fake letter to her parents announcing in it that she hates her parents, Frigga makes her way home one Monday (her day off) only to discover that they have both apparently suicided from the lost of their only daughter. After this and the death of her friend and fellow prostitute Sally, Frigga seeks revenge on those who have wronged her, namely Tony and her clients. She spends her Mondays learning martial arts, buggy driving and shooting in order to suitably equip herself to take on the villians in her life. One of the blueprints as to why Tarantino's Kill Bill films exist, this film is an essential in the femme fatale revenge genre.", 
    "genres": "Action, Thriller", 
    "release_year": "1973", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Dark Action Girl", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Psycho Lesbian: One of Madeline's clients is a lezzo who delights in slapping her in the face before having sex with her.", 
                "id": "PsychoLesbian"
            }
        ]
    }, 
    "imdbid": "tt0072285", 
    "poster_url": "ThrillerACruelPicture.jpg", 
    "similar": [
        {
            "shared": [
                "PsychoLesbian", 
                "DarkActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheRoommate", 
            "name": "The Roommate", 
            "poster_url": "TheRoommate.jpg"
        }, 
        {
            "shared": [
                "PsychoLesbian", 
                "DarkActionGirl"
            ], 
            "shared_count": 2, 
            "id": "LegendOfTheSeeker", 
            "name": "Legend of the Seeker"
        }, 
        {
            "shared": [
                "PsychoLesbian", 
                "DarkActionGirl"
            ], 
            "shared_count": 2, 
            "id": "LadySnowblood", 
            "name": "Lady Snowblood", 
            "poster_url": "LadySnowblood.jpg"
        }, 
        {
            "shared": [
                "DarkActionGirl"
            ], 
            "shared_count": 1, 
            "id": "LupinIIIOperationReturnTheTreasure", 
            "name": "Lupin III Operation Return The Treasure"
        }, 
        {
            "shared": [
                "DarkActionGirl"
            ], 
            "shared_count": 1, 
            "id": "Thunderball", 
            "name": "Thunderball", 
            "poster_url": "Thunderball.jpg"
        }
    ], 
    "id": "ThrillerACruelPicture", 
    "name": "Thriller: A Cruel Picture"
}