{
    "plot": "After securing a major victory on the battlefield, Taketoti Washizu and one of his commanders, Yoshiaki Miki, find themselves lost in the maze-like Spider's Web forest. They come across a spirit-like seer who tells them of their future: both have been promoted because of their victory that day; Washizu will someday be the Great Lord of the Spider's Web castle while Miki's son will someday rule as Great Lord as well. When they arrive at the castle, they learn that the first part of the prophecy is correct. Washizu has no desire to become Great Lord but his ambitious wife urges him to reconsider. When the current Great Lord makes a surprise visit to his garrison outpost, Washizu is again promoted to commander of his vanguard but his wife reminds him of the danger that comes with the position. As pressure mounts, Wahizu takes action leading to its inevitable conclusion.", 
    "genres": "Action, Drama", 
    "release_year": "1957", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Henpecked Husband: Washizu, possibly even more than Macbeth.", 
                "id": "HenpeckedHusband"
            }, 
            {
                "adjectives": [], 
                "role": "Samurai", 
                "id": "Samurai"
            }, 
            {
                "adjectives": [], 
                "role": "Throne of Blood", 
                "id": "Samurai"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "surprising"
                ], 
                "role": "Lady Macbeth: Asaji (not surprising, since she's based on the Trope Namer).", 
                "id": "LadyMacBeth"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "original"
                ], 
                "role": "Also, of course, Asaji from Throne Of Blood, which actually is a Setting Update of Macbeth. She's arguably even more evil than the original.", 
                "id": "LadyMacBeth"
            }, 
            {
                "adjectives": [], 
                "role": "Lady Macbeth (not surprising, since she's based on the Trope Namer)", 
                "id": "LadyMacBeth"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "first", 
                    "polite"
                ], 
                "role": "Yamato Nadeshiko: Lady Asaji is probably the best example of how this trope can be played villainously. She barely moves during the entire first half of the film, and always takes a polite tone with her husband, yet every word that pours from her mouth is honey laced with venom.", 
                "id": "YamatoNadeshiko"
            }
        ]
    }, 
    "imdbid": "tt0050613", 
    "poster_url": "ThroneOfBlood.jpg", 
    "similar": [
        {
            "shared": [
                "LadyMacBeth", 
                "HenpeckedHusband", 
                "YamatoNadeshiko", 
                "Samurai"
            ], 
            "shared_count": 4, 
            "id": "Ran", 
            "name": "Ran", 
            "poster_url": "Ran.jpg"
        }, 
        {
            "shared": [
                "Samurai", 
                "YamatoNadeshiko"
            ], 
            "shared_count": 2, 
            "id": "SuperSentai", 
            "name": "Super Sentai"
        }, 
        {
            "shared": [
                "Samurai", 
                "YamatoNadeshiko"
            ], 
            "shared_count": 2, 
            "id": "LoveAndHonor", 
            "name": "Love and Honor", 
            "poster_url": "LoveAndHonor.jpg"
        }, 
        {
            "shared": [
                "Samurai", 
                "YamatoNadeshiko"
            ], 
            "shared_count": 2, 
            "id": "Sanjuro", 
            "name": "Sanjuro", 
            "poster_url": "Sanjuro.jpg"
        }, 
        {
            "shared": [
                "Samurai", 
                "YamatoNadeshiko"
            ], 
            "shared_count": 2, 
            "id": "TheTwilightSamurai", 
            "name": "The Twilight Samurai", 
            "poster_url": "TheTwilightSamurai.jpg"
        }
    ], 
    "id": "ThroneOfBlood", 
    "name": "Throne of Blood"
}