{
    "plot": "Having bought a model ship, the Unicorn, for a pound off a market stall Tintin is initially puzzled that the sinister Mr. Sakharine should be so eager to buy it from him, resorting to murder and kidnapping Tintin - accompanied by his marvellous dog Snowy - to join him and his gang as they sail to Morocco on an old cargo ship. Sakharine has bribed the crew to revolt against the ship's master, drunken Captain Haddock, but Tintin, Snowy and Haddock escape, arriving in Morocco at the court of a sheikh, who also has a model of the Unicorn. Haddock tells Tintin that over three hundred years earlier his ancestor Sir Francis Haddock was forced to scuttle the original Unicorn when attacked by a piratical forebear of Sakharine but he managed to save his treasure and provide clues to its location in three separate scrolls, all of which were secreted in models of the Unicorn. Tintin and Sakharine have one each and the villain intends to use the glass-shattering top Cs of operatic soprano the Milanese Nightingale to secure the third. With aid from bumbling Interpol agents the Thompson Twins our boy hero, his dog and the captain must prevent Sakharine from obtaining all three scrolls to fulfil the prophesy that only the last of the Haddocks can discover the treasure's whereabouts.", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Beard: Haddock, as always.", 
                "id": "BadAssBeard"
            }, 
            {
                "adjectives": [
                    "comic", 
                    "resemble", 
                    "much"
                ], 
                "role": "Beard of Evil: Sakharine, with his pointy goatee. The artists apparently referenced Rasputin when working on his movie design, which makes sense - his comic design was already pretty Rasputin-y.  The redesign helps him resemble Red Rackham a little more. His slicked-back, distinguished look vs. Haddock's unkempt look is very much a case of Good Hair, Evil Hair.", 
                "id": "BeardOfEvil"
            }
        ]
    }, 
    "imdbid": "tt0983193", 
    "poster_url": "Tintin.jpg", 
    "similar": [
        {
            "shared": [
                "BeardOfEvil", 
                "BadAssBeard"
            ], 
            "shared_count": 2, 
            "id": "FlashGordon", 
            "name": "Flash Gordon", 
            "poster_url": "FlashGordon.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil", 
                "BadAssBeard"
            ], 
            "shared_count": 2, 
            "id": "MissingInAction", 
            "name": "Missing in Action", 
            "poster_url": "MissingInAction.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil", 
                "BadAssBeard"
            ], 
            "shared_count": 2, 
            "id": "OnceUponATimeInTheWest", 
            "name": "Once Upon a Time in the West", 
            "poster_url": "OnceUponATimeInTheWest.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil", 
                "BadAssBeard"
            ], 
            "shared_count": 2, 
            "id": "Nighthawks", 
            "name": "Nighthawks", 
            "poster_url": "Nighthawks.jpg"
        }, 
        {
            "shared": [
                "BeardOfEvil", 
                "BadAssBeard"
            ], 
            "shared_count": 2, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }
    ], 
    "id": "Tintin", 
    "name": "Tintin"
}