{
    "plot": "84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.", 
    "genres": "Drama, Romance", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Battle Butler: Lovejoy", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [], 
                "role": "Caledon Hockley in Titanic.", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "Cal"
                ], 
                "role": "Crazy Jealous Guy: Cal", 
                "id": "CrazyJealousGuy"
            }, 
            {
                "adjectives": [
                    "noble", 
                    "willing", 
                    "hysterical", 
                    "fair", 
                    "break"
                ], 
                "role": "Dirty Coward: Despite the focus on all the noble victims willing to Face Death with Dignity, everyone Jack and Rose meet as they attempt to escape the ship leaves them to their fate, one crew member even sneering a \"To hell with you!\" at a hysterical Rose. To be fair, she did break his nose.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [], 
                "role": "Waistcoat of Style: Most of the men wear one, often with a Nice Hat.", 
                "id": "WaistcoatOfStyle"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "occasional"
                ], 
                "role": "Action Girl: Rose has occasional glimpses of it when she doesn't have Jack around.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "middle-aged", 
                    "old"
                ], 
                "role": "Cool Old Lady: Elderly Rose. Molly Brown too, although she's more middle-aged than old.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [
                    "old", 
                    "cute", 
                    "little", 
                    "white", 
                    "Pomeranian", 
                    "affectionate", 
                    "soft", 
                    "cat"
                ], 
                "role": "Crazy Cat Lady: Averted. Nice old lady Rose has a cute little white Pomeranian dog, showing that she's affectionate and soft, but without the implications of a cat.", 
                "id": "CrazyCatLady"
            }, 
            {
                "adjectives": [
                    "other", 
                    "female", 
                    "tragic"
                ], 
                "role": "Grande Dame: Rose's mother and a number of the other female passengers are tragic variations on the character type, while \"Molly\" Brown is a subversion.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "tragic"
                ], 
                "role": "In Titanic Rose's mother is a tragic variation on the character, while \"Molly\" Brown is a subversion.", 
                "id": "GrandeDame"
            }, 
            {
                "adjectives": [
                    "male", 
                    "cold", 
                    "high", 
                    "free-spirited", 
                    "live"
                ], 
                "role": "Jack from Titanic is a rare case of a male spin of this trope. Rose was feeling cold and alone in high society, when Jack comes along and teaches her to be free-spirited and live life.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [
                    "mysterious", 
                    "artistic", 
                    "free-spirited", 
                    "perspective", 
                    "interior", 
                    "much", 
                    "big", 
                    "beautiful", 
                    "free"
                ], 
                "role": "Manic Pixie Dream Girl: An argument can be made for Jack Dawson being a rare male example of the MPDG trope: a mysterious, handsome, appealing, artistic and free-spirited boy who, because we see him entirely from Rose's perspective, we get very little sense of his interior life or character motivation beyond how he relates to Rose. All his actions throughout the film relate to Rose and are as much about defining her character as they are about his. His \"big speech\" moment is not about him, it's all about Rose and how he sees her as a beautiful creature trapped in her world who'll die if she can't break free.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Rose's mother Ruth in Titanic.", 
                "id": "MatronChaperone"
            }, 
            {
                "adjectives": [
                    "well-mannered", 
                    "high-class", 
                    "male", 
                    "particular", 
                    "lady-like", 
                    "polite"
                ], 
                "role": "Outwardly, Rose DeWitt Bukater from Titanic was everything a well brought up girl should be, poised and well-mannered, but she dreams of riding, chewing tobacco, and spitting like a man. Despite her high-class upbringing she is very witty. After she tells Mr. Ismay that Dr. Freud's ideas about the male preoccupation with size might be of particular interest to him, Molly Brown calls her a pistol. When the ship is sinking she loses all her lady-like qualities and shouts that she's through being polite.", 
                "id": "SpiritedYoungLady"
            }, 
            {
                "adjectives": [
                    "well-mannered", 
                    "high-class", 
                    "male", 
                    "particular", 
                    "lady-like", 
                    "polite"
                ], 
                "role": "Spirited Young Lady: Outwardly, Rose was everything a well brought up girl should be, poised and well-mannered, but she dreams of riding, chewing tobacco, and spitting like a man. Despite her high-class upbringing she is very witty. After she tells Mr. Ismay that Dr. Freud's ideas about the male preoccupation with size might be of particular interest to him, Molly Brown calls her a pistol. When the ship is sinking she loses all her lady-like qualities and shouts that she's through being polite.", 
                "id": "SpiritedYoungLady"
            }
        ]
    }, 
    "imdbid": "tt0120338", 
    "poster_url": "Titanic.jpg", 
    "similar": [
        {
            "shared": [
                "BattleButler", 
                "CoolOldLady", 
                "WaistcoatOfStyle", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 5, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "CrazyJealousGuy", 
                "WaistcoatOfStyle", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "ActionGirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "SpiritedYoungLady", 
                "ActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 3, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }
    ], 
    "id": "Titanic", 
    "name": "Titanic"
}