{
    "plot": "Based on Harper Lee's Pulitzer Prize winning book of 1961. Atticus Finch is a lawyer in a racially divided Alabama town in the 1930s. He agrees to defend a young black man who is accused of raping a white woman. Many of the townspeople try to get Atticus to pull out of the trial, but he decides to go ahead. How will the trial turn out - and will it change any of the racial tension in the town ?", 
    "genres": "Drama", 
    "release_year": "1962", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Atticus Finch from To Kill a Mockingbird. He's obviously also a Magnificent Bastard, minus the Bastard part. Hell, one of his responses to an argument is something along the lines of stating \"You think you're about to win?\", which he only said when he knew he would win an argument, or had a back up plan for what they were about to say. He's the model of a father that every child wants.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "responsible", 
                    "all-around", 
                    "low", 
                    "white"
                ], 
                "role": "Corrupt Hick: Bob Ewell has this trope down to a science, what with accusing Tom Robinson of rape, probably  responsible for the rape and abuse of his daughter, attempting to kill Scout and Jem and being an all-around not-nice person. This is nicely averted by the town sheriff Heck Tate, however, who is quite a kind man. There is also Link Deas, Tom's employer, who risks jail to stand up in court and speak out of turn bearing witness to Tom's integrity. It should be noted that even though Bob Ewell and his brood are considered the lowest of the low, the townsfolk only take his word instead of Tom Robinson's because Bob is white.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [
                    "responsible", 
                    "all-around", 
                    "low", 
                    "white"
                ], 
                "role": "To Kill a Mockingbird: Bob Ewell has this trope down to a science, what with accusing Tom Robinson of rape, probably  responsible for the rape and abuse of his daughter, attempting to kill Scout and Jem and being an all-around not-nice person. This is nicely averted by the town sheriff Heck Tate, however, who is quite a kind man. It should be noted that Bob Ewell and his brood were considered the lowest of the low, the townsfolk only took his word instead of Tom Robinson's because Bob is white.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [
                    "dark"
                ], 
                "role": "Dirty Coward: Bob Ewell.  He can't go after the best shot in Maycomb County, so he'll go after his children when they're walking home in the dark instead.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "filthy"
                ], 
                "role": "To Kill a Mockingbird has Bob Ewell, who tried to kill Scout and Jem in an attempt to get even with Atticus for dirtying his already filthy reputation. The reason he didn't go after Atticus himself is because Atticus is the best shot in the county.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Disappeared Dad: Alluded to in Dill's case, although at first he lies about it and claims his father is president of a railroad.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "good", 
                    "white", 
                    "fat", 
                    "sweaty"
                ], 
                "role": "Gregory Peck as Atticus Finch in the film version of To Kill a Mockingbird is a good guy in a white suit. Of course, he's a Southerner, although neither fat nor sweaty.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [
                    "original", 
                    "accessible"
                ], 
                "role": "In To Kill a Mockingbird, the description of Finch's Landing mentions that its original owner designed the upstairs so that the son's bedroom would be accessible by one staircase, and the daughters' bedrooms only by another... which took you directly through the parents' room.", 
                "id": "OverprotectiveDad"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf Atticus and his rifle.  Boo Radley", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "wrong"
                ], 
                "role": "Tom Robinson in To Kill a Mockingbird is accused of this. Of course, it's wrong.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [
                    "non-racist"
                ], 
                "role": "Atticus Finch of To Kill a Mockingbird, who is this trope, a Simple Country Lawyer, and explicitly non-racist.", 
                "id": "SouthernGentleman"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Cool Old Lady: Mrs. Dubose. At least, Atticus tries to get the children to see her as one.", 
                "id": "CoolOldLady"
            }, 
            {
                "adjectives": [], 
                "role": "Miss Stephanie Crawford from To Kill a Mockingbird.", 
                "id": "GossipyHens"
            }, 
            {
                "adjectives": [], 
                "role": "Calpurnia from To Kill a Mockingbird.", 
                "id": "KindlyHousekeeper"
            }, 
            {
                "adjectives": [], 
                "role": "Kindly Housekeeper: Calpurnia.", 
                "id": "KindlyHousekeeper"
            }, 
            {
                "adjectives": [
                    "real", 
                    "high"
                ], 
                "role": "Subverted in To Kill a Mockingbird: Scout Finch tries to do this. In the book she's surprised to see her victim fall back in real pain — \"I had meant to kick his shin, but aimed too high.\"", 
                "id": "LittleGirlsKickShins"
            }, 
            {
                "adjectives": [
                    "young", 
                    "manual", 
                    "interested", 
                    "first", 
                    "basic"
                ], 
                "role": "Miss Caroline from To Kill a Mockingbird manages to be this even though she is teaching very young kids. The problem is that they're children of farmers who have done manual labor pretty much since they could walk, and they're not really interested in the story of Mrs. Cat and her kittens. She gets a nasty shock when she meets one of the Ewells, a family who traditionally show up for the first day of school to satisfy the truant officer and hardly set foot in town the rest of the year. She tries to apply basic school rules to the kid and ends up getting \"slut\" screamed at her.", 
                "id": "MisplacedKindergartenTeacher"
            }, 
            {
                "adjectives": [
                    "few"
                ], 
                "role": "Missing Mom: Scout, Jem and Mayella lost their mothers long before the story opens. Since Scout's mom died when she was two, she doesn't remember her, but Jem, who's a few years older, does.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "dead"
                ], 
                "role": "The heroine of To Kill a Mockingbird grows up with father (and brother), but her mother is dead.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [], 
                "role": "Scout Finch in To Kill a Mockingbird. Her real name is Jean Louise but she prefers the nickname \"Scout\", she plays with boys, hates dresses and considers \"you act like a girl\" an insult.", 
                "id": "OneOfTheBoys"
            }, 
            {
                "adjectives": [
                    "meaningful"
                ], 
                "role": "Tomboy: Scout is one. Of course, the book is set in the 1930s when girls and women wore dresses and skirts a lot more than they do now, so being a tomboy and wearing boys' clothes was more of a meaningful statement.", 
                "id": "Tomboy"
            }
        ]
    }, 
    "imdbid": "tt0056592", 
    "poster_url": "ToKillAMockingbird.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "OverprotectiveDad", 
                "ManInWhite", 
                "CoolOldLady", 
                "CoolOldGuy", 
                "DirtyCoward", 
                "MissingMom"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "CorruptHick", 
                "GossipyHens", 
                "SouthernGentleman", 
                "ScaryBlackMan", 
                "MissingMom"
            ], 
            "shared_count": 6, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad", 
                "MissingMom", 
                "CoolOldLady", 
                "CoolOldGuy"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "Tomboy", 
                "DisappearedDad", 
                "MissingMom", 
                "CoolOldGuy", 
                "OneOfTheBoys"
            ], 
            "shared_count": 5, 
            "id": "OnceUponAForest", 
            "name": "Once Upon a Forest", 
            "poster_url": "OnceUponAForest.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "DisappearedDad", 
                "OverprotectiveDad", 
                "ScaryBlackMan", 
                "MissingMom"
            ], 
            "shared_count": 5, 
            "id": "Armageddon", 
            "name": "Armageddon", 
            "poster_url": "Armageddon.jpg"
        }
    ], 
    "id": "ToKillAMockingbird", 
    "name": "To Kill a Mockingbird"
}