{
    "plot": "Nora Walker is told that her British fighter pilot husband is missing in action and presumed killed in World War II. On V.E. Day, Nora gives birth to their son, who she names Tommy. While Tommy is an adolescent, Nora marries Frank, a shifty camp counselor. Shortly thereafter, Tommy suffers an emotionally traumatic experience associated with his father and step-father, which, based on things told to him at that time, results in him becoming deaf, dumb and blind, a situation which several people exploit for their own pleasure. As Nora tries several things to bring Tommy out of his psychosomatic disabilities, Tommy, now a young man, happens upon pinball as a stimulus. Playing by intuition, Tommy becomes a pinball master, which in turn makes him, and by association Nora and Frank, rich and famous. Nora literally shatters Tommy to his awakening, which ultimately leads to both the family's rise and downfall as people initially try to emulate Tommy's path then rebel against it.", 
    "genres": "Musical", 
    "release_year": "1975", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "musical", 
                    "self-defense", 
                    "ironic", 
                    "same", 
                    "self-defense"
                ], 
                "role": "In the 1993 musical, Captain Walker is the Papa Wolf killing his wife's lover in self-defense, which is an ironic shout-out to the 1975 film in which the lover does the same to Tommy's dad in self-defense.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "active"
                ], 
                "role": "Walking Shirtless Scene: Tommy himself in the movie, after he gets his senses back. Though, granted, it's more like running shirtless underwater and on the lava from an active volcano.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "underaged"
                ], 
                "role": "The gypsy \"queen\" from Tommy, described in \"The Hawker (Eyesight To The Blind)\" and fleshed out in \"Acid Queen\". She combines this trope with elements of the Snake Oil Salesman, using acid (and, according to some interpretations, sex) to \"cure\" the underaged protagonist of his blindness and deafness.", 
                "id": "HotGypsyWoman"
            }
        ]
    }, 
    "imdbid": "tt0073812", 
    "poster_url": "Tommy.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "WalkingShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "TheCroods", 
            "name": "The Croods", 
            "poster_url": "TheCroods.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "WalkingShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "ClashOfTheTitans", 
            "name": "Clash of the Titans", 
            "poster_url": "ClashOfTheTitans.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "WalkingShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "Tarzan", 
            "name": "Tarzan", 
            "poster_url": "Tarzan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "WalkingShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "JohnCarter", 
            "name": "John Carter", 
            "poster_url": "JohnCarter.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "WalkingShirtlessScene"
            ], 
            "shared_count": 2, 
            "id": "TheTenCommandments", 
            "name": "The Ten Commandments", 
            "poster_url": "TheTenCommandments.jpg"
        }
    ], 
    "id": "Tommy", 
    "name": "Tommy"
}