{
    "plot": "While Andy is away at summer camp Woody has been toynapped by Al McWiggin, a greedy collector and proprietor of \"Al's Toy Barn\"! In this all-out rescue mission, Buzz and his friends Mr. Potato Head, Slinky Dog, Rex and Hamm springs into action to rescue Woody from winding up as a museum piece. They must find a way to save him before he gets sold in Japan forever and they'll never see him again!", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "1999", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Dirty Old Man: Stinky Pete in the credits with the Barbies.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "In Toy Story 2, Stinky Pete is seen flirting with some Barbies during the end-credits Hilarious Outtakes.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [
                    "lifestyle"
                ], 
                "role": "In Toy Story 2, Al's lovely penthouse apartment is marred by his slovenly lifestyle, which includes junk food all over the floor.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [
                    "confused", 
                    "self-worth", 
                    "favorite", 
                    "male"
                ], 
                "role": "Toy Story 2: Buzz or tomboy Jessie is the Hunter (Buzz is a confused hunter who doesn't think he needs to prove anything; Jessie's self-worth was pretty much shattered by being abandoned; ironically she's a Friend to All Living Things), Woody is the Lord (in all three films he's worried about his status as Andy's favorite and leader of Andy's toys), and Stinky Pete is the Prophet (physically the oldest and very, very concerned about his legacy, or lack thereof, which gave him value).\n Toy Story 3: Ken is the Hunter (constantly needing to prove himself in spite of his lot in life as a male toy designed for girls), and Lotso is The Lord/Prophet (eldest toy in the place, maintains stability through fear and intimidation of newer toys).", 
                "id": "TheThreeFacesOfAdam"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "same"
                ], 
                "role": "The hold Jessie puts Woody in during their fight is the same one Buzz used when he and Woody fought under Andy's Mom's car.", 
                "id": "AffirmativeActionGirl"
            }, 
            {
                "adjectives": [
                    "aside", 
                    "single", 
                    "first"
                ], 
                "role": "From Toy Story 2, Buzz Lightyear and the gang are in Al's Toy Barn, where they stumble upon Tour Guide Barbie. Mr. Potato Head immediately begins chanting that he is a \"married spud\", while Hamm tells him to step aside for the single fellas.\n Invoked again by Toy Story 3, when Ken meets Molly's Barbie doll for the first time, accompanied by Gary Wright's \"Dream Weaver\".", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [
                    "complete"
                ], 
                "role": "Hello, Nurse!: Barbie, complete with the jaw drop.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Rex", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0120363", 
    "poster_url": "ToyStory2.jpg", 
    "similar": [
        {
            "shared": [
                "MenCantKeepHouse", 
                "AffirmativeActionGirl", 
                "TheChick"
            ], 
            "shared_count": 3, 
            "id": "ToyStory", 
            "name": "Toy Story", 
            "poster_url": "ToyStory.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "AffirmativeActionGirl", 
                "HelloNurse"
            ], 
            "shared_count": 3, 
            "id": "SpaceJam", 
            "name": "Space Jam", 
            "poster_url": "SpaceJam.jpg"
        }, 
        {
            "shared": [
                "HelloNurse", 
                "DirtyOldMan"
            ], 
            "shared_count": 2, 
            "id": "IfAManAnswers", 
            "name": "If A Man Answers", 
            "poster_url": "IfAManAnswers.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "DirtyOldMan"
            ], 
            "shared_count": 2, 
            "id": "Red", 
            "name": "Red", 
            "poster_url": "Red.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "AffirmativeActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheMostDangerousGame", 
            "name": "The Most Dangerous Game", 
            "poster_url": "TheMostDangerousGame.jpg"
        }
    ], 
    "id": "ToyStory2", 
    "name": "Toy Story 2"
}