{
    "plot": "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that he has life (as a toy) good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Once introduced himself at a speaking event as Buzz Lightyear, and also appeared As Himself on The Simpsons in a role where he mercilessly mocked himself.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "single", 
                    "first", 
                    "many", 
                    "only", 
                    "third", 
                    "single"
                ], 
                "role": "Disappeared Dad: There's no Andy's Dad in sight. It's never explicitly brought up but fans like to argue the three possibilities: Andy's mom is a widow; Andy's mom is a divorcee; Andy's mom just happens to be a single mother. In the first two scenarios, many fans in turn assume that Woody is one of the only gifts from his father. The third could be yet another Shout-Out to The Brave Little Toaster, since Rob's mom is single too. Food for thought: so is John Lasseter's mom.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "absent"
                ], 
                "role": "In Toy Story, Andy's father is noticeably absent, implying that Mrs. Davis is a widow or a divorcee. However, Shrug of God suggests that Woody belonged to Andy's dad.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "tidy", 
                    "small", 
                    "first", 
                    "third"
                ], 
                "role": "Men Can't Keep House: As shown with Sid's room in Toy Story and Al's apartment in Toy Story 2. Andy's room, however, is usually quite remarkably tidy considering he's a small boy in the first two movies and a teenager in the third.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [
                    "kid-at-home", 
                    "junk-strewn"
                ], 
                "role": "Sid Phillips in Toy Story demonstrates the kid-at-home variation of this trope, with his junk-strewn dimly-lit bedroom.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [], 
                "role": "Practically everything involving Ken. With expected results.", 
                "id": "TheDandy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "delusional", 
                    "second"
                ], 
                "role": "Buzz starts out delusional, has a breakdown when he finds out he's a toy, then comes right back to save himself and Woody via \"Falling! With style!\", before going on to rescue Woody in the second movie, and trying to save his friends from the Caterpillar Room, and rescuing Jessie while in the garbage truck", 
                "id": "AffirmativeActionGirl"
            }, 
            {
                "adjectives": [
                    "cast", 
                    "first", 
                    "female", 
                    "minor", 
                    "minor", 
                    "first", 
                    "female", 
                    "first"
                ], 
                "role": "Most of the cast of the first Toy Story was, well, a collection of boy's toys. The only female character, Bo Peep, was fairly minor and only existed because the boy shared a room with his baby sister (and so Woody could have a Love Interest). In Toy Story 2, Mrs. Potato Head was also fairly minor, but Jessie was one of the mains. Toy Story 3 gives Mrs. Potato Head a larger role, and also adds Barbie, though Bo Peep was actually cut entirely.\n In Barbie's case, it was also the fact that the movies had permission to use the character for the first time. Originally, Bo Peep (the aforementioned only female character in the first movie) was supposed to be a Barbie, but Mattel refused. It wasn't until they saw how the movies caused sales of Mr. Potato Head toys to spike that they agreed.", 
                "id": "AffirmativeActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Damsel in Distress: Bo Peep in Andy's games.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Rex", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0114709", 
    "poster_url": "ToyStory.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "DamselInDistress", 
                "TheChick", 
                "CoolOldGuy"
            ], 
            "shared_count": 4, 
            "id": "OnceUponAForest", 
            "name": "Once Upon a Forest", 
            "poster_url": "OnceUponAForest.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DamselInDistress", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "TheAristocats", 
            "name": "The Aristocats", 
            "poster_url": "TheAristocats.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "DamselInDistress", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "TheSwanPrincess", 
            "name": "The Swan Princess", 
            "poster_url": "TheSwanPrincess.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad", 
                "MenCantKeepHouse", 
                "CoolOldGuy"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "MenCantKeepHouse", 
                "AffirmativeActionGirl", 
                "TheChick"
            ], 
            "shared_count": 3, 
            "id": "ToyStory2", 
            "name": "Toy Story 2", 
            "poster_url": "ToyStory2.jpg"
        }
    ], 
    "id": "ToyStory", 
    "name": "Toy Story"
}