{
    "plot": "Woody, Buzz and the whole gang are back. As their owner Andy prepares to depart for college, his loyal toys find themselves in daycare where untamed tots with their sticky little fingers do not play nice. So, it's all for one and one for all as they join Barbie's counterpart Ken, a thespian hedgehog named Mr. Pricklepants and a pink, strawberry-scented teddy bear called Lots-o'-Huggin' Bear to plan their great escape.", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "many"
                ], 
                "role": "Camp Straight: Ken. From his frilly handwriting, to his many clothes, to his happiness when the army men parachute in the ending. Even dating Barbie doesn't help matters.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "many", 
                    "first"
                ], 
                "role": "Ken in Toy Story 3. There are so many jokes made regarding his sexuality, including having girly handwriting and Always Camp tastes. Yet he falls in love with Barbie at first sight.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [], 
                "role": "Toy Story 3:  Lotso runs Sunnyside with an iron fist.", 
                "id": "CorruptHick"
            }, 
            {
                "adjectives": [], 
                "role": "Ken in Toy Story 3.", 
                "id": "TheDandy"
            }, 
            {
                "adjectives": [
                    "only"
                ], 
                "role": "Chatter Telephone in Toy Story 3. He has been at Sunnyside Daycare Center for the longest time. Even before Lotso Bear took it over. To help Woody and his friends escape the daycare center, Chatter Telephone detailedly describes the layout of the daycare center and warns Woody that the only way for a toy to escape is to neutralize the Cymbal Monkey's surveillance system.", 
                "id": "TheOldConvict"
            }, 
            {
                "adjectives": [
                    "only"
                ], 
                "role": "The Old Convict: Chatter Telephone has been at Sunnyside Daycare Center even before Lotso Bear took it over. To help Woody and his friends escape the daycare center, Chatter Telephone detailedly describes the layout of the daycare center and warns Woody that the only way for a toy to escape is to neutralize the Cymbal Monkey's surveillance system.", 
                "id": "TheOldConvict"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "Toy Story 3: Ken is the Hunter (constantly needing to prove himself in spite of his lot in life as a male toy designed for girls), and Lotso is The Lord/Prophet (eldest toy in the place, maintains stability through fear and intimidation of newer toys).", 
                "id": "TheThreeFacesOfAdam"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Invoked again by Toy Story 3, when Ken meets Molly's Barbie doll for the first time, accompanied by Gary Wright's \"Dream Weaver\".", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [
                    "Heel-Face"
                ], 
                "role": "Barbie ends up playing this role in Toy Story 3. She did love Ken before realizing what was really going on at Sunnyside and then rejected him.  She played this role well enough to push him into a Heel-Face Turn, and they end the movie Happily Married.", 
                "id": "MataHari"
            }, 
            {
                "adjectives": [], 
                "role": "Mata Hari: Barbie", 
                "id": "MataHari"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Librarian: Bookworm", 
                "id": "ScaryLibrarian"
            }, 
            {
                "adjectives": [], 
                "role": "Team Parents: Barbie and Ken to the toys of Sunnyside in the epilogue.", 
                "id": "TeamMom"
            }
        ]
    }, 
    "imdbid": "tt0435761", 
    "poster_url": "ToyStory3.jpg", 
    "similar": [
        {
            "shared": [
                "CorruptHick", 
                "HelloNurse", 
                "TheDandy"
            ], 
            "shared_count": 3, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "TeamMom", 
                "HelloNurse"
            ], 
            "shared_count": 3, 
            "id": "Twilight", 
            "name": "Twilight", 
            "poster_url": "Twilight.jpg"
        }, 
        {
            "shared": [
                "CorruptHick", 
                "TheDandy"
            ], 
            "shared_count": 2, 
            "id": "TheQuickAndTheDead", 
            "name": "The Quick and the Dead", 
            "poster_url": "TheQuickAndTheDead.jpg"
        }, 
        {
            "shared": [
                "TeamMom", 
                "TheDandy"
            ], 
            "shared_count": 2, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "TheDandy"
            ], 
            "shared_count": 2, 
            "id": "AllAboutEve", 
            "name": "All About Eve", 
            "poster_url": "AllAboutEve.jpg"
        }
    ], 
    "id": "ToyStory3", 
    "name": "Toy Story 3"
}