{
    "plot": "Elizabeth, Jeremy, and Harry Martin have had it with their workaholic, nagging mother and they get in trouble at school with bullies and almost smoking cigarettes. They go to this mysterious gardener named Mrs. Cavour and she tells the siblings about an ancient spell to make their mother disappear. That night they say the incantation and the next morning, they wake up and they find their mother is gone and they can't remember anything about her. Mrs. Cavour tells the children about the Mommy Market, a place in town where they had about every mother you could think of. When they go there, the Mommy Market had a policy where you could have 3 tokens to take a mother home. If they could not find a suitable mother by their third token, they could never go back. The mothers they pick are not what they hoped for and they feel lost without someone to look after them. They wanted their very own mother to love and they must think of a memory of their own to remember her and break the spell.", 
    "genres": "Comedy, Family, Fantasy", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "In Trading Mom, the father of the kids left the family. As the kids are annoyed with their mom at the beginning, one of them remarks that their father left because he was also annoyed by their mom.", 
                "id": "DisappearedDad"
            }
        ]
    }, 
    "imdbid": "tt0111470", 
    "poster_url": "TradingMom.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "RealSteel", 
            "name": "Real Steel", 
            "poster_url": "RealSteel.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "Dumbo", 
            "name": "Dumbo", 
            "poster_url": "Dumbo.jpg"
        }, 
        {
            "shared": [
                "DisappearedDad"
            ], 
            "shared_count": 1, 
            "id": "TheFog", 
            "name": "The Fog", 
            "poster_url": "TheFog.jpg"
        }
    ], 
    "id": "TradingMom", 
    "name": "Trading Mom"
}