{
    "plot": "A long time ago, far away on the planet of Cybertron, a war is being waged between the noble Autobots (led by the wise Optimus Prime) and the devious Decepticons (commanded by the dreaded Megatron) for control over the Allspark, a mystical talisman that would grant unlimited power to whoever possesses it. The Autobots managed to smuggle the Allspark off the planet, but Megatron blasts off in search of it. He eventually tracks it to the planet of Earth (circa 1850), but his reckless desire for power sends him right into the Arctic Ocean, and the sheer cold forces him into a paralyzed state. His body is later found by Captain Archibald Witwicky, but before going into a comatose state Megatron uses the last of his energy to engrave into the Captain's glasses a map showing the location of the Allspark, and to send a transmission to Cybertron. Megatron is then carried away aboard the Captain's ship. A century later, Captain Witwicky's grandson Sam Witwicky (nicknamed Spike by his friends) buys his first car. To his shock, he discovers it to be Bumblebee, an Autobot in disguise who is to protect Spike, who possesses the Captain's glasses and the map engraved on them. But Bumblebee is not the only Transformer to have arrived on Earth - in the desert of Qatar, the Decepticons Blackout and Scorponok attack a U.S. military base, causing the Pentagon to send their special Sector Seven agents to capture all \"specimens of this alien race.\" Spike and his girlfriend Mikaela find themselves in the midst of a grand battle between the Autobots and the Decepticons, stretching from Hoover Dam all the way to Los Angeles. Meanwhile, deep inside Hoover Dam, the cryogenically stored body of Megatron awakens.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2007", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Transformers: Optimus Prime. Several versions, anyway.\n In Transformers Prime, it is hinted that Breakdown is (or was) this to the Decepticon Mooks under his command", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [], 
                "role": "Transformers' Optimus Prime is universally this, with a voice so deep and weighty it would crush the vocalizers of lesser 'bots.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [
                    "logical", 
                    "level-headed", 
                    "willing", 
                    "great", 
                    "other", 
                    "British", 
                    "male", 
                    "real", 
                    "glorious", 
                    "loyal", 
                    "mutual", 
                    "Yes-Man", 
                    "apparent", 
                    "glorious", 
                    "glorious", 
                    "half-dead", 
                    "hard"
                ], 
                "role": "Transformers (or more specifically, Megatron) has a ton of these.\n Transformers Generation 1 has Shockwave and Soundwave, both logical, level-headed, and more than willing to kick aft in Megatron's name. Soundwave even saved Megatron's life once in The Movie, though his loyalty apparently wasn't great enough to stop The Starscream and the other Decepticons from tossing him out Astrotrain's airlock five minutes later. And Shockwave even has a British accent!\n Beast Wars has Inferno, combined with a dash of Sociopathic Soldier, who has a glitch in his programming causing him to think he really is a fire ant, with Megatron as his \"Queen.\" The fact that Megatron is male doesn't seem to bother him.\n From Transformers Armada, Demolisher could qualify, but the real winner was  Starscream of all mechs, who lost his memory in the sequel Transformers Energon. For one glorious season Megatron had the most loyal Decepticon he could ever ask for, and one who eventually  followed Megatron into the Energon sun, to their mutual deaths.\n Finally, Transformers Animated crosses the Battle Butler with the Yes-Man in the character Lugnut. His only apparent motivation for fighting (or doing anything, really) is his undying loyalty to Megatron. Naturally, he hates Starscream, and will use his Punch of Kill Everything to pound you into the dirt for even the slightest hint of disrespect or treason.\n Lugnut has two driving forces in his programming: The compulsion to serve the grand and glorious Megatron, and the utter destruction of Autobots (in the name of his glorious master).\n The Transformers Prime version of Soundwave is also this. While he usually just hovers omniously in the background, his presence alone keeps Starscream from pulling the plug on a half-dead Megatron. Airachnid learned this the hard way.", 
                "id": "BattleButler"
            }, 
            {
                "adjectives": [
                    "giant", 
                    "planet-eating", 
                    "robotic"
                ], 
                "role": "Transformers:\n Unicron the giant, planet-eating, robotic, chaos god had a mustache and goatee. He also gave one to his minion Scourge, along with a lovely set of pink fingernails.\n As does the evil Junkion Detritus.", 
                "id": "BeardOfEvil"
            }, 
            {
                "adjectives": [
                    "distinct", 
                    "human", 
                    "young"
                ], 
                "role": "Implied a bit in Transformers. Between mannerisms and personality, Bumblebee seems to be in the Cybertronian analogue of his mid-teens, and the Twins give the distinct impression of being the equivalent of twelve. They are probably older than most human civilizations, but they're young for their species.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "younger-minded", 
                    "main", 
                    "analogous", 
                    "Cybertronian", 
                    "'slow", 
                    "mental", 
                    "clear", 
                    "wrong", 
                    "final", 
                    "warrior-class", 
                    "due", 
                    "young", 
                    "later"
                ], 
                "role": "Occasionally implied in the Transformers metaseries with the younger-minded characters. Done outright in Transformers Animated with Sari  especially after she turns out to be a Robot Girl and is pushed into the front lines in season 3.\n The episode \"Human Error\"  (where the main 'bots are shown in analogous human bodies) shows that Bumblebee is the Cybertronian equivalent of roughly her age.\n  Omega Supreme might also count, given that he was specifically created to be a superweapon and purposefully made mentally 'slow' so that he wouldn't question orders. Not a child, but close to a child's mind.\n The Transformers in Animated have an explicit childhood stage. He was a child soldier with mild mental retardation, and the actions of his creators made it clear that they knew what this would do to him, and how wrong their actions were.\n Transformers Prime's version of Bumblebee may also be considered this. The prequel novels state outright that he was among the final generation of Cybertronians to be born, and while fighting on the front lines is not given any explicit significance for him, the episode \"Masters and Students\" hints that he's not officially recognized as warrior-class due to being too young, though a later episode would have him admit he was holding off until they fixed Cybertron.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [
                    "other", 
                    "true"
                ], 
                "role": "Jetfire from Transformers.\n Sentinel Prime initially appears to be this to the other Autobots and their human allies, until he shows his true colors.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "old", 
                    "cool", 
                    "old", 
                    "common", 
                    "war-related", 
                    "old", 
                    "medic", 
                    "old", 
                    "much", 
                    "go-to", 
                    "fond", 
                    "insubordinate/uncooperative", 
                    "other", 
                    "codger-y", 
                    "such", 
                    "protective", 
                    "young", 
                    "same", 
                    "different", 
                    "original", 
                    "likely", 
                    "old"
                ], 
                "role": "Most \"old\" characters in Transformers tend to be cool old guys. Since they don't age like humans, the most common cause of death is war-related and anyone who survives to be really really old probably did so by being really really badass.\n Ratchet in Transformers Animated is definitely a badass, despite sporting a beer gut. He's also the team's medic, making comparisons to Bones McCoy even more impossible.\n Also Ultra Magnus, especially [when he's got his hammer with him.\n Kup in Transformers Generation 1 is definitely a cool old guy, like Animated Ratchet but much less grumpy. Also, in \"All Hail Megatron\" he gets a bitchin' robot cigar to chew on.\n Even Ratchet's G1 incarnation, who's not really intended to represent any extreme of age the way Kup is, tends to get a lot of this trope. His canon appearances as a competent medic and go-to guy paved the way for his interpretation by the fans. Fandom is especially fond of causing him to bludgeon insubordinate/uncooperative patients with wrenches and other tools, go all Doc McCoy even on Optimus Prime's aft, and generally act in a lovably codger-y manner, even ascribing him Cool Old Guy traits such as extreme shrewdness and a wrathfully protective nature regarding his crewmates (the young twins Sunstreaker and Sideswipe tend to be at the receiving end of his lectures and fists, more often than not).\n Somewhat justified by G1 Ratchet and Ironhide being the same toy with different color schemes.\n G1 Ironhide was the franchise's original Cool Old Guy . His toy card specifically states how he's the oldest Autobot, the most likely to break down from outdated parts, but too stubborn and orny to give up and quit fighting. The show just made it better by giving him a Southern grandpa accent to match.\n Vector Prime in Transformers Cybertron is both cool and so old he's made of clockwork.\n Scavenger in Transformers Armada was mentor to Optimus freaking Prime.\n And don't forget Revenge of the Fallen Jetfire. When Scorponok erupts from the sand without warning, Jetfire simply stabs him in the head with his cane, just about as quickly.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "well-regarded", 
                    "other", 
                    "foppish"
                ], 
                "role": "Abominus from the Transformers Mirror Universe of Shattered Glass. The Shattered Glass Terrorcons are all well-regarded performers of some form or other, and when combined their foppish charm is magnified tenfold.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "'army", 
                    "suck-up", 
                    "chronic"
                ], 
                "role": "Throughout Transformers, Starscream is and always has been a dirty coward, instinctively fleeing as soon as any fight starts even leaning in the enemy's favour. He will also fight like a coward, with cheap shots and ambushes, even if he probably had the advantage anyway.\n Taken Up to Eleven in Transformers Animated, where he makes  five clones to help him overthrow Megatron (hey, it's The Starscream we're talking about here), each of which represent one facet of his personality. This being Starscream, his 'army' consists of a pantophobe, an egomaniac, a suck-up, a chronic liar, and... something.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "Cybertron-built", 
                    "Cybertronian", 
                    "time-warped", 
                    "prehistoric", 
                    "alternative", 
                    "familiar", 
                    "valiant", 
                    "original"
                ], 
                "role": "Dumb Muscle: The Dinobots, especially Sludge. Though that was because in the G1 cartoons, they were built on Earth, without Cybertron-built brains. The \"GI Joe Vs. the Transformers\" Dinobots were originally five totally Cybertronian Autobots who were time-warped to Earth's prehistoric age by Teletran 3, and given dinosaur bodies (with which they tore through Shockwave's Decepticons) as alternative forms. The following volume, had Grimlock talk in the familiar third-person speech we know him for, but he does learn to appreciate the Joes as valiant warriors... and \"Good friends.\" Devastator in the original, Tidal Wave in Armada", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [], 
                "role": "Grumpy Old Man: Kup, Jetfire and Ratchet qualify. What about Ironhide?", 
                "id": "GrumpyOldMan"
            }, 
            {
                "adjectives": [], 
                "role": "Trent comes off as a Jerk Jock in his brief appearance in Transformers.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "tongue-in-cheek", 
                    "complete", 
                    "other", 
                    "eagle", 
                    "typical", 
                    "'noble", 
                    "noble", 
                    "animal"
                ], 
                "role": "Silverbolt, from Transformers: Beast Wars, is a usually tongue-in-cheek example of this type. He's not a parody so much as a walking Lampshade Hanging, complete with trumpet fanfares when he speaks. It really helps that both his animals - one a wolf, the other an eagle - are typical 'noble' animals. (which sorta makes a Griffin an even more noble animal)\n Sadly, he also counts as a case of Stupid Good.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [], 
                "role": "Men Can't Keep House: Sam's room, with his suggested Porn Stash.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [
                    "complete"
                ], 
                "role": "Sam Witwicky's room in Transformers, complete with Porn Stash references.", 
                "id": "MenCantKeepHouse"
            }, 
            {
                "adjectives": [
                    "common", 
                    "pregnant"
                ], 
                "role": "Transformers Mpreg is fairly common, starting with the fact that you can count the number of females in G1 on one hand but the number of males ranks in the thousands, and ending with them being robots. The tougher question should be how they can get pregnant.", 
                "id": "MisterSeahorse"
            }, 
            {
                "adjectives": [
                    "feminine", 
                    "female", 
                    "outright", 
                    "serious", 
                    "childish", 
                    "narrow-waisted", 
                    "metrosexual", 
                    "great", 
                    "giant"
                ], 
                "role": "Transformers\n Starscream moves up and down a Sliding Scale of Girlishness and Childishness depending on the series and translation, but is consistently  feminine bitchy. Some have mistakenly made him a girl, some have given him a female clone, some have made him an outright giggling fool and some have even made him a somewhat serious air commander... with a childish attitude and a girlfriend to complain to about how his lord and master mistreats him. Expect every incarnation to be a narrow-waisted, whiny, flighty asshole prone to backstabbing his lord and master for insults and ambition.\n Transformers Prime gives us Knock Out, a metrosexual Decepticon who puts great concern with his vehicle form. Watch the Paint Job. Seriously, don't scratch his paint job, he has a giant drill.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "Several", 
                    "metal", 
                    "apparent", 
                    "long", 
                    "white", 
                    "black"
                ], 
                "role": "Several Transformers characters have metal beards, goatees, or mustaches.\n In Transformers Generation One we have an apparent case of a metal beard growing. Alpha Trion has a long white metal beard, but during a time travel episode a younger version is seen with a black metal mustache. Best not to think about it.", 
                "id": "WeirdBeard"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "straight", 
                    "infinite", 
                    "female", 
                    "curvy", 
                    "sexy", 
                    "diverse", 
                    "original", 
                    "new", 
                    "previously-male", 
                    "primary", 
                    "original", 
                    "sexual", 
                    "common", 
                    "cosmetic", 
                    "same", 
                    "particular", 
                    "female", 
                    "beast-like", 
                    "first", 
                    "huge", 
                    "unnamed", 
                    "'monster", 
                    "half-Autobot"
                ], 
                "role": "Both averted and played straight in Transformers and its infinite spin-offs. The earliest female robots were indeed curvy and sexy, but more diverse female Transformer designs have been introduced, whether they were original characters, or new characters based on previously-male toys. However, \"sexy\" female Transformers are still the primary type.\n Dialogue, in the original series and Beast Wars, imply that sexual dimorphism is common amongst Cybertronians, Black Arachnia, Arcee and Thunderblast being a perfect example. Rat-Trap even mentions female stripper-bots with \"enhanced chest-plates\" or some such. The fact they even have strippers, to say nothing of cosmetic surgery, implies that our notions of gender roles are the same despite them being alien robots.\n For a particular aversion Strika. Yes, she is a girl.\n An earlier version of the character was even less feminine, and there was NO indication she was female when she first showed up; she pretended to have a beast-like mentality, only yelling wordlessly if she ever made any noise. When she spoke for the first time, well, huge surprise. Her earlier incarnation (a retcon naming an unnamed G1 Autobot as her) wasn't particularly shapely either, unless you count \"box\" as a shape.\n Transformers Animated Has Sari, though she's less a 'monster' than a half-Autobot", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "bad", 
                    "bad", 
                    "hat", 
                    "treacherous", 
                    "very", 
                    "popular", 
                    "many", 
                    "first", 
                    "own", 
                    "previous", 
                    "Opposite-Sex", 
                    "own"
                ], 
                "role": "Blackarachnia of Transformers: Beast Wars is a bad, bad girl, ready to dish out pain by the bucket at the drop of a hat, as well as a treacherous Femme Fatale when it suits her. These two things, in combination, made her very popular in the fandom. Unlike many, though, she does do a Heel-Face Turn in the end, though, at first, it's just for her own safety.\n Despite the previous having a counterpart in Animated, another for this trope would be Starscream's Opposite-Sex Clone.\n Airachnid of Transformers Prime. This is a woman (well, fembot) who got bored with her job as a Torture Technician and decided, as a hobby, to hunt endangered species and keep trophies from her kills. Rather than finding endangered species to hunt, she makes her own.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "female", 
                    "few", 
                    "female", 
                    "full", 
                    "general", 
                    "fangirl", 
                    "sure"
                ], 
                "role": "Transformers has always been aimed at boys, with female characters in the franchise few and far-between. Despite this, the series has a female fanbase — which is commonly portrayed in the fandom as being full of fangirls who ship Megatron/Starscream. Starscream in general seems to be fangirl bait, no matter the continuity. Nobody's really sure why.", 
                "id": "EstrogenBrigade"
            }, 
            {
                "adjectives": [
                    "due", 
                    "high"
                ], 
                "role": "In the 2007 Transformers movie, the analyst who helps decode the alien data probably should do some modeling on the side. Though some might not notice her due to the high competition of Mikaela Banes.\n Interestingly, Word of God says she actually DID do modelling work to put herself through college.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "high", 
                    "gear", 
                    "troubled"
                ], 
                "role": "Mikaela Banes from Transformers looks like she's developing into this, before the plot kicks into high gear and her troubled history comes out.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Sam Witwicky's mom in the Transformers movies.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [
                    "female", 
                    "male"
                ], 
                "role": "The female lead of the Transformers movies, whose life revolves around the male lead.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "sweet", 
                    "friendly", 
                    "old"
                ], 
                "role": "Annabelle Lennox in the Transformers fanfic Black Crayons. She's sweet and friendly, but she can be as brave and stubborn as her parents (or Ironhide) when she needs to. She sneaks her way into a warzone because she thought she needed to be there. Keep in mind that she's six years old at the time.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "good", 
                    "vital", 
                    "hard-to-relay-without-getting-caught", 
                    "plastic"
                ], 
                "role": "Ray Epps' wife in the novelization of Transformers: Revenge of the Fallen fits this. Also a bit of a Crowning Moment Of Awesome in that she managed to get the good guys a piece of very vital, hard-to-relay-without-getting-caught information under the guise of wanting her husband to pay for plastic surgery.", 
                "id": "SassyBlackWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Transformers has the Rosa Klebb version in Strika.", 
                "id": "TheBaroness"
            }
        ]
    }, 
    "imdbid": "tt0418279", 
    "similar": [
        {
            "shared": [
                "CulturedBadass", 
                "ChildSoldiers", 
                "TheBaroness", 
                "DirtyCoward", 
                "MisterSeahorse", 
                "CoolOldGuy", 
                "DarkActionGirl", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "AFatherToHisMen", 
                "PluckyGirl"
            ], 
            "shared_count": 11, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "MenCantKeepHouse", 
                "MisterSeahorse", 
                "NeverASelfMadeWoman", 
                "BeardOfEvil", 
                "GrumpyOldMan", 
                "DirtyCoward", 
                "CuteMonsterGirl", 
                "SissyVillain", 
                "WeirdBeard"
            ], 
            "shared_count": 9, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "BattleButler", 
                "JerkJock", 
                "KnightInShiningArmor", 
                "TheBaroness", 
                "SissyVillain", 
                "DirtyCoward", 
                "HotScientist"
            ], 
            "shared_count": 8, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "BattleButler", 
                "CoolOldGuy", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "WeirdBeard", 
                "DirtyCoward", 
                "BeardOfEvil"
            ], 
            "shared_count": 7, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "CoolOldGuy", 
                "DarkActionGirl", 
                "EstrogenBrigade", 
                "WeirdBeard", 
                "DirtyCoward", 
                "CuteMonsterGirl"
            ], 
            "shared_count": 6, 
            "id": "Ben10", 
            "name": "Ben 10"
        }
    ], 
    "id": "Transformers", 
    "name": "Transformers"
}