{
    "plot": "A youth chooses manhood. The week Sam Witwicky starts college, the Decepticons make trouble in Shanghai. A presidential envoy believes it's because the Autobots are around; he wants them gone. He's wrong: the Decepticons need access to Sam's mind to see some glyphs imprinted there that will lead them to a fragile object that, when inserted in an alien machine hidden in Egypt for centuries, will give them the power to blow out the sun. Sam, his girlfriend Mikaela Banes, and Sam's parents are in danger. Optimus Prime and Bumblebee are Sam's principal protectors. If one of them goes down, what becomes of Sam?", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "geriatric", 
                    "major"
                ], 
                "role": "Badass Grandpa: The geriatric Jetfire still kicks major ass.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [], 
                "role": "Cool Old Guy: Jetfire", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Transformers: Revenge of The Fallen: Starscream seems to almost revel in it. In this film, in an exchange with Megatron that combines this with Know When to Fold 'Em:", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "only"
                ], 
                "role": "He's the only guy who can order Megatron around in Transformers: Revenge of The Fallen.", 
                "id": "ScaryBlackMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "interesting", 
                    "new", 
                    "female", 
                    "fragile"
                ], 
                "role": "Faux Action Girl: The Arcees. At first glance, they're among the more interesting of the new Autobots introduced: a trio of female motorcycle Transformers. We're set up to expect a Crowning Moment Of Awesome from them, since they're Fragile Speedsters with the emphasis on \"fragile\".", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Transformers: Revenge of The Fallen: One can be seen during the scene where Sam is in his astronomy class sitting in the front row, whom the professor (Rainn Wilson) drops his apple to and tells her to finish it for him.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [
                    "surprising", 
                    "last"
                ], 
                "role": "Ms. Fanservice: Mikaela Banes, not surprising considering she's played by Megan Fox, she shows more skin in this movie than in the last film, her clothing in this film mainly consists of sleveeless shirts and dresses", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Revenge of the Fallen has Alice, the hottest Decepticon ever.", 
                "id": "RobotGirl"
            }, 
            {
                "adjectives": [
                    "hot", 
                    "unclear"
                ], 
                "role": "In Transformers: Revenge of The Fallen, amazingly hot college girl Alice is intent upon getting with Sam for unclear reasons.  She's a Decepticon spy named Pretender. Yes, they can turn into humans now.", 
                "id": "TheVamp"
            }, 
            {
                "adjectives": [], 
                "role": "Uncanny Valley Girl: Alice", 
                "id": "UncannyValleyGirl"
            }
        ]
    }, 
    "imdbid": "tt1055369", 
    "poster_url": "TransformersRevengeOfTheFallen.jpg", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa", 
                "TheVamp", 
                "ScaryBlackMan", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "CoolOldGuy", 
                "FauxActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "MortalKombat", 
            "name": "Mortal Kombat", 
            "poster_url": "MortalKombat.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "Meganekko", 
                "CoolOldGuy", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "CoolOldGuy", 
                "ScaryBlackMan", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "MsFanservice", 
                "ScaryBlackMan"
            ], 
            "shared_count": 3, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }
    ], 
    "id": "TransformersRevengeOfTheFallen", 
    "name": "Transformers: Revenge of The Fallen"
}