{
    "plot": "Southern Californian Bree Osbourne, formerly Stanley Chupak, has finally received the news for which she has been waiting: she has been approved for male-to-female sexual reassignment surgery. But before Margaret, her therapist, will allow her to go through with the surgery scheduled in a week's time, Bree has to deal with an unresolved problem from her past. Bree gets a telephone call from a seventeen year old man named Toby Wilkins, who is looking for Stanley, his biological father. Toby is in a New York jail, having been supporting himself by petty crime and hustling. Stanley/Bree knew nothing about Toby before the telephone call. Toby apparently is all alone in the world, with his mother having committed suicide and being estranged from his stepfather in Tennessee. Masquerading as a Christian social worker, Bree, not telling him either of her true identity or her transgender status, bails Toby out of jail and tells him she will take him to Los Angeles, where Toby has aspirations of becoming a porn actor and reconnecting with his biological father. As Bree and Toby take their trans-American journey which includes some interesting encounters along the way, Bree has to decide what is best for Toby while having the foremost goal of making it back to Los Angeles for the scheduled surgery.", 
    "genres": "Adventure, Comedy, Drama", 
    "release_year": "2005", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Cool Little Sis: Sydney.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [], 
                "role": "Hooker with a Heart of Gold: Toby.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "step-father"
                ], 
                "role": "Missing Mom:  Toby's mom killed herself when he was younger. This event was because she either found out about, or was the impetus of, Toby's step-father molesting him.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0407265", 
    "poster_url": "Transamerica.jpg", 
    "similar": [
        {
            "shared": [
                "CoolBigSis", 
                "HookerWithAHeartOfGold"
            ], 
            "shared_count": 2, 
            "id": "Queen", 
            "name": "Queen", 
            "poster_url": "Queen.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "TheTown", 
            "name": "The Town", 
            "poster_url": "TheTown.jpg"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "BatmanMysteryOfTheBatwoman", 
            "name": "Batman: Mystery of the Batwoman", 
            "poster_url": "BatmanMysteryOfTheBatwoman.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "Unforgiven", 
            "name": "Unforgiven", 
            "poster_url": "Unforgiven.jpg"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "BreakfastOnPluto", 
            "name": "Breakfast on Pluto", 
            "poster_url": "BreakfastOnPluto.jpg"
        }
    ], 
    "id": "Transamerica", 
    "name": "Transamerica"
}