{
    "plot": "Hard rock idol Sammi Curr burns to death in a hotel fire. His biggest fan, Lakeridge High School student and resident metal head Eddie Weinbauer is devastated by the news and turns to local radio DJ \"Nuke\" for emotional support. After a heated discussion about the deceased rock star, Nuke presents Eddie with a rare demo record, the last ever recorded by Sammi and the only copy in existence. Overwhelmed by Nuke's generosity, Eddie accepts the gift without hesitation, unaware of it's dark role in things to come. After constant humiliation and a near drowning at the hands of school bully Tim Hainy and his sports jock friends, Eddie becomes enraged and vows revenge on all those who have wronged him, much to the dismay of love interest, Leslie and best friend, Roger. Alone in his room with feelings of rage and retribution racing through his mind, Eddie places the new record onto his stereo and is shocked to discover that he can communicate with the deceased rock star when it is rotated backwards. Playing upon both Eddie's loyalty and emotional vulnerability, Sammi instructs the teenager on how to get back at those who have caused him so much pain, instructions that the easily manipulated Eddie carries out, prompting the usual 'underdog gets his own back' results. At first it's all fun and games as Hainy and his cohorts get their just desserts, but when Hainy's girlfriend is nearly killed by supernatural forces, Eddie realizes that he is nothing more than a pawn in a much more sinister plot and wants out. When Eddie tries to destroy the record, an evil version of Sammi is resurrected (complete with supernatural powers) and goes on a rampage at the high school Halloween dance, turning Eddie's involvement with the devilish rock star into a spine tingling nightmare not only for the young headbanger, but for his school and hometown as well. Can Eddie stop the demonic Sammi before he sends the entire town straight to hell? One thing's for sure, the teenagers of Lakeridge High are in for a Halloween they'll never forget.", 
    "genres": "Comedy, Horror, Music", 
    "release_year": "1986", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Alpha Bitch: Gennie.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "Lovable"
                ], 
                "role": "Lovable Alpha Bitch: Leslie, who likes Eddie despite facing scorn from the others.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Eddie's love interest Leslie.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0092112", 
    "poster_url": "TrickOrTreat.jpg", 
    "similar": [
        {
            "shared": [
                "TheChick", 
                "AlphaBitch", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "TheHotChick", 
            "name": "The Hot Chick", 
            "poster_url": "TheHotChick.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "AlphaBitch", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "HighSchoolMusical", 
            "name": "High School Musical", 
            "poster_url": "HighSchoolMusical.jpg"
        }, 
        {
            "shared": [
                "TheChick", 
                "AlphaBitch", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "GeekCharming", 
            "name": "Geek Charming"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "Heathers", 
            "name": "Heathers", 
            "poster_url": "Heathers.jpg"
        }, 
        {
            "shared": [
                "AlphaBitch", 
                "LovableAlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "GBF", 
            "name": "GBF", 
            "poster_url": "GBF.jpg"
        }
    ], 
    "id": "TrickOrTreat", 
    "name": "Trick Or Treat"
}