{
    "plot": "Sam Flynn, the tech-savvy 27-year-old son of Kevin Flynn, looks into his father's disappearance and finds himself pulled into the same world of fierce programs and gladiatorial games where his father has been living for 20 years. Along with Kevin's loyal confidant Quorra, father and son embark on a life-and-death journey across a visually-stunning cyber universe that has become far more advanced and exceedingly dangerous. Meanwhile, the malevolent program CLU, who dominates the digital world, plans to invade the real world and will stop at nothing to prevent their escape.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2010", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "sexual", 
                    "sexual"
                ], 
                "role": "Camp Straight: Although we never really get a hint at whether programs actually have sexual orientations, or even whether the concept of sexual orientation would make any sense in The Grid, Castor is most definitely camp... turned Up to Eleven... IN CYBERSPAAAAAAAAACE!", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "Technical", 
                    "Physical"
                ], 
                "role": "Kevin Flynn in TRON: Legacy, who despite being an Technical Pacifist, demonstrates that he's badass enough that all he needs to do is enter a room and he can shut down everything currently inside simply from his presence. Doesn't hurt that he's a Physical God in this world... after all, he built it.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "many", 
                    "content"
                ], 
                "role": "Subverted with Kevin Flynn. While he technically is a God, as the Creator of the Grid, indeed being venerated by many Programs and ISOs, Flynn clearly does not wish for any of this worship and devotion, instead content to act in the role as benevolent father-figure who wishes to help his creations.", 
                "id": "CoolOldGuy"
            }, 
            {
                "adjectives": [
                    "digital"
                ], 
                "role": "Disappeared Dad: He's been in the digital world all this time.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "digital"
                ], 
                "role": "Kevin Flynn in TRON Legacy, having been trapped in the digital world for twenty years.", 
                "id": "DisappearedDad"
            }, 
            {
                "adjectives": [
                    "same"
                ], 
                "role": "Likewise, Kevin Flynn in TRON: Legacy, played by the same actor.", 
                "id": "LooksLikeJesus"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Sam gets two. One not voluntarily, though.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [], 
                "role": "Castor/Zuse from TRON: Legacy.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [
                    "full", 
                    "original"
                ], 
                "role": "TRON: Legacy: Sam (Hunter), Clu (Lord), Flynn (Prophet). It's a bit tricky since Clu is Flynn, frozen in time when he was still full of himself and obsessed with perfection.\n In the original, Flynn (Hunter), Dillinger (Lord), and Walter (Prophet).", 
                "id": "TheThreeFacesOfAdam"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Quorra. Even when captured, she still has the gumption to strike back at Rinzler the instant Sam distracts him.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Quorra from TRON: Legacy certainly qualifies despite the fact that she seems to favor the Light Runner over the Light Cycles.", 
                "id": "BikerBabe"
            }, 
            {
                "adjectives": [], 
                "role": "Emotionless Girl: The Armory Sirens, except for Gem.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "unlike", 
                    "classic", 
                    "clad", 
                    "white", 
                    "white"
                ], 
                "role": "Femme Fatale: Gem, although unlike classic examples, she is clad in white and has white hair.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Quorra. On the couch. With her legs.◊", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "The armory sirens in TRON: Legacy, specifically Gem.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt1104001", 
    "poster_url": "TronLegacy.jpg", 
    "similar": [
        {
            "shared": [
                "DisappearedDad", 
                "ShirtlessScene", 
                "CoolOldGuy", 
                "ActionGirl", 
                "CampStraight"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "ShirtlessScene", 
                "MsFanservice", 
                "WomanInWhite", 
                "SissyVillain"
            ], 
            "shared_count": 5, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "DisappearedDad", 
                "ShirtlessScene", 
                "CoolOldGuy", 
                "FemmeFatale"
            ], 
            "shared_count": 5, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "MsFanservice", 
                "CoolOldGuy", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "SissyVillain", 
                "CoolOldGuy", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "Skyfall", 
            "name": "Skyfall", 
            "poster_url": "Skyfall.jpg"
        }
    ], 
    "id": "TronLegacy", 
    "name": "TRON: Legacy"
}