{
    "plot": "As Phyllis, a Beverly Hills housewife, is in the middle of a divorce, she tries to find focus in her life by taking over her daughter Hannah's Wilderness Girl troop. Among the girls are Tiffany, (who her father has to bribe to attend meetings, Emily (the daughter of an out of work actor, whose financial difficulties hinders her wanting to participate in certain activities), the neurotic Tessa (whose parents divorce has forced her into therapy twice a week), the hostile Chica (whose parents are too busy with their own lives to even remember her birthday), and Claire (the child star who see the wilderness girls as her chance to lead a \"normal\" life). Phyllis then begins to take the girls camping at a Beverly Hills hotel and earn patches relating to material things. The district leader, Velda, feels the troop should be disbanded. However, the head of the Wilderness girls organization believes that as long as Phyllis has taken an active interest in the girls, that is the only thing that's important. Then Velda begins to sabotage the girls endlessly.", 
    "genres": "Adventure, Comedy", 
    "release_year": "1989", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "good"
                ], 
                "role": "A Father to His Men: Well, Phyllis is A Mother To Her Girls and becomes a Parental Substitute to some of them while inspiring all of them to feel good about themselves.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "super-handsome"
                ], 
                "role": "Chick Magnet: The super-handsome cop who shows up to teach the girls first aid, if their response to his asking for a volunteer is any indication.... Cutely enough, when the girls all yell \"ME!\", he points at Phyllis without missing a beat: \"You.\"", 
                "id": "ChickMagnet"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "main", 
                    "entire", 
                    "grown"
                ], 
                "role": "Velda herself is pretty much the main Alpha Bitch of the entire organization even though she's a grown woman.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: In spades.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Phyllis Nefler in Troop Beverly Hills.", 
                "id": "Socialite"
            }, 
            {
                "adjectives": [
                    "stereotypical", 
                    "impending", 
                    "soon-to-be", 
                    "new", 
                    "own", 
                    "finish"
                ], 
                "role": "Phyllis Nefler (played by Shelley Long) from Troop Beverly Hills is a stereotypical spoiled Beverly Hills housewife who cares very much for the girls of the troop she leads. She is also genuinely heartbroken over the impending end of her marriage and her soon-to-be ex-husband's new girlfriend. When Velda, an enemy troop leader who has constantly put down and sabotaged Phyllis's troop, is injured and abandoned by her own troop during the Wilderness Girl Jamboree race, Phyllis and her troop carry Velda to the finish line.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [], 
                "role": "Spoiled Sweet: Phyllis and all her girls, saving perhaps Cheeka.", 
                "id": "SpoiledSweet"
            }
        ]
    }, 
    "imdbid": "tt0098519", 
    "poster_url": "TroopBeverlyHills.jpg", 
    "similar": [
        {
            "shared": [
                "SpoiledSweet", 
                "PluckyGirl", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "WreckItRalph", 
            "name": "Wreck-It Ralph", 
            "poster_url": "WreckItRalph.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "PluckyGirl", 
                "AlphaBitch"
            ], 
            "shared_count": 3, 
            "id": "ALittlePrincess", 
            "name": "A Little Princess", 
            "poster_url": "ALittlePrincess.jpg"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "PluckyGirl", 
                "AFatherToHisMen"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "SpoiledSweet", 
                "AFatherToHisMen"
            ], 
            "shared_count": 2, 
            "id": "Lincoln", 
            "name": "Lincoln", 
            "poster_url": "Lincoln.jpg"
        }, 
        {
            "shared": [
                "ChickMagnet", 
                "PluckyGirl"
            ], 
            "shared_count": 2, 
            "id": "NorwegianWood", 
            "name": "Norwegian Wood", 
            "poster_url": "NorwegianWood.jpg"
        }
    ], 
    "id": "TroopBeverlyHills", 
    "name": "Troop Beverly Hills"
}