{
    "plot": "Harry Tasker leads a double life. At work he is a government agent with a license to do just about anything, while at home he pretends to be a dull computer salesman. He is on the trail of stolen nuclear weapons that are in the hands of fanatic terrorists when something more important comes up. Harry finds his wife is seeing another man because she needs some adventure in her life. Harry decides to give it to her, juggling pursuit of terrorists on one hand and an adventure for his wife on the other while showing he can Tango all at once.", 
    "genres": "Action, Comedy, Romance", 
    "release_year": "1994", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "little"
                ], 
                "role": "Papa Wolf: When his little girl is kidnapped, Harry borrows the aforementioned Harrier Jet to rescue her and face the Big Bad.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "small"
                ], 
                "role": "Teeny Weenie: When being interrogated by Harry and Gib, Simon confesses that he has to lie to women to get laid because he has a small penis.", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [
                    "True"
                ], 
                "role": "True Lies, when Albert \"Gib\" Gibson (Tom Arnold) is shot at and he hides behind a lamppost, as soon as the gunfire stops he checks out his \"package\".", 
                "id": "TestesTest"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "entire", 
                    "shy", 
                    "first", 
                    "initial", 
                    "well-placed", 
                    "near-unconciousness", 
                    "later", 
                    "Curb-Stomp"
                ], 
                "role": "Helen, for the entire movie, just shy of being an Action Girl. The first and biggest example? During the initial raid, while Simon is pleading and crying, she almost gets away from the trained operatives twice, by a well-placed knee to Gib and biting Harry. Then, she almost spoils the following interrogation by breaking the glass with her stool. Later, she beats Harry to near-unconciousness with a telephone, almost knocks him out later, and almost turns her Designated Girl Fight into a Curb-Stomp Battle with a champagne bottle.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Adrenaline Makeover: Helen.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "incredible", 
                    "final"
                ], 
                "role": "Helen Tasker in True Lies. The meek housewife ditches the glasses, the hairdo, and the frumpy clothes that concealed her incredible physique. By the final scene, she and her husband are apparently a Battle Couple.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "nuclear"
                ], 
                "role": "Dana in True Lies is in the end saved by her father, but before that, she steals the key that the terrorists need to detonate their nuclear bomb.", 
                "id": "BadassDamsel"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "shy", 
                    "first", 
                    "initial", 
                    "well-placed", 
                    "near-unconciousness", 
                    "later", 
                    "Curb-Stomp", 
                    "entire", 
                    "entire"
                ], 
                "role": "Damsel out of Distress: Helen, for the entire movie, just shy of being an Action Girl. The first and biggest example? During the initial raid, while Simon is pleading and crying, she almost gets away from the trained operatives twice, by a well-placed knee to Gib and biting Harry. Then, she almost spoils the following interrogation by breaking the glass with her stool. Later, she beats Harry to near-unconciousness with a telephone, almost knocks him out later, and almost turns her Designated Girl Fight into a Curb-Stomp Battle with a champagne bottle. It also seems to run in the family. Dana, her daughter, when faced with the entire rogue faction, not only manages to get away, she also swipes the nuke ignition key, and keeps it for the entire climax.", 
                "id": "DamselOutOfDistress"
            }, 
            {
                "adjectives": [
                    "fantastic"
                ], 
                "role": "Ms. Fanservice: Jamie Lee Curtis, particularly in this scene. Also Tia Carrere and her fantastic cleavage and legs.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "kidnapped", 
                    "later", 
                    "true", 
                    "bad", 
                    "incredulous"
                ], 
                "role": "Subverted in True Lies. Mousy Helen Tasker wants a little adventure in her life, but not if it requires her to cheat on her husband. Later, when she and Harry are both kidnapped, she tries to tell him \"let me do the talking\". Even later, Helen finds out her husband is a spy, and falls into true Neutral Female territory. Later still, Helen tries to help Harry by taking up a gun she has no idea how to shoot, and drops it. As Helen winces at her \"oopsie\", the gun falls down the stairs, still firing, and takes out every bad guy in the room. At Harry's look of incredulous awe, she shrugs and smiles. Kidnapped again, though, she smacks her kidnapper upside the head with a bottle of Dom Perignon, and is well on her way to the XP required for her level in Badass.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [
                    "True"
                ], 
                "role": "True Lies, twice. Juno Skinner keeps her business card in her bra. Likewise Helen hides the transmitter bug between her breasts, however she quickly loses it when her Dress Hits The Floor.", 
                "id": "Ptitleba4e2b2g"
            }
        ]
    }, 
    "imdbid": "tt0111503", 
    "poster_url": "TrueLies.jpg", 
    "similar": [
        {
            "shared": [
                "DamselOutOfDistress", 
                "MsFanservice", 
                "AdrenalineMakeover", 
                "BadassDamsel", 
                "ActionGirl", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 6, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }, 
        {
            "shared": [
                "BadassDamsel", 
                "DamselOutOfDistress", 
                "MsFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "NeutralFemale", 
                "ActionGirl", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "AdrenalineMakeover", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "NeutralFemale", 
                "ActionGirl", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 3, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }
    ], 
    "id": "TrueLies", 
    "name": "True Lies"
}