{
    "plot": "An out of the ordinary encounter with strange alien ooze mutates four ordinary pet turtles Leonardo, Raphael, Michelangelo, and Donatello into talking, walking, fighting green machines! Together, these brothers train with the legendary sensei rat, Splinter, to master the martial art of Ninjitsu. In this truly turtle powered tale, the turtles from one dimension meet the turtles from another dimension when a teleporting mishap occurs. What the shell is going on? Together, the turtles must locate the Technodrome to fix this mess! Meanwhile, Shredder tracks down his counterpart, Ch'rell, who devises a master plan to travel back to the Prime Universe to get rid of the turtles once and for all! As worlds collide, the turtles come face to face with classic characters like Casey and April, and a slew of enemies including Krang, Hun, the Foot Soldiers, the Purple Dragons, Bebop and Rocksteady!", 
    "genres": "Animation, Action, Adventure", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "straight-up", 
                    "martial"
                ], 
                "role": "Bash Brothers: A Ninja Turtles staple, but what makes this movie interesting is contrasting the more straight-up martial arts of the 2003 Turtles with the slapstick of the 1987 Turtles, and by the end their styles merge together.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "straight"
                ], 
                "role": "Turtles Forever takes this to the apex with the '03 Turtles eventually fighting in tandem with the '87 Turtles, and the '03 style of straight ninja fighting is contrasted with the '87 slapstick style.", 
                "id": "BashBrothers"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Distressed Damsel: April's role as one in the 1987 series is lampshaded in the movie.", 
                "id": "DamselInDistress"
            }
        ]
    }, 
    "imdbid": "tt1543920", 
    "poster_url": "TurtlesForever.png", 
    "similar": [
        {
            "shared": [
                "DamselInDistress", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "Hook", 
            "name": "Hook", 
            "poster_url": "Hook.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "ClashOfTheTitans", 
            "name": "Clash of the Titans", 
            "poster_url": "ClashOfTheTitans.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "BashBrothers"
            ], 
            "shared_count": 2, 
            "id": "RushHour", 
            "name": "Rush Hour", 
            "poster_url": "RushHour.jpg"
        }
    ], 
    "id": "TurtlesForever", 
    "name": "Turtles Forever"
}