{
    "plot": "Animal activists invade a laboratory with the intention of releasing chimpanzees that are undergoing experimentation, infected by a virus -a virus that causes rage. The naive activists ignore the pleas of a scientist to keep the cages locked, with disastrous results. Twenty-eight days later, our protagonist, Jim, wakes up from a coma, alone, in an abandoned hospital. He begins to seek out anyone else to find London is deserted, apparently without a living soul. After finding a church, which had become inhabited by zombie like humans intent on his demise, he runs for his life. Selena and Mark rescue him from the horde and bring him up to date on the mass carnage and horror as all of London tore itself apart. This is a tale of survival and ultimately, heroics, with nice subtext about mankind's savage nature.", 
    "genres": "Horror", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "A Father to His Men: Major West.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "Later", 
                    "dark"
                ], 
                "role": "Major West in 28 Days Later is a dark version of this.", 
                "id": "AFatherToHisMen"
            }, 
            {
                "adjectives": [
                    "Later", 
                    "civilized", 
                    "erudite", 
                    "boisterous", 
                    "female", 
                    "insane"
                ], 
                "role": "Major West in 28 Days Later initially appears to be this sort of character — a civilized, erudite gentleman in contrast to his lewd, boisterous underlings. Then he agrees to let his men gang-rape the female civilians they've \"rescued\". And seems a wee bit fond of Jim, as well. And then, when Jim brutally slaughters all of his men, he abandons what little of his civilized side he has left and goes completely insane.", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "future", 
                    "healthy"
                ], 
                "role": "Officer and a Gentleman: Played with in Major West, who  uses it to sucker in the women as sex toys for his men to keep up morale. Technically, West is trying to ensure a future, which will help keep up morale.  Yes, the soldiers will get sex toys out of it, but West seems to think his intentions are noble. Doubles as Exact Words: the radio message in the film says the militia has  \"the answer to infection.\" But he never says that the \"answer\" is raping healthy women.", 
                "id": "OfficerAndAGentleman"
            }, 
            {
                "adjectives": [
                    "brutal"
                ], 
                "role": "He doesn't really snap, he just realizes what he must do to survive. He's very brutal, though, but does it out of his care for the girls.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "Later", 
                    "Cillian", 
                    "whole", 
                    "private", 
                    "ulterior"
                ], 
                "role": "Inverted in 28 Days Later, in which we are treated to plenty of naked Cillian Murphy but the lead female keeps her bra on the whole time, and, in fact, requests that the soldiers leave the room so she can change her clothes in private (there was an ulterior motive for this).", 
                "id": "RightThroughHisPants"
            }, 
            {
                "adjectives": [
                    "Later"
                ], 
                "role": "Lieutenant Mailer, the Infected soldier in 28 Days Later.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Shirtless Scene: Stupid Sexy Murphy.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Adrenaline Makeover: Even if this trope is related with female characters, it goes for Jim. He started as The Load, ended up as Bad Ass. Arguably applies to Hannah as well. Her father initially joins forces with Jim and Selena so that they can take care of her if something happens to him.  But she ends up saving them at the end when she kills Major West.", 
                "id": "AdrenalineMakeover"
            }, 
            {
                "adjectives": [
                    "Later", 
                    "eponymous", 
                    "suicide", 
                    "much", 
                    "entire", 
                    "cold"
                ], 
                "role": "28 Days Later\n Hannah's mother is deceased, though whether this is before or after the eponymous period of devastation is unclear. Jim's parents commit suicide together some time before he wakes from his coma, realising somewhat what's happening, and though Jim is an adult this is presumably part of why he bonds so well with the much older Frank.\n According to Word of God Selena had to kill her entire family in one afternoon. No wonder she's so cold.", 
                "id": "MissingMom"
            }, 
            {
                "adjectives": [
                    "ambiguous"
                ], 
                "role": "Missing Mom: It's never explained what happend to Hannah's mother and it's actually left quite ambiguous.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0289043", 
    "poster_url": "TwentyEightDaysLater.jpg", 
    "similar": [
        {
            "shared": [
                "PapaWolf", 
                "AdrenalineMakeover", 
                "MissingMom", 
                "ShirtlessScene"
            ], 
            "shared_count": 4, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "RightThroughHisPants", 
                "MissingMom", 
                "ShirtlessScene"
            ], 
            "shared_count": 4, 
            "id": "RepoTheGeneticOpera", 
            "name": "Repo! The Genetic Opera", 
            "poster_url": "RepoTheGeneticOpera.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MissingMom", 
                "ScaryBlackMan", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 4, 
            "id": "GoneWithTheWind", 
            "name": "Gone with the Wind", 
            "poster_url": "GoneWithTheWind.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ShirtlessScene", 
                "AFatherToHisMen"
            ], 
            "shared_count": 3, 
            "id": "Soldier", 
            "name": "Soldier", 
            "poster_url": "Soldier.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ShirtlessScene", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "TheBoondockSaints", 
            "name": "The Boondock Saints", 
            "poster_url": "TheBoondockSaints.jpg"
        }
    ], 
    "id": "TwentyEightDaysLater", 
    "name": "28 Days Later"
}