{
    "plot": "Bella Swan has always been a little bit different. Never one to run with the crowd, Bella never cared about fitting in with the trendy, plastic girls at her Phoenix, Arizona high school. When her mother remarried and Bella chooses to live with her father in the rainy little town of Forks, Washington, she didn't expect much of anything to change. But things do change when she meets the mysterious and dazzlingly beautiful Edward Cullen. For Edward is nothing like any boy she's ever met. He's nothing like anyone she's ever met, period. He's intelligent and witty, and he seems to see straight into her soul. In no time at all, they are swept up in a passionate and decidedly unorthodox romance - unorthodox because Edward really isn't like the other boys. He can run faster than a mountain lion. He can stop a moving car with his bare hands. Oh, and he hasn't aged since 1918. Like all vampires, he's immortal. That's right - vampire. But he doesn't have fangs - that's just in the movies. And he doesn't drink human blood, though Edward and his family are unique among vampires in that lifestyle choice. To Edward, Bella is that thing he has waited 90 years for - a soul mate. But the closer they get, the more Edward must struggle to resist the primal pull of her scent, which could send him into an uncontrollable frenzy. Somehow or other, they will have to manage their unmanageable love. But when unexpected visitors come to town and realize that there is a human among them Edward must fight to save Bella? A modern, visual, and visceral Romeo and Juliet story of the ultimate forbidden love affair - between vampire and mortal.", 
    "genres": "Drama, Fantasy, Romance", 
    "release_year": "2008", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "mortal", 
                    "minimal"
                ], 
                "role": "Bastard Boyfriend: More as an inversion of this trope, since Edward actually does everything because he is trying to keep Bella away from what he's seen to be literally mortal harm. For example, the famously cited section where Edward tries to keep Bella away from Jacob in New Moon. Considering what happened to Emily and Sam, it's pretty amazing that he did actually let her go, given that the werewolves (or really, shapeshifters) tended to shift with minimal provocation, as shown by Paul in New Moon).", 
                "id": "BastardBoyfriend"
            }, 
            {
                "adjectives": [
                    "music", 
                    "several", 
                    "blatant", 
                    "various", 
                    "attractive"
                ], 
                "role": "Raj enjoys chick flicks, Twilight, girly music, etc., has several pretty blatant Ho Yay and even a Heterosexual Life Partner but is shown at various points flirting with attractive women, including Summer Glau, and in one episode he sleeps with Penny. Just sleeps. Would've been sex, but he got so excited, he ejaculated before anything happened.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "good", 
                    "messed-up", 
                    "only"
                ], 
                "role": "Mike Newton, Tyler Crowley, and Eric Yorkie. Either humans just aren't good enough for Bella, or she's really socially messed-up if Edward's the only one for her. Tyler could also qualify as Casanova Wannabe.", 
                "id": "CasanovaWannabe"
            }, 
            {
                "adjectives": [], 
                "role": "Bella Swan of Twilight fame. Apparently even her science teacher fancies her.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "final", 
                    "later"
                ], 
                "role": "Child Soldiers: Implied with the final film: Bella explains that because more vampires are gathering near Forks, the gene in the Quileute men that turns them into werewolves to protect their territory from vampires is activating in more boys. We later see a shot of Jacob trying to advise three boys to control themselves, lest they accidentally kill their mother - the youngest of the boys can't be older than ten, and we see his wolf form in the battle against the Volturi.", 
                "id": "ChildSoldiers"
            }, 
            {
                "adjectives": [], 
                "role": "Cock Fight: Edward and Jacob keep fighting over Bella in the name of her safety until she has to tell then to stop and from now on she's Switzerland.", 
                "id": "CockFight"
            }, 
            {
                "adjectives": [], 
                "role": "Edward and Jacob over Bella in Twilight.", 
                "id": "CockFight"
            }, 
            {
                "adjectives": [
                    "Dogged"
                ], 
                "role": "Dogged Nice Guy: Jacob. Um, yeah.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "literal", 
                    "viable", 
                    "identical"
                ], 
                "role": "Jacob Black of Twilight is a very literal interpretation of this principle.\n Although he quickly stopped being nice and switched to abuse and manipulation instead. This was done intentionally by Stephenie Meyer in an attempt to make readers who shipped Bella and Jacob ship Bella and Edward instead.\n Or, rather more worryingly, this was her way of making him a viable love interest, as Edward's behaviour is all but identical, if not worse.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Twilight's Dr. Carlisle Cullen. He's not a widower (he's been married to Esme for nearly a century), but he fits just about every other requirement of this trope.", 
                "id": "HotDad"
            }, 
            {
                "adjectives": [
                    "male", 
                    "likely", 
                    "huge", 
                    "strong", 
                    "safe"
                ], 
                "role": "Hunk: Jacob and all the male werewolves. Also, Emmett is consistently described as being this. Also, Felix is mostly likely this, given he's described as being just as huge and strong as Emmett, and given that he's a vampire, it's probably safe to say that he's this.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "other", 
                    "male", 
                    "serious", 
                    "huge", 
                    "energetic", 
                    "other", 
                    "male"
                ], 
                "role": "Jacob Black, and basically every other male werewolf. Also, Emmett is consistently described as muscled \"like a serious weightlifter\" and bearlike, and is apparently so huge and energetic that he scares Bella a little. This places him in stark contract to every other male vampire, except maybe Felix from the Volturi.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "'plain", 
                    "complete", 
                    "very", 
                    "first", 
                    "much", 
                    "attractive", 
                    "small", 
                    "safe", 
                    "standoffish"
                ], 
                "role": "Bella from Twilight could count as a Rare Female Example. She describes herself as 'plain,' is a complete bitch to everyone, and yet she has boys flocking to her. Heck, five guys ask her to the school dance in the very first book! However, it's heavily implied that she's much more attractive than she gives herself credit for.\n It's also worth noting that she had just moved to a very small town, and some of the boys were thinking about asking her out before they'd even met her. It's safe to say that a lot of the interest came from her being a novelty.\n Though that doesn't quite cover how she has three men (Edward and Jacob, of course, and Mike continuously shows interest well into the series) remain vying for her attention months after her arrival, when she remains standoffish and rather rude.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [], 
                "role": "Knight in Shining Armor: Edward is more like Bella's knight in sparkling armor.", 
                "id": "KnightInShiningArmor"
            }, 
            {
                "adjectives": [
                    "male", 
                    "pre-packaged", 
                    "gushy", 
                    "other", 
                    "good", 
                    "sparkle"
                ], 
                "role": "All of the male vampires in Twilight. They even come with the Bishie Sparkle pre-packaged and their appearance is described in gushy detail. With the exception of Emmett and Felix, who are the other good looking male character type. They also never sparkle in the books once.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "single", 
                    "male", 
                    "average"
                ], 
                "role": "Pretty Boy: Every single one of the male vampires, except for Emmett and Felix, and James, who's described as being bland and average looking in the books, but is still this in the movie.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "total", 
                    "first"
                ], 
                "role": "Shirtless Scene: Actually, does Jacob know what a shirt is? According to the Seattle Times, Jacob takes his shirt off thirteen times total in the movies; out of which, three times were in the rain, and not happening at all in the first movie.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "due"
                ], 
                "role": "Aro, the head vampire in the film version of Twilight, due to Michael Sheen simply not giving a shit.", 
                "id": "SissyVillain"
            }, 
            {
                "adjectives": [], 
                "role": "Troubled, but Cute: Edward Cullen, described as a fatalist by the author and self loathing by the actor that plays him. Not to mention that he spents half of the time calling himself a soulless monster.", 
                "id": "TroubledButCute"
            }, 
            {
                "adjectives": [
                    "many", 
                    "other", 
                    "male", 
                    "new", 
                    "blatant"
                ], 
                "role": "Twilight\n How many stills are there out there of Jacob Black/Taylor Lautner with a shirt on? Or any of the other male actors playing werewolves in that movie, for that matter?\n According to Chester A. Bum, they all suffer from The Curse of the Missing Shirt.\n Lampshaded in Eclipse, where Edward asks: \"Doesn't he own a shirt?\"\n Lampshaded in Valentine's Day, where the character played by Taylor Lautner is offered a new shirt, starts changing shirts but stops less than halfway through saying that he doesn't want to take his shirt off in public.\n Originally, the film was going to have a scene where his character simply walked into school and took his shirt off. Lautner rejected that for being overly blatant Fanservice.", 
                "id": "WalkingShirtlessScene"
            }, 
            {
                "adjectives": [
                    "''Native", 
                    "American", 
                    "third"
                ], 
                "role": "Walking Shirtless Scene: Jacob and the wolfpack. \"They might as well have called the movie ''Native American in Blue Jeans, And That's It'', and that might have sold it.\" Rather amusingly lampshaded by Edward in the third film. \"Doesn't he own a shirt?\"", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "good", 
                    "suggestive", 
                    "good", 
                    "actual", 
                    "good", 
                    "bed—except"
                ], 
                "role": "In Twilight (the movie) Alice says that she and Bella will be \"really good friends\" in a suggestive manner, and Edward responds with a sneering, \"Can you keep your thoughts to yourself!\" It turns out that Alice is SO TOTALLY NOT GAY, and she REALLY REALLY MEANT THEY WOULD JUST BE GOOD FRIENDS.\n The book has a good bit of this at well. That line is in the actual book, as is Alice pointing out that Bella\" does smell good!\" As is the bit about Alice loving Bella deeply. Then throw in how often Alice hangs on Bella, carries her around, etc. and you've got a ripe lesyay shipping bed—except Meyer, as a devout Mormon, would not write lesbians into her story.", 
                "id": "BaitAndSwitchLesbians"
            }, 
            {
                "adjectives": [
                    "female", 
                    "blonde", 
                    "intentional", 
                    "several", 
                    "unpleasant"
                ], 
                "role": "Blondes Are Unpleasant: Most of the book's female antagonists are blonde, whereas the brunettes tend to be portrayed more favorably. Word of God says this wasn't intentional, but Meyer has admitted several unpleasant people in her life were blonde, and it might have unconsciously informed her writing.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "other", 
                    "later"
                ], 
                "role": "Edward and Bella both toward each other in Twilight. Jacob Black developed into something like this as well, later on (at least until Renesmee came along...).", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [
                    "uncanny", 
                    "able"
                ], 
                "role": "Bella Swan of Twilight seems to have an uncanny ability to lose her balance to the point that she's able to pass off the wounds from a vampire attack by claiming to have fallen down two flights of stairs and through a window without anyone getting suspicious. It got to a point where her father didn't even mind when she comes home with bandages after getting attacked by Jasper in New Moon.", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Cute Clumsy Girl: Bella, with lots of Lampshade Hanging from Edward.", 
                "id": "CuteClumsyGirl"
            }, 
            {
                "adjectives": [
                    "small", 
                    "beset", 
                    "life-threatening", 
                    "female"
                ], 
                "role": "Distressed Damsel: Bella. So. Much. Immediately upon arriving in small town USA, she's beset with life-threatening dangers so that Edward can capture her attention by saving her over and over. Odd, since she's the viewpoint character and female lead.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [
                    "ex-boyfriend", 
                    "near-death"
                ], 
                "role": "In Twilight, Bella thinks that she can psychically connect with her ex-boyfriend Edward if she gets an adrenaline rush, and purposefully puts herself in near-death situations to bring them on.", 
                "id": "DeliberatelyDistressedDamsel"
            }, 
            {
                "adjectives": [
                    "strong", 
                    "female", 
                    "other"
                ], 
                "role": "More specifically, Alice is often the character who is trotted out by Twilight defenders against accusations that the series is anti-feminist. It's usually countered by pointing out that Alice only seems like a \"strong female character\" in comparison to Bella, but by the standards of just about any other series she's clearly a Faux Action Girl.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [
                    "snarky", 
                    "pixie-like", 
                    "elegant", 
                    "applicable", 
                    "double", 
                    "small", 
                    "snarky", 
                    "maternal"
                ], 
                "role": "Four Girl Ensemble: The four Cullens women are the snarky Bella, pixie-like Alice, elegant Rosalie, and the motherly Esme. Also applicable to the Denali sisters—Tanya and Irina double as the elegant ones (and Tanya is rather small in the films), Kate is the snarky one, and Carmen is maternal.", 
                "id": "FourGirlEnsemble"
            }, 
            {
                "adjectives": [
                    "snarky", 
                    "pixie-like", 
                    "elegant"
                ], 
                "role": "The four Cullen women of Twilight are the snarky Bella, pixie-like Alice, elegant Rosalie, and the motherly Esme.", 
                "id": "FourGirlEnsemble"
            }, 
            {
                "adjectives": [], 
                "role": "Bella's hometown acquaintance Jacob from Twilight.", 
                "id": "GirlNextDoor"
            }, 
            {
                "adjectives": [
                    "other", 
                    "other", 
                    "high", 
                    "magical"
                ], 
                "role": "In the Twilight fanfic Luminosity, there’s a vampire whose power is beauty: literally. Everyone who sees her, even other women, even other vampires, are so stunned by her beauty that they will mindlessly follow her around until her self-esteem is high enough that her beauty level drops off to normal. Though, since she’s a vampire, her “normal” is still on a Hello Nurse level, just without accompanying magical compulsion.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [
                    "beautiful", 
                    "painful", 
                    "messy"
                ], 
                "role": "Twilight:\n Esme is the adopted mother of the Forks Coven: Edward, Alice, Rosealie, Jasper, and Emmett. The reader is frequently reminded about how Esme is both ungodly beautiful and more motherly than anyone below the age of 40 should be.\n The fact that having sex with her probably will result in a painful, messy death does turn some people off. Then again, there's her husband Carlisle...", 
                "id": "HotMom"
            }, 
            {
                "adjectives": [], 
                "role": "The Twilight series has Rosalie Hale for the vampires and Leah Clearwater for the werewolves.", 
                "id": "LovableAlphaBitch"
            }, 
            {
                "adjectives": [
                    "male", 
                    "Magical"
                ], 
                "role": "The male leads in the Twilight series are Magical Boyfriends.", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [], 
                "role": "Manic Pixie Dream Girl: Alice to Jasper.", 
                "id": "ManicPixieDreamGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Twilight: Bella will put herself in danger just to see Edward again.", 
                "id": "NaiveEverygirl"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Bella Swan is this trope. Her prime role in the books is to end up in danger so that she can be rescued by Edward, mostly from situations that she senselessly caused in the first place. Even when she's against something, at most, she'll only murmur apologetically before she's quickly dismissed. This even goes as far as being expected to comply and wait passively while she's being assaulted by Jacob or ordered around by Edward.", 
                "id": "NeutralFemale"
            }, 
            {
                "adjectives": [
                    "big", 
                    "few", 
                    "jealous", 
                    "gang", 
                    "main", 
                    "male", 
                    "double", 
                    "birth", 
                    "entire", 
                    "bitchy", 
                    "only", 
                    "next", 
                    "characteristic", 
                    "entire"
                ], 
                "role": "This is a big source of criticism for the Twilight series. Among them:\n Bella Swan has virtually no identity beyond Edward Cullen. The few details we are given about her are there to emphasize her relationship with him (they both like Clair de Lune, they both like Jane Austen, etc) except for her housekeeping skills, which we're told were developed to take care of her mother, but are mostly employed out of necessity because of her incompetent father.\n Rosalie's defining character trait throughout most of the books is that she is jealous that she does not have Edward's affections. Her backstory, revealed in Eclipse, is that she was gang raped by her fiance and his male friends. In the Twilight Illustrated Guide, we find out that the main reason she became a vampire was because Carlisle had hoped she would be a wife for Edward.\n Esme's backstory is how she met Carlisle and was smitten with him as a teenager, was abused by her husband as an adult, and was saved and turned into a vampire by Carlisle.\n Alice was only saved from James and the asylum she was locked in because of a male vampire on the staff.\n Kim, Claire, and Emily are only introduced in the story to be the imprintees/ Love Interests of Jared, Quil, and Sam respectively. This goes double for Renesmee, who from birth was used as a way to solve the Bella/Edward/Jacob love triangle. Leah also spends the entire series being defined by being the bitchy ex-fiance of Sam.\n Victoria spends all of Twilight with no identity beyond being James's mate, which also serves as her only motivation for serving as the villainess for the next two books. Similarly, Irena's only identifying characteristic in Breaking Dawn is her grieving for the loss of Laurent, and Jane is always shown as a sister and as Aro's servant.\n Kate's entire character development in Breaking Dawn centers around her forming a relationship with Garrett.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Bella Swan towards Edward from Twilight", 
                "id": "SmittenTeenageGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Team Mom: Esme, to the vampires; Emily, to the wolves.", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [
                    "post-vamp", 
                    "high-end", 
                    "fashionable"
                ], 
                "role": "Alice in the Twilight saga. Loves dressing people up and throwing parties, especially if Bella's involved. She not only organized Bella's wedding, but packed her honeymoon suitcase, dressed her up in a cocktail dress and stilettos for her first post-vamp hunt, and filled up her closet at home mostly with high-end, fashionable clothing while Bella would rather wear jeans.", 
                "id": "TheFashionista"
            }, 
            {
                "adjectives": [
                    "old", 
                    "responsible", 
                    "own", 
                    "able", 
                    "own", 
                    "elegant", 
                    "strong", 
                    "maternal"
                ], 
                "role": "The Hecate Sisters: Bella is described as an old soul because she's more responsible than her mom and she keeps to herself. When she found out she had conceived she was determined to carry the child despite the danger the pregnancy could bring her. Rosalie and Esme were the two women who were on her side on this. Rosalie, because she treasures humanity more than anything and wishes she could have children of her own, and Esme, because she understood Bella's desire to have children and believed that she should be able to make her own choices in the matter. Rosalie is described as always having been beautifully elegant and proud of it while Esme has always had strong maternal instincts that she shows through kindness to her surrogate children and the family's allies.", 
                "id": "TheHecateSisters"
            }, 
            {
                "adjectives": [
                    "other", 
                    "sweet", 
                    "girl", 
                    "true", 
                    "beautiful", 
                    "fashionable"
                ], 
                "role": "Tomboy and Girly Girl: Bella Swan, the tomboy, would rather repair cars and read books than shop for clothes and dress up. On the other hand, Alice Cullen is the sweet girly girl who loves shopping and dressing up. Very true also with Bella and beautiful, fashionable Rosalie, or Bella and her classmates Jessica and Lauren.", 
                "id": "TomBoyAndGirlyGirl"
            }, 
            {
                "adjectives": [
                    "bad"
                ], 
                "role": "Bella from Twilight is this played straight. Though given Bella has had accidents walking through a door, it would be jarring if she wasn't a bad driver.", 
                "id": "WomenDrivers"
            }, 
            {
                "adjectives": [], 
                "role": "Wrench Wench: Rosalie.", 
                "id": "WrenchWench"
            }, 
            {
                "adjectives": [
                    "true", 
                    "married", 
                    "other"
                ], 
                "role": "Even if their relationship is denied by those involved, the Nonsten fans have started to talk about the nasty things they will do to Kristen Stewart if she is indeed romantically involved with Edward...I mean Rob Pattinson from the Twilight movies. Most fans want Robsten to be true and root for the couple to make it.\n And some Robsten fans really don't like Nikki Reed, the actress playing Rosalie Hale. In their words:\n And now it's all gone to hell with the revelation that Kristen cheated on Robert with the married director of Snow White & the Huntsman. Even when it takes TWO to tango and cheat, all of the heat has gone towards Stewart and not towards the other dude, paired up with the already existing fangirl misogyny.", 
                "id": "YokoOhNo"
            }
        ]
    }, 
    "imdbid": "tt1099212", 
    "poster_url": "Twilight.jpg", 
    "similar": [
        {
            "shared": [
                "ChickMagnet", 
                "DoggedNiceGuy", 
                "WalkingShirtlessScene", 
                "KavorkaMan", 
                "CasanovaWannabe", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "MagicalGirlfriend", 
                "CuteClumsyGirl"
            ], 
            "shared_count": 9, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "DoggedNiceGuy", 
                "ShirtlessScene", 
                "ClingyJealousGirl", 
                "YokoOhNo", 
                "BlondesAreEvil", 
                "NeverASelfMadeWoman", 
                "NeutralFemale", 
                "CockFight"
            ], 
            "shared_count": 8, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "KnightInShiningArmor", 
                "ClingyJealousGirl", 
                "TheFashionista", 
                "TomBoyAndGirlyGirl", 
                "MagicalGirlfriend", 
                "DamselInDistress", 
                "NaiveEverygirl", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 8, 
            "id": "Enchanted", 
            "name": "Enchanted", 
            "poster_url": "Enchanted.jpg"
        }, 
        {
            "shared": [
                "WalkingShirtlessScene", 
                "ChildSoldiers", 
                "BastardBoyfriend", 
                "HotDad", 
                "NeverASelfMadeWoman", 
                "SissyVillain", 
                "WrenchWench"
            ], 
            "shared_count": 7, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "ClingyJealousGirl", 
                "KavorkaMan", 
                "TomBoyAndGirlyGirl", 
                "TheHecateSisters", 
                "DamselInDistress", 
                "Hunk"
            ], 
            "shared_count": 6, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "Twilight", 
    "name": "Twilight"
}