{
    "plot": "A war has been raging between the Vampires and Lycan for centuries, Selene (Beckinsale) is a death dealer, assigned to hunt down and eradicate the last of the Lycan. When she comes across Michael Corvin (Speedman) who holds the key to end the war she must decide where her allegiances will lie.", 
    "genres": "Action, Fantasy, Thriller", 
    "release_year": "2003", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "special"
                ], 
                "role": "Badass Baritone: There are no special effects involved in Kevin Grevioux's voice.", 
                "id": "BadassBaritone"
            }, 
            {
                "adjectives": [
                    "many", 
                    "brutish", 
                    "first"
                ], 
                "role": "While not a singer, actor Kevin Grevioux has an extremely deep voice, to the point where many people watching Underworld thought his voice was altered. Not only is Grevioux playing a brutish enforcer (and looks the part), but he's also the one who came up with the idea for the movie in the first place thanks to his degree in microbiology.", 
                "id": "BassoProfundo"
            }, 
            {
                "adjectives": [], 
                "role": "Dirty Coward: Kraven.", 
                "id": "DirtyCoward"
            }, 
            {
                "adjectives": [
                    "Bad"
                ], 
                "role": "Viktor in Underworld after regaining his strength but before setting out for the raid.\n Marcus Corvinus and Andreas Tanis in the sequel. Subverted in the latter case, as Tanis is far from a Bad Ass (he can't his Selene from 15 feet away).", 
                "id": "NoShirtLongJacket"
            }, 
            {
                "adjectives": [], 
                "role": "Scary Black Man: Raze.", 
                "id": "ScaryBlackMan"
            }, 
            {
                "adjectives": [], 
                "role": "Sissy Villain: Kraven.", 
                "id": "SissyVillain"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Dark Action Girl: Selene.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "wrong"
                ], 
                "role": "It can be argued that Selene from Underworld fits this trope quite nicely until she realizes that she's been fighting the wrong war.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "werewolf/vampire", 
                    "true", 
                    "mortal"
                ], 
                "role": "Selene in Underworld is a vampire who hunts werewolves until she falls in love with a werewolf/vampire hybrid and starts to question whether what she has been told by the elder vampires was ever true (like who started the war, why, and who killed her mortal family). Though technically, her defection had more to do the truth than Michael.\n Before her there was Sonja, and it ended very badly for her.", 
                "id": "DefectingForLove"
            }, 
            {
                "adjectives": [
                    "constant", 
                    "fair", 
                    "one-up", 
                    "automatic"
                ], 
                "role": "Faux Action Girl: Sonja in Rise of the Lycans. Despite being the leader of the Death Dealers, Sonja needs almost constant rescuing. To be fair, she needs rescuing from overwhelming odds. She did kill three lycans while being chased in the beginning of the film, and she managed to one-up Viktor in their sword fight. And unlike Selene, she didn't have access to automatic firearms.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [
                    "elite", 
                    "entire", 
                    "introduced", 
                    "forcing", 
                    "classic", 
                    "forcing", 
                    "Lucian", 
                    "free"
                ], 
                "role": "Underworld Rise Of The Lycans.: Rhona Mitra's Sonja is the leader of the elite vampire \"death dealers,\" but unlike Kate Beckinsdale's Selene, she's almost completely helpless through the entire film. She's introduced while fleeing from werewolves, forcing her werewolf lover Lucian to save her. Later, he has to save her again from being overrun by werewolves. Later still, Viktor imprisons her and uses her as bait to catch Lucian. After Lucian busts her out, she actually manages to best Viktor in a swordfight, but he immediately uses her Standard Female Grab Area to trap her in a classic hostage pose, forcing Lucian to surrender to save her. After all that, she gets executed, while Lucian breaks free and successfully slaughters the castle.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [
                    "brutal"
                ], 
                "role": "Even though Selene from the Underworld can rip most her enemies to shreds with her bare hands, she always prefers killing them more elegantly, with weapons and acrobatics, if she can avoid it. This is in a particularly striking contrast to the brutal fighting styles of Michael and their daughter Eve in Awakening.", 
                "id": "LadyOfWar"
            }, 
            {
                "adjectives": [], 
                "role": "Underworld - vampire.", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [
                    "proto-lycan", 
                    "birth", 
                    "unmanageable", 
                    "whip-wielding"
                ], 
                "role": "Alternately, proto-lycan females could've been culled after Lucian's birth, because their instinct to protect their offspring made them unmanageable even for whip-wielding vampires. Lucian's mom did look ready to pounce on anyone who came near when she was killed.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "female", 
                    "contagious", 
                    "male", 
                    "proto-lycan", 
                    "birth", 
                    "unmanageable", 
                    "whip-wielding", 
                    "only", 
                    "first", 
                    "visible", 
                    "imprisoned", 
                    "few", 
                    "female", 
                    "non-canonical", 
                    "Lucian", 
                    "Lucian", 
                    "survivng", 
                    "modern"
                ], 
                "role": "Monogender Monsters: Going by the movies, there was exactly one female Lycan, Lucian's mother, who was infected while pregnant. Though presumably the virus is just as contagious to both genders, the use of this trope was justified as the vampires wanting only male lycan slaves. Alternately, proto-lycan females could've been culled after Lucian's birth, because their instinct to protect their offspring made them unmanageable even for whip-wielding vampires. Lucian's mom did look ready to pounce on anyone who came near when she was killed. Although Lucian's mother is the only prominent female Lycan, technically two can be seen the background in the first movie. One sits on a raised platform as Raze brings his injured comrade back to the den. Another is visible among the imprisoned Lycans in the Lucian/Sonja flashback. There's also a few distinct mentions of female Lycans within the novels of the movies. The one who gets mentioned the most is Leyba in the non-canonical novel Underworld: Blood Enemy, who is the one who ends up ratting Lucian and Sonya out to Viktor, as she wanted Lucian for herself. She ends up survivng to modern day and hunting Lucian for revenge.", 
                "id": "MonogenderMonsters"
            }, 
            {
                "adjectives": [
                    "likely", 
                    "pregnant", 
                    "pregnant", 
                    "entire"
                ], 
                "role": "Although her knowledge of it is never confirmed, it is highly likely that Selene is pregnant in the opening sequence of Underworld: Awakening, jumping off buildings and dodging flamethrowers, before she is taken hostage and put into frozen stasis for more than a decade, waking up to find a pubescent daughter. Sonja is consistently a badass in Underworld: Rise of the Lycans, and is revealed to have been pregnant for the entire movie towards the end.", 
                "id": "PregnantBadass"
            }
        ]
    }, 
    "imdbid": "tt0320691", 
    "poster_url": "Underworld.jpg", 
    "similar": [
        {
            "shared": [
                "NoShirtLongJacket", 
                "SissyVillain", 
                "LadyOfWar", 
                "DarkActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "ScaryBlackMan", 
                "DarkActionGirl", 
                "LadyOfWar", 
                "PregnantBadass", 
                "MamaBear"
            ], 
            "shared_count": 5, 
            "id": "KillBill", 
            "name": "Kill Bill", 
            "poster_url": "KillBill.jpg"
        }, 
        {
            "shared": [
                "NoShirtLongJacket", 
                "SissyVillain", 
                "ScaryBlackMan", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "SissyVillain", 
                "BadassBaritone", 
                "DarkActionGirl", 
                "DirtyCoward"
            ], 
            "shared_count": 4, 
            "id": "Transformers", 
            "name": "Transformers"
        }, 
        {
            "shared": [
                "MagicalGirlfriend", 
                "LadyOfWar", 
                "BadassBaritone", 
                "ScaryBlackMan"
            ], 
            "shared_count": 4, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }
    ], 
    "id": "Underworld", 
    "name": "Underworld"
}