{
    "plot": "The town of Big Whisky is full of normal people trying to lead quiet lives. Cowboys try to make a living. Sheriff 'Little Bill' tries to build a house and keep a heavy-handed order. The town whores just try to get by.Then a couple of cowboys cut up a whore. Dissatisfied with Bill's justice, the prostitutes put a bounty on the cowboys. The bounty attracts a young gun billing himself as 'The Schofield Kid', and aging killer William Munny. Munny reformed for his young wife, and has been raising crops and two children in peace. But his wife is gone. Farm life is hard. And Munny is no good at it. So he calls his old partner Ned, saddles his ornery nag, and rides off to kill one more time, blurring the lines between heroism and villainy, man and myth.", 
    "genres": "Western", 
    "release_year": "1992", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "old"
                ], 
                "role": "Badass Grandpa: While not technically a grandfather, William Munny is more than old enough to be one. DEFINITELY Little Bill, who's even older than Munny. Just watch him when he stares down the barrel of Munny's shotgun and calmly tells his men to kill Munny after he's dead. No matter what you think of him, the man has INCREDIBLE balls.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "English", 
                    "later", 
                    "public"
                ], 
                "role": "English Bob from Unforgiven appears to embody this trope, although it is later implied that his debonair, cultured manner may be a facade (and also that he may be less of a badass than his public image would suggest).", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "Two-Gun"
                ], 
                "role": "Gag Penis: As Little Bill tells Beauchamp, English Bob once killed a man who was nicknamed \"Two-Gun Corcoran\", though he carried only one gun.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [
                    "mean", 
                    "actual"
                ], 
                "role": "Miles Gloriosus:  The Schofield Kid. English Bob is shown to be an excellent pistol marksman (shooting birds in flight from a moving train with a pistol is no mean feat), but he has no stomach for actual fighting.", 
                "id": "MilesGloriosus"
            }, 
            {
                "adjectives": [
                    "tragic", 
                    "small"
                ], 
                "role": "Teeny Weenie: The tragic events of the movie begin when Delilah is attacked by Quick Mike because she laughed at his small penis.", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [
                    "tragic", 
                    "small", 
                    "whole", 
                    "bloodshed"
                ], 
                "role": "The tragic events in Unforgiven began when Delilah, a prostitute, laughed at Quick Mike's small penis, which enraged the cowboy enough to cut her up. This sets off a whole chain of Disproportionate Retribution steps which ultimately end in bloodshed.", 
                "id": "TeenyWeenie"
            }, 
            {
                "adjectives": [], 
                "role": "The Schofield Kid in Unforgiven", 
                "id": "YoungGun"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "innocent", 
                    "bad", 
                    "kick-off", 
                    "unofficial", 
                    "prime", 
                    "other"
                ], 
                "role": "Delilah in Unforgiven is the sweetest and most innocent of the working girls, whose ill treatment at the hands of a gang of bad cowboys is the kick-off point for the movie's plot. A case can also be made for Strawberry Alice fitting this trope, as she's the unofficial leader of the working girls and her prime motivation throughout the film is avenging Delilah and defending the other girls.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "innocent", 
                    "big"
                ], 
                "role": "Hooker with a Heart of Gold: Certainly Delilah, who is characterized as the sweetest and most innocent of the working girls. Deconstructed with Strawberry Alice, the caring big sister of the group. While she does look after Delilah when she's hurt, she's also eager for revenge and shows no remorse for getting it.", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "late"
                ], 
                "role": "In Unforgiven, Clint Eastwood must raise his son and daughter alone, trying to atone for his past solely on the memory of his late wife.", 
                "id": "MissingMom"
            }
        ]
    }, 
    "imdbid": "tt0105695", 
    "poster_url": "Unforgiven.jpg", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa", 
                "HookerWithAHeartOfGold", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "TheTown", 
            "name": "The Town", 
            "poster_url": "TheTown.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "HookerWithAHeartOfGold", 
                "MissingMom"
            ], 
            "shared_count": 3, 
            "id": "LesMiserables", 
            "name": "Les Misérables"
        }, 
        {
            "shared": [
                "HookerWithAHeartOfGold", 
                "YoungGun"
            ], 
            "shared_count": 2, 
            "id": "McCabeAndMrsMiller", 
            "name": "McCabe & Mrs. Miller", 
            "poster_url": "McCabeAndMrsMiller.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa", 
                "MissingMom"
            ], 
            "shared_count": 2, 
            "id": "NextAvengersHeroesOfTomorrow", 
            "name": "Next Avengers: Heroes of Tomorrow"
        }, 
        {
            "shared": [
                "CulturedBadass", 
                "MilesGloriosus"
            ], 
            "shared_count": 2, 
            "id": "TheGrey", 
            "name": "The Grey", 
            "poster_url": "TheGrey.jpg"
        }
    ], 
    "id": "Unforgiven", 
    "name": "Unforgiven"
}