{
    "plot": "Julie, a girl from the valley, meets Randy, a punk from the city. They are from different worlds and find love. Somehow they need to stay together in spite of her trendy, shallow friends.", 
    "genres": "Comedy, Romance", 
    "release_year": "1983", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "other"
                ], 
                "role": "Mrs. Robinson / Stacy's Mom: Beth. She and Skip are clearly attracted to each other, and Beth even lampshades the trope when Skip comes over to deliver groceries. When Suzi calls Skip to invite him over to the house during an unsupervised slumber party (Beth is on a date), he declines, muttering his disappointment after hanging up.  Subverted when Skip goes to Beth's house, looking for her, and is apparently having sex with her when Suzi comes home, but Beth turns out to be the one who comes home and discovers Skip in her bed... with Suzi!", 
                "id": "MrsRobinson"
            }, 
            {
                "adjectives": [], 
                "role": "The movie Valley Girl, of course!", 
                "id": "ValleyGirl"
            }, 
            {
                "adjectives": [
                    "different", 
                    "other", 
                    "close", 
                    "true", 
                    "few"
                ], 
                "role": "Valley Girl: The core four girls to the max, with the exception of Loryn. In the DVD commentary for the film, E.G. Daily admitted that she had no idea what Valley Girls were supposed to sound like, so she decided that Loryn would be from Malibu in order to explain why Loryn's speech pattern was somewhat different from the other girls'. Malibu borders the Valley, or is otherwise close enough to it (much more so than Hollywood proper, though the city of North Hollywood is actually within the Valley) for Julie, Stacey, and Suzi to not mind that Loryn was not a true Valley Girl. Considering that Malibu was, and still is, one of the beach spots in southern California, befriending Loryn apparently came with a few perks.", 
                "id": "ValleyGirl"
            }
        ]
    }, 
    "imdbid": "tt0086525", 
    "similar": [
        {
            "shared": [
                "ValleyGirl"
            ], 
            "shared_count": 1, 
            "id": "PokemonMewtwoReturns", 
            "name": "Pokémon: Mewtwo Returns"
        }, 
        {
            "shared": [
                "MrsRobinson"
            ], 
            "shared_count": 1, 
            "id": "CatherineTheGreat", 
            "name": "Catherine The Great", 
            "poster_url": "CatherineTheGreat.jpg"
        }, 
        {
            "shared": [
                "MrsRobinson"
            ], 
            "shared_count": 1, 
            "id": "TheLairOfTheWhiteWorm", 
            "name": "The Lair of the White Worm", 
            "poster_url": "TheLairOfTheWhiteWorm.jpg"
        }, 
        {
            "shared": [
                "ValleyGirl"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "MrsRobinson"
            ], 
            "shared_count": 1, 
            "id": "LairOfTheWhiteWorm", 
            "name": "Lair Of The White Worm", 
            "poster_url": "LairOfTheWhiteWorm.jpg"
        }
    ], 
    "id": "ValleyGirl", 
    "name": "Valley Girl"
}