{
    "plot": "Van Helsing is in the world to rid all evil, even if not everyone agrees with him. The Vatican sends the monster hunter and his ally, Carl, to Transylvania. They have been sent to this land to stop the powerful Count Dracula. Whilst there they join forces with a Gypsy Princess called Anna Valerious, who is determined to end an ancient curse on her family by destroying the vampire. They just don't know how!", 
    "genres": "Action, Adventure, Fantasy", 
    "release_year": "2004", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "single"
                ], 
                "role": "Mr. Fanservice: Every single male character in this movie except Frankenstein's Monster.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "'nuff"
                ], 
                "role": "Shirtless Scene: It's an action movie starring Hugh Jackman, 'nuff said.", 
                "id": "ShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Anna Valerious is a Princess of the Gypsies in Van Helsing, though she's more of a Faux Action Girl throughout the course of the movie.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [], 
                "role": "Belly Dancer: Marishka certainly dresses like one, though she kind of gets killed before we see much of her.", 
                "id": "BellyDancer"
            }, 
            {
                "adjectives": [], 
                "role": "Bodyguard Babes: The Brides.", 
                "id": "BodyguardBabes"
            }, 
            {
                "adjectives": [
                    "cute"
                ], 
                "role": "Cute Monster Girl: Averted. The Brides may be cute in their human forms but their vampire forms...not so much.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Dracula's three brides become this in Van Helsing. Marishka is killed off pretty early but Verona and Aleera really prove to be quite the thorn in the protagonist's side.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses: Why else would she be Princess Anna Valerious? Even the vampires call her that. And, you know, the thing about her father being king of the gypsies.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "'Gypsy", 
                    "only"
                ], 
                "role": "In Van Helsing Anna's father is referred to as \"King of the Gypsies\" which would make her a princess too. The blurb on the back of the DVD case calls her a 'Gypsy Princess'. Though the only time she's explicitly called that in the film is by Aleera in a rather mocking tone.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "top"
                ], 
                "role": "Faux Action Girl: Anna Valerious, through and through. She gets top marks for effort, but when it comes to actually doing anything... check this blog post.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [
                    "laughable", 
                    "due"
                ], 
                "role": "Van Helsing: Anna Valarious is another lovely example, whose laughable losing record is referenced in this blog post. Most of this is due The Worf Effect, but she repays the favor in the end.", 
                "id": "FauxActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Anna, the Gypsy princess of Van Helsing.", 
                "id": "HotGypsyWoman"
            }, 
            {
                "adjectives": [
                    "Hot"
                ], 
                "role": "Hot Gypsy Woman: Anna, the Gypsy princess. Marishka was apparently a gypsy too before she was turned.", 
                "id": "HotGypsyWoman"
            }, 
            {
                "adjectives": [
                    "notable"
                ], 
                "role": "In Van Helsing, the Brides of Dracula display some notable lesbian tendencies, especially Brides Verona and Aleera.", 
                "id": "LesbianVampire"
            }, 
            {
                "adjectives": [
                    "Lesbian", 
                    "notable", 
                    "bisexual", 
                    "interested"
                ], 
                "role": "Lesbian Vampire: The Brides of Dracula display some notable lesbian tendencies, especially Brides Verona and Aleera. Marishka might have shown some too, if she'd lasted longer. Aleera is bisexual and seems very interested in Anna.", 
                "id": "LesbianVampire"
            }, 
            {
                "adjectives": [
                    "male", 
                    "female"
                ], 
                "role": "Ms. Fanservice: Like her male counterpart, any female presences, especially Anna and the Brides.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "male"
                ], 
                "role": "Anna Valerious of Van Helsing is introduced as a daughter and sister, is motivated by the absence of the brother, and her function in the story is as a Love Interest to the male lead. And she's a Faux Action Girl to boot!", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [
                    "Self-Made"
                ], 
                "role": "Never a Self-Made Woman: Anna Valerious's standing is defined primarily by that of her father and brothers.", 
                "id": "NeverASelfMadeWoman"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick — Anna Valerious.", 
                "id": "TheChick"
            }
        ]
    }, 
    "imdbid": "tt0338526", 
    "similar": [
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "ShirtlessScene", 
                "MrFanservice", 
                "FauxActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 5, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "NeverASelfMadeWoman", 
                "BodyguardBabes", 
                "DarkActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "MsFanservice", 
                "MrFanservice", 
                "BadassPrincess"
            ], 
            "shared_count": 4, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "ShirtlessScene", 
                "BodyguardBabes", 
                "NeverASelfMadeWoman", 
                "MrFanservice"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "EverythingsBetterWithPrincesses", 
                "MsFanservice", 
                "MrFanservice", 
                "BadassPrincess"
            ], 
            "shared_count": 4, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }
    ], 
    "id": "VanHelsing", 
    "name": "Van Helsing"
}