{
    "plot": "Van Wilder is a guy who has been at his college for seven years. He spends most of his time throwing parties and \"fund raisers\". When his father decides that it's time for tough love, he doesn't pay his tuition. So Van becomes a professional party thrower. At the same time, Gwen who writes for the college paper, is tasked with doing a story on him, but Van is too busy partying to do that. So she writes it using info from people who talk about him and writes an unflattering piece, which doesn't make him happy. He then dares her to see if she can get the true story but is more interested in trying to score with her, which is not easy because she has a boyfriend, who is a snob, and who is not too happy with the amount time she is spending with him. So he tries to get rid of him.", 
    "genres": "Comedy, Romance", 
    "release_year": "2002", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Big Man on Campus", 
                "id": "BigManOnCampus"
            }, 
            {
                "adjectives": [
                    "Chivalrous", 
                    "complete", 
                    "same"
                ], 
                "role": "Chivalrous Pervert: Van flirts mercilessly with Gwen but he never actually makes a pass at her since he knows she has a boyfriend, even though the guy is a complete Jerkass. He does the same thing with Kaitlin in Freshman Year", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "love-interest", 
                    "complete", 
                    "same"
                ], 
                "role": "Van in Van Wilder. He flirts mercilessly with love-interest Gwen but he never actually makes a pass at her since he knows she has a boyfriend, even though the guy is a complete Jerkass. He does the same thing with Kaitlin in Freshman Year", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "main", 
                    "actual"
                ], 
                "role": "The title character in Van Wilder is a mix between this trope and a Big Man on Campus. Ironically, the film's main antagonist is the actual president of a fraternity but he does not fill this role and is instead portrayed as a Jerk Jock and a (male) Academic Alpha Bitch.", 
                "id": "Fratbro"
            }, 
            {
                "adjectives": [], 
                "role": "Van Wilder is what happens when this character goes to college. And then stays there for almost a decade.", 
                "id": "HighSchoolHustler"
            }, 
            {
                "adjectives": [], 
                "role": "Mr. Fanservice: It's Ryan Reynolds.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "The Charmer: Van to pretty much everyone.", 
                "id": "TheCharmer"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Ms. Fanservice: Kristin Cavallari in Freshman Year. Also, Charlotte in \"The Rise of Taj\".", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt0283111", 
    "poster_url": "VanWilder.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "MrFanservice", 
                "ChivalrousPervert"
            ], 
            "shared_count": 3, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "TheCharmer", 
                "ChivalrousPervert"
            ], 
            "shared_count": 3, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "MrFanservice", 
                "TheCharmer", 
                "ChivalrousPervert"
            ], 
            "shared_count": 3, 
            "id": "TheATeam", 
            "name": "The A-Team", 
            "poster_url": "TheATeam.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "TheCharmer", 
                "ChivalrousPervert"
            ], 
            "shared_count": 3, 
            "id": "ResidentEvil", 
            "name": "Resident Evil", 
            "poster_url": "ResidentEvil.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "TheCharmer", 
                "MrFanservice"
            ], 
            "shared_count": 3, 
            "id": "PiratesOfTheCaribbean", 
            "name": "Pirates of the Caribbean"
        }
    ], 
    "id": "VanWilder", 
    "name": "Van Wilder"
}