{
    "plot": "The Law Enforcement Technology Advancement Centre (LETAC) has developed SID version 6.7: a Sadistic, Intelligent, and Dangerous virtual reality entity which is synthesized from the personalities of more than 150 serial killers. LETAC would like to train police officers by putting them in VR with SID, but they must prove the concept by using prisoners as test subjects. One such prisoner is ex-cop Parker Barnes. When SID manages to inject his personality into a nano-machine android, it appears that Barnes might be the only one who can stop him.", 
    "genres": "Action, Crime, Sci-Fi", 
    "release_year": "1995", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Beard of Sorrow: Barnes has a beard and dreadlocks as a prisoner. He shaves them when he is reinstated to hunt Sid.", 
                "id": "BeardOfSorrow"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "android"
                ], 
                "role": "Robot Girl: Clyde's desire to turn Shelia 3.2 into this results in Sid getting an android body.", 
                "id": "RobotGirl"
            }, 
            {
                "adjectives": [
                    "psychosexual", 
                    "vocal", 
                    "indestructible"
                ], 
                "role": "Virtuosity. Sheila 3.2, Virtual reality sex doll, Sole function is to deduce your psychosexual needs, and fulfill them. \"Sheila 3.2 is collecting information from 136 aspects of your physiology. Your heart rate, pupil dilation, vocal intonation, syntax...\" She was scheduled for download to nigh indestructible regeneration type, possibly shape shifting body, subverted.", 
                "id": "RobotGirl"
            }
        ]
    }, 
    "imdbid": "tt0114857", 
    "poster_url": "Virtuosity.jpg", 
    "similar": [
        {
            "shared": [
                "RobotGirl"
            ], 
            "shared_count": 1, 
            "id": "BladeRunner", 
            "name": "Blade Runner", 
            "poster_url": "BladeRunner.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow"
            ], 
            "shared_count": 1, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow"
            ], 
            "shared_count": 1, 
            "id": "TheJazzSinger", 
            "name": "The Jazz Singer", 
            "poster_url": "TheJazzSinger.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow"
            ], 
            "shared_count": 1, 
            "id": "XMenDaysOfFuturePast", 
            "name": "X-Men: Days of Future Past", 
            "poster_url": "XMenDaysOfFuturePast.jpg"
        }, 
        {
            "shared": [
                "RobotGirl"
            ], 
            "shared_count": 1, 
            "id": "CuteyHoney", 
            "name": "Cutey Honey"
        }
    ], 
    "id": "Virtuosity", 
    "name": "Virtuosity"
}