{
    "plot": "Dartmoor,1914: To his wife's dismay farmer Narracott buys a thoroughbred horse rather than a plough animal, but when his teenaged son Albert trains the horse and calls him Joey, the two becoming inseparable. When his harvest fails, the farmer has to sell Joey to the British cavalry and he is shipped to France where, after a disastrous offensive he is captured by the Germans and changes hands twice more before he is found, caught in the barbed wire in No Man's Land four years later and freed. He is returned behind British lines where Albert, now a private, has been temporarily blinded by gas, but still recognizes his beloved Joey. However, as the Armistice is declared Joey is set to be auctioned off. After all they have been through will Albert and Joey return home together?", 
    "genres": "Drama, War", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "post-Great", 
                    "positive", 
                    "regimental", 
                    "simple-minded", 
                    "first"
                ], 
                "role": "Played with in War Horse, where it isn't quite the trope it'd be in a post-Great War setting. Mr. Narracott is shown as having fought in the Boer War, and it's hardened him somewhat, but not in a positive sense. He refuses to talk about what he did or even acknowledge his medals and regimental pennant. His wife explains the situation to Albie, his gentle and somewhat simple-minded son, but it doesn't keep him from attempting to enlist in World War One at the first opportunity.", 
                "id": "DadTheVeteran"
            }, 
            {
                "adjectives": [
                    "typical", 
                    "superior", 
                    "German", 
                    "good", 
                    "much", 
                    "evident"
                ], 
                "role": "Captain Nicholls in War Horse is a typical example, even objecting to his superior's plan to attack an undefended German garrison with a surprise cavalry charge. Like a good officer, though, he follows orders. He doesn't have much of a Stiff Upper Lip, though, and the look of horror and desperation is evident on his face when he realizes that the Germans have set up machineguns in the treeline, which are mowing down the cavalry. He keeps charging, though.", 
                "id": "OfficerAndAGentleman"
            }
        ]
    }, 
    "imdbid": "tt1568911", 
    "poster_url": "WarHorse.jpg", 
    "similar": [
        {
            "shared": [
                "DadTheVeteran", 
                "OfficerAndAGentleman"
            ], 
            "shared_count": 2, 
            "id": "TheSoundOfMusic", 
            "name": "The Sound of Music", 
            "poster_url": "TheSoundOfMusic.jpg"
        }, 
        {
            "shared": [
                "OfficerAndAGentleman"
            ], 
            "shared_count": 1, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "OfficerAndAGentleman"
            ], 
            "shared_count": 1, 
            "id": "TheBarberOfSiberia", 
            "name": "The Barber of Siberia", 
            "poster_url": "TheBarberOfSiberia.jpg"
        }, 
        {
            "shared": [
                "OfficerAndAGentleman"
            ], 
            "shared_count": 1, 
            "id": "EnemyAtTheGates", 
            "name": "Enemy at the Gates", 
            "poster_url": "EnemyAtTheGates.jpg"
        }, 
        {
            "shared": [
                "OfficerAndAGentleman"
            ], 
            "shared_count": 1, 
            "id": "TheGreatDictator", 
            "name": "The Great Dictator", 
            "poster_url": "TheGreatDictator.jpg"
        }
    ], 
    "id": "WarHorse", 
    "name": "War Horse"
}