{
    "plot": "Jeff Gerber, an insurance agent, lives in a typical suburban neighborhood. He is also both racist and a fitness freak. But Jeff's bigoted world of taunting and harassing black people on and off the job is turned upside down when his skin inexplicably turns dark overnight. As Jeff tries to come to terms with this unexplained phenomenon that has befallen him, he soon becomes the victim himself when all of his friends and neighbors suddenly shun and harass him. This puts a strain on his marriage and loyal wife Althea, who begins to crack under the pressure. When all medical attempts to change his skin back to his former color fail, Jeff accepts that Kharma has caught up with him. Jeff tries to see the light of being a persecuted black man in this cruel and segregated world with the help of some of some new black friends, some of whom were people he, as a white man, taunted and harassed.", 
    "genres": "Comedy, Drama", 
    "release_year": "1970", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Angry Black Man: Gerber has become this at the end of his film.", 
                "id": "AngryBlackMan"
            }
        ]
    }, 
    "imdbid": "tt0066550", 
    "poster_url": "WatermelonMan.jpg", 
    "similar": [
        {
            "shared": [
                "AngryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "AmericanHistoryX", 
            "name": "American History X", 
            "poster_url": "AmericanHistoryX.jpg"
        }, 
        {
            "shared": [
                "AngryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "Coonskin", 
            "name": "Coonskin"
        }, 
        {
            "shared": [
                "AngryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "DontBeAMenaceToSouthCentralWhileDrinkingYourJuiceInTheHood", 
            "name": "Don't Be A Menace To South Central While Drinking Your Juice In The Hood", 
            "poster_url": "DontBeAMenaceToSouthCentralWhileDrinkingYourJuiceInTheHood.jpg"
        }, 
        {
            "shared": [
                "AngryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "JesusChristSuperstar", 
            "name": "Jesus Christ Superstar", 
            "poster_url": "JesusChristSuperstar.jpg"
        }, 
        {
            "shared": [
                "AngryBlackMan"
            ], 
            "shared_count": 1, 
            "id": "ClerksII", 
            "name": "Clerks II", 
            "poster_url": "ClerksII.jpg"
        }
    ], 
    "id": "WatermelonMan", 
    "name": "Watermelon Man"
}