{
    "plot": "The vampires Louise, Charlotte and Nora arrive in Berlin after attacking the passengers and crew of an airplane in a flight to Paris. The leader Louise has been looking for centuries for her missed love and Charlotte misses her daughter that she saw in 1923 for the last time. Meanwhile, the smalltime pickpocket Lena steals a Russian mobster and is chased by Detective Tom. When Lena goes to a nightclub, the lesbian Louise believes that Lena is the love of her life and transforms her into a vampire. Lena initially feels lost with the transformation, but sooner she joins the trio of vampires in their nightlife. When the pack of vampires attacks a group of criminals, the police department investigates the case and hunts the women without knowing the risks that they are taking. Meanwhile the lonely Tom and the Lena fall in love with each other; but the unrequited love of Louise for Lena jeopardizes the couple.", 
    "genres": "Drama, Fantasy, Horror", 
    "release_year": "2010", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Lesbian", 
                    "bisexual", 
                    "open", 
                    "sexual"
                ], 
                "role": "Lesbian Vampire: Louise definitely is, and Nora and Charlotte's kiss could point to them being bisexual (note Charlotte stroking Nora's hair and her reaction to  Nora's death). Word of God says that Charlotte is open to sexual relations with both men and women and that Charlotte actually agreed to be bitten.", 
                "id": "LesbianVampire"
            }, 
            {
                "adjectives": [
                    "bisexual"
                ], 
                "role": "The German film We Are the Night has one of these and two bisexual ones.", 
                "id": "LesbianVampire"
            }, 
            {
                "adjectives": [
                    "Lesbian", 
                    "bisexual", 
                    "real", 
                    "open", 
                    "sexual"
                ], 
                "role": "Lesbian Vampire: Louise definitely is, and Nora and Charlotte's kiss could point to them being bisexual, but Lena is neither. She probably sees Louise as a mother figure who takes care of her, unlike her real mother, and only shows aversion towards Louise when kissed by her. When Louise first starts to kiss her Lena is noticeably uncomfortable. Word of God says that Charlotte is open to sexual relations with both men and women.", 
                "id": "LesbianVampire"
            }, 
            {
                "adjectives": [], 
                "role": "Nora, from We Are the Night. A happy vampire chick, enjoying her powers.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [], 
                "role": "Perky Goth: Nora is perhaps the archetype.", 
                "id": "PerkyGoth"
            }
        ]
    }, 
    "imdbid": "tt1692504", 
    "poster_url": "WeAreTheNight.jpg", 
    "similar": [
        {
            "shared": [
                "PerkyGoth", 
                "LesbianVampire"
            ], 
            "shared_count": 2, 
            "id": "TheDeadMatter", 
            "name": "The Dead Matter", 
            "poster_url": "TheDeadMatter.jpg"
        }, 
        {
            "shared": [
                "LesbianVampire"
            ], 
            "shared_count": 1, 
            "id": "RazorBladeSmile", 
            "name": "Razor Blade Smile", 
            "poster_url": "RazorBladeSmile.jpg"
        }, 
        {
            "shared": [
                "LesbianVampire"
            ], 
            "shared_count": 1, 
            "id": "TheLairOfTheWhiteWorm", 
            "name": "The Lair of the White Worm", 
            "poster_url": "TheLairOfTheWhiteWorm.jpg"
        }, 
        {
            "shared": [
                "PerkyGoth"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "PerkyGoth"
            ], 
            "shared_count": 1, 
            "id": "TheHotChick", 
            "name": "The Hot Chick", 
            "poster_url": "TheHotChick.jpg"
        }
    ], 
    "id": "WeAreTheNight", 
    "name": "We Are the Night"
}