{
    "plot": "Two unpopular teenagers, Gary Wallace and Wyatt Donnelly, fail at all attempts to be accepted by their peers. Their desperation to be liked leads them to \"create\" a woman via their computer. Their living and breathing creation is a gorgeous woman, Lisa, whose purpose is to boost their confidence level by putting them into situations which require Gary and Wyatt to act like men. On their road to becoming accepted, they encounter many hilarious obstacles, which gives the movie an overall sense of silliness.", 
    "genres": "Comedy, Fantasy, Romance", 
    "release_year": "1985", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Jerk Jock: Chet.", 
                "id": "JerkJock"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "gratuitous", 
                    "other"
                ], 
                "role": "Fanservice Extras: The girl in the upside down bathroom who gives a gratuitous Panty Shot is one. The other is the girl playing the piano, who gets stripped down to her panties before being sucked up and out the chimney. The \"Girl Playing Piano\" is Kym Malin, who is also Playboy's Playmate of the Month for May 1982.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "second", 
                    "Upside-Down", 
                    "gratuitous", 
                    "other"
                ], 
                "role": "In Weird Science, Gary and Wyatt try to create a second woman during the Wild Teen Party near the middle of the movie. Hilarity Ensues, and two Fanservice Extras make an appearance:\n The \"Girl in Upside-Down Bathroom\" giggles while giving a gratuitous Panty Shot as the bathroom is rotating. Actress Alison Carole Lowe, whose only other film credit is as \"Gymnast\" in Breakin 2 Electric Boogaloo, gets her 5 seconds on the screen.\n The \"Girl Playing Piano\" vs. The Invisible Nudifier, or whatever it is that is sucking everything in the room into the fireplace and out the chimney. Actress Kym Malin, who did her own stunts here.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "Magical"
                ], 
                "role": "Magical Girl: Lisa, born of a Magical Computer. Instant A.I., Just Add Water and/or lightning. And don't forget to hook up the doll. Pershing missiles happen when you don't hook up the doll.", 
                "id": "MagicalGirl"
            }, 
            {
                "adjectives": [
                    "very", 
                    "own", 
                    "Magical", 
                    "virtual-reality-based", 
                    "unintended", 
                    "initial", 
                    "real", 
                    "romantic", 
                    "questionable", 
                    "different", 
                    "underwear"
                ], 
                "role": "Subverted in Weird Science (film and series), in which two teenage geeks create their very own Magical Girlfriend, Lisa, a virtual-reality-based supermodel-type who solves all their problems for them, often with unintended results or methods, then helpfully goes away. (Despite their initial intentions for creating her, neither geek seems to have any real romantic relationship with Lisa — beyond the requisite ogling — so her \"Girlfriend\" status is questionable; they treat her more like their Cool Big Sis.)\n The movie is different: one of the teenagers wakes up wearing Lisa's underwear, so it's strongly implied they've had sex- though she claims he passed out before they did anything. Possibly the underwear was a joke on her part, as it gets him in trouble with his older brother.", 
                "id": "MagicalGirlfriend"
            }, 
            {
                "adjectives": [
                    "huge", 
                    "female", 
                    "huge"
                ], 
                "role": "In Weird Science, the two protagonists consider designing the program to make the girl's breasts huge; but then Gary says, \"Hold it, Wyatt, I know female stats. Anything bigger than a handful and you're looking at a sprained tongue.\" So they reduce them to average size. (Zigzagged in a way because while Lisa'a bust doesn't turn out to be huge, she isn't exactly petite either.)", 
                "id": "PetitePride"
            }
        ]
    }, 
    "imdbid": "tt0090305", 
    "poster_url": "WeirdScience.jpg", 
    "similar": [
        {
            "shared": [
                "MagicalGirl", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "ExchangeStudentZero", 
            "name": "Exchange Student Zero"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "TheAmazingSpiderMan", 
            "name": "The Amazing Spider-Man", 
            "poster_url": "TheAmazingSpiderMan.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "TheAmazingSpider-Man", 
            "name": "The Amazing Spider-Man", 
            "poster_url": "TheAmazingSpider-Man.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra", 
                "JerkJock"
            ], 
            "shared_count": 2, 
            "id": "DetroitRockCity", 
            "name": "Detroit Rock City", 
            "poster_url": "DetroitRockCity.jpg"
        }
    ], 
    "id": "WeirdScience", 
    "name": "Weird Science"
}