{
    "plot": "In a tale that almost redefines sibling rivalry, faded actresses Blanche and 'Baby' Jane Hudson live together. Jane was by far the most famous when she performed with their father in vaudeville but as they got older, it was Blanche who became the finer actress, which Jane still resents. Blanche is now confined to a wheelchair - Jane ran her over with the car while drunk, even though she has no memory of it - and Jane is firmly in control. As time goes by, Jane exercises greater and greater control over her sister, intercepting her letters and ensuring that few if anyone from the outside has any contact with her. As Jane slowly loses her mind, she torments her sister going to ever greater extremes.", 
    "genres": "Drama, Horror, Thriller", 
    "release_year": "1962", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Momma's Boy: Edwin.", 
                "id": "MommasBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Lady Drunk: Jane.", 
                "id": "LadyDrunk"
            }, 
            {
                "adjectives": [
                    "clingy", 
                    "possessive", 
                    "jealous"
                ], 
                "role": "My Beloved Smother: Edwin's mother is very clingy and possessive, and gets jealous when he starts spending his time with Jane.", 
                "id": "MyBelovedSmother"
            }, 
            {
                "adjectives": [], 
                "role": "Whatever Happened To Baby Jane. Jane threatens Blanche with the note that she wrote for help that she kept tucked away in her blouse.", 
                "id": "Ptitleba4e2b2g"
            }, 
            {
                "adjectives": [
                    "adorable", 
                    "creepy", 
                    "sung"
                ], 
                "role": "In What Ever Happened to Baby Jane?, Jane dresses like a little girl and sings songs that would be adorable for a little girl but are incredibly creepy when sung by an adult.", 
                "id": "TheFakeCutie"
            }, 
            {
                "adjectives": [
                    "entire", 
                    "Former", 
                    "dead", 
                    "awe-struck"
                ], 
                "role": "This is the entire premise of Whatever Happened To Baby Jane?. Jane Hudson shares a home with her crippled Twin sister Blanche, who she constantly torments and starves. All the while Jane speaks of being a Former Child Star and goes just about anywhere to see if anyone remembers her. She says something to the effect of \"Someday I'm going to get up and dance, then everyone will gather around me.\" The audience sympathizes with Blanche, whom Jane allegedly crippled by running her over with a car. When Jane decides that she must move away and finally takes Blanche out of the house she reveals that Jane never hit her with the car. She'd gotten in an accident and blamed Jane when the cops arrived.. She's dying when she confesses this and Jane, has slipped into insanity. The film ends with  the authorities approaching the dead body. Jane (who had gone to get an icecream cone) , starts dancing slowly as awe-struck people gather to see what has happened. In her mind, her dream has come true. They've all remembered Little Baby Jane Hudson..", 
                "id": "WhiteDwarfStarlet"
            }, 
            {
                "adjectives": [
                    "White-Dwarf"
                ], 
                "role": "White-Dwarf Starlet: Baby Jane, of course. Also a Former Child Star. Just to complete the trifecta, from what little we get to see of when she was a star, she was The Prima Donna. And she seems to have stayed that way...", 
                "id": "WhiteDwarfStarlet"
            }
        ]
    }, 
    "imdbid": "tt0056687", 
    "poster_url": "WhatEverHappenedToBabyJane.jpg", 
    "similar": [
        {
            "shared": [
                "TheFakeCutie", 
                "WhiteDwarfStarlet", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 3, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "WhiteDwarfStarlet", 
                "MommasBoy", 
                "Ptitleba4e2b2g"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "MommasBoy", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "PeytonPlace", 
            "name": "Peyton Place", 
            "poster_url": "PeytonPlace.jpg"
        }, 
        {
            "shared": [
                "WhiteDwarfStarlet", 
                "LadyDrunk"
            ], 
            "shared_count": 2, 
            "id": "BulletsOverBroadway", 
            "name": "Bullets Over Broadway", 
            "poster_url": "BulletsOverBroadway.jpg"
        }, 
        {
            "shared": [
                "MommasBoy", 
                "MyBelovedSmother"
            ], 
            "shared_count": 2, 
            "id": "TheLionInWinter", 
            "name": "The Lion in Winter", 
            "poster_url": "TheLionInWinter.jpg"
        }
    ], 
    "id": "WhatEverHappenedToBabyJane", 
    "name": "What Ever Happened to Baby Jane?"
}