{
    "plot": "What's Eating Gibert Grape is a beautifully shot movie of tenderness, caring and self-awareness that is set amongst the fictional working class one street town Endora. Centred around the Grape family Ellen and Amy and their two brothers Arnie and Gilbert, who, along with their morbidly obese widowed mother Bonnie Grape are striving to survive and coexist with the absence of a father figure, low wage work and seventeen-year-old Arnie's severe mental condition. It is in this awkward and extremely one sided affair that the unfortunate Gilbert has to constantly, while working for the town's slowly dying convenience store, take care of his younger brother Arnie. Gilbert's life, his future, is thwarted he knows this, but it is in this guardian angel that his love and bond for Arnie cannot, and will not, be let go. That is until the free spirit of Becky arrives in town, and with her grandmother are stranded for the week while waiting for parts for their vehicle. This realization unties new feelings, new thoughts and new hope for the put upon Gibert, something new is eating Gilbert Grape.", 
    "genres": "Drama", 
    "release_year": "1993", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Bratty Teenage Daughter: Ellen Grape", 
                "id": "BrattyTeenageDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Ellen Grape from What's Eating Gilbert Grape?.", 
                "id": "BrattyTeenageDaughter"
            }, 
            {
                "adjectives": [
                    "beached"
                ], 
                "role": "Fat Girl: When Gilbert says his mother is the size of a beached whale, he's not far off.", 
                "id": "FatGirl"
            }, 
            {
                "adjectives": [
                    "own", 
                    "public", 
                    "due"
                ], 
                "role": "Mama Bear: Bonnie Grape. When the cops detain Arnie for climbing the water tower again, she risks her own health and being humiliated in public due to her weight, walking to the police station demanding to know where Arnie is.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [], 
                "role": "Manic Pixie Dream Girl: Becky seems to be one for Gilbert.", 
                "id": "ManicPixieDreamGirl"
            }
        ]
    }, 
    "imdbid": "tt0108550", 
    "poster_url": "WhatsEatingGilbertGrape.jpg", 
    "similar": [
        {
            "shared": [
                "FatGirl", 
                "BrattyTeenageDaughter", 
                "MamaBear"
            ], 
            "shared_count": 3, 
            "id": "TokyoGodfathers", 
            "name": "Tokyo Godfathers", 
            "poster_url": "TokyoGodfathers.jpg"
        }, 
        {
            "shared": [
                "BrattyTeenageDaughter", 
                "MamaBear", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 3, 
            "id": "Hanna", 
            "name": "Hanna", 
            "poster_url": "Hanna.jpg"
        }, 
        {
            "shared": [
                "BrattyTeenageDaughter", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "Parenthood", 
            "name": "Parenthood", 
            "poster_url": "Parenthood.jpg"
        }, 
        {
            "shared": [
                "MamaBear", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "WithoutAPaddle", 
            "name": "Without A Paddle", 
            "poster_url": "WithoutAPaddle.jpg"
        }, 
        {
            "shared": [
                "MamaBear", 
                "ManicPixieDreamGirl"
            ], 
            "shared_count": 2, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }
    ], 
    "id": "WhatsEatingGilbertGrape", 
    "name": "What's Eating Gilbert Grape"
}