{
    "plot": "Michael James, a notorious womanizer, desperately wants to be faithful to his fiancée Carole, but runs into serious problems since every woman he meets seems to fall in love with him. His psychoanalyst Dr. Fassbender can't help him either since he's busy courting one of his patients who in turn longs for Michael. A catastrophe appears on the horizon as all the characters check into the Chateau Chantelle hotel for the weekend not knowing of each other's presence.", 
    "genres": "Comedy", 
    "release_year": "1965", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "'60s", 
                    "shoulder-length"
                ], 
                "role": "The '60s comedy What's New Pussycat? opens with Peter Sellers, in a velvet suit and shoulder-length hair, arguing with his wife who accuses him of seeing another woman. She demands \"Is she prettier than me?\" He shouts \"Is she prettier than you?! ...I'm prettier than you!\" (Note: for comparison's sake, he's nowhere near pretty.)", 
                "id": "DudeLooksLikeALady"
            }, 
            {
                "adjectives": [
                    "faithful", 
                    "deranged"
                ], 
                "role": "What's New Pussycat? stars Peter O'Toole as a man who just can't say no to women. He sees a psychiatrist to help him swear them off and be faithful to his fiancee, but the doctor is a deranged lech himself.", 
                "id": "TheCasanova"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "such", 
                    "full", 
                    "Wagnerian", 
                    "Freudian"
                ], 
                "role": "In What's New Pussycat?, such a woman is married to Viennese psychiatrist Peter Sellers - she tracks him down to a hotel in full Wagnerian dress to stop his philandering, and appears to be a Freudian nightmare to Woody Allen.", 
                "id": "BrawnHilda"
            }
        ]
    }, 
    "imdbid": "tt0059903", 
    "poster_url": "WhatsNewPussycat.jpg", 
    "similar": [
        {
            "shared": [
                "TheCasanova", 
                "BrawnHilda"
            ], 
            "shared_count": 2, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "DudeLooksLikeALady", 
                "TheCasanova"
            ], 
            "shared_count": 2, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "BrawnHilda"
            ], 
            "shared_count": 2, 
            "id": "TheFifthElement", 
            "name": "The Fifth Element", 
            "poster_url": "TheFifthElement.jpg"
        }, 
        {
            "shared": [
                "TheCasanova", 
                "BrawnHilda"
            ], 
            "shared_count": 2, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "TheCasanova"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }
    ], 
    "id": "WhatsNewPussycat", 
    "name": "What's New Pussycat?"
}