{
    "plot": "\"What's Opera, Doc?\" lampoons classic opera by using its elements to set up the latest chapter in Elmer Fudd's hapless pursuit of Bugs Bunny. We open with a silhouette of a mighty Viking arousing ferocious lightning storms ... only to find it's Elmer -- this time as the demigod Siegfried. Elmer admonishes the audience (in classical verse) to \"be vewwy quiet, I'm hunting wabbits!\" It's not long before Elmer comes upon Bugs' hole and sings out \"Kill the wabbit!\" not realizing that the hare has already climbed out and is viewing Elmer spearing fruitlessly in said hole. Bugs joins in the fun, querying his tagline in operatic verse and leaving Elmer in his dust (but not before \"Siegfried\" shows us an example of supposed \"mighty powers\" from his spear and magic helmet). Elmer goes after the wascally wabbit, but his pursuit is ended when he sets his eyes on the stunningly and awesomely beautiful Valkyrie Brunhilde (Bugs in disguise). After a \"hard-to-get\" pursuit\" (brought on by Elmer's eternally-misguided hormones) \"Siegfried\" and \"Valkyrie\" join in magnificent duet with \"Return My Love.\" However, Bugs' scheme is exposed when his headdress falls off, enraging Elmer. The pseudo-Viking commands fierce lightning, rain, hail and wind storms (not to mention smog) to \"kill the wabbit!\" It works, but upon seeing the bunny's corpse, a woefully remorseful Elmer is reduced to tears as he somberly carries the \"dead\" Bugs into the distance. But has Bugs really been struck dead?", 
    "genres": "Animation, Short, Comedy", 
    "release_year": "1957", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Averted when Bugs Bunny disguised himself as \"Bwunhilde\" to fool Elmer Fudd (depicted as the hero Siegfried) in What's Opera, Doc? (as it was when he had originally dressed as her in Herr Meets Hare); his valkyrie is actually quite petite. The horse more than makes up for it.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "Brünnhilde", 
                    "curvaceous", 
                    "noble"
                ], 
                "role": "Brawn Hilda: Averted; Bugs as Brünnhilde is really quite petite. The horse \"she\" rides in on, however...◊ Chuck Jones once explained that, denied the traditionally curvaceous opera heroine, they threw every curve they had into her noble steed instead.", 
                "id": "BrawnHilda"
            }, 
            {
                "adjectives": [
                    "Brünnhilde"
                ], 
                "role": "Valkyries: Bugs as Brünnhilde, obviously.", 
                "id": "Valkyries"
            }
        ]
    }, 
    "imdbid": "tt0051189", 
    "poster_url": "WhatsOperaDoc.jpg", 
    "similar": [
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "GrownUps", 
            "name": "Grown Ups", 
            "poster_url": "GrownUps.jpg"
        }, 
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "RobinHoodPrinceOfThieves", 
            "name": "Robin Hood: Prince of Thieves", 
            "poster_url": "RobinHoodPrinceOfThieves.jpg"
        }, 
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "TheSinisterUrge", 
            "name": "The Sinister Urge", 
            "poster_url": "TheSinisterUrge.jpg"
        }, 
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "LaserMission", 
            "name": "Laser Mission", 
            "poster_url": "LaserMission.jpg"
        }, 
        {
            "shared": [
                "BrawnHilda"
            ], 
            "shared_count": 1, 
            "id": "FiddlerOnTheRoof", 
            "name": "Fiddler on the Roof", 
            "poster_url": "FiddlerOnTheRoof.jpg"
        }
    ], 
    "id": "WhatsOperaDoc", 
    "name": "What's Opera, Doc?"
}