{
    "plot": "Vera is a femme fatale for the 21st century; a beautiful, capricious young woman living in New York whom begins exploring the limits of her sexual and intellectual power. She picks up men on the street and has sex with them in her apartment. She also videotapes a sexual romp with a female lover, and has sexually frank discussions with her potential employer. As the daughter of wealthy, indulgent parents, Vera seems to be improvising her way through the beginning of her life as an adult. Her boyfriend, Ford, is a fast-talking hustler prepared to do anything to make a buck. Aware of Vera's promiscuity, Ford sees a chance to make big money when he meets an aging Italian media mogul, named Count Tommaso, who is enamored of Vera because of her sexuality, her intelligence, and what he perceives as her naiveté. Ford cooks up an idea to pimp Vera out to the Count for $100,000, easy money, if he can only talk Vera into it. Incredibly, she agrees. Everything appears to be going even better than planned. But both men have gravely underestimated Vera, who has an agenda of her own. Ford and the Count unwittingly play right into her hands, and when her plan of deception and manipulation comes to fruition, the results are staggering.", 
    "genres": "Drama, Thriller", 
    "release_year": "2004", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Femme Fatale: Vera Barrie.", 
                "id": "FemmeFatale"
            }
        ]
    }, 
    "imdbid": "tt0396271", 
    "poster_url": "WhenWillIBeLoved.jpg", 
    "similar": [
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "AssassinationOfAHighSchoolPresident", 
            "name": "Assassination Of A High School President", 
            "poster_url": "AssassinationOfAHighSchoolPresident.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "ISpitOnYourGrave", 
            "name": "I Spit on Your Grave", 
            "poster_url": "ISpitOnYourGrave.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "ThreeHundredRiseOfAnEmpire", 
            "name": "300: Rise of an Empire", 
            "poster_url": "ThreeHundredRiseOfAnEmpire.jpg"
        }, 
        {
            "shared": [
                "FemmeFatale"
            ], 
            "shared_count": 1, 
            "id": "SherlockHolmes", 
            "name": "Sherlock Holmes", 
            "poster_url": "SherlockHolmes.jpg"
        }
    ], 
    "id": "WhenWillIBeLoved", 
    "name": "When Will I be Loved"
}