{
    "plot": "'Toon star Roger is worried that his wife Jessica is playing pattycake with someone else, so the studio hires detective Eddie Valiant to snoop on her. But the stakes are quickly raised when Marvin Acme is found dead and Roger is the prime suspect. Groundbreaking interaction between the live and animated characters, and lots of references to classic animation.", 
    "genres": "Animation, Comedy, Crime", 
    "release_year": "1988", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "gorgeous", 
                    "physical"
                ], 
                "role": "Who Framed Roger Rabbit: Roger Rabbit, an infantile short goofy animated rabbit is married to a gorgeous sex bomb, Jessica Rabbit. Justified: toons seem to have no concept of physical beauty and prize only humor. By those standards, it's explicitly stated that it's Roger who's the catch and Jessica who's out of her league.", 
                "id": "KavorkaMan"
            }, 
            {
                "adjectives": [
                    "non-Fanservice"
                ], 
                "role": "Baby Herman from Who Framed Roger Rabbit is a non-Fanservice example.", 
                "id": "WalkingShirtlessScene"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "obvious"
                ], 
                "role": "Butterface: Lena Hyena perfectly mimics Jessica Rabbit's everything, but her face, for obvious reasons.", 
                "id": "ButterFace"
            }, 
            {
                "adjectives": [], 
                "role": "In Who Framed Roger Rabbit, Eddie Valiant sees what he thinks is the silhouette of Jessica Rabbit in the window of an apartment. But it turns out that it's Lena Hyena, who somehow managed to make herself look just like Jessica (toon physics or something), excluding the face. As soon as she saw Eddie, the rest of it unraveled.", 
                "id": "ButterFace"
            }, 
            {
                "adjectives": [
                    "sexy", 
                    "gorgeous", 
                    "female"
                ], 
                "role": "Jessica Rabbit of Who Framed Roger Rabbit is so sexy and gorgeous that she has a ton of female fans that have said they would switch teams for her.", 
                "id": "EvenTheGirlsWantHer"
            }, 
            {
                "adjectives": [
                    "hard-boiled", 
                    "detective"
                ], 
                "role": "Femme Fatale: Jessica. What would a hard-boiled detective story be without one?", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "dangerous", 
                    "bad"
                ], 
                "role": "Jessica from Who Framed Roger Rabbit. She's a toon clearly created by some artist to be the perfect Femme Fatal, from her dangerous good looks and sultry voice, to the slinky way she moves. Even her smile is suspicious.  It turns out that she's the Red Herring and was telling the truth all along. She really isn't bad! Just drawn that way.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "amusing"
                ], 
                "role": "Jessica Rabbit from Who Framed Roger Rabbit. Made especially amusing by the line:", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [
                    "prominent"
                ], 
                "role": "Most prominent example: A Booby Trap.", 
                "id": "GagBoobs"
            }, 
            {
                "adjectives": [], 
                "role": "Jessica Rabbit in Who Framed Roger Rabbit.", 
                "id": "GoodBadGirl"
            }, 
            {
                "adjectives": [
                    "human", 
                    "infamous", 
                    "bad", 
                    "she's—oh", 
                    "odd", 
                    "other", 
                    "real"
                ], 
                "role": "Even the human characters in Who Framed Roger Rabbit lust for the infamous Jessica Rabbit. She's not bad; she's—oh, you know the rest.\n Jessica actually played a nurse in the Disney short-film Tummy Trouble featuring Roger Rabbit and Baby Herman.\n An odd case, since Roger is the one that other Toons consider a real catch.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [], 
                "role": "Hello, Nurse!: Jessica Rabbit.", 
                "id": "HelloNurse"
            }, 
            {
                "adjectives": [
                    "comic", 
                    "real"
                ], 
                "role": "A comic book spinoff of Who Framed Roger Rabbit introduces, Jessica's rival, Winnie Weasel. The male weasels depicted in the movie are built roughly like real weasels standing on their back legs. This is Winnie.", 
                "id": "HumanoidFemaleAnimal"
            }, 
            {
                "adjectives": [
                    "gorgeous", 
                    "slinky"
                ], 
                "role": "Subverted by Jessica Rabbit from Who Framed Roger Rabbit. She's gorgeous and wears a very revealing long slinky shiny dress, showing some legs and lots of cleavage, but", 
                "id": "LadyInRed"
            }, 
            {
                "adjectives": [
                    "integral", 
                    "flesh-colored"
                ], 
                "role": "Ms. Fanservice: Jessica Rabbit. Okay okay, she's integral to the plot, but seriously... look at her. She gets a flesh-colored Panty Shot after getting spun out of the car. This was reworked in the 20 Years Release.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [], 
                "role": "Inverted and subverted by Jessica Rabbit in Who Framed Roger Rabbit, as her husband actually IS a rabbit but she dresses like a nightclub singer.", 
                "id": "PlayboyBunny"
            }, 
            {
                "adjectives": [], 
                "role": "Jessica Rabbit of Who Framed Roger Rabbit towers over both Roger Rabbit and Eddie Valiant.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "male", 
                    "married", 
                    "comedian"
                ], 
                "role": "Jessica Rabbit in Who Framed Roger Rabbit is introduced this way, working as a singer in the Ink & Paint Club. The entire (male) crowd is gobsmacked by her beauty and sensuality, and Eddie Valiant openly asks Betty Boop how that woman wound up married to a comedian like Roger Rabbit.", 
                "id": "TheChanteuse"
            }, 
            {
                "adjectives": [], 
                "role": "The Chanteuse: Jessica Rabbit.", 
                "id": "TheChanteuse"
            }, 
            {
                "adjectives": [
                    "White-Dwarf", 
                    "black", 
                    "upbeat", 
                    "Ink-n-Paint"
                ], 
                "role": "White-Dwarf Starlet: Betty Boop (shown in black and white) is an unusually upbeat version of one, working at the Ink-n-Paint Club.", 
                "id": "WhiteDwarfStarlet"
            }, 
            {
                "adjectives": [
                    "color.note", 
                    "Significant", 
                    "philosophical", 
                    "sad", 
                    "Sure"
                ], 
                "role": "Who Framed Roger Rabbit finds Betty Boop working as a nightclub cigarette girl, having been put out of business by cartoons going to color.note There actually is one color Betty cartoon, Poor Cinderella (1934). And Betty's a Significant Greeneyed Redhead in it! She's fairly philosophical about it, though. Counts for a bit of a Tear Jerker, especially Eddie's sad, \"Sure, Betty\" after she assures him she's \"Still got it.\" You can thank this movie for helping to revive Betty Boop's career, if not as an animated film star then as a merchandising icon.", 
                "id": "WhiteDwarfStarlet"
            }, 
            {
                "adjectives": [], 
                "role": "Benny the Cab from Who Framed Roger Rabbit calls everyone he passes \"lady\", even though he is the one who Drives Like Crazy.", 
                "id": "WomenDrivers"
            }
        ]
    }, 
    "imdbid": "tt0096438", 
    "poster_url": "WhoFramedRogerRabbit.jpg", 
    "similar": [
        {
            "shared": [
                "WalkingShirtlessScene", 
                "ButterFace", 
                "StatuesqueStunner", 
                "KavorkaMan", 
                "WhiteDwarfStarlet"
            ], 
            "shared_count": 5, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "PlayboyBunny", 
                "WalkingShirtlessScene", 
                "GagBoobs", 
                "StatuesqueStunner", 
                "EvenTheGirlsWantHer"
            ], 
            "shared_count": 5, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "TheChanteuse", 
                "LadyInRed", 
                "MsFanservice", 
                "HelloNurse"
            ], 
            "shared_count": 4, 
            "id": "RedHotRidingHood", 
            "name": "Red Hot Riding Hood"
        }, 
        {
            "shared": [
                "GagBoobs", 
                "MsFanservice", 
                "StatuesqueStunner", 
                "HelloNurse"
            ], 
            "shared_count": 4, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }, 
        {
            "shared": [
                "GagBoobs", 
                "MsFanservice", 
                "HelloNurse", 
                "FemmeFatale"
            ], 
            "shared_count": 4, 
            "id": "Clue", 
            "name": "Clue", 
            "poster_url": "Clue.jpg"
        }
    ], 
    "id": "WhoFramedRogerRabbit", 
    "name": "Who Framed Roger Rabbit"
}