{
    "plot": "A baby girl is discovered in a river by Ranon and Mims, the children of Willow Ufgood, a dwarf farmer and magician and the baby girl is taken into the care of Willow's family. But when a terrifying dog-like creature attacks Willow's village, whilst tracking down the baby. Willow consults the village council and the wizard The High Aldwin. The High Aldwin gives Willow a task and Willow leaves the village and embarks on the task to give the baby girl to a responsible person. But Willow soon learns the baby is Elora Danan, the baby girl destined to bring about the downfall of the evil sorceress Queen Bavmorda. Joined by his allies: swordsman Madmartigan, sorceress Fin Raziel and the Brownies Franjean and Rool, Willow takes it upon himself to protect Elora from Queen Bavmorda, who intends to kill Elora and prevent Elora from fulfilling her destiny. And Willow and his allies are pursued by Queen Bavmorda's daughter Sorsha and the evil commander of Queen Bavmorda's army General Kael, whom are searching for Elora and bring her back to Queen Bavmorda's castle, where Queen Bavmorda bids to kill Elora in a ritual and prevent the prophecy of her downfall.", 
    "genres": "Action, Adventure, Drama", 
    "release_year": "1988", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "sudden"
                ], 
                "role": "Disguised in Drag: Madmartigan, in a hasty attempt to avoid the wrath of his paramour's husband. The trope is furthered by the husband's sudden lust for Madmartigan.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [
                    "jealous"
                ], 
                "role": "In Willow, Madmartigan disguises himself as a woman in an attempt to hide from a woman's jealous husband. It backfires when said husband finds him attractive and proceeds to proposition him. Right infront of his wife.", 
                "id": "DisguisedInDrag"
            }, 
            {
                "adjectives": [
                    "open"
                ], 
                "role": "Mr. Fanservice: Madmartigan. He runs around with his shirt open.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "protective"
                ], 
                "role": "Papa Wolf: Willow is very protective of his children, including Elora Danan.", 
                "id": "PapaWolf"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Sorsha.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "infant"
                ], 
                "role": "In Willow, even the infant queen Elora Danaan had one.", 
                "id": "BeautyMark"
            }, 
            {
                "adjectives": [], 
                "role": "Sorsha in Willow betrays her Evil Queen mother and joins the heroes out of love for Madmartigan.", 
                "id": "DefectingForLove"
            }, 
            {
                "adjectives": [], 
                "role": "Evil Matriarch / Evil Overlord: Bavmorda.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [
                    "evil", 
                    "bad"
                ], 
                "role": "Queen Bavmorda in Willow is not only an evil queen but a bad mother.", 
                "id": "EvilMatriarch"
            }, 
            {
                "adjectives": [], 
                "role": "God Save Us from the Queen!: Queen Bavmorda.", 
                "id": "GodSaveUsFromTheQueen"
            }, 
            {
                "adjectives": [], 
                "role": "In Willow, Sorsha plays the Mad Sorceress's Beautiful Daughter. With some help from a Love Potion and Heel-Face Turn from her mother.", 
                "id": "MadScientistsBeautifulDaughter"
            }, 
            {
                "adjectives": [], 
                "role": "Mad Scientist's Beautiful Daughter: Sorsha.", 
                "id": "MadScientistsBeautifulDaughter"
            }
        ]
    }, 
    "imdbid": "tt0096446", 
    "poster_url": "Willow.jpg", 
    "similar": [
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "EvilMatriarch", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 4, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "ActionGirl", 
                "MrFanservice", 
                "MadScientistsBeautifulDaughter"
            ], 
            "shared_count": 4, 
            "id": "BatmanTheAnimatedSeries", 
            "name": "Batman: The Animated Series"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "PapaWolf", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "GodSaveUsFromTheQueen", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 3, 
            "id": "TheLordOfTheRings", 
            "name": "The Lord of the Rings", 
            "poster_url": "TheLordOfTheRings.jpg"
        }
    ], 
    "id": "Willow", 
    "name": "Willow"
}