{
    "plot": "N/A", 
    "genres": "Western", 
    "release_year": "2007", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Nscho-tschi", 
                    "noble", 
                    "Indian", 
                    "big", 
                    "hair", 
                    "sweet", 
                    "bright", 
                    "much", 
                    "unresolved"
                ], 
                "role": "Apache Gold: Nscho-tschi (Beautiful Day) is Intschu-tschuna's daughter and Winnetou's sister. Intschu-tschuna is the chief of Apaches and Winnetou his successor, and both are noble Indian men. Nscho-tschi is the cutest girl with big brown eyes and raven hair, and she's lovely, sweet and caring. She's also a bright girl with desire to go to school and learn as much as possible. She nurses captured Old Shatterhand to health and falls for him. Notably, she believes his claim that he saved Winnetou's life and she procures the evidence for him to prove that he's not lying. Old Shatterhand returns her affection but their love mostly stayed unresolved and undeclared.", 
                "id": "TheChiefsDaughter"
            }, 
            {
                "adjectives": [
                    "unresolved"
                ], 
                "role": "The Chief's Daughter: Nscho-tschi is Intschu-tschuna's daughter and Winnetou's sister. Intschu-tschuna is the chief of Apaches and Winnetou his successor. She falls for Old Shatterhand who returns her affection though their love mostly stayed unresolved and undeclared.", 
                "id": "TheChiefsDaughter"
            }, 
            {
                "adjectives": [
                    "big", 
                    "gorgeous", 
                    "sweet", 
                    "bright", 
                    "much", 
                    "possible"
                ], 
                "role": "The Cutie: Nscho-tschi, Winnetou's sister is the cutest girl with big brown eyes and gorgeous raven hair. She's lovely, sweet and caring. She's also a bright and clever girl with desire to go to school and learn as much as possible.", 
                "id": "TheCutie"
            }
        ]
    }, 
    "imdbid": "tt1082590", 
    "similar": [
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "Stargate", 
            "name": "Stargate", 
            "poster_url": "Stargate.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "FreeBirds", 
            "name": "Free Birds", 
            "poster_url": "FreeBirds.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "JeremiahJohnson", 
            "name": "Jeremiah Johnson", 
            "poster_url": "JeremiahJohnson.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "TheBounty", 
            "name": "The Bounty", 
            "poster_url": "TheBounty.jpg"
        }
    ], 
    "id": "WinnetouI", 
    "name": "Winnetou I"
}