{
    "plot": "The construction of the Great Western Railroad creates heavy conflict between the railway company and neighboring Indian tribes. Worse, criminal gang leader Santer sets his eyes on a gold mine located on holy Indian land and influences the construction supervisor to re-rout the planned railroad straight through Apache land. Old Shatterhand, who works as a measurement technician, discovers the evil plan and searches contact with the Apaches in an effort to avert war.", 
    "genres": "Western, Adventure", 
    "release_year": "1963", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Nscho-tschi", 
                    "noble", 
                    "Indian", 
                    "big", 
                    "hair", 
                    "sweet", 
                    "bright", 
                    "much", 
                    "unresolved", 
                    "straight", 
                    "only", 
                    "gorgeous", 
                    "white", 
                    "whole"
                ], 
                "role": "The Winnetou series:\n Apache Gold: Nscho-tschi (Beautiful Day) is Intschu-tschuna's daughter and Winnetou's sister. Intschu-tschuna is the chief of Apaches and Winnetou his successor, and both are noble Indian men. Nscho-tschi is the cutest girl with big brown eyes and raven hair, and she's lovely, sweet and caring. She's also a bright girl with desire to go to school and learn as much as possible. She nurses captured Old Shatterhand to health and falls for him. Notably, she believes his claim that he saved Winnetou's life and she procures the evidence for him to prove that he's not lying. Old Shatterhand returns her affection but their love mostly stayed unresolved and undeclared.\n Last Of The Renegades: Ribanna is not a straight example. She's the only daughter of the Cheif of Assiniboin tribe. She's a gorgeous woman and Action Girl who can fight because she thinks her father wanted a son. She falls in love with Winnetou, the Chief of Apaches. They plan to marry, but alas! Lieutenant Merril likes Ribanna and proposes he marry her — their marriage will cement a treaty of peace between white men and Indians. Most chiefs like the idea and promise not to fight if they do get married. Winnetou is shattered because he has fought his whole life for peace. He commits this Heroic Sacrifice, but he and Ribanna suffer terribly.", 
                "id": "TheChiefsDaughter"
            }
        ]
    }, 
    "imdbid": "tt0057687", 
    "similar": [
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "Stargate", 
            "name": "Stargate", 
            "poster_url": "Stargate.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "FreeBirds", 
            "name": "Free Birds", 
            "poster_url": "FreeBirds.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "JeremiahJohnson", 
            "name": "Jeremiah Johnson", 
            "poster_url": "JeremiahJohnson.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "PeterPan", 
            "name": "Peter Pan", 
            "poster_url": "PeterPan.jpg"
        }, 
        {
            "shared": [
                "TheChiefsDaughter"
            ], 
            "shared_count": 1, 
            "id": "TheBounty", 
            "name": "The Bounty", 
            "poster_url": "TheBounty.jpg"
        }
    ], 
    "id": "Winnetou", 
    "name": "Winnetou"
}