{
    "plot": "In the beginning of the times, God created life into universe: light gave birth to angels, earth to men and fire to djin, creatures condemned to dwell in the void between the worlds. One who wakes a djin shall be given three wishes. Upon granting the third, an unholy legion of djins are freed through a doorway between the worlds upon the Earth. In 1127 A.D., in Persia, a sorcerer lures and traps a powerful Djinn in the stone of secret fire. In the present days, a drunken crane operator drops the valuable statue of Ahura Mazda over the assistant of Raymond Beaumont on the harbor, and one worker finds the huge and priceless opal red stone where Djin is seized. Alexandra Amberson, who works in an auction house, receives the stone for evaluation and accidentally awakes Djin. The evil creature is released later, charges the stone with people souls and feeds with their fears, while chasing Alexandra to force to make three wishes and unleash the demoniac fiends upon Earth.", 
    "genres": "Fantasy, Horror", 
    "release_year": "1997", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Sharp-Dressed"
                ], 
                "role": "Sharp-Dressed Man: The Djinn looks quite refined while wearing a suit in his human guise, to the point that the clerk selling the suit is clearly floored by him. He rewards her interest by turning her into a mannequin.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [], 
                "role": "The evil Djinn of Wishmaster looks quite refined while wearing a suit in his human guise, to the point that the clerk selling the suit is clearly floored by him. He rewards her interest by turning her into a mannequin.", 
                "id": "SharpDressedMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "original"
                ], 
                "role": "Cool Big Sis: Alexandra to Shannon, in the original film.", 
                "id": "CoolBigSis"
            }, 
            {
                "adjectives": [
                    "Final", 
                    "straight", 
                    "original", 
                    "later"
                ], 
                "role": "Final Girl: The series is prone to playing with this. While played completely straight in the original, the sequel's Final Girl was a goth burglar who actually kills a guy in the opening, during a heist gone wrong, though she later redeems herself, in order to beat the Djinn. The protagonist of Wishmaster 4: The Prophecy Fulfilled is also shown having sex at least twice, including with the Djinn.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "straight", 
                    "original", 
                    "later"
                ], 
                "role": "The Wishmaster series is prone to playing with this. While played completely straight in the original, the sequel's Final Girl was a goth burglar who actually kills a guy in the opening, during a heist gone wrong, though she later redeems herself, in order to beat the Djinn. The protagonist of Wishmaster 4: The Prophecy Fulfilled is also shown having sex at least twice, including with the Djinn.", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Morgana from Wishmaster 2: Evil Never Dies was presumably this, until her boyfriend died in the intro.", 
                "id": "PerkyGoth"
            }, 
            {
                "adjectives": [], 
                "role": "Perky Goth: Morgana from Wishmaster 2: was presumably this, until her boyfriend died in the intro.", 
                "id": "PerkyGoth"
            }
        ]
    }, 
    "imdbid": "tt0120524", 
    "poster_url": "Wishmaster.jpg", 
    "similar": [
        {
            "shared": [
                "CoolBigSis", 
                "SharpDressedMan", 
                "FinalGirl"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "CoolBigSis", 
                "PerkyGoth"
            ], 
            "shared_count": 2, 
            "id": "AliceInWonderland", 
            "name": "Alice in Wonderland"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "PerkyGoth"
            ], 
            "shared_count": 2, 
            "id": "TheWorldsEnd", 
            "name": "The World's End", 
            "poster_url": "TheWorldsEnd.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "PerkyGoth"
            ], 
            "shared_count": 2, 
            "id": "TheNightmareBeforeChristmas", 
            "name": "The Nightmare Before Christmas", 
            "poster_url": "TheNightmareBeforeChristmas.jpg"
        }, 
        {
            "shared": [
                "PerkyGoth", 
                "FinalGirl"
            ], 
            "shared_count": 2, 
            "id": "LaidToRest", 
            "name": "Laid to Rest", 
            "poster_url": "LaidToRest.jpg"
        }
    ], 
    "id": "Wishmaster", 
    "name": "Wishmaster"
}