{
    "plot": "It's Britain, 1953. Upon his return to work following a heart attack, irrepressible barrister Sir Wilfrid Robarts, known as a barrister for the hopeless, takes on a murder case, much to the exasperation of his medical team, led by his overly regulated private nurse, Miss Plimsoll, who tries her hardest to ensure that he not return to his hard living ways - including excessive cigar smoking and drinking - while he takes his medication and gets his much needed rest. That case is defending American war veteran Leonard Vole, a poor, out of work, struggling inventor who is accused of murdering his fifty-six year old lonely and wealthy widowed acquaintance, Emily French. The initial evidence is circumstantial but points to Leonard as the murderer. Despite being happily married to East German former beer hall performer Christine Vole, he fostered that friendship with Mrs. French in the hopes that she would finance one of his many inventions to the tune of a few hundred pounds. It thus does not help his case when it is learned that Mrs. French changed her will prior to her murder with Leonard being the primary beneficiary of a £80,000 estate. Leonard states that he knew nothing about the will. Christine is apparently the only alibi Leonard has to his whereabouts at the time of the murder. The usual methods Sir Wilfrid uses to test his clients' guilt or innocence leads to him believing that Leonard is indeed innocent. As the trial progresses, the prosecution calls a surprise witness, one that could place a nail in the coffin of Sir Wilfrid's planned line of defense. As Sir Wilfrid gets deeper and deeper into the case, something doesn't quite sit right with him, although he doesn't know what it is. The primary questions become how far Sir Wilfrid will go to obtain evidence to acquit Leonard, and if he will ever discover why he feels that there is something odd about the case.", 
    "genres": "Crime, Drama, Mystery", 
    "release_year": "1957", 
    "roles": {
        "f": [
            {
                "adjectives": [], 
                "role": "Blondes are Evil: Christine.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [], 
                "role": "The Vamp: Christine.", 
                "id": "TheVamp"
            }
        ]
    }, 
    "imdbid": "tt0051201", 
    "poster_url": "WitnessForTheProsecution.jpg", 
    "similar": [
        {
            "shared": [
                "TheVamp", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "CoolWorld", 
            "name": "Cool World", 
            "poster_url": "CoolWorld.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "SleepyHollow", 
            "name": "Sleepy Hollow", 
            "poster_url": "SleepyHollow.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "DoubleIndemnity", 
            "name": "Double Indemnity", 
            "poster_url": "DoubleIndemnity.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "ToDieFor", 
            "name": "To Die For", 
            "poster_url": "ToDieFor.jpg"
        }, 
        {
            "shared": [
                "TheVamp", 
                "BlondesAreEvil"
            ], 
            "shared_count": 2, 
            "id": "PoisonIvy", 
            "name": "Poison Ivy", 
            "poster_url": "PoisonIvy.jpg"
        }
    ], 
    "id": "WitnessForTheProsecution", 
    "name": "Witness for the Prosecution"
}