{
    "plot": "A dramatization, in modern theatrical style, of the life and thought of the Viennese-born, Cambridge-educated philosopher Ludwig Wittgenstein (1889-1951), whose principal interest was the nature and limits of language. A series of sketches depict the unfolding of his life from boyhood, through the era of the first World War, to his eventual Cambridge professorship and association with Bertrand Russell and John Maynard Keynes. The emphasis in these sketches is on the exposition of the ideas of Wittgenstein, a homosexual, and an intuitive, moody, proud, and perfectionistic thinker generally regarded as a genius.", 
    "genres": "Biography, Comedy, Drama", 
    "release_year": "1993", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "casual", 
                    "real", 
                    "open", 
                    "young", 
                    "faithful"
                ], 
                "role": "Camp Straight: Camp Bi, really: John Maynard Keynes, as camp as a row of tents, having a casual snog with a handsome male student, and yet deeply in love with his ballerina wife Lydia Lopokova. Once more, Truth in Television: Keynes in real life was quite open about his affairs with handsome young guys, and then in 1921 he fell in love with Lopokova and, after he married her, remained faithful to her until his death 20 years later.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "Many", 
                    "comfortable", 
                    "comfortable", 
                    "such"
                ], 
                "role": "Straight Gay: Many of the gay characters are this, Wittgenstein most of all. Justified in his case in that he wasn't entirely comfortable with his sexuality. Wittgenstein's biographer Ray Monk has asserted that Wittgenstein wasn't entirely comfortable with sexuality as such.", 
                "id": "StraightGay"
            }
        ]
    }, 
    "imdbid": "tt0108583", 
    "poster_url": "Wittgenstein.jpg", 
    "similar": [
        {
            "shared": [
                "CampStraight", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "CecilBDemented", 
            "name": "Cecil B. Demented", 
            "poster_url": "CecilBDemented.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "BlazingSaddles", 
            "name": "Blazing Saddles", 
            "poster_url": "BlazingSaddles.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "DiamondsAreForever", 
            "name": "Diamonds Are Forever", 
            "poster_url": "DiamondsAreForever.jpg"
        }, 
        {
            "shared": [
                "CampStraight", 
                "StraightGay"
            ], 
            "shared_count": 2, 
            "id": "ButImACheerleader", 
            "name": "But I'm a Cheerleader", 
            "poster_url": "ButImACheerleader.jpg"
        }, 
        {
            "shared": [
                "CampStraight"
            ], 
            "shared_count": 1, 
            "id": "Kingpin", 
            "name": "Kingpin", 
            "poster_url": "Kingpin.jpg"
        }
    ], 
    "id": "Wittgenstein", 
    "name": "Wittgenstein"
}