{
    "plot": "In a post apocalyptic future that appears as a blend of World War II Europe and J.R.R. Tolkien's Middle-earth, a pint-size wizard named Avatar must save the world from a band of fascist mutants controlled by his evil twin brother, Blackwolf, who likes to confuse enemy armies by projecting films of Adolf Hitler speeches during attacks. Painted live-action footage of advancing Nazi armies contrasts with Saturday-morning-cartoon-style animation of fairies and elves as Avatar travels through various magical and radioactive realms on his quest. Aiding him are the beautiful Fairy princess Elinore, hot-blooded warrior elf Weehawk, and Peace, a misunderstood robot rebelling against his Blackwolf-controlled programming. A bizarre and psychedelic meditation on magic vs. technology, this ultimate futuristic fantastic epic cult film still finds an audience on college campuses and will prove quite rewarding to viewers in the right frame of mind.", 
    "genres": "Animation, Adventure, Fantasy", 
    "release_year": "1977", 
    "roles": {
        "m": [
            {
                "adjectives": [], 
                "role": "Badass Grandpa: Avatar, the protagonist, who is also something of a Deadpan Snarker.", 
                "id": "BadassGrandpa"
            }
        ]
    }, 
    "imdbid": "tt0076929", 
    "poster_url": "Wizards.jpg", 
    "similar": [
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "AViewToAKill", 
            "name": "A View to a Kill", 
            "poster_url": "AViewToAKill.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "Go", 
            "name": "Go"
        }, 
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "Kagemusha", 
            "name": "Kagemusha", 
            "poster_url": "Kagemusha.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }, 
        {
            "shared": [
                "BadassGrandpa"
            ], 
            "shared_count": 1, 
            "id": "TheMaskOfZorro", 
            "name": "The Mask of Zorro", 
            "poster_url": "TheMaskOfZorro.jpg"
        }
    ], 
    "id": "Wizards", 
    "name": "Wizards"
}