{
    "plot": "Woody Woodpecker spends his day singing loudly and pecking holes in trees. He infuriates the other woodland creatures - when he isn't baffling them with his bizarre behavior. Woody overhears a squirrel and a group of birds gossiping about him. Even though he just sang a song proclaiming his craziness, he denies their whispered accusations that he's nuts. But after they trick him into knocking his head on a statue, the poor bird hears voices in his head and decides the animals might be right. He decides to see a doctor. But leave it to Woody to choose Dr. Horace N. Buggy, a Scottish-brogue-burring fox, who is, if it's impossible, even madder than he is.", 
    "genres": "Animation, Family, Short", 
    "release_year": "1941", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "plenty", 
                    "human", 
                    "beautiful", 
                    "French", 
                    "second", 
                    "gigantic", 
                    "Hot", 
                    "O'Clock", 
                    "few", 
                    "such", 
                    "other", 
                    "female", 
                    "giant", 
                    "love", 
                    "second", 
                    "gigantic"
                ], 
                "role": "Chick Magnet: He's had plenty of women, particularly human women fall for him instantly. In \"Belle Boys\" the beautiful French actress Ga Ga Gazoo tries to kiss him on the lips the second she meets him. A Mexican woman gives him two gigantic smooches in \"Hot Noon (Or 12 O'Clock For Sure).\" Princess Salami of \"Socco in Morroco\" kisses him only moments after they've met and the cartoon ends with the two making out. With few exceptions such as his girlfriend Winnie Woopdecker this seems to work against his favor with other female animals though, with them becoming Abhorrent Admirers. Gorgeous Gal of \"A Fine Feathered Frenzy\" had a lovely voice but was an overweight and elderly dowager crow. When Gorgeous met Woody Woodpecker she batted her eyelashes, gave him a giant wink and clicked her heels in excitement. She wanted to make love to him right away even though he was not interested. She even offered to bathe with him! Eventually she got him to marry her with their honeymoon starting a second later. Woody also caught the fancy of a gigantic female pink octopus in \"Alley To Bali\" who kissed him on the cheek twice.", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "general"
                ], 
                "role": "Drill Sergeant Nasty: The general from \"Ace in the Hole\".", 
                "id": "DrillSergeantNasty"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "close"
                ], 
                "role": "A belly-dancer is shown close to the end of the Woody Woodpecker cartoon called \"Roamin' Roman\" which reveals to be the lion in drag.", 
                "id": "BellyDancer"
            }, 
            {
                "adjectives": [], 
                "role": "Butter Face: Socko in Morocco. Subverted, however.", 
                "id": "ButterFace"
            }
        ]
    }, 
    "imdbid": "tt0153922", 
    "similar": [
        {
            "shared": [
                "ChickMagnet", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 2, 
            "id": "CaptainAmericaTheFirstAvenger", 
            "name": "Captain America: The First Avenger", 
            "poster_url": "CaptainAmericaTheFirstAvenger.jpg"
        }, 
        {
            "shared": [
                "ButterFace", 
                "DrillSergeantNasty"
            ], 
            "shared_count": 2, 
            "id": "Cars", 
            "name": "Cars", 
            "poster_url": "Cars.jpg"
        }, 
        {
            "shared": [
                "ChickMagnet", 
                "ButterFace"
            ], 
            "shared_count": 2, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "DrillSergeantNasty"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "DrillSergeantNasty"
            ], 
            "shared_count": 1, 
            "id": "TheBarberOfSiberia", 
            "name": "The Barber of Siberia", 
            "poster_url": "TheBarberOfSiberia.jpg"
        }
    ], 
    "id": "WoodyWoodpecker", 
    "name": "Woody Woodpecker"
}