{
    "plot": "Wreck-It Ralph longs to be as beloved as his game's perfect Good Guy, Fix-It Felix. Problem is, nobody loves a Bad Guy. But they do love heroes... so when a modern, first-person shooter game arrives featuring tough-as-nails Sergeant Calhoun, Ralph sees it as his ticket to heroism and happiness. He sneaks into the game with a simple plan -- win a medal -- but soon wrecks everything, and accidentally unleashes a deadly enemy that threatens every game in the arcade. Ralph's only hope? Vanellope von Schweetz, a young troublemaking \"glitch\" from a candy-coated cart racing game who might just be the one to teach Ralph what it means to be a Good Guy. But will he realize he is good enough to become a hero before it's \"Game Over\" for the entire arcade?", 
    "genres": "Animation, Adventure, Comedy", 
    "release_year": "2012", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Wreck-It", 
                    "flamboyant", 
                    "such", 
                    "long", 
                    "top", 
                    "aggressive"
                ], 
                "role": "King Candy in Wreck-It Ralph may talk with a lisp, dress in frilly clothing, and use flamboyant word choices and gestures (such as calling people \"silly\" with a downwards wrist stroke), but he has The Chessmaster levels of cunning and is, by a long shot, the best driver in Sugar Rush until Vanellope joins the races. To a lesser extent, Rancis Fluggerbutter, also from Sugar Rush, hangs out with the Alpha Bitch and behaves like one, but he is one of the top four racers in the game and also one of its most aggressive.", 
                "id": "AgentPeacock"
            }, 
            {
                "adjectives": [
                    "normal-sized", 
                    "own", 
                    "tall"
                ], 
                "role": "Amazon Chaser: Felix, who falls for Calhoun. While Calhoun is a normal-sized woman in her own game (though a bit on the tall side), compared with Felix she might as well be Fasolt or Fafnir.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "rough", 
                    "tough", 
                    "first"
                ], 
                "role": "Wreck-It Ralph: Felix falls for Space Marine Sergeant Calhoun. She's rough, tough, and knows her way around a gun, in contrast to his niceness and innocence; their first meeting involves her knocking him to the ground and almost shooting him as he's admiring her. Later on, when they are both stuck in a dire situation in which she is forced to batter him repeatedly in order to escape, he smiles through each blow and compliments her strength as she's hitting him.", 
                "id": "AmazonChaser"
            }, 
            {
                "adjectives": [
                    "Wreck-It"
                ], 
                "role": "The title character from Wreck-It Ralph.", 
                "id": "BigBeautifulMan"
            }, 
            {
                "adjectives": [
                    "Fix-It", 
                    "Wreck-It", 
                    "effeminate"
                ], 
                "role": "Fix-It Felix, Jr. from Wreck-It Ralph may have just a smidgen of this. The way he approaches his relationship with Calhoun is extremely effeminate.", 
                "id": "CampStraight"
            }, 
            {
                "adjectives": [
                    "Fix-It", 
                    "Wreck-It"
                ], 
                "role": "Fix-It Felix Jr. is essentially Type 2 in Wreck-It Ralph. He meets and becomes smitten with Calhoun while on his quest to find Ralph, but he does not force his attention on her.", 
                "id": "DoggedNiceGuy"
            }, 
            {
                "adjectives": [], 
                "role": "Drill Sergeant Nasty: Calhoun is voiced by Jane Lynch.", 
                "id": "DrillSergeantNasty"
            }, 
            {
                "adjectives": [
                    "Due", 
                    "Russian", 
                    "stereotypical"
                ], 
                "role": "Due to the issues of portraying a Husky Russkie in a Russian dub, Zangief instead speaks like a stereotypical Georgean: brash and macho.", 
                "id": "HuskyRusskie"
            }, 
            {
                "adjectives": [
                    "Fix-It", 
                    "Wreck-It"
                ], 
                "role": "Fix-It Felix Jr. from Wreck-It Ralph.\n In a twist of irony, this actually comes back to bite him  when he is imprisoned in King Candy's castle, any attempts to break the bars on his cell only end up fixing them so that they're stronger than before.", 
                "id": "MrFixit"
            }, 
            {
                "adjectives": [
                    "Fix-It"
                ], 
                "role": "Mr Fix It: He's not called \"Fix-It Felix Jr.\" for nothing.", 
                "id": "MrFixit"
            }, 
            {
                "adjectives": [], 
                "role": "Papa Wolf: Ralph will do anything to protect Vanellope. He even nearly gives up his life to save her.", 
                "id": "PapaWolf"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "brick-shaped◊", 
                    "triangular", 
                    "upper", 
                    "short", 
                    "stumpy", 
                    "able", 
                    "physical", 
                    "8-bit", 
                    "physical", 
                    "due", 
                    "intelligent"
                ], 
                "role": "Wreck-It Ralph is a bit more brick-shaped◊ than conventionally triangular, but he definitely has far, far more upper body and arm mass than his short, stumpy legs should be able to support. His hands have more physical mass than his legs. Justified by both his nature as a video game character designed in the 80's 8-bit era, and being a physical Expy of Donkey Kong in particular. He does not revert to the expected Primal Stance his physique would imply, due to being more intelligent than he appears.", 
                "id": "TopHeavyGuy"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Calhoun.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Alpha Bitch: While everyone bullies Vanellope, as mentioned above, Taffyta is the one who leads them in it; no bullying is shown without her orchestrating it.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "giant", 
                    "animal"
                ], 
                "role": "Vanellope von Schweetz from Wreck-It Ralph casually confronts a giant Punch Clock Villain most people are scared of, repeatedly outsmarts The Caligula and his guards who (fail to) hunt her down like an animal, and eventually becomes a Badass Driver with the help of the previously mentioned Punch Clock Villain. She is eventually revealed to be a princess, and she turns down the title to become a president instead. Vanellope is all badass.", 
                "id": "BadassPrincess"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "cute", 
                    "finish"
                ], 
                "role": "In Wreck-It Ralph, Vanellope Von Schweetz is rather cute, even with her waif clothing and unkempt hair. When she  transforms into a princess once she crosses the finish line of her game Sugar Rush, she becomes radiant. But she prefers how she looked before.", 
                "id": "BeautifulAllAlong"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "later", 
                    "Turbo/King", 
                    "enough", 
                    "real", 
                    "evil"
                ], 
                "role": "The bullying Taffyta Muttonfudge in Wreck-It Ralph. It's later revealed that her and everyone else's memories had been erased by Turbo/King Candy. We don't see enough of her real personality to know if she's evil at heart or was a Blank Slate gone wrong.", 
                "id": "BlondesAreEvil"
            }, 
            {
                "adjectives": [
                    "cold"
                ], 
                "role": "Broken Bird: Sergeant Calhoun. Her initially cold personality is the result of losing her fiancé on their wedding day.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "much", 
                    "due"
                ], 
                "role": "Wreck-It Ralph:\n Vanellope von Schweetz first comes off as a Bratty Half-Pint, but she reveals she is much more in a Crapsaccharine World where she is dismissed as a \"mistake.\"\n Sergeant Calhoun. Being programmed to believe your fiancé died on your wedding day due to your mistake is definitely going to make you rough around the edges.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "female"
                ], 
                "role": "Contralto of Danger: The tough-as-nails Space Marine Sergeant Calhoun has the lowest female voice (she is voiced by Jane Lynch) and is by far the most overtly badass character in the movie.", 
                "id": "ContraltoOfDanger"
            }, 
            {
                "adjectives": [], 
                "role": "Everything's Better with Princesses: Vanellope originally invoked this trope since she was written as a princess but when she's turned back she wants to be President instead.", 
                "id": "EverythingsBetterWithPrincesses"
            }, 
            {
                "adjectives": [
                    "young"
                ], 
                "role": "Gamer Chick: Moppet Girl, that young blonde girl in the arcade.", 
                "id": "GamerChick"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "young"
                ], 
                "role": "Wreck-It Ralph has the \"Moppet Girl\", a young girl often seen in Litwak's Arcade who serves as the Audience Surrogate reacting to the events of the film from the point of view of a random player.", 
                "id": "GamerChick"
            }, 
            {
                "adjectives": [
                    "interesting", 
                    "plot-critical", 
                    "true"
                ], 
                "role": "Lady Not-Appearing-in-This-Game: An interesting and actually plot-critical example: Vanellope is featured prominently in the Sugar Rush cabinet art despite that she's supposedly a glitch and not supposed to even be in the game. This is what clues Ralph in that King Candy's hiding something and ultimately leads to the latter's plan derailing. In the end it actually proves to be a hint to an even bigger reveal: that Vanellope is actually the true ruler of Sugar Rush.", 
                "id": "LadyNotAppearingInThisGame"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "interesting", 
                    "in-universe", 
                    "rogue", 
                    "different", 
                    "in-game"
                ], 
                "role": "Wreck-It Ralph provides an interesting in-universe example. Vanellope Von Schweetz appears on the side of the Sugar Rush console, but  (at least before the events of the movie) she doesn't appear in the game at all  because her code was removed from the game's core by a rogue Attention Whore from a completely different game, when in actuality Vanellope was the intended ruler of the in-game world.", 
                "id": "LadyNotAppearingInThisGame"
            }, 
            {
                "adjectives": [
                    "bluish", 
                    "Bing-Bing"
                ], 
                "role": "Ladyella: A minor character from Sugar Rush is called \"Citrusella Flugpucker\" (it's a bluish recolor of Jubileena Bing-Bing).", 
                "id": "Ladyella"
            }, 
            {
                "adjectives": [
                    "out-of-universe", 
                    "protective", 
                    "entire", 
                    "protect/console"
                ], 
                "role": "Mama Bear: Interesting out-of-universe example. According to Jim Reardon (Head of Story), all the women on the film's story crew were very protective of the character of Vanellope throughout the entire developing process. An army of females in the film's fandom have passionately expressed their wish to protect/console Vanellope in some way.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "Wreck-It"
                ], 
                "role": "Wreck-It Ralph: The girl at the arcade.", 
                "id": "Meganekko"
            }, 
            {
                "adjectives": [], 
                "role": "Plucky Girl: Vanellope von Schweetz. She's probably Plucky Girl personified!!", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "optimistic"
                ], 
                "role": "Vanellope von Schweetz from Wreck-It Ralph has enough spirit to power a jet fighter, reacts to her circumstances as The Pollyanna and is the Determinator in her dream of becoming a racer. She's probably this trope PERSONIFIED, because after all the bullying and abuse she's been through, she's still optimistic and happy. Wow.", 
                "id": "PluckyGirl"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "hero-worshiped", 
                    "other", 
                    "likable", 
                    "only", 
                    "nice", 
                    "Punch", 
                    "other", 
                    "main", 
                    "final", 
                    "only", 
                    "good"
                ], 
                "role": "Wreck-It Ralph has a variation dealing with attention rather than money. Fix-It Felix Jr., the hero of Ralph's game, is basically hero-worshiped by the NPCs of the game. However, despite both this attention and the other characters' behavior towards Ralph, he's a genuinely Nice Guy who is sweet and likable and the only person who even attempts to be nice to Ralph. He also shows that he isn't just a Punch Clock Hero when he doesn't seem to even consider leaving Sugar Rush and the other three main characters during the final fight, even though he clearly has the opportunity and even though his only weapon would do him zero good in a fight.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "tall", 
                    "Bad-Anon", 
                    "much", 
                    "technical", 
                    "much", 
                    "own", 
                    "various"
                ], 
                "role": "Statuesque Stunner: Calhoun is actually even taller than Ralph, who's supposed to be nine feet tall. See this pic◊ for reference. Of course, Ralph clearly isn't that tall, otherwise he'd dwarf most everyone at the Bad-Anon meeting (though wider, he certainly isn't much taller than they are), making the height discrepancy a technical limitation of his game (hence why Felix is not much taller than Vanellope). Calhoun's own height naturally comes from the various characters she draws from, all statuesque themselves.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "Wreck-It"
                ], 
                "role": "Vanellope Von Schweetz from Wreck-It Ralph.", 
                "id": "StrangeGirl"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "cold"
                ], 
                "role": "Sergeant Calhoun in Wreck-It Ralph commands a squad that is battling alien invaders called \"Cy-Bugs\". Her initially cold personality is the result of losing her fiancé on their wedding day.", 
                "id": "TheSquadette"
            }, 
            {
                "adjectives": [], 
                "role": "The Squadette: Calhoun.", 
                "id": "TheSquadette"
            }, 
            {
                "adjectives": [
                    "other", 
                    "female", 
                    "clear-cut", 
                    "aggressive", 
                    "same", 
                    "other", 
                    "unkempt", 
                    "homeless", 
                    "own", 
                    "traditional"
                ], 
                "role": "Tomboy and Girly Girl: Vanellope Von Schweetz (Tomboy) and the other female racers (Girly Girl). It's not entirely clear-cut, though. The others are all aggressive race car drivers and not any more or less girly than Vanellope. Vanellope, who wears cutesy clothing like the others and wants to do the same things the other girls are doing, stands out because she is unkempt and homeless by no fault of her own, not because she is unfeminine. Vanellope could superficially be considered the Girly Girl to Calhoun's Tomboy. But this is also subverted at the end,  since Vanellope would rather be an elected leader than a princess, while Calhoun is a bride with a pretty traditional dress in the finale.", 
                "id": "TomBoyAndGirlyGirl"
            }, 
            {
                "adjectives": [
                    "Wreck-It", 
                    "spunky", 
                    "tomboyish", 
                    "little"
                ], 
                "role": "Vanellope von Schweetz from Wreck-It Ralph, a spunky and tomboyish little kart racer, is revealed to be a princess at the end of the movie, although she gives up that title to become a President instead.", 
                "id": "TomboyPrincess"
            }
        ]
    }, 
    "imdbid": "tt1772341", 
    "poster_url": "WreckItRalph.jpg", 
    "similar": [
        {
            "shared": [
                "AmazonChaser", 
                "CampStraight", 
                "PapaWolf", 
                "EverythingsBetterWithPrincesses", 
                "DrillSergeantNasty", 
                "PluckyGirl", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 8, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "BigBeautifulMan", 
                "TheSquadette", 
                "MrFixit", 
                "SpoiledSweet", 
                "EverythingsBetterWithPrincesses", 
                "Meganekko", 
                "PluckyGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 8, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "AmazonChaser", 
                "PluckyGirl", 
                "EverythingsBetterWithPrincesses", 
                "TomboyPrincess", 
                "BrokenBird", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 7, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "MamaBear", 
                "PapaWolf", 
                "EverythingsBetterWithPrincesses", 
                "TomboyPrincess", 
                "PluckyGirl", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 7, 
            "id": "TheLittleMermaid", 
            "name": "The Little Mermaid", 
            "poster_url": "TheLittleMermaid.jpg"
        }, 
        {
            "shared": [
                "MamaBear", 
                "BlondesAreEvil", 
                "EverythingsBetterWithPrincesses", 
                "TomboyPrincess", 
                "ActionGirl", 
                "BadassPrincess"
            ], 
            "shared_count": 6, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "WreckItRalph", 
    "name": "Wreck-It Ralph"
}