{
    "plot": "Chris Flynn is driving his car for a job interview in another city. However, an accident with a trunk transporting chemical products blocks the highway and Chris looks for an alternative route through the mountains of West Virginia to accomplish his schedule. Due to a lack of attention, he crashes another car parked in the middle of the road with flat tires. Chris meets a group of five friends, who intended to camp in the forest, and they decide to leave the couple Francine and Evan on the place, while Chris, Jessie, Carly and her fiancé Scott tries to find some help. They find a weird cabin in the middle of nowhere, where three violent cannibalistic mountain men with the appearance of monsters live. The two couples try to escape from the mountain men while chased by them.", 
    "genres": "Horror", 
    "release_year": "2003", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "Final", 
                    "first", 
                    "second", 
                    "actual", 
                    "good", 
                    "few", 
                    "final", 
                    "last", 
                    "final", 
                    "last"
                ], 
                "role": "Final Girl: Jessie in the first film, Nina in the second, and Alex in the third. Nina from 2 might be pushing it. She does save Jake at the end and technically kills the villains but most of the actual heavy lifting by the good guys is done by Dale who had performed a Heroic Sacrifice a few minutes earlier that saved their lives. That hardly makes her less of a final girl; she was the last female character standing. That's what a final girl is. Alex from 3 did absolutely nothing and she still counts. In Part 4, this is averted. Kenia and Sara last to the end, but are killed. Lita from Part 5. She had a pulse when the movie ended at least...", 
                "id": "FinalGirl"
            }, 
            {
                "adjectives": [
                    "Lesbian"
                ], 
                "role": "Lesbian Jock: Amber in Dead End. Sara from Bloody Beginnings.", 
                "id": "LesbianJock"
            }
        ]
    }, 
    "imdbid": "tt0295700", 
    "poster_url": "WrongTurn.jpg", 
    "similar": [
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "DevilsPrey", 
            "name": "Devil's Prey", 
            "poster_url": "DevilsPrey.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "Suspiria", 
            "name": "Suspiria", 
            "poster_url": "Suspiria.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "YoureNext", 
            "name": "You're Next", 
            "poster_url": "YoureNext.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "NineDead", 
            "name": "Nine Dead", 
            "poster_url": "NineDead.jpg"
        }, 
        {
            "shared": [
                "FinalGirl"
            ], 
            "shared_count": 1, 
            "id": "FridayThe13thPartVANewBeginning", 
            "name": "Friday the 13th Part V: A New Beginning"
        }
    ], 
    "id": "WrongTurn", 
    "name": "Wrong Turn"
}