{
    "plot": "In a world where both Mutants and Humans fear each other, Marie, better known as Rogue, runs away from home and hitches a ride with another mutant, known as Logan, a.k.a. Wolverine. Charles Xavier, who owns a school for young mutants, sends Storm and Cyclops to bring them back before it is too late. Magneto, who believes a war is approaching, has an evil plan in mind, and needs young Rogue to help him.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2000", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "X-Men", 
                    "hilarious", 
                    "second"
                ], 
                "role": "X-Men:First Class, wherein just one hilarious macro image◊ launched a wave of fanfics wherein Erik impregnates Charles. The science is usually handwaved using the idea of Charles simply having a second mutation.", 
                "id": "MisterSeahorse"
            }, 
            {
                "adjectives": [], 
                "role": "Sharp Dressed Man: Almost everyone in First Class, with Azazel and Riptide standing out the most.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "White-Haired", 
                    "seventy-something", 
                    "de-aged", 
                    "re-aged", 
                    "realistic"
                ], 
                "role": "Inverted with Magneto. While not ugly by any means, he's considerably older than the character in the comics and much less physically imposing. While Magneto was a buff, chiseled White-Haired Pretty Boy in the comics, in the movie his white hair is the result of him being seventy-something years old. Justified, since the movies don't have the comics' sliding timescale or the multiple instances of him being de-aged and re-aged and had to make him the realistic age of a Holocaust survivor. This gets rectified when you see him in First Class.", 
                "id": "WhiteHairedPrettyBoy"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Jean", 
                    "X-Men", 
                    "special", 
                    "major", 
                    "major", 
                    "power-spiking", 
                    "love", 
                    "unremarkable", 
                    "Phoenix-y", 
                    "amazed", 
                    "full", 
                    "impressive", 
                    "comic", 
                    "full", 
                    "male", 
                    "final", 
                    "little", 
                    "actual", 
                    "fair", 
                    "third"
                ], 
                "role": "Jean Grey in the X-Men film series suffers from a special case of this. The Phoenix storyline is major Never Live It Down material for her, so she got some major movements of power-spiking leading up to her Phoenix debut... but the rest of the time, she suffers as mentioned down in Western Animation. So she spends movie one as love interest and gets beaten by the Toad. The. Freaking. Toad (at least he was played by Ray Parks...). Movie two, she uses her powers in ways that would be perfectly unremarkable in the comics when nothing remotely Phoenix-y is going on, and everyone's amazed and a bit scared. note Okay, maybe holding back the full fury of Scott's Eye Beams with her TK was impressive even by her comic self's standards... Movie three, she ascends into full Phoenix mode... and does nothing but be the MacGuffin of the story, sought after by the male leads (Wolverine to save her, and Magneto to make her The Dragon — a role in which she just stands around.) Even the final rampage adds little to the actual plot and only exists so Wolverine can angst about having to Shoot the Dog. (To be fair, the third movie had another problem to contend with.)", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [
                    "natural"
                ], 
                "role": "Blue Skinned Babe: Mystique is this in her natural form.", 
                "id": "GreenSkinnedSpaceBabe"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "Last", 
                    "X-Men"
                ], 
                "role": "Mystique in X-Men 3: The Last Stand.\n Or was that part of Magneto's plot?\n Likewise, after rescue by the X-Men, Jean Grey tries to sex Wolverine up. He refuses. Cue Superpowered Evil Side taking over.", 
                "id": "WomanScorned"
            }
        ]
    }, 
    "imdbid": "tt0120903", 
    "poster_url": "X-Men.jpg", 
    "similar": [
        {
            "shared": [
                "WomanScorned", 
                "GreenSkinnedSpaceBabe", 
                "MisterSeahorse"
            ], 
            "shared_count": 3, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "GreenSkinnedSpaceBabe", 
                "MisterSeahorse"
            ], 
            "shared_count": 3, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "Chickification"
            ], 
            "shared_count": 2, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "WomanScorned", 
                "MisterSeahorse"
            ], 
            "shared_count": 2, 
            "id": "TheRockyHorrorPictureShow", 
            "name": "The Rocky Horror Picture Show", 
            "poster_url": "TheRockyHorrorPictureShow.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "Chickification"
            ], 
            "shared_count": 2, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }
    ], 
    "id": "X-Men", 
    "name": "X-Men"
}