{
    "plot": "Sentinels, robots that were created for the purpose of hunting down mutants were released in 1973. 50 years later the Sentinels would also hunt humans who aid mutants. Charles Xavier and his X-Men try their best to deal with the Sentinels but they are able to adapt and deal with all mutant abilities. Charles decides to go back in time and change things. He asks Kitty Pryde who can send a person's consciousness into the person's past to send him but she can only send someone back a few weeks because if she sends someone back further it could harm them. So Logan decides to go back himself because he might be able to withstand it. So Charles tells him that it's Mystique who's responsible because when she learned about the Sentinels she sought out Bolivar Trask the man who created them and killed him. She would be caught and studied and her ability to change was somehow added to the Sentinels which is why they can adapt. Logan must go to the younger Charles and ask him to help; problem is that he was despondent at that time and without his powers because he took a drug which allows him to walk but takes away his powers. Logan is also told to find Magneto.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2014", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "late", 
                    "eighties/early", 
                    "X-Men", 
                    "X-Jet"
                ], 
                "role": "Badass Grandpa: As a Holocaust survivor living in 2023, Magneto is, at the very least, in his late eighties/early nineties (X-Men: First Class portrayed him as being around ten in 1944).  He still lifts the X-Jet and hurls it at a horde of incoming Sentinels like it's a child's toy, takes a piece of shrapnel to the gut and slightly-less-than-casually pulls it out, and still uses the remaining wreckage to further barricade the path to Kitty and Wolverine.", 
                "id": "BadassGrandpa"
            }, 
            {
                "adjectives": [
                    "entire"
                ], 
                "role": "Beard of Sorrow: Young Charles has one when Wolverine first visits him in 1973. Played with, as he keeps it for the entire movie.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "entire"
                ], 
                "role": "In X-Men: Days of Future Past, Young Charles has one when Wolverine first visits him in 1973. Played with, as he keeps it for the entire movie.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "long", 
                    "All-Loving"
                ], 
                "role": "In X-Men: Days of Future Past, Young Professor X not only sports a long hair and a Beard of Sorrow, but he ultimately becomes an All-Loving Hero at the movie's climax.", 
                "id": "LooksLikeJesus"
            }, 
            {
                "adjectives": [
                    "long", 
                    "All-Loving"
                ], 
                "role": "Looks Like Jesus: Young Professor X not only sports a long hair and a Beard of Sorrow, but he ultimately becomes an All-Loving Hero at the movie's climax.", 
                "id": "LooksLikeJesus"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "70s!Magneto's prison attire in X-Men: Days of Future Past, which may well be a Mythology Gag to the film above.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [
                    "second"
                ], 
                "role": "Man in White: 70s!Magneto's prison attire, which may well be a Mythology Gag to the second film.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [
                    "first", 
                    "past"
                ], 
                "role": "Mr. Fanservice: Logan appears entirely naked when first waking up in the past.", 
                "id": "MrFanservice"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "visible"
                ], 
                "role": "Averted in X-Men: Days of Future Past, by Hugh Jackman's request. However, only his back was visible.", 
                "id": "RightThroughHisPants"
            }, 
            {
                "adjectives": [
                    "visible"
                ], 
                "role": "Right Through His Pants: Averted by Hugh Jackman's request. However, only his back was visible.", 
                "id": "RightThroughHisPants"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "In X-Men: Days of Future Past, Charles in 1973 is more accurately an Overly Sensitive Guy with Wolverine in the Manly Man role.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "Sensitive"
                ], 
                "role": "Sensitive Guy and Manly Man: Charles in 1973 is more accurately an Overly Sensitive Guy with Wolverine in the Manly Man role.", 
                "id": "SensitiveGuyAndManlyMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "effective", 
                    "only", 
                    "past", 
                    "last", 
                    "few", 
                    "active"
                ], 
                "role": "Action Girl: Storm. Blink's powers make her extremely effective in fighting the Sentinels, both in taking them out herself and assisting the others in fighting them. On a more meta level, Mystique is the only mutant back in the past who's been doing anything for the last few years.  Magneto's been stuck in the Pentagon for a decade, and Xavier's been moping around the house since the start of the Vietnam War. Even once the plot takes off, she's arguably the most active character.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "several", 
                    "later", 
                    "dead"
                ], 
                "role": "Broken Bird: Time and events have really taken their toll on Young Charles Xavier. He lost Raven and Erik, Sean disappeared several years prior (and is later confirmed dead at the hands of Trask), then his teachers and students were drafted, leaving Charles alone except for Hank.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "several", 
                    "later", 
                    "dead"
                ], 
                "role": "Time and events have really taken their toll on Young Charles Xavier in X-Men: Days of Future Past. He lost Raven and Erik, Sean disappeared several years prior (and is later confirmed dead at the hands of Trask), then his teachers and students were drafted, leaving Charles alone except for Hank.", 
                "id": "BrokenBird"
            }, 
            {
                "adjectives": [
                    "main"
                ], 
                "role": "Dark Action Girl: Mystique. She's a main villain in 1973 and kicks tons of ass.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "main"
                ], 
                "role": "In X-Men: Days of Future Past, she's a main villain in 1973 and kicks tons of ass.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "good"
                ], 
                "role": "In X-Men: Days of Future Past, Mystique chokes out one of her victims. With one foot. Executing perfect martial arts form. And casually looking through his mail, just to show off how good she is at this.", 
                "id": "KickChick"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "former"
                ], 
                "role": "In X-Men: Days of Future Past, Mystique is a sister to Charles and a former lover to Erik. While the fate of the world rests on her actions, the conflict is boiled down to which of them she is going to choose.", 
                "id": "NeverASelfMadeWoman"
            }
        ]
    }, 
    "imdbid": "tt1877832", 
    "poster_url": "XMenDaysOfFuturePast.jpg", 
    "similar": [
        {
            "shared": [
                "BeardOfSorrow", 
                "NeverASelfMadeWoman", 
                "SensitiveGuyAndManlyMan", 
                "DarkActionGirl", 
                "ManInWhite"
            ], 
            "shared_count": 5, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "RightThroughHisPants", 
                "SensitiveGuyAndManlyMan", 
                "NeverASelfMadeWoman", 
                "KickChick"
            ], 
            "shared_count": 5, 
            "id": "Futurama", 
            "name": "Futurama"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "BadassGrandpa", 
                "SensitiveGuyAndManlyMan", 
                "MrFanservice", 
                "ActionGirl"
            ], 
            "shared_count": 5, 
            "id": "Thor", 
            "name": "Thor", 
            "poster_url": "Thor.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "ActionGirl", 
                "MrFanservice", 
                "DarkActionGirl"
            ], 
            "shared_count": 4, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "BrokenBird", 
                "SensitiveGuyAndManlyMan", 
                "ActionGirl", 
                "ManInWhite"
            ], 
            "shared_count": 4, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }
    ], 
    "id": "XMenDaysOfFuturePast", 
    "name": "X-Men: Days of Future Past"
}