{
    "plot": "Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. Before they were archenemies, they were closest of friends, working together, with other Mutants (some familiar, some new), to stop the greatest threat the world has ever known. In the process, a rift between them opened, which began the eternal war between Magneto's Brotherhood and Professor X's X-MEN.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "heterochromia—see", 
                    "crush"
                ], 
                "role": "Chick Magnet: Charles has the attention of Amy (the blond woman with heterochromia—see the Funny Background Event entry), Raven (who has a crush on him) and Moira (there is a deleted scene where she and Charles are making out after drinking too much champagne).", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "heterochromia—she", 
                    "crush"
                ], 
                "role": "In X-Men: First Class, Charles Xavier has the attention of Amy (the blond woman with heterochromia—she has a Funny Background Event showing her continued interest), his sister figure Raven Darkholme (who has a crush on him) and Moira MacTaggert (there is a deleted scene where she and Charles are making out after drinking too much champagne).", 
                "id": "ChickMagnet"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "comical", 
                    "appreciative"
                ], 
                "role": "In X-Men: First Class, Sean Cassidy is introduced flirting with a girl, who seems to find him comical more than anything else. He's also very appreciative of Angel.", 
                "id": "ChivalrousPervert"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "In X-Men: First Class, Havok seems to be this to Beast.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [], 
                "role": "Jerk Jock: Havok seems to be this to Beast.", 
                "id": "JerkJock"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "Swiss", 
                    "responsible", 
                    "high-ranking"
                ], 
                "role": "In X-Men: First Class, Erik interrogates a Swiss banker - whose bank is responsible for storing Nazi Gold - on the location of a high-ranking former Nazi.", 
                "id": "MorallyBankruptBanker"
            }, 
            {
                "adjectives": [
                    "Bankrupt", 
                    "Swiss", 
                    "responsible", 
                    "high-ranking"
                ], 
                "role": "Morally Bankrupt Banker: Erik interrogates a Swiss banker - whose bank is responsible for storing Nazi Gold - on the location of a high-ranking former Nazi.", 
                "id": "MorallyBankruptBanker"
            }, 
            {
                "adjectives": [
                    "Appearance-wise", 
                    "soft", 
                    "reddish", 
                    "shorter-than-average", 
                    "symbolic", 
                    "sensitive", 
                    "nice", 
                    "adorable", 
                    "first"
                ], 
                "role": "Pretty Boy: Appearance-wise, Charles is strongly defined by his boyishness: he has a soft, round face, baby blue eyes, reddish lips (the colour is so deep at times that it almost looks like he's wearing lipstick), and is of shorter-than-average height. It's symbolic of his sensitive, nice guy qualities. Erik even calls him \"adorable\" when Charles tries the Cerebro machine for the first time.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "Appearance-wise", 
                    "soft", 
                    "reddish", 
                    "shorter-than-average", 
                    "symbolic", 
                    "sensitive", 
                    "nice", 
                    "adorable", 
                    "first"
                ], 
                "role": "X-Men: First Class: Appearance-wise, Charles is strongly defined by his boyishness: he has a soft, round face, baby blue eyes, reddish lips (the colour is so deep at times that it almost looks like he's wearing lipstick), and is of shorter-than-average height. It's symbolic of his sensitive, nice guy qualities. Erik even calls him \"adorable\" when Charles tries the Cerebro machine for the first time.", 
                "id": "PrettyBoy"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "In X-Men: First Class, Charles and Erik display this, in their physique as well as their philosophies and methods.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "Sensitive"
                ], 
                "role": "Sensitive Guy and Manly Man: Charles and Erik display this, in their physique as well as their philosophies and methods.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed", 
                    "Sebastian", 
                    "black"
                ], 
                "role": "Sharp-Dressed Man: Sebastian Shaw. Azazel is always wearing a black suit. Riptide. Another Badass in a Nice Suit.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "Sebastian", 
                    "black"
                ], 
                "role": "X-Men: First Class:\n Sebastian Shaw.\n Azazel is always wearing a black suit.\n Riptide. Another Badass in a Nice Suit.", 
                "id": "SharpDressedMan"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "In X-Men: First Class, Charles' charisma comes in the form of bubbly exuberance.", 
                "id": "TheCharmer"
            }, 
            {
                "adjectives": [], 
                "role": "The Charmer: Charles' charisma comes in the form of bubbly exuberance.", 
                "id": "TheCharmer"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "pre-supervillainy", 
                    "Nazi-hunting", 
                    "human", 
                    "few"
                ], 
                "role": "In X-Men: First Class, pre-supervillainy Erik Lehnsherr is a Badass Nazi-hunting Byronic Hero with an intensely Dark and Troubled Past (involving the Holocaust, loss of his parents, and being a victim of human experimentation) and bucketloads of trauma and cynicism. He also wears a leather jacket on a few occasions.", 
                "id": "TroubledButCute"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "odd", 
                    "X-Men", 
                    "familiar", 
                    "original", 
                    "loose", 
                    "certain", 
                    "impressive", 
                    "likely", 
                    "future"
                ], 
                "role": "An odd variant happens with Mystique in X-Men: First Class. Fans familiar with the character in the original trilogy (which First Class establishes loose continuity with) will probably find it jarring that she goes from being The Dragon to Magneto and a Dark Action Girl to being an awkward if Adorkable girl. Given that the movie is a prequel and that there are certain scenes (for example, Mystique bench pressing an impressive amount of weight), it's likely it's being set up for future badassery.", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [
                    "fond", 
                    "other", 
                    "X-Men"
                ], 
                "role": "Raven wasn't too fond of seeing Charles hit on other women in a pub in X-Men: First Class.", 
                "id": "ClingyJealousGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Cute Monster Girl: Mystique as a little girl when Charles first meets her.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "Mystique as a little girl when Charles first meets her in X-Men: First Class.", 
                "id": "CuteMonsterGirl"
            }, 
            {
                "adjectives": [
                    "private", 
                    "comfortable", 
                    "aware", 
                    "vulnerable"
                ], 
                "role": "Dirty Harriet: In order to infiltrate a Hellfire Club private party, Moira McTaggert strips down to her undergarments and pretends to be one of the call-girls. Done fairly well as it's shown that she's not all that comfortable with it and is acutely aware of how vulnerable she is.", 
                "id": "DirtyHarriet"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "private", 
                    "comfortable", 
                    "aware", 
                    "vulnerable"
                ], 
                "role": "In X-Men: First Class, in order to infiltrate a Hellfire Club private party, Moira McTaggert strips down to her undergarments and pretends to be one of the call-girls. Done fairly well as it's shown that she's not all that comfortable with it and is acutely aware of how vulnerable she is.", 
                "id": "DirtyHarriet"
            }, 
            {
                "adjectives": [
                    "Disposable", 
                    "sole", 
                    "major", 
                    "X-Men", 
                    "Disposable"
                ], 
                "role": "Disposable Woman: Erik's mother is murdered in front of him for the sole purpose of motivating him, and his search for revenge is a major element in his Start of Darkness. Although in this case it’s actually a subversion, as the prologue to X-Men had already implied that both of Erik's parents died in Auschwitz, so his mother, but not his father was upgraded from \"Disposable Parent\".", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "sole", 
                    "major", 
                    "X-Men", 
                    "Disposable"
                ], 
                "role": "In X-Men: First Class, Erik's mother is murdered in front of him for the sole purpose of motivating him, and his search for revenge is a major element in his Start of Darkness.\n Although in this case is actually a subversion, as the prologue to X-Men had already implied that both of Erik's parents died in Auschwitz, so in First Class his mother, but not his father was upgraded from \"Disposable Parent\".", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [], 
                "role": "Also, Emma Frost.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "adequate"
                ], 
                "role": "Emma Frost from X-Men: First Class. The surname is adequate.", 
                "id": "EmotionlessGirl"
            }, 
            {
                "adjectives": [
                    "major", 
                    "other"
                ], 
                "role": "Fanservice Extra: In addition to every major female character showing some skin at one point or another, the other girls in the Lingerie Scene at the Hellfire Club.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "major", 
                    "other"
                ], 
                "role": "In X-Men: First Class, in addition to every major female character showing some skin at one point or another, the other girls in the Lingerie Scene at the Hellfire Club.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [], 
                "role": "Femme Fatale: Emma Frost, who is then replaced by Angel. Mystique also starts to blossom into one.", 
                "id": "FemmeFatale"
            }, 
            {
                "adjectives": [
                    "High", 
                    "Inverted", 
                    "female", 
                    "dark", 
                    "only"
                ], 
                "role": "High Heel-Face Turn: Inverted:  both female mutants working with Xavier have turned to the dark side by the time the movie is over, and, aside from Magneto, are the only ones to do so.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "female", 
                    "dark", 
                    "only"
                ], 
                "role": "Inverted in X-Men: First Class:  both female mutants working with Xavier have turned to the dark side by the time the movie is over, and, aside from Magneto, are the only ones to do so.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "friendly", 
                    "first", 
                    "ambiguous"
                ], 
                "role": "Subverted in X-Men: First Class. Angel's friendly with the rest of the group, but is the first to join Shaw (albeit for morally ambiguous reasons).", 
                "id": "HookerWithAHeartOfGold"
            }, 
            {
                "adjectives": [
                    "''X-Men", 
                    "rare", 
                    "male", 
                    "technobabble"
                ], 
                "role": "Charles Xavier, in ''X-Men: First Class, a very rare male version of the trope. He shamelessly uses his charm, looks and technobabble to pick up women at Oxford.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "Hot", 
                    "rare", 
                    "male", 
                    "technobabble"
                ], 
                "role": "Hot Scientist: Charles Xavier, a very rare male version of the trope. He shamelessly uses his charm, looks and technobabble to pick up women at Oxford.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "female", 
                    "X-Men", 
                    "open"
                ], 
                "role": "Ms. Fanservice: Every female character in the film qualifies. January Jones of Mad Men fame as Emma Frost. Jennifer Lawrence as Raven/Mystique. Very briefly an uncredited Rebecca Romijn as Raven/Mystique. Rose Byrne as an FBI agent going undercover in lingerie. Zoe Kravitz as Angel. Justified, as she used to work as a stripper prior to joining the X-Men and she needs her back open to use her wings.", 
                "id": "MsFanservice"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "Class—although"
                ], 
                "role": "Angel in X-Men: First Class—although she says that she's used to men staring at her without clothes on and not so used to them staring at her with clothes on.", 
                "id": "ReluctantFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "filthy"
                ], 
                "role": "Charles in X-Men: First Class, is filthy rich and he is a gentle, caring person.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "filthy"
                ], 
                "role": "Spoiled Sweet: Charles is filthy rich and he is a gentle, caring person.", 
                "id": "SpoiledSweet"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "Moira McTaggart in X-Men: First Class, with Xavier as the Team Dad and Magneto as...the Team Cool Uncle?", 
                "id": "TeamMom"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "Emma Frost in X-Men: First Class.", 
                "id": "TheBaroness"
            }, 
            {
                "adjectives": [], 
                "role": "The Chick: Mystique", 
                "id": "TheChick"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "Angel's already wearing black during her stripper days in X-Men: First Class.", 
                "id": "WomanInBlack"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "good"
                ], 
                "role": "Emma Frost in X-Men: First Class wears a variety of revealing white ensembles throughout the movie. She looks good.", 
                "id": "WomanInWhite"
            }, 
            {
                "adjectives": [
                    "good"
                ], 
                "role": "Woman in White: Emma Frost wears a variety of revealing white ensembles throughout the movie. She looks good.", 
                "id": "WomanInWhite"
            }
        ]
    }, 
    "imdbid": "tt1270798", 
    "poster_url": "XMenFirstClass.jpg", 
    "similar": [
        {
            "shared": [
                "DirtyHarriet", 
                "JerkJock", 
                "FemmeFatale", 
                "TheBaroness", 
                "DisposableWoman", 
                "EmotionlessGirl", 
                "HotScientist"
            ], 
            "shared_count": 7, 
            "id": "SinCity", 
            "name": "Sin City", 
            "poster_url": "SinCity.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "TroubledButCute", 
                "SensitiveGuyAndManlyMan", 
                "TheCharmer", 
                "EmotionlessGirl", 
                "Chickification"
            ], 
            "shared_count": 6, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "TheBaroness", 
                "SharpDressedMan", 
                "SensitiveGuyAndManlyMan", 
                "WomanInBlack", 
                "HotScientist"
            ], 
            "shared_count": 6, 
            "id": "XMen", 
            "name": "X-Men", 
            "poster_url": "XMen.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "ReluctantFanserviceGirl", 
                "ChivalrousPervert", 
                "TeamMom", 
                "WomanInWhite", 
                "TheChick"
            ], 
            "shared_count": 6, 
            "id": "FairyTail", 
            "name": "Fairy Tail"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "ClingyJealousGirl", 
                "JerkJock", 
                "FemmeFatale", 
                "ChivalrousPervert"
            ], 
            "shared_count": 5, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }
    ], 
    "id": "XMenFirstClass", 
    "name": "X-Men: First Class"
}