{
    "plot": "In a world where both Mutants and Humans fear each other, Marie, better known as Rogue, runs away from home and hitches a ride with another mutant, known as Logan, a.k.a. Wolverine. Charles Xavier, who owns a school for young mutants, sends Storm and Cyclops to bring them back before it is too late. Magneto, who believes a war is approaching, has an evil plan in mind, and needs young Rogue to help him.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2000", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "X-Men", 
                    "X-Men", 
                    "Last", 
                    "beard", 
                    "likely", 
                    "Last", 
                    "entire"
                ], 
                "role": "X-Men:\n In X-Men: The Last Stand, Cyclops displays a stubbly beard while in mourning.\n In The Wolverine Logan starts out with a shaggy one, likely resulting from the events of The Last Stand.\n In X-Men: Days of Future Past, Young Charles has one when Wolverine first visits him in 1973. Played with, as he keeps it for the entire movie.", 
                "id": "BeardOfSorrow"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "X-Men", 
                    "claw-like", 
                    "X-Men", 
                    "animal"
                ], 
                "role": "X-Men:\n Hank McCoy/Beast. Duh.\n Victor Creed in X-Men Origins: Wolverine has claw-like fingernails, fangs instead of canines, and by X-Men he's basically an animal.", 
                "id": "BeastMan"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "several", 
                    "considerable", 
                    "foreign", 
                    "occasional", 
                    "Last"
                ], 
                "role": "X-Men:\n Magneto speaks several languages, passionately discusses philosophy, shows considerable knowledge of politics and foreign cultures, and enjoys the occasional game of chess with Xavier.\n Beast. In X-Men: The Last Stand, he tries to quote Churchill while fighting, and quotes Shakespeare prior to taking off to San Francisco in a deleted scene.", 
                "id": "CulturedBadass"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "good-looking"
                ], 
                "role": "Colossus. He's the largest of the X-Men and quite good-looking.", 
                "id": "Hunk"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "X-Men", 
                    "X-Men"
                ], 
                "role": "X-Men:\n Magneto's prison attire in X2: X-Men United.\n 70s!Magneto's prison attire in X-Men: Days of Future Past, which may well be a Mythology Gag to the film above.", 
                "id": "ManInWhite"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "X-Men"
                ], 
                "role": "X-Men:\n In X-Men: First Class, Charles and Erik display this, in their physique as well as their philosophies and methods.\n In X-Men: Days of Future Past, Charles in 1973 is more accurately an Overly Sensitive Guy with Wolverine in the Manly Man role.", 
                "id": "SensitiveGuyAndManlyMan"
            }, 
            {
                "adjectives": [
                    "Sharp-Dressed"
                ], 
                "role": "Sharp-Dressed Man: Almost everyone in First Class, with Azazel and Riptide standing out the most.", 
                "id": "SharpDressedMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "X-Men", 
                    "main", 
                    "X-Men", 
                    "stoic", 
                    "dark", 
                    "agile", 
                    "sharp", 
                    "X-Men", 
                    "Last", 
                    "vicious", 
                    "martial"
                ], 
                "role": "X-Men:\n Mystique is one that's not ashamed to kick lots of ass.\n In X-Men: Days of Future Past, she's a main villain in 1973 and kicks tons of ass.\n Lady Deathstrike from X2: X-Men United. Raven Hair, Ivory Skin, stoic, dark clothes, agile and literally sharp...\n Callisto from X-Men: The Last Stand, is basically Magneto's replacement for Mystique.\n Viper from The Wolverine, is a vicious poisoner and martial artist to the point that even men don't mind fighting her.", 
                "id": "DarkActionGirl"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "X-Men", 
                    "evil", 
                    "X-Men", 
                    "female", 
                    "dark", 
                    "only"
                ], 
                "role": "X-Men:\n Kayla from X-Men Origins: Wolverine. One thing for sure is that she's not evil to begin with.\n Inverted in X-Men: First Class:  both female mutants working with Xavier have turned to the dark side by the time the movie is over, and, aside from Magneto, are the only ones to do so.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "''X-Men", 
                    "rare", 
                    "male", 
                    "technobabble"
                ], 
                "role": "X-Men:\n Charles Xavier, in ''X-Men: First Class, a very rare male version of the trope. He shamelessly uses his charm, looks and technobabble to pick up women at Oxford.\n Viper according to Logan in The Wolverine, who congratulates Yashida upon finding out she's his oncologist.", 
                "id": "HotScientist"
            }, 
            {
                "adjectives": [
                    "original", 
                    "X-Men", 
                    "mutant", 
                    "natural", 
                    "blue", 
                    "yellow"
                ], 
                "role": "In the original trilogy of X-Men films, mutant shapeshifter Mystique goes naked in her natural form (human, except with blue skin and yellow eyes).", 
                "id": "InnocentFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "Gender-switched", 
                    "romantic", 
                    "big"
                ], 
                "role": "Gender-switched in X-Men.  Wolverine gives his dog tags to Rogue as he's leaving to learn about his past, promising that he'll come back for them.  It's not intended to be romantic, since his feelings for her were more like a big brother.", 
                "id": "Ptitlejsycb8gxibrd"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "blue", 
                    "actual", 
                    "blue", 
                    "prosthetic"
                ], 
                "role": "Mystique from the X-Men films does not give a damn about the implications of being naked all the time. It helps that her privates are naturally covered by blue scales and she probably doesn't feel the cold. It also helps that she can shapeshift the appearance of clothes onto herself when impersonating others, so actual clothing would be an impediment.\n The actress playing Mystique wasn't wearing much more than blue paint and prosthetic appliques but she said she didn't feel at all naked - though she admitted she sure looked naked.", 
                "id": "ShamelessFanserviceGirl"
            }, 
            {
                "adjectives": [
                    "original", 
                    "X-Men", 
                    "young"
                ], 
                "role": "Mystique, in the original X-Men trilogy, where she's 5' 11\" (1.80 m). While young Mystique is not that much, Jennifer Lawrence's 5' 9\" (1.75 m) makes her only slightly shorter than Magneto.", 
                "id": "StatuesqueStunner"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "X-Men", 
                    "sadistic", 
                    "cold", 
                    "old", 
                    "Russian"
                ], 
                "role": "X-Men:\n Emma Frost in X-Men: First Class.\n Viper from The Wolverine is sadistic, cold and sexy. Even fitting the old Communist stereotype as the actress is Russian.", 
                "id": "TheBaroness"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "X-Men", 
                    "X-Men"
                ], 
                "role": "X-Men:\n Kayla Silverfox in X-Men Origins: Wolverine.\n Angel's already wearing black during her stripper days in X-Men: First Class.\n Yukio from The Wolverine. Mostly her combat outfits.", 
                "id": "WomanInBlack"
            }
        ]
    }, 
    "imdbid": "tt0120903", 
    "poster_url": "XMen.jpg", 
    "similar": [
        {
            "shared": [
                "BeardOfSorrow", 
                "CulturedBadass", 
                "BeastMan", 
                "ManInWhite", 
                "TheBaroness", 
                "DarkActionGirl", 
                "SensitiveGuyAndManlyMan", 
                "WomanInBlack"
            ], 
            "shared_count": 8, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "TheBaroness", 
                "SharpDressedMan", 
                "SensitiveGuyAndManlyMan", 
                "WomanInBlack", 
                "HotScientist"
            ], 
            "shared_count": 6, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "TheBaroness", 
                "HotScientist", 
                "DarkActionGirl", 
                "WomanInBlack"
            ], 
            "shared_count": 5, 
            "id": "TheWolverine", 
            "name": "The Wolverine", 
            "poster_url": "TheWolverine.jpg"
        }, 
        {
            "shared": [
                "SharpDressedMan", 
                "SensitiveGuyAndManlyMan", 
                "ManInWhite", 
                "Hunk"
            ], 
            "shared_count": 4, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "BeardOfSorrow", 
                "SensitiveGuyAndManlyMan", 
                "DarkActionGirl", 
                "ManInWhite"
            ], 
            "shared_count": 4, 
            "id": "XMenDaysOfFuturePast", 
            "name": "X-Men: Days of Future Past", 
            "poster_url": "XMenDaysOfFuturePast.jpg"
        }
    ], 
    "id": "XMen", 
    "name": "X-Men"
}