{
    "plot": "Two mutant brothers, Logan and Victor, born 200 years ago, suffer childhood trauma and have only each other to depend on. Basically, they're fighters and killers, living from war to war through U.S. history. In modern times, a U.S. colonel, Stryker, recruits them and other mutants as commandos. Logan quits and becomes a logger, falling in love with a local teacher. When Logan refuses to rejoin Stryker's crew, the colonel sends the murderous Victor. Logan now wants revenge.", 
    "genres": "Action, Adventure, Sci-Fi", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "X-Men", 
                    "first", 
                    "mutual"
                ], 
                "role": "In X-Men Origins: Wolverine, Logan and his brother do this for the first fifteen minutes of the movie. The opening sequence is a Badass Montage through The American Civil War, WW1, WW2 and The Vietnam War!\n They also come back together briefly at the end, albeit for a mutual gain.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "very", 
                    "sociopathy"
                ], 
                "role": "The film details the relationship between James Howlett (Wolverine) and Victor Creed (Sabretooth), who are half-brothers. They were Bash Brothers to the very end until Victor's sociopathy went off the deep end and caused James to lose his connection with Victor.", 
                "id": "BashBrothers"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "claw-like", 
                    "X-Men", 
                    "animal"
                ], 
                "role": "Victor Creed in X-Men Origins: Wolverine has claw-like fingernails, fangs instead of canines, and by X-Men he's basically an animal.", 
                "id": "BeastMan"
            }, 
            {
                "adjectives": [
                    "heavy"
                ], 
                "role": "Dumb Muscle: Fred Dukes, who Stryker employs to do the heavy stuff like stopping a tank from firing at them, is not the smartest of Stryker's team, even getting a tattoo of a woman he only met the night before.", 
                "id": "DumbMuscle"
            }, 
            {
                "adjectives": [
                    "dramatic", 
                    "lovable", 
                    "mostly-side-shot"
                ], 
                "role": "Shirtless Scene: The film took this to an extreme, which was much to the delight of Hugh Jackman fangirls. During a dramatic escape scene, not only does he erupt from a tank of water completely shirtless (and indeed naked) (muscles + dripping water...) but he then proceeds to escape, running and fighting his way out of the building. Viewers get a lovable full-body shot (in which censorship is barely provided by his leg from a mostly-side-shot) when he jumps off a waterfall.", 
                "id": "ShirtlessScene"
            }, 
            {
                "adjectives": [
                    "post-eating", 
                    "X-Men", 
                    "bulky", 
                    "elastic"
                ], 
                "role": "Blob, post-eating disorder in X-Men Origins: Wolverine. Add the bulky composition with an elastic skin...", 
                "id": "StoutStrength"
            }, 
            {
                "adjectives": [
                    "post-eating"
                ], 
                "role": "Stout Strength: Blob, post-eating disorder.", 
                "id": "StoutStrength"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "X-Men", 
                    "real"
                ], 
                "role": "In, X-Men Origins: Wolverine, Wolverine gets a love interest for the purposes of this trope - bonus points for her dying twice, once for fake and once for real!", 
                "id": "DisposableWoman"
            }, 
            {
                "adjectives": [
                    "X-Men", 
                    "evil"
                ], 
                "role": "Kayla from X-Men Origins: Wolverine. One thing for sure is that she's not evil to begin with.", 
                "id": "HighHeelFaceTurn"
            }, 
            {
                "adjectives": [
                    "first"
                ], 
                "role": "Ill Boy: Little Jimmy Logan, for the first two minutes of the movie until his mutation manifests.", 
                "id": "IllGirl"
            }, 
            {
                "adjectives": [
                    "X-Men"
                ], 
                "role": "Kayla Silverfox in X-Men Origins: Wolverine.", 
                "id": "WomanInBlack"
            }
        ]
    }, 
    "imdbid": "tt0458525", 
    "poster_url": "XMenOriginsWolverine.jpg", 
    "similar": [
        {
            "shared": [
                "HighHeelFaceTurn", 
                "WomanInBlack", 
                "BeastMan"
            ], 
            "shared_count": 3, 
            "id": "XMen", 
            "name": "X-Men", 
            "poster_url": "XMen.jpg"
        }, 
        {
            "shared": [
                "StoutStrength", 
                "ShirtlessScene", 
                "DumbMuscle"
            ], 
            "shared_count": 3, 
            "id": "StreetFighter", 
            "name": "Street Fighter", 
            "poster_url": "StreetFighter.jpg"
        }, 
        {
            "shared": [
                "HighHeelFaceTurn", 
                "WomanInBlack", 
                "DisposableWoman"
            ], 
            "shared_count": 3, 
            "id": "XMenFirstClass", 
            "name": "X-Men: First Class", 
            "poster_url": "XMenFirstClass.jpg"
        }, 
        {
            "shared": [
                "WomanInBlack", 
                "BeastMan", 
                "BashBrothers"
            ], 
            "shared_count": 3, 
            "id": "FullmetalAlchemist", 
            "name": "Fullmetal Alchemist"
        }, 
        {
            "shared": [
                "StoutStrength", 
                "BashBrothers", 
                "DumbMuscle"
            ], 
            "shared_count": 3, 
            "id": "HowToTrainYourDragon", 
            "name": "How to Train Your Dragon", 
            "poster_url": "HowToTrainYourDragon.jpg"
        }
    ], 
    "id": "XMenOriginsWolverine", 
    "name": "X-Men Origins: Wolverine"
}