{
    "plot": "Dramatization of \"Yentl, the Yeshiva Boy,\" by Isaac Bashevis Singer (1902-1991); originally published in Yiddish c. 1960, then in English c. 1983. The story: In an Ashkenazic shtetl in Poland, Yentl Mendel is the boyishly klutzy daughter and only child of long widowed Rebbe (\"Talmud Teacher\") Mendel, who teaches Talmud (a codification of Jewish Law) to local boys - and to Yentl, but secretly because girls were not allowed to learn the law in those days. When her father dies, Yentl is all alone in the world. She takes the momentous decision to leave the village and - disguised as a boy and calling herself by the name of her late brother, Anshel - seeks and gets admitted to a Yeshiva, to study the texts, traditions, subtleties and complexities of Torah, Talmud, etc. She befriends Avigdor who is engaged to Haddas, but her family discovers his brother committed suicide so they call off the wedding (in case Avigdor possesses the same madness). Anshel then finds \"him\"-self in the awkward position of being called into service as substitute bridegroom, so that the wedding can go ahead and Haddas will have a husband. It is a marriage that never gets consummated - apart from the more obvious reasons, because Haddas still wants Avigdor (though she eventually falls in love with Yentl, too). After numerous complications (including Avidor and Yentl falling in love with each other, briefly, after she reveals her secret to him, along with her bosom), the film ends with everybody getting what they always wanted - Haddas and Avigdor to live happily ever after with each other, while Anshel, now Yentl once again, goes off to America to pursue her dream of serious study in Yeshiva, where she will be able to study without needing to hide her identity as a woman.", 
    "genres": "Drama, Musical, Romance", 
    "release_year": "1983", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "weird"
                ], 
                "role": "Yentl followed this trope. The main character became a man in order to attend a school in Jewish Talmudic Law, which was forbidden for women at the time. It made for some really weird love triangles.", 
                "id": "SweetPollyOliver"
            }
        ]
    }, 
    "imdbid": "tt0086619", 
    "poster_url": "Yentl.jpg", 
    "similar": [
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "Mulan", 
            "name": "Mulan", 
            "poster_url": "Mulan.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "Lockout", 
            "name": "Lockout", 
            "poster_url": "Lockout.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "HouseOfFlyingDaggers", 
            "name": "House of Flying Daggers", 
            "poster_url": "HouseOfFlyingDaggers.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "StTrinians", 
            "name": "St. Trinian's", 
            "poster_url": "StTrinians.jpg"
        }, 
        {
            "shared": [
                "SweetPollyOliver"
            ], 
            "shared_count": 1, 
            "id": "RobinHoodPrinceOfThieves", 
            "name": "Robin Hood: Prince of Thieves", 
            "poster_url": "RobinHoodPrinceOfThieves.jpg"
        }
    ], 
    "id": "Yentl", 
    "name": "Yentl"
}