{
    "plot": "A young neurosurgeon (Gene Wilder) inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback called Igor, a pretty lab assistant named Inga and the old housekeeper, frau Blucher -iiiiihhh!-. Young Frankenstein believes that the work of his grandfather is only crap, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind...", 
    "genres": "Comedy", 
    "release_year": "1974", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "enormous", 
                    "sweet", 
                    "last"
                ], 
                "role": "Bigger Is Better in Bed / The Immodest Orgasm: Upon finding the Monster's enormous Schwanzstüke, there's \"Ah, sweet mystery of life, at last I've found yooou!\"", 
                "id": "BiggerIsBetterInBed"
            }, 
            {
                "adjectives": [
                    "enormous"
                ], 
                "role": "Gag Penis: The Monster's enormous Schwanzstüke, mentioned three times.", 
                "id": "GagPenis"
            }, 
            {
                "adjectives": [
                    "noted", 
                    "enormous", 
                    "enormous", 
                    "new", 
                    "same"
                ], 
                "role": "Young Frankenstein. It's noted that if all parts of the Monster were in proportion to his size, \"He would have an enormous schwanzstucker!\" Later on, Elizabeth is raped by the Monster but likes it and falls in love with him because of his enormous size. At the end Inga learns that her new husband Frederick traded part of his brain for the Monster's endowment, and she has the same reaction.", 
                "id": "GagPenis"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Blücher", 
                    "*WHINNY", 
                    "quintessential", 
                    "complete", 
                    "nice", 
                    "other"
                ], 
                "role": "Creepy Housekeeper: Frau Blücher (*WHINNY!*) is the quintessential creepy housekeeper: as you may notice, every time her name is mentioned, horses rear in fear. Also, in regards to Victor Frankenstein: \"He... vas... my... BOYFRIEND!\" \"He Vas\" Song\": Which leads to her singing about Victor in the Musical, complete with Evil Laugh and vamping by Andrea Martin for \"He Vas My Boyfriend.\" Doubles as a Villain Song as she hints he wasn't too nice a guy other than the sex.", 
                "id": "CreepyHouseKeeper"
            }, 
            {
                "adjectives": [
                    "original"
                ], 
                "role": "Frau Blucher from Young Frankenstein: Every time someone says her name, horses neigh and there is lightning.\n Doesn't help she has a creepy obsession with the original frankenstein and tried to transfer it to our protagonist", 
                "id": "CreepyHouseKeeper"
            }, 
            {
                "adjectives": [
                    "actual"
                ], 
                "role": "Gag Boobs: \"What knockers!\" Subverted. Dr. Frankenstein is talking about the actual knockers. On the doors.", 
                "id": "GagBoobs"
            }
        ]
    }, 
    "imdbid": "tt0072431", 
    "poster_url": "YoungFrankenstein.jpg", 
    "similar": [
        {
            "shared": [
                "GagBoobs", 
                "GagPenis", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 3, 
            "id": "HistoryOfTheWorldPartI", 
            "name": "History of the World Part I"
        }, 
        {
            "shared": [
                "GagBoobs", 
                "GagPenis"
            ], 
            "shared_count": 2, 
            "id": "CityHunter", 
            "name": "City Hunter", 
            "poster_url": "CityHunter.jpg"
        }, 
        {
            "shared": [
                "GagPenis", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "Mash", 
            "name": "M*A*S*H"
        }, 
        {
            "shared": [
                "GagPenis", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "ShowdownInLittleTokyo", 
            "name": "Showdown in Little Tokyo", 
            "poster_url": "ShowdownInLittleTokyo.jpg"
        }, 
        {
            "shared": [
                "GagPenis", 
                "BiggerIsBetterInBed"
            ], 
            "shared_count": 2, 
            "id": "Porkys", 
            "name": "Porky's", 
            "poster_url": "Porkys.jpg"
        }
    ], 
    "id": "YoungFrankenstein", 
    "name": "Young Frankenstein"
}