{
    "plot": "Thirty-seven year old Mavis Gary seems incapable of happiness. She has had one failed marriage with no romance in her immediate horizon. She ghosts writes a young adult series of books, which has just been canceled due to low sales. She is in the process of writing the last book, with which she is having a mental block. She lives vicariously through Kendall Strickland, the teenaged female heroine in her books, as like Kendall she believes her high school years were the best years of her life when she was the prom queen. When she receives news that her high school beau, Buddy Slade, and his wife, Beth Slade, have just had their first child, Mavis takes it as a sign that she and Buddy are meant to be together. As such, she devises a false pretense to travel from her Minneapolis home back her her old hometown of Mercury, Minnesota to reclaim Buddy from Beth. As Mavis slyly or not so slyly does whatever she can to hang out with Buddy, even in Beth's company if need be, she also runs into another old high school colleague named Matt Freehauf. She barely remembers Matt until she is reminded that he was the \"hate crime\" kid i.e. he was beaten almost to death by the school jocks who believed he was gay (which he is not), which has left him among other things needing to walk with a brace. Matt ends up being Mavis' drinking buddy and confidante, Matt, in turn, who tries to be Mavis' voice of reason to get her out of her delusional state about Buddy and get a grip on reclaiming her life as a functioning adult.", 
    "genres": "Comedy, Drama", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "former", 
                    "teen-lit", 
                    "high"
                ], 
                "role": "Female example: Mavis Gary in Young Adult is a former Alpha Bitch prom queen who's now in her thirties, divorced, and ghostwrites teen-lit novels in order to recreate her high school Glory Days.", 
                "id": "JadedWashout"
            }, 
            {
                "adjectives": [
                    "Jaded"
                ], 
                "role": "Jaded Washout: Mavis.", 
                "id": "JadedWashout"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "high", 
                    "many", 
                    "other", 
                    "sorry", 
                    "nice"
                ], 
                "role": "Alpha Bitch: Apparently, Mavis in her high school days. She still acts like she is, but it doesn't fool anyone. Buddy's wife reveals that she along with many other people feel sorry for her, and that's why she had made Buddy be nice to her when he didn't really want anything to do with her.", 
                "id": "AlphaBitch"
            }, 
            {
                "adjectives": [
                    "several"
                ], 
                "role": "Done several times during trips to the salon in Young Adult.", 
                "id": "LipstickAndLoadMontage"
            }, 
            {
                "adjectives": [
                    "Several"
                ], 
                "role": "Lipstick and Load Montage: Several times during trips to the salon, including closeups of manicures, facials, etc.", 
                "id": "LipstickAndLoadMontage"
            }, 
            {
                "adjectives": [
                    "various", 
                    "dive"
                ], 
                "role": "Ms. Fanservice: Mavis tries to be this, wearing plenty of revealing outfits and appearing in various states of undress. All it does is show that she is trying too hard, as she's often inappropriately dressed for the venue (dive bar, sports bar, family party).", 
                "id": "MsFanservice"
            }
        ]
    }, 
    "imdbid": "tt1625346", 
    "poster_url": "YoungAdult.jpg", 
    "similar": [
        {
            "shared": [
                "MsFanservice", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "Burlesque", 
            "name": "Burlesque", 
            "poster_url": "Burlesque.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "Kickass2", 
            "name": "Kick-Ass 2", 
            "poster_url": "Kickass2.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "JadedWashout"
            ], 
            "shared_count": 2, 
            "id": "TheBrassTeapot", 
            "name": "The Brass Teapot", 
            "poster_url": "TheBrassTeapot.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "LipstickAndLoadMontage"
            ], 
            "shared_count": 2, 
            "id": "PrettyWoman", 
            "name": "Pretty Woman", 
            "poster_url": "PrettyWoman.jpg"
        }, 
        {
            "shared": [
                "MsFanservice", 
                "AlphaBitch"
            ], 
            "shared_count": 2, 
            "id": "CoolWorld", 
            "name": "Cool World", 
            "poster_url": "CoolWorld.jpg"
        }
    ], 
    "id": "YoungAdult", 
    "name": "Young Adult"
}