{
    "plot": "Throughout history, tales of chivalry have burnished the legends of brave, handsome knights who rescue fair damsels, slay dragons and conquer evil. But behind many a hero is a good-for-nothing younger brother trying just to stay out of the way of those dragons, evil and trouble in general. As two princes on a daring mission to save their land, they must rescue the heir apparent's fiancée before their kingdom is destroyed. Thadeous (McBride) has spent his life watching his perfect older brother Fabious (Franco) embark upon valiant journeys and win the hearts of his people. Tired of being passed over for adventure, adoration and the throne, he's settled for a life of wizard's weed, hard booze and easy maidens. But when Fabious' bride-to-be, Belladonna (Zooey Deschanel), gets kidnapped by the evil wizard Leezar (Justin Theroux), the king gives his deadbeat son an ultimatum: Man up and help rescue her or get cut off. Half-assedly embarking upon his first quest, Thadeous joins Fabious to trek across the perilous outlands and free the princess. Joined by Isabel (Natalie Portman)-an elusive warrior with a dangerous agenda of her own-the brothers must vanquish horrific creatures and traitorous knights before they can reach Belladonna. If Thadeous can find his inner hero, he can help his brother prevent the destruction of his land. Stay a slacker, and not only does he die a coward, he gets front row seats to the dawn of an all-new Dark Ages.", 
    "genres": "Adventure, Comedy, Fantasy", 
    "release_year": "2011", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "large", 
                    "ritual", 
                    "Fabious"
                ], 
                "role": "Armored Closet Gay: Given the large amount of Ho Yay in the film,  Leezar certainly seems to give this sort of impression considering what he says when trying to complete the ritual with Belladonna. Also  Boremont, who confesses his love for Fabious  just before he dies", 
                "id": "ArmouredClosetGay"
            }, 
            {
                "adjectives": [
                    "much"
                ], 
                "role": "Dirty Old Man: The Wise Wizard, very much so.", 
                "id": "DirtyOldMan"
            }, 
            {
                "adjectives": [
                    "trouble"
                ], 
                "role": "The Loins Sleep Tonight: Poor Leezar has trouble concentrating with the battle going on around him", 
                "id": "TheLoinsSleepTonight"
            }
        ], 
        "f": [
            {
                "adjectives": [], 
                "role": "Action Girl: Isabel, who's also a archer.", 
                "id": "ActionGirl"
            }, 
            {
                "adjectives": [
                    "Affirmative"
                ], 
                "role": "Affirmative Action Girl: Isabel, in order to allow Belladonna to be a Distressed Damsel.", 
                "id": "AffirmativeActionGirl"
            }, 
            {
                "adjectives": [], 
                "role": "Distressed Damsel: Belladonna.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Fanservice Extra - Most of the \"White People\" are played by topless glamour models.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "Mysterious"
                ], 
                "role": "Mysterious Woman: Isabel, before she reveals her backstory to the heroes.", 
                "id": "MysteriousWoman"
            }
        ]
    }, 
    "imdbid": "tt1240982", 
    "poster_url": "YourHighness.jpg", 
    "similar": [
        {
            "shared": [
                "DamselInDistress", 
                "ActionGirl", 
                "DirtyOldMan"
            ], 
            "shared_count": 3, 
            "id": "IronMan3", 
            "name": "Iron Man 3", 
            "poster_url": "IronMan3.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "DirtyOldMan"
            ], 
            "shared_count": 2, 
            "id": "Hercules", 
            "name": "Hercules", 
            "poster_url": "Hercules.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "HouseOfFlyingDaggers", 
            "name": "House of Flying Daggers", 
            "poster_url": "HouseOfFlyingDaggers.jpg"
        }, 
        {
            "shared": [
                "ActionGirl", 
                "MysteriousWoman"
            ], 
            "shared_count": 2, 
            "id": "SkyCaptainAndTheWorldOfTomorrow", 
            "name": "Sky Captain and the World of Tomorrow", 
            "poster_url": "SkyCaptainAndTheWorldOfTomorrow.jpg"
        }, 
        {
            "shared": [
                "DamselInDistress", 
                "ActionGirl"
            ], 
            "shared_count": 2, 
            "id": "TheExpendables", 
            "name": "The Expendables", 
            "poster_url": "TheExpendables.jpg"
        }
    ], 
    "id": "YourHighness", 
    "name": "Your Highness"
}