{
    "plot": "Centers on sixteen year-old Zoey Stevens a skilled dancer and straight-A student who is having a hard time adjusting to a new high school, a new and klutzy dance squad, a new step-dad, three new rowdy step-brothers and an unruly dog. But things change when a dog training app on her smart phone begins to somehow control all the boys around her.", 
    "genres": "Comedy, Fantasy", 
    "release_year": "2014", 
    "roles": {
        "f": [
            {
                "adjectives": [
                    "telekinetic", 
                    "same", 
                    "other", 
                    "convertible", 
                    "long-running"
                ], 
                "role": "In Zapped, Scott Baio's character acquires telekinetic powers and uses them for exactly the same thing every other man would use them for: rigging gambling tables and separating hot women from their clothing. Hilarity Ensues. Fanservice Extras abound. Some highlights:\n The two uncredited girls in the convertible who get their tops ripped off. The redhead is Jewel Shepard, who made a career out of Fanservice bit parts in 80s sex comedies.\n The prom scene. Everyone is uncredited, but rumor has it that the girl whose dress does not survive the Marilyn Maneuver now has a long-running Soap Opera career.", 
                "id": "FanserviceExtra"
            }, 
            {
                "adjectives": [
                    "first", 
                    "new", 
                    "open"
                ], 
                "role": "One of the first uses of the new powers gained in Zapped was to make a girl's pink sweater pop open to reveal her (also pink) bra underneath.", 
                "id": "SweaterGirl"
            }
        ]
    }, 
    "imdbid": "tt3544734", 
    "similar": [
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "StarTrekIIITheSearchForSpock", 
            "name": "Star Trek III: The Search for Spock", 
            "poster_url": "StarTrekIIITheSearchForSpock.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "ConanTheBarbarian2011", 
            "name": "Conan the Barbarian ", 
            "poster_url": "ConanTheBarbarian2011.jpg"
        }, 
        {
            "shared": [
                "SweaterGirl"
            ], 
            "shared_count": 1, 
            "id": "ScoobyDoo", 
            "name": "Scooby-Doo", 
            "poster_url": "ScoobyDoo.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "JoeDirt", 
            "name": "Joe Dirt", 
            "poster_url": "JoeDirt.jpg"
        }, 
        {
            "shared": [
                "FanserviceExtra"
            ], 
            "shared_count": 1, 
            "id": "ClassOf1984", 
            "name": "Class Of", 
            "poster_url": "ClassOf1984.jpg"
        }
    ], 
    "id": "Zapped", 
    "name": "Zapped"
}