{
    "plot": "Searching for family. In the early twenty-first century, zombies have taken over America. A shy and inexperienced college student in Texas has survived by following his 30 rules: such as \"look in the back seat,\" \"double-tap,\" \"avoid public restrooms.\" He decides to travel to Ohio to see if his parents are alive. He gets a ride with a boisterous zombie-hating good-old boy headed for Florida, and soon they confront a young woman whose sister has been bitten by a zombie and wants to be put out of her misery. The sisters were headed to an LA amusement park they've heard is zombie free. Can the kid from Ohio get to his family? And what about rule thirty one?", 
    "genres": "Comedy, Horror", 
    "release_year": "2009", 
    "roles": {
        "m": [
            {
                "adjectives": [
                    "Sensitive"
                ], 
                "role": "Sensitive Guy and Manly Man: Columbus and Tallahassee respectively.", 
                "id": "SensitiveGuyAndManlyMan"
            }
        ], 
        "f": [
            {
                "adjectives": [
                    "Third"
                ], 
                "role": "Chickification - While totally badass throughout the film,  Whichita and Little Rock fall victim to this in the Third Act.", 
                "id": "Chickification"
            }, 
            {
                "adjectives": [
                    "possible", 
                    "only", 
                    "long", 
                    "tenacious", 
                    ".no"
                ], 
                "role": "Distressed Damsel - After being competent through most of the movie, the two girls succumb to this. Complete with being stuck in a tower. In the girls' defense, going for the highest ground was their best possible survival strategy, and them being trapped was the only way Columbus could have his Big Damn Heroes moment.\n Kinda averted. They were kicking and shooting at the zombies for as long as they could.\n Columbus actually only saves them from one particularly tenacious zombie. The girls handled the rest of that part of the horde themselves.\n uhhhh....no they didn't, the part of the horde that was threatening to eat them was killed by Tallahassee at the shooting gallery.", 
                "id": "DamselInDistress"
            }, 
            {
                "adjectives": [], 
                "role": "Little Miss Badass: Little Rock.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Zombieland: Little Rock (Abigail Breslin).", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Little Miss Badass - Little Rock.", 
                "id": "LittleMissBadass"
            }, 
            {
                "adjectives": [], 
                "role": "Little Miss Con Artist: Little Rock again.", 
                "id": "LittleMissConArtist"
            }, 
            {
                "adjectives": [], 
                "role": "Little Miss Con Artist - Little Rock again.", 
                "id": "LittleMissConArtist"
            }, 
            {
                "adjectives": [
                    "dead", 
                    "same"
                ], 
                "role": "Mama Bear: If you are not Little Rock, then it's going to take some very extenuating circumstances for Wichita not to rob you blind and leave you for dead if she gets the chance. If you threaten Little Rock, you've got about the same chance of not being shot.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "dead", 
                    "same"
                ], 
                "role": "Mama Bear - If you are not Little Rock, then it's going to take some very extenuating circumstances for Wichita not to rob you blind and leave you for dead if she gets the chance.  If you threaten Little Rock, you've got about the same chance of not being shot.", 
                "id": "MamaBear"
            }, 
            {
                "adjectives": [
                    "recipient"
                ], 
                "role": "Never Mess with Granny: Sister Cynthia Knickerbocker, recipient of the Zombie Kill of the Week award. With a piano.", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [], 
                "role": "Zombieland. Sister Cynthia Knickerbocker, winner of the Zombie Kill of the Week, who walks quietly away from a zombie so she can drop a fucking piano on him! This is her only appearance in the film and she has absolutely no connection to the rest of the plot or characters... but does she need to?", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [
                    "recipient"
                ], 
                "role": "Never Mess With Granny - Sister Cynthia Knickerbocker, recipient of the Zombie Kill of the Week award.", 
                "id": "NeverMessWithGranny"
            }, 
            {
                "adjectives": [
                    "impressive", 
                    "arsenal", 
                    "12-year-old"
                ], 
                "role": "Little Rock from Zombieland can use a quite impressive arsenal for a 12-year-old.", 
                "id": "SmallGirlBigGun"
            }
        ]
    }, 
    "imdbid": "tt1156398", 
    "poster_url": "Zombieland.jpg", 
    "similar": [
        {
            "shared": [
                "DamselInDistress", 
                "SensitiveGuyAndManlyMan", 
                "Chickification"
            ], 
            "shared_count": 3, 
            "id": "Frozen", 
            "name": "Frozen", 
            "poster_url": "Frozen.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass", 
                "LittleMissConArtist", 
                "SmallGirlBigGun"
            ], 
            "shared_count": 3, 
            "id": "KickAss", 
            "name": "Kick-Ass", 
            "poster_url": "KickAss.jpg"
        }, 
        {
            "shared": [
                "LittleMissBadass", 
                "DamselInDistress", 
                "SmallGirlBigGun"
            ], 
            "shared_count": 3, 
            "id": "TrueGrit", 
            "name": "True Grit", 
            "poster_url": "TrueGrit.jpg"
        }, 
        {
            "shared": [
                "Chickification", 
                "SensitiveGuyAndManlyMan", 
                "DamselInDistress"
            ], 
            "shared_count": 3, 
            "id": "TheHost", 
            "name": "The Host", 
            "poster_url": "TheHost.jpg"
        }, 
        {
            "shared": [
                "SensitiveGuyAndManlyMan", 
                "MamaBear"
            ], 
            "shared_count": 2, 
            "id": "SnowWhiteAndTheHuntsman", 
            "name": "Snow White & the Huntsman"
        }
    ], 
    "id": "Zombieland", 
    "name": "Zombieland"
}