{
    "occurrence_over_time": [
        [
            "Films of the 1920s", 
            0, 
            0.0, 
            60
        ], 
        [
            "Films of the 1930s", 
            0, 
            0.0, 
            91
        ], 
        [
            "Films of the 1940s", 
            0, 
            0.0, 
            111
        ], 
        [
            "Films of the 1950s", 
            0, 
            0.0, 
            176
        ], 
        [
            "Films of the 1960s", 
            0, 
            0.0, 
            225
        ], 
        [
            "Films of the 1970s", 
            0, 
            0.0, 
            302
        ], 
        [
            "Films of the 1980s", 
            0, 
            0.0, 
            587
        ], 
        [
            "Films of the 1990s", 
            1, 
            0.0011299435028248588, 
            885
        ], 
        [
            "Films of the 2000s", 
            0, 
            0.0, 
            569
        ], 
        [
            "Films of the 2010s", 
            0, 
            0.0, 
            646
        ]
    ], 
    "description": "Are you just hanging around your sister's house, watching the kids, doing the laundry, or maybe even just playing video games, with no prospects, and contributing nothing to society?\nThen you might be a NEET. Not currently engaged in Employment, Education or Training.\nThe NEET is usually a college-age male, though it is occasionally used in regards to females. A NEET is either between jobs and down on his luck, an idiot who has failed the entrance exams for college, or a Lazy Bum with no goals in life, freeloading off whoever is around. Occasionally the NEET might also be a shut-in, and unable to enter into society because of some debilitating agorophobia or peer pressure. Either way, he will probably have something like \"Shut up, you stupid NEET!\" or \"Get a job!\" yelled in his face at least once. Probably more than once.\nIn most stories featuring this Trope, the NEET is the world's Butt Monkey, or at least perceives himself as such. The Deadpan Snarker will take every opportunity to remind him that he's useless, while more sentimental characters may try to motivate him to get a life with a Rousing Speech. In fact, if he isn't the Plucky Comic Relief, set there as an Acceptable Target for mockery, then he is more than likely The Hero, and this is the premise behind his story. Hopefully by the end, he is a fully functional member of society, who got into that college after that cram session with The Smart Guy, or now has a promising career after hard work job-searching, and he might even get together with the crazy girl who kicked his ass into gear.\nCompare This Loser Is You, Hikikomori and The Slacker. Related to, but generally not overlapping with, Pretty Freeloaders, despite the fact that that they might not contribute money to the household. This is mostly on account of Double Standards, as it's more socially acceptable for a female to be without an income than it is for a male, though this is changing. Only a female in these circumstances who is actively being hassled for not having a job or being in school can be considered a NEET.\nThere's also a Spanish version of this trope, called Ni-Ni note \"ni estudia, ni trabaja\", \"neither studies, nor works\".\nNot to be confused with Keet, though a 'keet NEET could exist.", 
    "gender": "m", 
    "adjs": [
        "college-age", 
        "shut-in", 
        "unable", 
        "sentimental", 
        "functional"
    ], 
    "adjectives": [
        [
            "college-age", 
            1, 
            11.104844105454484, 
            1.0, 
            [
                "NEET"
            ]
        ], 
        [
            "job-searching", 
            1, 
            11.104844105454484, 
            1.0, 
            [
                "NEET"
            ]
        ], 
        [
            "keet", 
            1, 
            11.104844105454484, 
            1.0, 
            [
                "NEET"
            ]
        ], 
        [
            "shut-in", 
            1, 
            11.104844105454484, 
            1.0, 
            [
                "NEET"
            ]
        ], 
        [
            "functional", 
            1, 
            10.060289670389281, 
            0.9059370464685642, 
            [
                "NEET", 
                "TheChick"
            ]
        ], 
        [
            "sentimental", 
            1, 
            10.060289670389281, 
            0.9059370464685642, 
            [
                "NEET", 
                "GlamorousWartimeSinger"
            ]
        ], 
        [
            "hard", 
            1, 
            7.012787758985332, 
            0.6315070875727815, 
            [
                "BeautyMark", 
                "TomboyWithAGirlyStreak", 
                "NEET", 
                "AdrenalineMakeover", 
                "HugeSchoolgirl", 
                "FemininityFailure", 
                "Hobos", 
                "CuteWitch", 
                "BoyBand", 
                "MagicalGirl", 
                "HelloNurse"
            ]
        ], 
        [
            "unable", 
            1, 
            6.300146028414301, 
            0.567333135754674, 
            [
                "BlackMagicianGirl", 
                "SenseiChan", 
                "BarbaricBully", 
                "NEET", 
                "OldMaid", 
                "PrinceCharmingWannabe", 
                "BastardBastard", 
                "UselessBoyfriend", 
                "OneOfTheBoys", 
                "MagicalGirlfriend", 
                "NeutralFemale", 
                "EmotionlessGirl", 
                "SeashellBra", 
                "AccidentalPornomancer", 
                "BasementDweller"
            ]
        ], 
        [
            "acceptable", 
            1, 
            5.971776438209417, 
            0.5377631942870946, 
            [
                "DisposableSexWorker", 
                "GlamorousWartimeSinger", 
                "BastardGirlfriend", 
                "NEET", 
                "SweaterGirl", 
                "TheHighQueen", 
                "GirlOfTheWeek", 
                "BlondGuysAreEvil", 
                "MartyStu", 
                "NonActionGuy", 
                "HotScoop", 
                "ProperLady", 
                "FemininityFailure", 
                "TheFlapper", 
                "TheGeneralissimo", 
                "StandardFiftiesFather", 
                "MommasBoy", 
                "LesbianJock", 
                "BasementDweller"
            ]
        ]
    ], 
    "image_url": "assets/data/tropes/images/NEET.jpg", 
    "id": "NEET", 
    "name": "NEET"
}